Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/04_monitoring_license_and_quotas/quotas.po
Languages: de, es, it, nl

source: Managing quotas
de: Verwalten von Quoten
es: Administrar las cuotas
it: Gestione delle quote
nl: Quota's beheren

source: Your portal license
de: Ihre Portallizenz
es: Licencia del portal
it: La licenza del tuo portale
nl: De licentie van uw portaal

source: Before diving into which quotas exist on Opendatasoft portals, it is important to introduce the license topic. A license applies to each and every Opendatasoft portal. It is a contract between Opendatasoft and the portal owners, defining how much data can be injected into the portal and the consumption of this data.
de: Bevor wir uns damit beschäftigen, welche Quoten auf Opendatasoft-Portalen existieren, muss erst einmal das Thema Lizenzen angesprochen werden. Für jedes einzele Opendatasoft-Portal gibt es eine Lizenz. Das ist ein Vertrag zwischen Opendatasoft und den Portalbesitzern, der die Menge an Daten, die in das Portal eingespeist werden können, sowie die Nutzung dieser Daten definiert.
es: Antes de analizar las cuotas existentes en los portales Opendatasoft, es importante introducir el tema de las licencias. Se aplica una licencia a todos y cada uno de los portales Opendatasoft. Es un contrato entre Opendatasoft y los propietarios del portal que define la cantidad de datos que es posible insertar en el portal y el consumo de esos datos.
nl: Alvorens dieper in te gaan op welke quota's er bestaan op Opendatasoft-portalen, is het belangrijk om het licentieonderwerp te introduceren. Een licentie is van toepassing op elk Opendatasoft-portaal. Het is een contract tussen Opendatasoft en de portaaleigenaars waarin staat gedefinieerd hoeveel data er kunnen worden geïnjecteerd in het portaal en het verbruik van deze data.

source: For example, freemium portals can have up to 5 datasets, each having at most 20000 records.
de: Beispielsweise können Freemium-Portale bis zu 5 Datensätze mit jeweils maximal 20000 Einträgen haben.
es: Por ejemplo, los portales freemium pueden tener hasta 5 conjuntos de datos de hasta 20.000 registros cada uno.
it: Ad esempio, i portali "freemium" possono contenere fino a 5 dataset, ciascuno con un massimo di 20.000 record.
nl: Bijvoorbeeld: freemium portalen kunnen tot 5 datasets hebben en elke dataset maximaal 20000 records.

source: Your license defines 4 global limits on your portal: the first one puts an upper limit on data consumption. The others regulate the amount of data you can inject into the portal.
de: Ihre Lizenz bestimmt 4 generelle Grenzen für Ihr Portal: Die erste legt eine Obergrenze für die Nutzung der Daten fest und die anderen regeln die Datenmenge, die Sie ins Portal einspeisen können.
es: Su licencia define 4 límites globales en el portal: el primero establece un límite superior en el consumo de los datos. Los demás regulan la cantidad de datos que puede insertar en el portal.
nl: Uw licentie definieert 4 globale limieten op uw portaal: het eerste plaatst een bovenlimiet op het verbruik van de data en de andere reguleren de hoeveelheid data die kan worden geïnjecteerd in het portaal.

source: **API calls quota** limits the number of requests made to the data within a given timeframe (usually within a month)
de: Die Quote **Anzahl der API-Aufrufe** begrenzt die Anzahl der Datenanforderungen in einem bestimmten Zeitrahmen (normalerweise innerhalb eines Monats).
es: **Cuota de llamadas de API** restringe el número de solicitudes de datos efectuadas dentro de un período de tiempo determinado (normalmente, un mes).
it: La **quota di chiamate API** limita il numero di richieste di dati che è possibile effettuare in un determinato periodo di tempo, in genere un mese
nl: **API calls quota** beperkt het aantal verzoeken dat gedaan kan worden aan de data binnen een welbepaalde tijdperiode (meestal binnen een maand)

source: The number of API calls measure can be a bit difficult to wrap their head around since this is a very technical measure. It can be summarised as such: every time somebody accesses your portal, for example, the datasets catalog page, the interface will make requests to the portal for the filters values, for the first ten datasets, then the next ten ones, etc. Each of these requests is an API call and counted within the quota.
de: Die Messung der Anzahl der API-Aufrufe ist nicht unbedingt leicht nachzuvollziehen, da dies eine sehr technische Messung ist. Sie lässt sich jedoch wie folgt zusammenfassen: Jedes Mal, wenn jemand auf Ihr Portal zugreift, z.B. auf die Datensatzkatalogseite, sendet die Schnittstelle Anforderungen für die Filterwerte, die ersten zehn Datensätze, die nächsten zehn usw. an das Portal. Jede dieser Anforderungen ist ein API-Aufruf, der für die Quote zählt.
es: El número de llamadas de API puede ser un poco difícil de entender ya que es una medida muy técnica. Para resumir: cada vez que alguien accede al portal (por ejemplo, a la página de catálogo de conjuntos de datos), la interfaz efectúa solicitudes en el portal de los valores de filtros, de los 10 primeros conjuntos de datos, a continuación de los 10 siguientes, etc. Cada una de estas solicitudes es una llamada de API y se contabiliza en la cuota.
nl: Het meten van het aantal API calls kan iets moeilijker zijn aangezien dit een zeer technische meting van de activiteit is. Maar ze kan als volgt worden samengevat: telkens iemand zich toegang verschaft tot uw portaal, bijvoorbeeld de cataloguspagina met datasets, doet de interface aanvragen aan het portaal voor de filterwaarden, voor de eerste tien datasets, vervolgens de tien volgende enz. Elk van deze aanvragen is een API call en wordt geteld binnen het quotum.

source: API calls are therefore made by visitors on your portal, but also by developers using the API to retrieve the data you published and dashboards hosted outside of your portal.
de: API-Aufrufe werden also von Besuchern Ihres Portals gemacht, aber auch von Entwicklern, die die API zum Abrufen der von Ihnen veröffentlichten Daten nutzen, sowie außerhalb Ihres Portals gehosteter Dashboards.
es: Por consiguiente, las llamadas de API son realizadas por los visitantes del portal, pero también por los desarrolladores que usan la API para recuperar los datos publicados y los paneles que se alojan fuera del portal.
it: Le chiamate API vengono quindi effettuate dai visitatori del tuo portale, ma anche dagli sviluppatori che ricorrono all'API per recuperare i dati da te pubblicati e i dashboard fuori dal tuo portale.
nl: API calls worden daarom gedaan door bezoekers op uw portaal, maar ook door ontwikkelaars die de API gebruiken om de data die u gepubliceerd hebt, terug te vinden en dashboards die gehost worden buiten uw portaal.

source: **Data size quota** limits the total size of the data in datasets in the domain
de: Die Quote **Datengröße** begrenzt die Gesamtmenge der Daten in Datensätzen in der Domain
es: **Cuota de tamaño de datos** limita el tamaño total de los datos en los conjuntos de datos del dominio.
it: La **quota delle dimensioni dei dati** limita la dimensione totale dei dati presenti in tutti i dataset del dominio
nl: **Data size quota** beperkt de totale grootte van de data in datasets binnen het domein

source: **Datasets quota** constraints the total number of currently published datasets, for local datasets on the one hand and for federated datasets on the other hand
de: Die Quote **Datensätze** begrenzt die Gesamtanzahl der gegenwärtig veröffentlichten Datensätze, einerseits für lokale Datensätze und anderseits für verbundene Datensätze
es: **Cuota de conjuntos de datos** restringe el número total de conjuntos de datos publicados actualmente, por una parte para los conjuntos de datos locales y por otra parte para los conjuntos de datos federados.
it: La **quota dei dataset** definisce il numero totale di dataset pubblicati, da una parte per i dataset locali e dall'altra per quelli federati
nl: **Datasets quota** beperkt het aantal momenteel gepubliceerde datasets., voor lokale datasets enerzijds en voor samengevoegde datasets anderzijds

source: **Records quota** limits the total number of records within published datasets and also limits the maximum number of records per dataset
de: Die Quote **Einträge** begrenzt sowohl die Gesamtanzahl von Einträgen innerhalb veröffentlichter Datensätze wie auch die Höchstanzahl von Einträgen pro Datensatz
es: **Cuota de registros** restringe el número total de registros dentro de los conjuntos de datos publicados, y también limita el número máximo de registros por conjunto de datos.
it: La **quota dei record** stabilisce il numero globale di record possibili nei dataset pubblicati e il limite massimo di record per ciascun dataset
nl: **Records quota** beperkt het totale aantal records in gepubliceerde datasets en beperkt ook het maximaal aantal records per dataset

source: You can see these quotas and check any information related to your license under the **License** section of the back office.
de: Im Backoffice-Bereich **Lizenz** können Sie diese Quoten sehen und sämtliche Informationen im Zusammenhang mit Ihrer Lizenz prüfen.
es: Puede consultar estas cuotas y examinar cualquier información relacionada con su licencia, bajo la sección **Licencia** del back office.
nl: U kan deze quota's zien en alle informatie met betrekking tot uw licentie controleren onder de rubriek **Licentie** van de back office.

source: Setting defaults limitations on users
de: Einrichten von Standardbeschränkungen für Benutzer
es: Configurar límites predeterminados para los usuarios
it: Impostazione dei limiti predefiniti sugli utenti
nl: Standaard beperkingen instellen voor gebruikers

source: Since your portal has global upper limits set, you want to avoid having anybody use all of the license quota just by him/herself. You can therefore set general limits on users and if your portal is open to anonymous users, set a different limit for them. You can also set a global limit for all anonymous users to be sure that they won't eat up all of your usage quota.
de: Da globale Obergrenzen für Ihr Portal existieren, möchten Sie wahrscheinlich vermeiden, dass jemand ganz allein die komplette Lizenzquote in Anspruch nimmt. Daher können Sie allgemeine Grenzen für Benutzer festlegen. Steht Ihr Portal auch anonymen Benutzern offen, können Sie andere Grenzen für sie festlegen. Sie können auch eine globale Grenze für alle anonymen Benutzer einrichten, um sicherzustellen, dass sie nicht die gesamte Nutzungsquote verbrauchen.
es: Como el portal tiene establecidos límites superiores globales, es necesario evitar que alguien acapare toda la cuota de licencia. En este sentido, puede establecer límites generales para los usuarios y, si el portal está abierto a los usuarios anónimos, definir un límite distinto para estos. También puede configurar un límite global para todos los usuarios anónimos a fin de asegurarse de que no consuman toda la cuota de uso.
it: Poiché il tuo portale dispone di limiti globali superiori, è necessario evitare che un utente possa esaurire da solo la quota prevista dalla licenza. A questo scopo, è possibile impostare una soglia massima per gli utenti in generale e, se il portale è aperto agli utenti anonimi, definirne una diversa per questi ultimi. Per gli utenti anonimi puoi stabilire un limite globale da non superare, in modo da preservare la tua quota.
nl: Aangezien er voor uw portaal globale maximale limieten zijn ingesteld, wil u vermijden dat wie dan ook alle quota's van uw licentie helemaal zelf opgebruikt. U kan daarom algemene limieten instellen voor gebruikers en wanneer uw portaal open staat voor anonieme gebruikers, kan u voor hen een andere limiet instellen. U kan ook een globale limiet instellen voor alle anonieme gebruikers om er zeker van te zijn dat ze al uw gebruiksquota's niet zullen opsouperen.

source: You'll be able to set these limits in the **Security** subsection of the **Configuration** section of your portal's back office.
de: Einrichten können Sie diese Beschränkungen im Backoffice Ihres Portals, und zwar im Unterbereich **Sicherheit** des Bereichs **Konfiguration**.
es: Podrá establecer estos límites en la subsección **Seguridad** de la sección **Configuración** del back office del portal.
nl: U zal deze limieten kunnen instellen in de subsectie **Veiligheid** van de sectie **Configuratie** van de back-office van uw portaal.

source: When a user makes a request (be it an API call, a dataset creation of the publication of a dataset), we make sure he/she isn't running into the default limit set for him/her and isn't going over the global portal limit. Were it the case, a message would pop-up telling him/her so.
de: Startet ein Benutzer eine Anforderung (z. B. API-Aufruf oder Datensatzerstellung von einer Datensatzveröffentlichung) stellen wir sicher, dass er weder die für ihn festgelegte Standardbegrenzung noch die globale Portalbegrenzung erreicht. Wäre das der Fall, würde ihm das anhand einer Popupnachricht signalisiert.
es: Cuando un usuario efectúa una solicitud (que puede ser una llamada de API, la creación de un conjunto de datos o la publicación de un conjunto de datos), nos aseguramos de que no alcanza el límite predeterminado establecido para él ni el límite global del portal. Si es el caso, le aparecerá un mensaje informativo.
it: Quando un utente effettua una richiesta (come una chiamata API, la creazione di un dataset o la sua pubblicazione), ci assicuriamo che non stia superando né il suo limite massimo, né quello globale del portale. Al verificarsi di uno dei due casi, l'utente viene avvertito da un messaggio pop-up.
nl: Wanneer een gebruiker een aanvraag doet (zijnde een API call, de aanmaak van een dataset of de publicatie van een dataset), zorgen we ervoor dat hij/zij de standaard limiet niet bereikt die voor hem/haar is ingesteld en dat hij/zij de globale limiet van het portaal niet overschrijdt. Wanneer dit het geval is, zou een bericht te voorschijn kunnen komen om hem/haar dit te melden.

source: Setting specific limitations for individual users and a group of users
de: Einrichten spezifischer Einschränkungen für individuelle Benutzer und eine Benutzergruppe
es: Establecer límites específicos para usuarios individuales y un grupo de usuarios
nl: Specifieke limieten instellen voor individuele gebruikers en groepen van gebruikers

source: Some of your users have specific roles within your organization that justify their need for quotas larger than the default ones. For example, you may allow registered users to create only a couple of datasets each, but your Chief Data Office will need to be able to publish as many datasets as the license allows.
de: Einige Ihrer Benutzer übernehmen bestimmte Rollen in Ihrer Organisation, die einen Bedarf an höheren als den standardmäßigen Quoten rechtfertigen. Beispielsweise muss Ihr Chief Data Officer so viele Datensätze veröffentlichen können, wie die Lizenz zulässt, während Sie registrierten Benutzern nur jeweils die Erstellung einiger weniger Datensätze gewähren.
es: Algunos usuarios tienen unos roles específicos en la organización que justifican su necesidad de cuotas superiores a las predeterminadas. Por ejemplo, puede permitir que cada uno de los usuarios registrados cree solo un par de conjuntos de datos, pero el director de datos deberá poder publicar todos los conjuntos de datos permitidos por la licencia.
nl: Sommige van uw gebruikers hebben specifieke rollen binnen uw organisatie die rechtvaardigen dat ze quota's nodig hebben die groter zijn dan de standaard quota's. Bijvoorbeeld: u kan geregistreerde gebruikers toelaten om elk slechts een aantal datasets aan te maken, maar uw Chief Data Officer zal zoveel datasets moeten kunnen publiceren als de licentie toelaat.

source: In order to do so, you'll have to go to the :doc:`user's management page </managing_domain/01_managing_users_and_groups/users>` or his/her :doc:`group management page </managing_domain/01_managing_users_and_groups/groups>` to set a more appropriate limit for his/her use case.
de: Dazu müssen Sie zur :doc:`Benutzerverwaltungseite </managing_domain/01_managing_users_and_groups/users>` bzw. der entsprechenden :doc:`Gruppenverwaltungsseite </managing_domain/01_managing_users_and_groups/groups>` wechseln, wo Sie eine für den jeweiligen Fall passendere Begrenzung einrichten können.
es: Para ello, tendrá que ir a la :doc:`página de administración de usuarios </managing_domain/01_managing_users_and_groups/users>` o la :doc:`página de administración de grupos </managing_domain/01_managing_users_and_groups/groups>` con objeto de establecer un límite más adecuado para ese caso de uso.
nl: Om dit te doen, moet u naar de :doc:`beheerpagina van de gebruiker </managing_domain/01_managing_users_and_groups/users>` of zijn/haar :doc:`beheerpagina van de groep </managing_domain/01_managing_users_and_groups/groups>` gaan om een meer gepaste limiet voor zijn/haar gebruiksgeval in te stellen.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: When setting a new quota for individuals users or a group of users, the quota count starts back at 0 for the period.
de: Wenn eine neue Quote für einzelne Benutzer oder eine Benutzergruppe festgelegt wird, beginnt die Quotenzählung für den Zeitraum wieder bei 0.
es: Al establecer una nueva cuota para usuarios individuales o un grupo de usuarios, el recuento de la cuota vuelve a ponerse a cero para el periodo.
nl: Wanneer nieuwe quota's voor individuele gebruikers of groepen van gebruikers worden ingesteld, beginnen de quota's voor de periode terug te tellen vanaf 0.

source: Before diving into which quotas exist on OpenDataSoft portals, it is important to introduce the license topic. A license applies to each and every OpenDataSoft portal. It is a contract between OpenDataSoft and the portal owners, defining how much data can be injected into the portal and the consumption of this data.
it: Prima di descrivere le quote presenti sui portali OpenDataSoft, è importante introdurre il tema delle licenze. Ogni portale OpenDataSoft è regolato da una licenza, cioè un contratto stipulato tra OpenDataSoft e i proprietari del portale, che stabilisce la quantità di dati che è possibile inserire e utilizzare.

source: Your license defines 4 global limits on your portal: the first one puts an upper limit on the consumption of the data and the others regulate the amount of data you can inject into the portal.
it: La licenza definisce 4 limiti globali per il tuo portale: il primo stabilisce un limite massimo per il consumo dei dati, mentre gli altri regolano la quantità di dati che è possibile inserire nel portale.

source: The number of API calls measure can be a bit difficult to wrap his/her head around since this is a very technical measure of the activity. But it can be summarised as such: everytime somebody accesses your portal, for example the datasets catalog page, the interface will make requests to the portal for the filters values, for the 10 first datasets then the 10 next ones etc. Each of these requests is an API call and counted within the quota.
it: Data la tecnicità del dato, il numero delle chiamate API è una misura non semplice da comprendere, ma può essere riassunta in questo modo: ogni volta che qualcuno accede al tuo portale, ad esempio alla pagina del catalogo dei dataset, l'interfaccia invia una richiesta al portale per visualizzare i primi 10 dataset in base ai filtri applicati, poi una per i 10 successivi e così via. Ciascuna di queste richieste è una chiamata API e verrà conteggiata nella quota.

source: You can see these quotas and check any information related to your license, under the **License** section of the back office.
it: Per visualizzare le tue quote e consultare le informazioni relative alla tua licenza, vai nella sezione **Licenza** dell'interfaccia di back-office.

source: You'll be able to set these limits in the **Security** subsection of the **Configuration** section of your portal's backoffice.
it: Per specificare questi limiti, fai clic su **Sicurezza**, nel menu **Configurazione** dell'interfaccia di back-office.

source: Setting specific limitations for individual users and group of users
it: Impostazione di limiti specifici per utenti individuali e gruppi

source: Some of your users have specific roles within your organisation that justify their need for quotas larger than the default ones. For example, you may allow registered users to create only a couple of datasets each, but your Chief Data Office will need to be able to publish as many datasets as the license allows.
it: Alcuni utenti svolgono funzioni all'interno della tua organizzazione che giustificano l'assegnazione di quote più ampie rispetto a quelle predefinite. Potresti ad esempio consentire la creazione di al massimo un paio di dataset per ogni utente registrato, ma al contempo assegnare al tuo responsabile dei dati la facoltà di pubblicarne tanti quanti ne concede la licenza.
