Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/01_creating_content_page/create.po
Languages: es, fr, it, nl

source: Creating a content page
es: Crear una página de contenido
fr: Créer une page de contenu
nl: Een contentpagina aanmaken

source: The OpenDataSoft platform allows to publish and explore datasets, but also to use it to build fully customized content pages, mixing editorial content as well as data visualizations built from the datasets published in the domain.
es: La plataforma OpenDataSoft permite publicar y explorar conjuntos de datos, pero también puede usarse para crear páginas de contenido totalmente personalizadas, combinando contenido editorial y visualizaciones de datos obtenidas a partir de sus propios conjuntos de datos.
fr: La plateforme OpenDataSoft permet de publier et d'explorer des jeux de données, mais aussi de créer des pages de contenu totalement personnalisées, mélangeant contenu éditorial et visualisations, basées sur les jeux de données publiés sur le domaine.
nl: Dankzij het OpenDataSoft-platform kunt u datasets publiceren en exploreren, maar het ook gebruik om volledig gepersonaliseerde contentpagina's te bouwen, editoriale content te mengen alsook dataweergaves vanuit de datasets die gepubliceerd zijn in het domein.

source: Content pages can be used to:
es: Las páginas de contenido se pueden utilizar para:
fr: Les pages de contenu peuvent servir à :
it: Le pagine di contenuto possono rivelarsi utili per le seguenti finalità:
nl: Contentpagina's kunnen gebruikt worden om:

source: Complement and organize the portal by configuring a home page and by creating pages on specific topics (the project, the data license...)
es: Complementar y organizar el portal de datos configurando una página principal y creando páginas sobre materias específicas (el proyecto, la licencia de datos, etc.).
fr: Compléter et organiser le portail en configurant une page d'accueil et en créant des pages dédiées à des sujets spécifiques (le projet, la licence sous laquelle les données sont publiées, etc.).
nl: Het portaal aanvullen en organiseren door een homepagina te configureren en door pagina's te creÃ«ren rond specifieke onderwerpen (het project, de datalicentie, ...)

source: Write editorial content directly on the platform and share it, as a direct link or through an embed
es: Escribir contenido editorial directamente en la plataforma y compartirlo en forma de vínculo directo o a través de una incrustación.
fr: Rédiger du contenu éditorial sur la plateforme et le partager sous forme de lien direct ou d'intégration.
nl: Editoriale content rechtstreeks op het platform schrijven en deze delen als een rechtstreekse link of via een embed

source: Build advanced dashboards with dynamic visualizations on the portal, and share them
es: Crear paneles avanzados con visualizaciones dinámicas en el portal, y compartirlos.
fr: Développer et partager des tableaux de bord complexes comprenant des visualisations dynamiques des données du portail.
nl: Geavanceerde dashboards bouwen met dynamische weergaves op het portaal en deze delen

source: Writing the page
es: Escribir la página
fr: Créer la page
it: Creazione della pagina
nl: De pagina schrijven

source: We want to create a very simple page, containing information about our portal, and a side bar to talk a bit about our city.
es: Queremos crear una página muy simple, que contenga información sobre el portal, y una barra lateral para hablar un poco de la ciudad.
fr: Nous voulons créer une page très simple, présentant des informations sur notre portail et une barre latérale pour parler brièvement de notre ville.
it: Il nostro obiettivo è creare una pagina molto semplice con alcune informazioni sul nostro portale e un menu laterale per parlare un po' della nostra città.
nl: We willen een heel eenvoudige pagina aanmaken, die informatie bevat over uw portaal en een zijbalk waarin u iets kan vertellen over uw stad.

source: Let's start by going into the Back office, and clicking on the *Page > New page* link in the menu.
es: Para comenzar, vaya al back office y haga clic en el vínculo *Página > Página nueva* del menú.
fr: Commençons par cliquer sur le lien *Page > Nouvelle page* dans le menu du back office.
it: Per iniziare, vai nell'interfaccia di back-office e clicca sul link *Pagina > Nuova pagina* del menu.
nl: Laten we beginnen met naar de back-office te gaan en te klikken op de koppeling "Pagina > Nieuwe pagina" in het menu.

source: This brings you into the interface to edit your new blank page.
es: Así accederá a la interfaz para editar la página en blanco nueva.
fr: Nous sommes désormais dans l'interface d'édition de cette nouvelle page.
it: Comparirà così l'interfaccia di modifica della nuova pagina.
nl: Hierdoor komt u terecht op de interface waarmee u uw nieuwe blanco pagina kan bewerken.

source: For now the page isn't really created yet; you need to save it first. Before doing this you need to configure the page **slug** (*page1* in the example above), which is both the page's unique identifier, and the last part of the page's URL (address in the browser).
es: Por el momento la página todavía no está creada; primero tiene que guardarla. Para ello, antes tiene que configurar el **slug** de la página (*page1* en el ejemplo anterior), que es a la vez el identificador exclusivo de la página y la última parte de la dirección URL de la página (la dirección del explorador).
fr: Pour l'instant la page n'est pas vraiment créée, vous devez d'abord l'enregistrer. Toutefois, avant de l'enregistrer, il vous faut déterminer le **slug** de la page (*page1* dans l'exemple ci-dessus), qui sert à l'identifier de manière unique et qui sera le dernier élément de l'URL de la page (adresse dans le navigateur).
it: La pagina non è ancora stata realmente creata, perché deve essere innanzitutto salvata. Prima di fare ciò, è però necessario configurare il suo **slug** (*page1* nell'esempio precedente), che rappresenterà sia l'identificatore univoco della pagina sia l'ultima parte del suo URL (l'indirizzo visualizzato dal browser).
nl: Op dit moment is de pagina nog niet echt aangemaakt; u moet deze eerst nog opslaan. Alvorens dit te doen moet u eerst de **slug** pagina configureren (*page1* in het bovenstaande voorbeeld), die zowel de unieke identifier van de pagina als de het laatste deel van de URL van de pagina is (adres in de browser).

source: Note
es: Nota
fr: Remarque
nl: Opmerking

source: If the domain is configured for multiple user interface languages, you need to configure the page's content (title, description and page text itself) for all the configured languages.
es: Si el dominio está configurado para varios idiomas de la interfaz de usuario, tiene que configurar el contenido de la página (título, descripción y texto de la página) para todos los idiomas configurados.
fr: Si le domaine est configuré de manière à prendre en charge plusieurs langues, vous devrez configurer le contenu de la page (titre, description et texte de la page) dans chacune de ces langues.
it: Se il tuo è un dominio multilingue, il contenuto della pagina dovrà essere creato in tutte le lingue configurate (titolo, descrizione e testo della pagina).
nl: Wanneer het domein is geconfigureerd voor interfacetalen van meerdere gebruikers, moet u de content van de pagina configureren (titel, beschrijving en paginatekst zelf) voor alle geconfigureerde talen.

source: The template selector shows predefined templates that you can directly use. These templates range from very simple layout, with text zones that you can edit directly, to portal homepages presenting the content of the catalog.
es: El selector de plantillas muestra plantillas predefinidas listas para usar directamente. Estas plantillas varían de un diseño muy simple, con zonas de texto que puede editar directamente, a páginas principales de portales que presentan el contenido del catálogo.
fr: Le sélectionneur de modèles propose des modèles prédéfinis que vous pouvez utiliser. Ces modèles comprennent aussi bien des pages à disposition simple avec des zones de texte que vous pouvez éditer directement, que des pages d'accueil de portail qui présentent le contenu du catalogue.
it: Nell'apposito menu a tendina, hai a disposizione diversi modelli predefiniti pronti all'uso, che spaziano da un layout molto semplice con aree di testo da modificare direttamente fino alle homepage in cui presentare il catalogo del portale.
nl: De templatekiezer toont vooraf gedefinieerde templates die u rechtstreeks kan gebruiken. Deze templates gaan van een zeer eenvoudige lay-out, met tekstzones die u rechtstreeks kan bewerken, tot homepagina's van portalen die de content van de catalogus voorstellen.

source: You can also choose to edit the page in **expert mode**, which gives you a direct access to the page's HTML and CSS, allowing you to :doc:`further customize the style of your page <style>`, or to :doc:`build very advanced pages using our OpenDataSoft widgets <../tutorials/dashboard/dashboard>`. You can switch to expert mode from any template, meaning you can use these templates as starting points for dashboards or advanced pages. But once you've switched to expert mode, you cannot go back.
es: También puede elegir editar la página en **modo experto**, lo que le permite acceder directamente al código HTML y CSS de la página, a fin de :doc:`personalizar de forma adicional el estilo de la página <style>` o :doc:`crear páginas muy avanzadas mediante los widgets de OpenDataSoft <../tutorials/dashboard/dashboard>`. Puede cambiar al modo experto desde cualquier plantilla, lo que significa que puede usar estas plantillas como base para paneles o páginas avanzadas. No obstante, una vez que cambie al modo experto, no podrá volver atrás.
fr: Vous pouvez également modifier la page en **mode expert**, ce qui vous donne un accès direct au code HTML et CSS de la page, vous permettant ainsi de :doc:`personnaliser davantage le style de votre page <style>` ou de :doc:`créer des pages très complexes grâce aux widgets d'OpenDataSoft <../tutorials/dashboard/dashboard>`. Vous pouvez passer en mode expert depuis n'importe quel modèle, ce qui vous permet d'utiliser ces modèles comme point de départ pour les tableaux de bord ou les pages complexes. En revanche, une fois le mode expert activé, il n'est pas possible de revenir en arrière.
nl: U kunt er ook voor kiezen om de pagina te bewerken in **expertmodus**. Hiermee krijgt u rechtstreeks toegang tot de HTML en CSS van de pagina en laat u toe om :doc:`de stijl van uw pagina verder te personaliseren <style>`, of om :doc:`zeer geavanceerde pagina's te bouwen door gebruik te maken van onze OpenDataSoft widgets <../tutorials/dashboard/dashboard>`. U kunt vanuit om het even welke template overschakelen naar expertmodus, m.a.w. u kunt deze templates gebruiken als vertrekpunten voor dashboards of geavanceerde pagina's. Maar eenmaal u bent overgeschakeld naar expertmodus, kunt u niet terug keren.

source: Since the stated goal is to create a simple content page with a side bar, the "Main block + right column" template seems like a perfect fit.
es: Dado que el objetivo indicado es crear una página de contenido simple con una barra lateral, la plantilla "Main block + right column" parece perfecta.
fr: Étant donné que nous voulons créer une page de contenu simple avec une barre latérale, le modèle "Main block + right column" (Bloc principal + colonne de droite) semble correspondre parfaitement.
it: Nell'esempio in questione, per creare una pagina di contenuto semplice dotata di una barra laterale, sceglieremo il modello "Blocco principale + colonna a destra".
nl: Aangezien de opgegeven doelstelling erin bestaat om een eenvoudige contentpagina aan te maken met een zijbalk, lijkt de template "Hoofdblok + kolom rechts" hier perfect te passen.

source: Once the template is chosen, you can see the two blocks of texts, and you can edit and format the text inside them using a text editor. For example you can type a few paragraphs about your portal in the center block, including headers and parts in bold using the editor. Then a few lines about your city in the right side bar.
es: Tras seleccionar la plantilla, puede ver los 2 bloques de textos, y puede editar y dar formato al texto de su interior con un editor de texto. Por ejemplo, puede escribir varios párrafos sobre el portal en el bloque central, y especificar encabezados y partes en negrita con el editor. Y después, incluya unas líneas sobre la ciudad en la barra lateral derecha.
fr: Une fois le modèle choisi, vous verrez les deux blocs de texte dans lesquels vous pouvez éditer et mettre en forme le texte grâce à un logiciel de traitement de texte. Vous pouvez par exemple rédiger quelques paragraphes à propos de votre portail dans le bloc central, en incluant des en-têtes et des parties en gras via le logiciel de traitement de texte, et écrire quelques lignes à propos de votre ville dans la barre latérale droite.
it: Una volta selezionato il modello, verranno visualizzati due blocchi, all'interno dei quali sarà possibile creare e formattare i testi tramite un editor. Ad esempio, nel blocco centrale puoi inserire qualche paragrafo con una descrizione del tuo portale, arricchita da intestazioni e parti in grassetto, mentre nella barra a destra avrai modo di includere qualche informazione sulla tua città.
nl: Eenmaal de template is gekozen, kan u de twee tekstblokken zien en kan u de tekst erin bewerken en formatteren met behulp van een text editor. Bijvoorbeeld: u kan een aantal paragrafen over uw portaal typen in het centraal blok, inclusief headers en onderdelen in het vetjes met behulp van de editor. Vervolgens enkele lijnen over uw stad in de zijbalk rechts.

source: On the right part of the interface, you can see a little *Preview* button, which toggle a preview of the page as your users would see it on the portal, without having to save the page first.
es: En la parte derecha de la interfaz puede ver un pequeño botón *Vista previa*, que alterna una vista previa de la página tal como la verían los usuarios del portal, sin tener que guardar primero la página.
fr: Le petit bouton *Aperçu* dans la partie droite de l'interface vous permet de générer un aperçu de la page, telle qu'elle sera vue par les utilisateurs sur le portail, sans avoir à l'enregistrer au préalable.
it: Nella parte destra dell'interfaccia, il piccolo pulsante *Anteprima* permette di visualizzare il modo in cui la pagina apparirà agli utenti del portale, senza dover salvare il lavoro.
nl: Aan de rechterzijde van de interface kan u een knopje "Voorbeeldweergave" zien die een voorbeeldweergave geeft van de pagina zoals uw gebruikers deze zouden zien op het portaal, zonder eerst de pagina te moeten opslaan.

source: After editing the page, having a look at the preview, maybe editing and previewing again a few times, you'll reach a point where you are happy with your page, and you'll be able to save it.
es: Tras editar la página, obtener una vista previa, y quizás volver a editar y obtener una vista previa varias veces, llegará a un punto en que estará satisfecho con la página y ya podrá guardarla.
fr: Après avoir édité la page, en avoir généré un aperçu, puis l'avoir modifiée et testée encore quelques fois, vous finirez par être satisfait de celle-ci, et c'est à ce moment que vous pourrez la sauvegarder.
it: Dopo aver lavorato sulla pagina, visualizzato a più riprese l'anteprima e apportato tutte le modifiche che ritieni necessarie, sarai infine pronto per salvarla.
nl: Nadat u de pagina heeft bewerkt, kan u een kijkje nemen naar de voorbeeldweergave en deze misschien een paar keer opnieuw bewerken en bekijken. Op een bepaald moment belandt u op een punt waarbij u tevreden bent met uw pagina en waarbij u deze kan opslaan.

source: Making the page accessible to your users
es: Establecer la página como accesible para los usuarios
fr: Rendre la page disponible pour vos utilisateurs
it: Come rendere la pagina accessibile agli utenti
nl: De pagina beschikbaar maken voor uw gebruikers

source: Once the page is created and saved, it is accessible using its page URL; you can share the URL to anyone you want, but you may want to make the page accessible through your portal's menu, or even make it your new portal homepage. This is all done through the *Look & feel > Navigation* page.
es: Una vez creada y guardada la página, se puede acceder a ella utilizando la dirección URL de la página; puede compartir la dirección URL con cualquier usuario que desee, pero puede que desee establecer la página como accesible a través del menú del portal, o incluso hacer que sea la nueva página principal del portal. Todas estas acciones se llevan a cabo en la página *Apariencia > Navegación*.
fr: Une fois la page créée et sauvegardée, elle devient accessible via son URL. Vous pouvez partager cette URL avec les utilisateurs, mais il est également possible d'intégrer la page au menu de votre portail ou même d'en faire la nouvelle page d'accueil de votre portail. Pour ce faire, rendez-vous sur la page *Apparence > Navigation*.
it: Una volta creata e salvata, la pagina è accessibile tramite il relativo URL ed è pronta per essere condivisa con chiunque tu desideri. In alcuni casi, potresti volerla includere nel menu del tuo portale o trasformarla nella nuova homepage. Puoi fare tutto ciò nella pagina *Look & feel > Navigazione*.
nl: Eenmaal de pagina is aangemaakt en opgeslagen, is deze toegankelijk via de URL van deze pagina: u kan de URL delen met iedereen die u wil, maar u kan de pagina ook beschikbaar stellen via het menu van uw portaal of deze zelfs tot uw nieuwe homepagina van uw portaal maken. Dit gebeurt allemaal via de pagina "Look & feel > Navigatie".

source: From here, you can add your page in the header menu, or set it as the homepage.
es: Desde aquí, puede añadir la página al menú de encabezado o configurarla como la página principal.
fr: D'ici, vous pouvez ajouter votre page dans le menu de l'en-tête ou la définir comme page d'accueil.
it: Qui avrai modo di aggiungere la tua pagina nel menu dell'header o impostarla come homepage.
nl: Van hieruit kan u uw pagina toevoegen in het headermenu of deze instellen als de homepagina.
