Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/01_creating_content_page/creating_page.po
Languages: de, es, fr, nl

source: Creating a content page
de: Eine Inhaltsseite erstellen
es: Crear una página de contenido
fr: Créer une page de contenu
nl: Een contentpagina aanmaken

source: The Opendatasoft platform allows the creation of content pages entirely built with HTML and CSS. These content pages can be used for various types of usage: portal homepages, dashboards that mix editorial content and data visualizations based on the datasets published on the portal, pages dedicated to specific topics (explanation about the open data project of the portal, the license, etc.).
de: Die Opendatasoft-Plattform ermöglicht die Erstellung von Inhaltsseiten, die vollständig aus HTML und CSS bestehen. Diese Inhaltsseiten können für verschiedene Einsatzbereiche genutzt werden: Portal-Homepages, Dashboards, die redaktionelle Inhalte und Datenvisualisierungen auf Grundlage der auf dem Portal veröffentlichten Datensätze kombinieren, Seiten zu bestimmten Themen (Erklärung zum Open-Data-Projekt des Portals, der Lizenz usw.).
fr: La plateforme Opendatasoft permet de créer des pages de contenu en HTML et CSS. Celles-ci peuvent être utilisées à différentes fins : pages d'accueil de portail, tableaux de bord qui associent contenu éditorial et visualisations de données en fonction des jeux de données publiés sur le portail, pages dédiées à des sujets spécifiques (explications sur le projet Open Data du portail, sur la licence, etc.).

source: To create a new content page:
de: Um eine neu Inhaltsseite zu erstellen:
es: Para crear una nueva página de contenido:
fr: Pour créer une page de contenu :
nl: Om een nieuwe contentpagina aan te maken:

source: Go to the Pages section of the back office.
de: Öffnen Sie den Seiten-Bereich des Back-Office.
es: Vaya a la sección Páginas del back office.
fr: Rendez-vous dans la section Pages de l'interface d'administration.
nl: Ga naar de rubriek Pagina's van de back office.

source: Click on the New Page button.
de: Klicken Sie auf den Button "Neue Seite".
es: Haga clic en el botón Página nueva.
fr: Cliquez sur le bouton Nouvelle page.
nl: Kik op de knop Nieuwe pagina.

source: In the Properties tab, fill in the following properties:
de: Geben Sie unter der Registerkarte Eigenschaften die folgenden Eigenschaften ein:
es: En la ficha Propiedades, especifique las siguientes propiedades:
fr: Renseignez les propriétés suivantes dans l'onglet Propriétés :
nl: Vul in het tabblad Eigenschappen de volgende eigenschappen in:

source: Page URL (mandatory): write the page slug, which is both the unique identifier of the page and the last part of the URL to access the page. This property is mandatory: the page cannot be fully created nor saved if it does not have a defined page slug.
de: Seiten-URL (obligatorisch): Geben Sie den Seiten-Slug ein, der sowohl die eindeutige Kennung der Seite als auch den letzten Teil der URL für den Zugriff auf die Seite enthält. Diese Eigenschaft ist erforderlich: Die Seite kann nicht vollständig erstellt oder gespeichert werden, wenn kein festgelegter Seiten-Slug vorliegt.
fr: URL de page (obligatoire) : indiquez le slug de la page, qui constitue l'identifiant unique de la page et la dernière partie de l'URL permettant d'accéder à cette page. Cette propriété est obligatoire : sans elle, la page ne peut pas être totalement créée ni sauvegardée.

source: Title: choose a title for the page, which will be displayed as the browser tab title and in the list of content pages. The title can be configured in more than one language, depending on how many languages are available for the portal.
de: Titel: Wählen Sie einen Titel für die Seite, der als Titel der Browser-Registerkarte und in der Liste der Inhaltsseiten angezeigt wird. Der Titel kann in mehr als einer Sprache konfiguriert werden, je nachdem, wie viele Sprachen für das Portal zur Verfügung stehen.
fr: Titre : donnez un titre à votre page, qui sera affiché en tant que titre d'onglet de navigateur et ajouté à la liste des pages de contenu. Le titre peut être configuré en plusieurs langues, en fonction du nombre de langues disponibles dans le portail.

source: Description: write a description for the page, which will be displayed in the list of content pages, right under the title.
de: Beschreibung: Geben Sie eine Beschreibung für die Seite ein. Diese wird in der Liste der Inhaltsseiten direkt unter dem Titel angezeigt.
es: Descripción: escriba una descripción para la página, que se visualizará en la lista de páginas de contenido justo debajo del título.
fr: Description : indiquez une description pour la page, qui sera affichée dans la liste des pages de contenu, juste en dessous du titre.
nl: Beschrijving: schrijf een beschrijving voor de pagina. Deze zal in de lijst van contentpagina's worden weergegeven net onder de titel.

source: Tags: enter one or more tags related to the page, which will be displayed in the list of content pages in the "Tags" column.
de: Tags: Geben Sie in der Spalte "Tags" ein oder mehrere auf die Seite bezogene Tags ein, die in der Liste der Inhaltsseiten angezeigt werden.
fr: Tags : entrez un ou plusieurs tags associés à la page. Ils seront affichés dans la colonne "Tags" de la liste de pages de contenu.

source: Click on the Save button.
de: Klicken Sie auf den Button "Speichern".
es: Haga clic en el botón Guardar.
fr: Cliquez sur le bouton Enregistrer.
nl: Klik op de knop Opslaan.

source: The Opendatasoft platform allows the creation of content pages, entirely built with HTML and CSS. These content pages can be used for various types of usage: portal homepages, dashboards that mix editorial content and data visualizations based on the datasets published on the portal, pages dedicated to specific topics (i.e. explanation about the open data project of the portal, the license etc.).
es: La plataforma Opendatasoft permite la creación de páginas de contenido, creadas completamente con HTML y CSS. Estas páginas de contenido pueden usarse de varias formas: páginas principales de portales, paneles que combinen contenido editorial y visualizaciones de datos a partir de los metadatos publicados en el portal, páginas dedicadas a materias específicas (p. ej., una descripción sobre el proyecto de datos abiertos del portal, la licencia, etc.).
nl: Het Opendatasoft-platform laat toe om contentpagina's aan te maken die volledig opgebouwd zijn met HTML en CSS. Deze contentpagina's kunnen voor verschillende gebruiksdoeleinden gebruikt worden: homepagina's van een portaal, dashboards met gemengde editoriale content en dataweergaven gebaseerd op de datasets die gepubliceerd staan op het portaal, pagina's die gewijd zijn aan specifieke onderwerpen (m.a.w. uitleg over het open data-project van het portaal, de licentie, enz.).

source: Page URL (mandatory): write the page slug, which is both the unique identifier of the page, and the last part of the URL to access the page. This property is mandatory: the page cannot be fully created nor saved if it does not have a defined page slug.
es: Dirección URL de página (obligatoria): escriba el slug de página, que es a la vez el identificador exclusivo de la página y la última parte de la dirección URL para acceder a la página. Esta propiedad es obligatoria: la página no puede terminar de crearse ni guardarse si no tiene un slug de página definido.
nl: URL van de pagina (verplicht): schrijf de pagina slug, zijnde de unieke identifier van de pagina, en het laatste deel van de URL om naar de pagina te gaan. Deze eigenschap is verplicht: de pagina kan niet volledig aangemaakt of bewaard worden wanneer er geen pagina slug is gedefinieerd.

source: Title: choose a title for the page, which will be displayed as the browser tab title, and in the list of content pages. The title can be configured in more than one language, depending on how many languages are available for the portal.
es: Título: elija un título para la página, que se visualizará como el título de la ficha del explorador y en la lista de páginas de contenido. El título puede configurarse en más de un idioma, dependiendo de cuántos estén disponibles para el portal.
nl: Titel: kies een titel voor de pagina. Deze zal worden weergegeven als de titel van de browser tab en in de lijst met contentpagina's. De titel kan in meer dan één taal worden geconfigureerd, afhankelijk van het aantal talen dat beschikbaar is voor het portaal.

source: Tags: enter one or more tags related to the page, which will be displayed in the list of content pages, in the "Tags" column.
es: Etiquetas: especifique una o más etiquetas relacionadas con la página, que se visualizarán en la lista de páginas de contenido, en la columna "Etiquetas".
nl: Tags: voer een of meer tags in met betrekking tot de pagina. Deze zal in de lijst met contentpagina's worden weergegeven in de kolom "Tags".
