Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/01_creating_content_page/integrate_content.po
Languages: de, es, fr, nl

source: Content pages: ideas, tips & resources
de: Inhaltsseiten: Ideen, Tipps & Ressourcen
es: Páginas de contenido: ideas, consejos y recursos
fr: Pages de contenu : idées, astuces et ressources
nl: Contentpagina's: ideeën, tips & middelen

source: Opendatasoft pages allow the creation and integration of a variety of content. Although page templates are available for use, which makes the process of creating a new page content not only easier but also faster (see :ref:`Using page templates<using_page_templates>`), it definitely is a possibility to create a content page from scratch. There are indeed various possible integrations that can be done, and Opendatasoft also offers many resources that can be used as guidelines.
de: Opendatasoft-Seiten ermöglichen die Erstellung und Integration einer Vielzahl von Inhalten. Obwohl Seitenvorlagen zur Verfügung stehen, was das Erstellen eines neuen Seiteninhalts nicht nur einfacher, sondern auch schneller macht (siehe :ref:`Verwendung von Seitenvorlagen<using_page_templates>`), kann auch eine vollkommen neue Inhaltsseite erstellt werden. Es gibt verschiedene mögliche Integrationen und Opendatasoft bietet zahlreiche Ressourcen zur Anleitung.
es: Las páginas de Opendatasoft permiten la creación e integración de una variedad de contenido. Aunque puede usar las plantillas de página disponibles, lo que facilitará y acelerará el proceso de crear el contenido de una página nueva (consulte :ref:`Utilizar plantillas de página<using_page_templates>`), obviamente se puede crear una página de contenido desde cero. En realidad se pueden llevar a cabo distintas integraciones, y Opendatasoft ofrece también muchos recursos que pueden emplearse como guía.
fr: Les pages Opendatasoft vous permettent de créer et d'intégrer divers contenus. Des modèles de page sont disponibles pour simplifier et accélérer le processus de création de pages de contenu (voir :ref:`Utilisation des modèles de page<using_page_templates>`), mais vous avez aussi la possibilité de créer des pages de contenu de A à Z. De nombreuses intégrations peuvent être effectuées, et Opendatasoft propose également différentes ressources utilisables en tant que référentiels.
nl: Opendatasoft-pagina's laten toe een grote verscheidenheid aan content aan te maken en te integreren. Alhoewel er paginatemplates voor gebruik beschikbaar zijn, waardoor het aanmaakproces van nieuwe paginacontent niet alleen eenvoudiger maar ook sneller verloopt (zie :ref:`Paginatemplates gebruiken<using_page_templates>`), is het zeker en vast een mogelijkheid om een contentpagina vanaf nul aan te maken. Er zijn ook verschillende integraties mogelijk en Opendatasoft biedt ook tal van middelen die gebruikt kunnen worden als richtlijnen.

source: This documentation aims at listing ideas and pieces of advice concerning content pages, as well as links to other useful Opendatasoft resources.
de: Diese Dokumentation möchte Ideen und Ratschläge zu Inhaltsseiten sowie Links zu anderen nützlichen Opendatasoft-Ressourcen auflisten.
es: Esta documentación tiene como finalidad enumerar ideas y consejos sobre páginas de contenido, así como enlaces a otros recursos útiles de Opendatasoft.
fr: Cette documentation répertorie des idées et conseils relatifs aux pages de contenu, ainsi que des liens vers d'autres ressources Opendatasoft utiles.
nl: Deze documentatie is bedoeld om een lijst van ideeën en adviezen op te maken betreffende contentpagina's, alsook links naar andere nuttige Opendatasoft-middelen.

source: Content integrations
de: Integration von Inhalten
es: Integraciones de contenido
fr: Intégrations de contenu
nl: Integraties van content

source: The main integration to think of when creating a content page is that of widgets. Opendatasoft widgets are components, available as HTML elements, that can be combined together to build interactive content pages. All widgets are documented in the `Opendatasoft Widgets documentation <https://help.opendatasoft.com/widgets/>`_.
de: Die wichtigste Integration bei der Erstellung einer Inhaltsseite, ist die von Widgets. Opendatasoft-Widgets sind Komponenten, die als HTML-Elemente verfügbar sind und miteinander kombiniert werden können, um interaktive Inhaltsseiten zu erstellen. Alle Widgets sind in der `Dokumentation zu OpenDatasoft-Widgets <https://help.opendatasoft.com/widgets/>`_ erläutert.
es: La integración principal que tener en cuenta al crear una página de contenido es la de los widgets. Los widgets de Opendatasoft son componentes, disponibles como elementos HTML, que pueden combinarse para crear páginas de contenido interactivas. Puede consultar la información de todos los widgets en la `documentación de los widgets de Opendatasoft <https://help.opendatasoft.com/widgets/>`_.
fr: La principale intégration à laquelle vous devez penser lors de la création d'une page de contenu est celle des widgets. Les widgets Opendatasoft sont des composants disponibles en tant qu'éléments HTML et pouvant être combinés pour créer des pages de contenu interactives. Tous les widgets sont présentés dans la `documentation sur les widgets Opendatasoft <https://help.opendatasoft.com/widgets/>`_.
nl: De belangrijkste integratie waar men kan aan denken bij het aanmaken van een contentpagina is die van widgets. Opendatasoft-widgets zijn componenten die beschikbaar zijn als HTML-elementen, die met elkaar gecombineerd kunnen worden om interactieve contentpagina's aan te maken. Alle widgets zijn gedocumenteerd in de `Opendatasoft Widgets documentatie <https://help.opendatasoft.com/widgets/>`_.

source: Some of the best-known widgets, and most useful when creating a content page, are the visualization ones. Each Opendatasoft dataset is available through several visualizations that can all be embedded in a content page (see :doc:`Sharing & embedding data visualizations </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>`).
de: Zu den bekanntesten Widgets, die am nützlichsten bei der Erstellung einer Inhaltsseite sind, gehören Visualisierungen. Jeder Opendatasoft-Datensatz ist über mehrere Visualisierungen verfügbar, die jeweils in eine Inhaltsseite eingebettet werden können. (siehe :doc:`Eine Datenvisualisierung teilen und einbetten </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>`).
es: Algunos de los widgets más conocidos y usados al crear una página de contenido son los de visualización. Cada uno de los conjuntos de datos de Opendatasoft está disponible por medio de varias visualizaciones que pueden incrustarse conjuntamente en una página de contenido (consulte: :doc:`Compartir e incrustar visualizaciones de datos </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>`).
fr: Les plus connus et les plus utiles quand il s'agit de créer une page de contenu sont les widgets de visualisation. Chaque jeu de données Opendatasoft est disponible via plusieurs visualisations, qui peuvent toutes être intégrées dans une page de contenu (voir :doc:`Partager et intégrer des visualisations de données </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>`).
nl: Enkele van de best bekende widgets en de nuttigste bij het aanmaken van een contentpagina zijn de weergavewidgets. Elke Opendatasoft-dataset is inderdaad beschikbaar via verschillende weergaves, die allemaal embed kunnen worden in een contentpagina (zie :doc:`Dataweergaves delen & embedden </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>`).

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: A few widgets are available in the User Guide instead of the Widgets documentation. Contrary to all other widgets, they cannot be used outside the Opendatasoft environment. See :doc:`Contact form <../tutorials/contact_form/contact_form>` and :doc:`Pages list <../tutorials/pages_list/pages_list>`.
de: Einige Widgets sind statt in der Widgets-Dokumentation im Benutzerhandbuch verfügbar. Im Gegensatz zu allen anderen Widgets können sie nicht außerhalb der Opendatasoft-Umgebung verwendet werden. Siehe :doc:`Kontaktformular <../tutorials/contact_form/contact_form>` und :doc:`Seitenliste<../tutorials/pages_list/pages_list>`.
es: Algunos widgets están disponibles en la guía del usuario en lugar de la documentación de los widgets. A diferencia de todos los demás widgets, no pueden emplearse fuera del entorno de Opendatasoft. Consulte :doc:`Formulario de contacto <../tutorials/contact_form/contact_form>` y :doc:`Lista de páginas <../tutorials/pages_list/pages_list>`.
fr: Quelques widgets sont disponibles dans le guide de l'utilisateur plutôt que dans la documentation sur les widgets. Contrairement aux autres widgets, ils ne peuvent pas être utilisés en dehors de l'environnement Opendatasoft. Consultez :doc:`Formulaire de contact <../tutorials/contact_form/contact_form>` et :doc:`Liste des pages <../tutorials/pages_list/pages_list>`.
nl: Er zijn een aantal widgets beschikbaar in de Gebruikshandleiding in plaats van de Widget documentatie, omdat, in tegenstelling tot alle andere widgets, ze niet buiten de Opendatasoft-omgeving kunnen worden gebruikt. Zie :doc:`Contactformulier <../tutorials/contact_form/contact_form>` en :doc:`Lijst met pagina's <../tutorials/pages_list/pages_list>`.

source: Third-party content, that is, integrations with elements that are not of the Opendatasoft environment, can also be integrated in a content page, as long as they are available as a pastable HTML piece of code.
de: Inhalte von Drittanbietern, also Integrationen mit Elementen, die nicht zur Opendatasoft-Umgebung gehören, können ebenfalls in eine Inhaltsseite integriert werden, sofern sie als einfügbarer HTML-Code vorliegen.
es: También se puede integrar contenido de terceros (es decir, integraciones con elementos que no son del entorno de Opendatasoft) en una página de contenido, siempre y cuando estén disponibles como fragmento de código HTML listo para pegar.
fr: Les contenus tiers (c.-à-d. les intégrations à des éléments étrangers à l'environnement Opendatasoft) peuvent également être intégrés dans une page de contenu, sous réserve qu'ils soient disponibles sous la forme d'un extrait de code HTML à coller.
nl: Content van derden (betekenis, integraties met elementen die niet van de Opendatasoft-omgeving zijn) kan ook in een contentpagina worden geïntegreerd, zoals ze beschikbaar is als plakbaar HTML-element of -code.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Due to security concerns, JavaScript is not allowed in Opendatasoft pages. Other-party embeds in JavaScript are therefore not supported.
de: Aus Sicherheitsgründen ist JavaScript auf Opendatasoft-Seiten nicht erlaubt. Einbettungen von Drittanbietern in JavaScript werden daher nicht unterstützt.
es: Por motivos de seguridad, no se permite JavaScript en las páginas de Opendatasoft. Por lo tanto, no se permiten incrustaciones de terceros en JavaScript.
fr: Pour des raisons de sécurité, JavaScript n'est pas autorisé dans les pages Opendatasoft. Par conséquent, les autres intégrations tierces en JavaScript ne sont pas prises en charge.
nl: Omwille van veiligheidsoverwegingen is JavaScript niet toegelaten in Opendatasoft-pagina's. Daardoor worden embeds van derden in JavaScript niet ondersteund.

source: Content creation resources
de: Ressourcen für die Erstellung von Inhalten
es: Recursos de creación de contenido
fr: Ressources de création de contenu
nl: Middelen voor het aanmaken van content

source: The user guide is not meant to provide more information about content pages than what is already documented in this Creating content section. However, there are other Opendatasoft resources entirely about the content pages topic.
de: Das Benutzerhandbuch liefert keine weiteren Informationen über Inhaltsseiten als solche, die bereits in dem Abschnitt "Inhalt erstellen" dokumentiert sind. Dennoch gibt es noch andere Opendatasoft-Ressourcen, die sich ausschließlich mit dem Thema Inhaltsseiten befassen.
es: La guía del usuario no está pensada para dar más información sobre las páginas de contenido de la que ya está documentada en esta sección de creación de contenido. Sin embargo, existen otros recursos de Opendatasoft específicamente sobre el tema de las páginas de contenido.
fr: L'objectif du guide de l'utilisateur n'est pas de fournir d'autres informations sur les pages de contenu que celles déjà présentes dans cette section sur la création de contenu. Toutefois, d'autres ressources Opendatasoft sont entièrement dédiées à ce sujet.
nl: De gebruikershandleiding is niet bedoeld om meer informatie te verschaffen over contentpagina's dan wat reeds gedocumenteerd wordt in deze rubriek Content aanmaken. Er zijn wel andere Opendatasoft-middelen die volledig handelen over het onderwerp contentpagina's.

source: `Product Concepts <https://discovery.opendatasoft.com/pages/home/?refine.type=Product%20Concept>`_: explained demonstrations of concepts that can be used in content pages, such as HTML, CSS, Angular, etc.
de: `Produktkonzepte <https://discovery.opendatasoft.com/pages/home/?refine.type=Product%20Concept>`_: erläuterte Demonstrationen von Konzepten, die in Inhaltsseiten verwendet werden können, wie HTML, CSS, Angular usw.
es: `Conceptos de producto <https://discovery.opendatasoft.com/pages/home/?refine.type=Product%20Concept>`_: demostraciones explicadas de conceptos que pueden usarse en páginas de contenido, como HTML, CSS, Angular, etc.
fr: `Concepts produits <https://discovery.opendatasoft.com/pages/home/?refine.type=Product%20Concept>`_ : des démonstrations détaillées de concepts pouvant être utilisés dans des pages de contenu, tels que HTML, CSS, Angular, etc.
nl: In `Productconcepten <https://discovery.opendatasoft.com/pages/home/?refine.type=Product%20Concept>`_: worden demonstraties van concepten uitgelegd die gebruikt kunnen worden in contentpagina's, zoals HTML, CSS, Angular, enz.

source: `ODS Templates <https://discovery.opendatasoft.com/pages/home/?refine.type=Template>`_: content page templates that can be copied and are ready to be pasted on an empty page.
de: `ODS-Vorlagen <https://discovery.opendatasoft.com/pages/home/?refine.type=Template>`_: Vorlagen von Inhaltsseiten, die kopiert und auf einer leeren Seite eingefügt werden können.
es: `Plantillas de ODS <https://discovery.opendatasoft.com/pages/home/?refine.type=Template>`_: plantillas de página de contenido que pueden copiarse y están listas para pegar en una página vacía.
fr: `Templates ODS <https://discovery.opendatasoft.com/pages/home/?refine.type=Template>`_ : des templates de page de contenu qui peuvent être copiés et collés sur une page vide.
nl: `ODS Templates <https://discovery.opendatasoft.com/pages/home/?refine.type=Template>`_: templates van contentpagina's die gekopieerd kunnen worden en klaar zijn om geplakt te worden in een lege pagina.

source: `Tutorials <https://help.opendatasoft.com/tutorials/en/tutorials.html>`_: step by step guides to create entire or parts of content pages, ranked by 3 difficulty levels.
de: `Tutorials <https://help.opendatasoft.com/tutorials/en/tutorials.html>`_: Schritt-für-Schritt-Anleitungen zur Erstellung von ganzen oder teilweisen Inhaltsseiten, die in 3 Schwierigkeitsgrade eingeteilt sind.
es: `Tutoriales <https://help.opendatasoft.com/tutorials/en/tutorials.html>`_: guías paso a paso para crear total o parcialmente páginas de contenido, clasificadas en 3 niveles de dificultad.
fr: `Tutoriels <https://help.opendatasoft.com/tutorials/en/tutorials.html>`_ : des guides étape par étape pour créer entièrement ou partiellement des pages de contenu. Ces tutoriels sont classés selon 3 niveaux de difficulté.
nl: `Handleidingen <https://help.opendatasoft.com/tutorials/en/tutorials.html>`_: stap voor stap richtlijnen om volledige of delen van contentpagina's aan te maken, gerangschikt in 3 moeilijkheidsniveaus.
