Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/01_creating_content_page/managing_page_security.po
Languages: de, es, fr, nl

source: Managing the security of a page
de: Die Sicherheit einer Seite verwalten
es: Gestionar la seguridad de una página
fr: Gérer la sécurité d'une page
nl: De veiligheid van een pagina beheren

source: To manage a content page security, go to the Pages section of the back office, in the Security tab of the chosen content page.
de: Öffnen Sie unter der Registerkarte Sicherheit der ausgewählten Inhaltsseite den Seitenbereich des Backoffice, um die Sicherheit einer Inhaltsseite zu verwalten.
es: Para gestionar la seguridad de una página de contenido, vaya a la sección Páginas del back office, en la ficha Seguridad de la página de contenido elegida.
fr: Pour gérer la sécurité d'une page de contenu, rendez-vous à la section Pages du backoffice, dans l'onglet Sécurité de la page de contenu choisie.
nl: Om de veiligheid van een contentpagina te beheren, ga naar de rubriek Pagina's van de back office en vervolgens naar het tabblad Veiligheid van de gekozen contentpagina.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: General permissions at domain level have priority over permissions at page level. For example, if a user has the *Browse all pages* permission, they can access any page, even the private ones. They don't need to be added in the page and granted security permissions for that private page.
de: Allgemeine Berechtigungen auf Domain-Ebene haben Vorrang vor Berechtigungen auf Seitenebene. Hat ein Benutzer beispielsweise die Berechtigung *Alle Seiten durchsuchen*, kann er auf alle Seiten zugreifen, d. h. auch auf private. Er muss hierzu nicht zu den Seiten- und Sicherheitsberechtigungen für diese private Seite hinzugefügt werden.
es: Los permisos generales a nivel de dominio tienen prioridad sobre los permisos a nivel de página. Por ejemplo, si un usuario tiene el permiso *Explorar todas las páginas*, puede acceder a cualquier página, incluso las privadas. No es necesario añadirlo a la página y otorgarle permisos de seguridad para esa página privada.
fr: Les permissions générales au niveau du domaine prévalent sur les permissions au niveau de la page. Par exemple, si un utilisateur dispose de la permission *Consulter toutes les pages*, il peut accéder à l'ensemble des pages, même aux pages privées. Il n'a pas besoin d'être ajouté à la page et d'obtenir des permissions de sécurité pour cette page privée.
nl: Algemene toelatingen op domeinniveau hebben prioriteit op toelatingen op paginaniveau. Bijvoorbeeld, wanneer een gebruiker de "Doorloop alle pagina's"-toelating heeft, heeft hij toegang tot alle pagina's, zelfs de privépagina's. Ze moeten niet aan de pagina worden toegevoegd en hebben de veiligheidstoelatingen voor die privépagina.

source: Choosing an access policy
de: Eine Zugriffsrichtlinie auswählen
es: Elegir una directiva de acceso
fr: Choisir une politique d'accès
nl: Een toegangsbeleid kiezen

source: Content pages created with the Opendatasoft platform can either be accessible by anyone allowed on the portal, or restricted to specifically defined users.
de: Mit der Opendatasoft-Plattform erstellte Inhaltsseiten können entweder von jedem auf dem Portal zugelassenen Benutzer aufgerufen oder auf bestimmte Benutzer beschränkt werden.

source: To choose the access policy of a content page:
de: So wählen Sie die Zugriffsrichtlinie für eine Inhaltsseite aus:
es: Para elegir la directiva de acceso de una página de contenido:
fr: Pour choisir la politique d'accès d'une page de contenu :
nl: Om het toegangsbeleid van een contentpagina te kiezen:

source: Go to Security > Access policy.
de: Öffnen Sie Sicherheit > Zugriffsrichtlinie.
es: Vaya a Seguridad > Directiva de acceso.
fr: Accédez à Sécurité > Politique d'accès.
nl: Ga naar Veiligheid > Toegangsbeleid.

source: Click
de: Klicken Sie
es: Haga clic en
fr: Cliquez
nl: Klik

source: either, the **Public access** button, to let any user access the page, as long as they have access to the portal,
de: entweder auf Button **Öffentlicher Zugriff**, um jedem Benutzer den Zugriff auf die Seite zu ermöglichen, sofern er Zugriff auf das Portal hat,
es: o bien el botón **Acceso público** para permitir a cualquier usuario acceder a la página, siempre que tenga acceso al portal,
fr: sur le bouton **Accès public** pour autoriser tous les utilisateurs à accéder à la page, sous réserve qu'ils aient accès au portail
nl: ofwel op de knop **Publieke toegangen**, zodat elke gebruiker toegang heeft tot de pagina zolang hij toegang heeft tot het portaal,

source: or, the **Private access** button, to restrict the access to the page to specifically defined users and/or groups of users.
de: oder den Button **Privater Zugriff**, um den Seitenzugriff auf bestimmte Benutzer und/oder Benutzergruppen zu beschränken,
es: o bien el botón **Acceso privado** para restringir el acceso a la página a los usuarios y/o grupos de usuarios definidos específicamente.
fr: ou cliquez sur le bouton **Accès privé** pour restreindre l'accès à la page à des utilisateurs et/ou groupes d'utilisateurs définis spécifiquement.
nl: ofwel op de knop **Private toegang** om de toegang tot de pagina te beperken tot specifiek gedefinieerde gebruikers en/of groepen van gebruikers.

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: If a user has access to a content page created from datasets that they aren't allowed to access, all related visualizations will not load. However, that user will be able to read all other information displayed on the content page, such as text.
de: Hat ein Benutzer Zugriff auf eine Inhaltsseite, die aus Datensätzen erstellt wurde, auf die er nicht zugreifen darf, werden die dazugehörigen Visualisierungen nicht geladen. Doch dieser Benutzer kann alle anderen Informationen lesen, die auf der Inhaltsseite angezeigt werden, wie z.B. Text.
es: Si un usuario tiene acceso a una página de contenido creada con conjuntos de datos para los cuales carece de permiso de acceso, las visualizaciones relacionadas no se cargarán. Sin embargo, ese usuario podrá leer toda la información restante que se visualice en la página de contenido, como por ejemplo texto.
fr: Si un utilisateur a accès à une page de contenu créée à partir de jeux de données auxquels il n'a pas le droit d'accéder, toutes les visualisations associées ne seront pas chargées. Toutefois, cet utilisateur pourra consulter l'ensemble des autres informations affichées sur la page de contenu, comme les informations textuelles.
nl: Wanneer een gebruiker toegang heeft tot een contentpagina die aangemaakt is vanuit datasets waar hij geen toegang toe heeft, worden alle eraan verbonden weergaves niet geladen. Wel zal die gebruiker alle andere informatie kunnen lezen die weergegeven wordt op de contentpagina, zoals tekst.

source: Managing page permissions for users and groups
de: Verwalten von Seitenberechtigungen für Benutzer und Gruppen
es: Gestionar permisos de página para usuarios y grupos
fr: Gérer les permissions associées à une page pour les utilisateurs et les groupes
nl: Paginatoelatingen voor gebruikers en groepen beheren

source: Users and groups must be added in the Users & Groups section beforehand, otherwise they can't be found in a page security management. No matter the access policy or the permission, permissions can indeed be given to users invididually or through groups of users, but both users and groups must already be listed in the Users & Groups section of the back office (where users are invited to the portal and where groups are created).
de: Benutzer und Gruppen müssen zunächst im Bereich "Benutzer & Gruppen" hinzugefügt werden, ansonsten können sie nicht in der Sicherheitsverwaltung einer Seite gefunden werden. Unabhängig von der Zugriffsrichtlinie oder der Berechtigung können Berechtigungen an individuelle Benutzer oder an Benutzergruppen vergeben werden. Jedoch müssen die jeweiligen Benutzer oder Gruppen bereits im Bereich "Benutzer & Gruppen" des Backoffice aufgeführt sein (wo Benutzer zum Portal eingeladen und Gruppen erstellt werden).
es: Los usuarios y grupos deben haberse añadido previamente en la sección Usuarios y grupos; de lo contrario, no se podrán encontrar al gestionar la seguridad de una página. Independientemente de la directiva de acceso o el permiso, se pueden conceder permisos a los usuarios de forma individual o mediante grupos de usuarios, pero tanto los usuarios como los grupos ya deben figurar en la sección Usuarios y grupos del back office (donde se invita a los usuarios al portal y donde se crean los grupos).
fr: Les utilisateurs et les groupes doivent être ajoutés au préalable dans la section Utilisateurs et groupes pour qu'ils puissent apparaître dans la gestion de sécurité d'une page. Quelle que soit la permission ou la politique d'accès, les permissions peuvent être accordées de façon individuelle aux utilisateurs ou via des groupes d'utilisateurs. Néanmoins, les utilisateurs et les groupes doivent déjà être répertoriés dans la section Utilisateurs et groupe du backoffice (où les utilisateurs sont invités à accéder au portail et où les groupes sont créés).
nl: Gebruikers en groepen moeten op voorhand worden toegevoegd in de rubriek Gebruikers & Groepen. Zo niet kunnen ze niet worden teruggevonden in een paginaveiligheidsbeheer. Ongeacht het toegangsbeleid of de toelating, toelatingen kunnen inderdaad individueel aan gebruikers worden verleend of via groepen van gebruikers, maar zowel gebruikers als groepen moeten al opgesomd staan in de rubriek Gebruikers & Groepen van de back office (waar gebruikers worden uitgenodigd op het portaal en waar groepen worden aangemaakt).

source: There are 2 permissions available in the security management of a content page:
de: In der Sicherheitsverwaltung einer Inhaltsseite stehen 2 Berechtigungen zur Verfügung:
es: Hay 2 permisos disponibles para gestionar la seguridad de una página de contenido:
fr: 2 permissions sont disponibles dans la gestion de sécurité d'une page de contenu :
nl: Er zijn 2 toelatingen beschikbaar in het veiligheidsbeheer van een contentpagina:

source: *Browse page*: it allows the user/group of users to access the page and its content. This permission is set by default for all users added to the security management section of the page.
de: *Seite durchsuchen*: erlaubt dem Benutzer/der Benutzergruppe, auf die Seite und ihren Inhalt zuzugreifen. Diese Berechtigung ist standardmäßig für alle Benutzer aktiviert, die der Sicherheitsverwaltung der Seite hinzugefügt wurden.
es: *Explorar página*: Permite al usuario/grupo de usuarios acceder a la página y su contenido. Este permiso se establece de forma predeterminada para todos los usuarios añadidos a la sección de gestión de la seguridad de la página.
fr: *Consulter la page* : permet à l'utilisateur/au groupe d'utilisateurs d'accéder à la page et à son contenu. Cette permission est définie par défaut pour tous les utilisateurs ajoutés à la section de gestion de la sécurité de la page.
nl: *Doorloop pagina*: deze laat de gebruiker/groep van gebruikers toe om toegang te hebben tot de pagina en de content ervan. Deze toelating is standaard ingesteld voor alle gebruikers die aan de veiligheidsbeheerrubriek van de pagina worden toegevoegd.

source: *Edit page*: it allows the user/group of users to access the back office to edit the content of the page.
de: *Seite bearbeiten*: erlaubt dem Benutzer/der Benutzergruppe, auf das Backoffice zuzugreifen, um den Inhalt der Seite zu bearbeiten.
es: *Editar página*: Permite al usuario/grupo de usuarios acceder al back office para editar el contenido de la página.
fr: *Modifier la page* : permet à l'utilisateur/au groupe d'utilisateurs d'accéder au backoffice pour modifier le contenu de la page.
nl: *Bewerk pagina*: deze laat de gebruiker/groep van gebruikers toe om toegang te hebben tot de back office om de content van de pagina te bewerken.

source: These permissions have different impacts depending on the chosen access policy.
de: Je nach gewählter Zugriffsrichtlinie haben diese Berechtigungen unterschiedliche Auswirkungen.
es: Estos permisos tienen incidencias distintas en función de la directiva de acceso elegida.
fr: Ces permissions ont des effets différents selon la politique d'accès choisie.
nl: Deze toelatingen hebben verschillende gevolgen, afhankelijk van het gekozen toegangsbeleid.

source: *Browse page* permission:
de: Die Berechtigung *Seite durchsuchen*:
es: Permiso *Explorar página*:
fr: Permission *Consulter la page* :
nl: Toelating *Doorloop pagina*:

source: For a private page, the *Browse page* permission gives access to that page, hence the importance of adding users to the security management section, otherwise nobody (except users with the general domain-level *Browse all pages*) can access the page and its content.
de: Bei einer privaten Seite gewährt die Berechtigung *Seite durchsuchen* Zugriff auf die Seite. Deshalb ist es wichtig, Benutzer in der Sicherheitsverwaltung hinzuzufügen, da sonst niemand (außer Benutzer mit der allgemeinen Domain-Ebene *Alle Seiten durchsuchen*) auf die Seite und ihren Inhalt zugreifen kann.
es: Para una página privada, el permiso *Explorar página* da acceso a esa página; de ahí la importancia de añadir los usuarios a la sección de gestión de la seguridad, porque de lo contrario nadie podrá acceder a la página y su contenido (excepto los usuarios con el permiso *Explorar todas las páginas* a nivel de dominio general).
fr: Pour une page privée, la permission *Consulter la page* offre aux utilisateurs la possibilité d'accéder à cette page, d'où l'importance d'ajouter les utilisateurs à la section de gestion de la sécurité. Dans le cas contraire, personne (à l'exception des utilisateurs disposant de la permission *Consulter toutes les pages*) ne peut accéder à la page et à son contenu.
nl: Voor een privépagina verleent de toelating *Doorloop pagina* toegang tot die pagina. Vandaar dat het belangrijk is om gebruikers aan de veiligheidsbeheerrubriek toe te voegen. Zo niet heeft niemand (behalve gebruikers met de algemene toegang op domeinniveau *Doorloop alle pagina's*) toegang tot de pagina en de content ervan.

source: For a public page, the *Browse page* permission doesn't change anything to the access security of that page because it is already accessible by anybody who has access to the domain.
de: Bei einer öffentlichen Seite ändert die Berechtigung *Seite durchsuchen* nichts an der Zugriffssicherheit dieser Seite, da sie bereits für jeden zugänglich ist, der Zugriff auf die Domain hat.
es: Para una página pública, el permiso *Explorar página* no afecta en modo alguno a la seguridad de acceso de esa página porque cualquiera que tenga acceso al dominio ya puede acceder a ella.
fr: Pour une page publique, la permission *Consulter la page* ne modifie pas la sécurité d'accès de cette page, puisque cette dernière est déjà accessible par toutes les personnes ayant accès au domaine.
nl: Voor een publieke pagina verandert de toelating *Doorloop pagina* niets aan de toegangsveiligheid van die pagina omdat iedereen die toegang heeft tot het domein ook al toegang heeft tot die pagina.

source: *Edit page* permission: this permission is relevant for both private and public pages and gives edition rights on the page to any user/group of users added to the security management section of the page and granted with this *Edit page* permission.
de: Die Berechtigung *Seite bearbeiten*: Diese Berechtigung ist sowohl für private als auch öffentliche Seiten von Bedeutung. Sie gibt jedem Benutzer/jeder Benutzergruppe, der/die der Sicherheitsverwaltung der Seite hinzugefügt und mit der Berechtigung *Seite bearbeiten* versehen wurde, das Recht zur Bearbeitung der Seite.
es: Permiso *Editar página*: Este permiso es relevante para las páginas privadas y públicas, y concede permisos de edición sobre la página a cualquier usuario/grupo de usuarios que se haya añadido a la sección de gestión de la seguridad de la página y al cual se haya concedido este permiso *Editar página*.
fr: Permission *Modifier la page* : cette permission est applicable pour les pages publiques et privées. Elle octroie des droits de modification de la page à tous les utilisateurs/groupes d'utilisateurs ajoutés à la section de gestion de la sécurité de la page et à qui cette permission *Modifier la page** a été accordée.
nl: Toelating *Bewerk pagina*: deze toelating is relevant voor zowel privé- als publieke pagina's en verleent elke gebruiker/groep van gebruikers die aan de veiligheidsbeheerrubriek van de pagina zijn toegevoegd en aan wie deze toelating *Bewerk pagina* verleend is, rechten om de pagina te bewerken.

source: Adding and deleting users or groups of users from a page
de: Hinzufügen und Löschen von Benutzern oder Benutzergruppen auf einer Seite
es: Añadir y suprimir usuarios o grupos de usuarios a/de una página
fr: Ajouter des utilisateurs ou des groupes d'utilisateurs à une page et les supprimer de celle-ci
nl: Gebruikers of groepen van gebruikers aan een pagina toe te voegen of van een pagina te verwijderen

source: Adding users or groups to a page
de: Einer Seite Benutzer oder Gruppen hinzufügen
es: Añadir usuarios o grupos a una página
fr: Ajouter des utilisateurs ou des groupes à une page
nl: Gebruikers of groepen aan een pagina toevoegen

source: Go to Security > User permissions or Security > Group permissions, depending on whether a user or a group will be added.
de: Öffnen Sie Sicherheit > Benutzerberechtigungen oder Sicherheit > Gruppenberechtigungen, je nachdem, ob ein Benutzer oder eine Gruppe hinzugefügt werden soll.
es: Vaya a Seguridad > Permisos de usuario o Seguridad > Permisos de grupo, según se trate de añadir un usuario o un grupo.
fr: Accédez à Sécurité > Permissions utilisateur ou Sécurité > Permissions groupe, en fonction de ce que vous souhaitez ajouter (un utilisateur ou un groupe).
nl: Ga naar Veiligheid > Gebruikerstoelatingen of Veiligheid > Groepstoelatingen, afhankelijk van het feit of er een gebruiker of een groep zal worden toegevoegd.

source: Click the **Add user/group permissions** button at the bottom of the table.
de: Klicken Sie im unteren Tabellenbereich auf den Button **Benutzer-/Gruppenberechtigungen hinzufügen**.
es: Haga clic en el botón **Añadir permisos de usuario/grupo** en la parte inferior de la tabla.
fr: Cliquez sur le bouton **Ajouter des permissions utilisateur/groupe** en bas du tableau.
nl: Klik op de knop **Toelatingen gebruiker/groep toevoegen** onderaan de tabel.

source: Select one or more users/groups of users from the list. A search bar is also available to search a user/group by name.
de: Wählen Sie einen oder mehrere Benutzer/Benutzergruppen aus der Liste aus. Außerdem steht eine Suchleiste zur Verfügung, um einen Benutzer/eine Gruppe nach Namen zu suchen.
es: Seleccione uno o más de los usuarios/grupos de usuarios de la lista. También dispone de una barra de búsqueda para buscar un usuario/grupo por nombre.
fr: Dans la liste, sélectionnez un ou plusieurs utilisateurs/groupes d'utilisateurs. Vous pouvez également utiliser la barre de recherche pour rechercher un utilisateur/groupe par nom.
nl: Selecteer een of meerdere gebruikers/groepen van gebruikers uit de lijst. Er is ook een zoekbalk beschikbaar om een gebruiker/groep te zoeken op naam.

source: (optional) If all added users/groups are going to be granted the *Edit page* permission as well as the default *Browse page* permission, it is possible to grant that permission now. Otherwise permissions can be granted afterward. To grant the *Edit page* permission, at the top of the "Add user/group permissions" window, in the "Grant these permissions" section:
de: (optional) Wird allen Benutzern/Gruppen die Berechtigung *Seite bearbeiten* sowie die Standardberechtigung *Seite durchsuchen* gewährt, so kann diese Berechtigung bereits jetzt erteilt werden. Andernfalls können die Berechtigungen nachträglich erteilt werden. Um die Berechtigung *Seite bearbeiten* zu gewähren, klicken Sie im oberen Bereich des Fensters "Benutzer-/Gruppenberechtigungen hinzufügen" auf den Bereich "Diese Berechtigungen gewähren":
es: (Opcional) Si se va a conceder a todos los usuarios/grupos añadidos el permiso *Editar página* y el permiso *Explorar página* predeterminado, se puede conceder ese permiso ahora. En caso contrario, se pueden conceder los permisos más adelante. Para conceder el permiso *Editar página*, en la parte superior de la ventana "Añadir permisos de usuario/grupo", en la sección "Conceder estos permisos":
fr: (optionnel) S'il est prévu que tous les utilisateurs/groupes ajoutés reçoivent la permission *Modifier la page*, ainsi que la permission *Consulter la page* par défaut, vous pouvez leur accorder cette permission dès maintenant. Sinon, les permissions peuvent être octroyées ultérieurement. Pour accorder la permission *Modifier la page*, en haut de la fenêtre "Ajouter des permissions utilisateur/groupe", dans la section "Accorder ces permissions" :
nl: (optineel) Wanneer aan alle toegevoegde gebruikers/groepen de toelating "Bewerk pagina" gaat worden verleend alsook de standaard toelating *Doorloop pagina*, is het mogelijk om die toelating nu te verlenen. Ook kunnen toelatingen later nog worden verleend. Om de toelating *Bewerk pagina* te verlenen, bovenaan het venster "Toelatingen gebruiker/groep toevoegen", in de rubriek "Deze toelatingen verlenen":

source: Click the **Add permission** button.
de: Klicken Sie auf den Button **Berechtigung hinzufügen**.
es: Haga clic en el botón **Añadir permiso**.
fr: Cliquez sur le bouton **Ajouter une permission**.
nl: Klik op de knop **Toelating toevoegen**.

source: Click the *Edit page* permission button.
de: Klicken Sie auf den Button für die Berechtigung *Seite bearbeiten*.
es: Haga clic en el botón del permiso *Editar página*.
fr: Cliquez sur le bouton correspondant à la permission *Modifier la page*.
nl: Klik op de knop *Bewerk pagina*-toelating.

source: Click the **Add user/group permissions** button at the bottom of the Add user/group permissions window.
de: Klicken Sie im unteren Bereich des Fensters "Benutzer-/Gruppenberechtigungen hinzufügen" auf den Button **Benutzer-/Gruppenberechtigungen hinzufügen**.
es: Haga clic en el botón **Añadir permisos de usuario/grupo** en la parte inferior de la ventana Añadir permisos de usuario/grupo.
fr: Cliquez sur le bouton **Ajouter des permissions utilisateur/groupe** en bas de la fenêtre Ajouter des permissions utilisateur/groupe.
nl: Klik op de knop **Toelatingen gebruiker/groep toevoegen** onderaan het venster "Toelatingen gebruiker/groep toevoegen".

source: Click the **Save** button in the top right corner.
de: Klicken Sie oben rechts auf den Button **Speichern**.
es: Haga clic en el botón **Guardar** en la esquina superior derecha.
fr: Cliquez sur le bouton **Enregistrer** en haut à droite.
nl: Klik op de knop **Opslaan** rechts bovenaan.

source: Deleting users or groups from a page
de: Benutzer oder Gruppen von einer Seite löschen
es: Suprimir usuarios o grupos de una página
fr: Supprimer des utilisateurs ou des groupes d'une page
nl: Gebruikers of groepen van een pagina verwijderen
