Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/01_creating_content_page/managing_page_security.po
Languages: de, es, fr, nl

source: Go to Security > User permissions or Security > Group permissions, depending on whether a user or a group will be deleted.
de: Öffnen Sie Sicherheit > Benutzerberechtigungen oder Sicherheit > Gruppenberechtigungen, je nachdem, ob ein Benutzer oder eine Gruppe gelöscht werden soll.
es: Vaya a Seguridad > Permisos de usuario o Seguridad > Permisos de grupo, según se trate de suprimir un usuario o un grupo.
fr: Accédez à Sécurité > Permissions utilisateur ou Sécurité > Permissions groupe, en fonction de ce que vous souhaitez supprimer (un utilisateur ou un groupe).
nl: Ga naar Veiligheid > Gebruikerstoelatingen of Veiligheid > Groepstoelatingen, afhankelijk van het feit of er een gebruiker of een groep zal worden verwijderd.

source: In the table, the first column indicates the name of the user or the group of users. The second column indicates the corresponding permission(s). The third column displays the |trash-button| button. Click that |trash-button| button to delete a chosen user/group of users.
de: In der Tabelle steht in der ersten Spalte der Name des Benutzers oder der Benutzergruppe. Die zweite Spalte gibt die entsprechende(n) Berechtigung(en) an. In der dritten Spalte befindet sich der Button |trash-button|. Klicken Sie auf den Button |trash-button|, um einen ausgewählten Benutzer bzw. eine Benutzergruppe zu löschen.
es: En la tabla, la primera columna indica el nombre del usuario o el grupo de usuarios. La segunda columna indica los permisos correspondientes. La tercera columna muestra el botón |trash-button|. Haga clic en ese botón |trash-button| para suprimir un usuario/grupo de usuarios seleccionado.
fr: La première colonne du tableau spécifie le nom de l'utilisateur ou du groupe d'utilisateurs. La deuxième colonne indique les permissions associées. Dans la troisième colonne se trouve le bouton |trash-button|. Cliquez sur ce bouton |trash-button| pour supprimer un utilisateur/groupe d'utilisateurs choisi.
nl: In de tabel staat in de eerste kolom de naam van de gebruiker of van de groep van gebruikers. In de tweede kolom staan de overeenkomstige toelatingen. In de derde kolom staat de knop |trash-button|. Klik op die knop |trash-button| om een gekozen gebruiker/groep van gebruikers te verwijderen.

source: Managing page permissions for users and groups of users
de: Verwalten von Seitenberechtigungen für Benutzer und Benutzergruppen
es: Gestionar permisos de página para usuarios y grupos de usuarios
fr: Gérer les permissions associées à une page pour les utilisateurs et les groupes d'utilisateurs
nl: De toelatingen tot pagina's voor gebruikers en groepen van gebruikers beheren

source: Managing page security permissions can mean 2 things:
de: Die Verwaltung der Sicherheitsberechtigungen einer Seite kann zweierlei bedeuten:
es: Gestionar los permisos de seguridad de las páginas puede significar 2 cosas:
fr: Gérer les permissions de sécurité associées à une page peut vouloir dire 2 choses :
nl: Het beheren van veiligheidstoelatingen voor pagina's kan 2 dingen betekenen:

source: granting a user or a group of users a new page permission,
de: die Gewährung einer neuen Seitenberechtigung für einen Benutzer oder eine Benutzergruppe
es: conceder a un usuario o un grupo de usuarios un nuevo permiso de página,
fr: accorder à un utilisateur ou à un groupe d'utilisateurs une nouvelle permission associée à une page
nl: aan een gebruiker of aan een groep van gebruikers een nieuwe paginatoelating verlenen,

source: or, deleting a page permission for a user or a group of users.
de: oder das Löschen einer Seitenberechtigung eines Benutzers oder einer Benutzergruppe.
es: o suprimir un permiso de página para un usuario o un grupo de usuarios.
fr: ou supprimer une permission associée à une page pour un utilisateur ou un groupe d'utilisateurs.
nl: of een paginatoelating voor een gebruiker of een groep van gebruikers verwijderen.

source: Granting page permissions for users or groups
de: Seitenberechtigungen für Benutzer und Gruppen erteilen
es: Conceder permisos de página para usuarios o grupos
fr: Accorder des permissions associées à une page à des utilisateurs ou groupes
nl: Paginatoelatingen voor gebruikers of groepen verlenen

source: Go to Security > User permissions or Security > Group permissions, depending on whether the new permission must be granted to a user or a group of users.
de: Öffnen Sie Sicherheit > Benutzerberechtigungen oder Sicherheit > Gruppenberechtigungen, je nachdem, ob einem Benutzer oder einer Gruppe eine neue Berechtigung gewährt werden soll.
es: Vaya a Seguridad > Permisos de usuario o Seguridad > Permisos de grupo, según se trate de conceder el nuevo permiso a un usuario o un grupo de usuarios.
fr: Accédez à Sécurité > Permissions utilisateur ou Sécurité > Permissions groupe, en fonction de la personne à qui vous souhaitez accorder la permission (utilisateur ou groupe d'utilisateurs).
nl: Ga naar Veiligheid > Gebruikerstoelatingen of Veiligheid > Groepstoelatingen, afhankelijk van het feit of de nieuwe toelating moet worden verleend aan een gebruiker of aan een groep van gebruikers.

source: In the table, the first column indicates the name of the user or the group of users. The second column indicates the corresponding permission(s). In this second column, click the **Add permission** button to add a new permission to a chosen user or group of users.
de: In der Tabelle steht in der ersten Spalte der Name des Benutzers oder der Benutzergruppe. Die zweite Spalte gibt die entsprechende(n) Berechtigung(en) an. Klicken Sie in dieser zweiten Spalte auf den Button **Berechtigung hinzufügen**, um einem Benutzer oder einer Gruppe eine neue Berechtigung zu erteilen.
es: En la tabla, la primera columna indica el nombre del usuario o el grupo de usuarios. La segunda columna indica los permisos correspondientes. En esta segunda columna, haga clic en el botón **Añadir permiso** para añadir un nuevo permiso a un usuario o grupo de usuarios seleccionado.
fr: La première colonne du tableau spécifie le nom de l'utilisateur ou du groupe d'utilisateurs. La deuxième colonne indique les permissions associées. Dans la deuxième colonne, cliquez sur le bouton **Ajouter une permission** pour ajouter une permission à un utilisateur ou groupe d'utilisateurs choisi.
nl: In de tabel staat in de eerste kolom de naam van de gebruiker of van de groep van gebruikers. In de tweede kolom staan de overeenkomstige toelatingen. Klik in deze tweede kolom op de knop **Toelating toevoegen** om een nieuwe toelating toe te voegen voor een gekozen gebruiker of groep van gebruikers.

source: Click on the permission to grant.
de: Klicken Sie auf die zu erteilende Berechtigung.
es: Haga clic en el permiso que va a conceder.
fr: Cliquez sur la permission à accorder.
nl: Klik op de toelating om deze te verlenen.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Since there are only 2 page permissions, including 1 default permission (*Browse page*), the only permission left to be granted is *Edit page*.
de: Da es nur 2 Seitenberechtigungen gibt (einschließlich 1 Standardberechtigung *Seite durchsuchen*), kann nur noch die Berechtigung *Seite bearbeiten* gewährt werden.
es: Como solo hay 2 permisos de página, y uno es el predeterminado (*Explorar página*), el único permiso que queda para otorgar es *Editar página*.
fr: Étant donné qu'il existe uniquement 2 permissions associées à une page, dont 1 permission par défaut (*Consulter la page*), la seule permission restant à accorder est *Modifier la page*.
nl: Aangezien er slechts 2 paginatoelatingen zijn, waaronder 1 standaard toelating (*Doorloop pagina*), is de enige toelating die nog kan worden verleend de toelating *Bewerk pagina*.

source: Deleting page permissions for users or groups
de: Seitenberechtigungen für Benutzer oder Gruppen löschen
es: Suprimir permisos de página para usuarios o grupos
fr: Supprimer des permissions associées à une page pour des utilisateurs ou groupes
nl: Paginatoelatingen voor gebruikers of groepen verwijderen

source: Go to Security > User permissions or Security > Group permissions, depending on whether the new permission must be deleted for a user or a group of users.
de: Öffnen Sie Sicherheit > Benutzerberechtigungen oder Sicherheit > Gruppenberechtigungen, je nachdem, ob die Berechtigung eines Benutzers oder einer Gruppe gelöscht werden soll.
es: Vaya a Seguridad > Permisos de usuario o Seguridad > Permisos de grupo, según se trate de suprimir el permiso para un usuario o un grupo de usuarios.
fr: Accédez à Sécurité > Permissions utilisateur ou Sécurité > Permissions groupe, en fonction de la personne à qui vous souhaitez supprimer la permission (utilisateur ou groupe d'utilisateurs).
nl: Ga naar Veiligheid > Gebruikerstoelatingen of Veiligheid > Groepstoelatingen, afhankelijk van het feit of de nieuwe toelating moet worden verwijderd voor een gebruiker of voor een groep van gebruikers.

source: In the table, the first column indicates the name of the user or the group of users. The second column indicates the corresponding permission(s). In this second column, click on a chosen permission to delete it.
de: In der Tabelle steht in der ersten Spalte der Name des Benutzers oder der Benutzergruppe. Die zweite Spalte gibt die entsprechende(n) Berechtigung(en) an. Klicken Sie in dieser zweiten Spalte auf die zu löschende Berechtigung.
es: En la tabla, la primera columna indica el nombre del usuario o el grupo de usuarios. La segunda columna indica los permisos correspondientes. En esta segunda columna, haga clic en un permiso seleccionado para suprimirlo.
fr: La première colonne du tableau spécifie le nom de l'utilisateur ou du groupe d'utilisateurs. La deuxième colonne indique les permissions associées. Dans la deuxième colonne, cliquez sur une permission choisie pour la supprimer.
nl: In de tabel staat in de eerste kolom de naam van de gebruiker of van de groep van gebruikers. In de tweede kolom staan de overeenkomstige toelatingen. Klik in deze tweede kolom op een gekozen toelating om deze te verwijderen.

source: It isn't possible to delete the *Browse page* permission, the only page permission that can be deleted is *Edit page*. To prevent a user from accessing a page, the page must be private (see `Choosing an access policy`_) and the user must be deleted from the page security (see `Deleting users or groups from a page`_).
de: Die Berechtigung *Seite durchsuchen* kann nicht gelöscht werden. Nur die Seitenberechtigung *Seite bearbeiten* kann entfernt werden. Um zu verhindern, dass ein Benutzer auf eine Seite zugreift, muss die entsprechende Seite privat sein (siehe `Eine Zugriffsrichtlinie auswählen`_) und der Benutzer muss aus der Seitensicherheit gelöscht werden (siehe `Benutzer oder Gruppen von einer Seite löschen`_).
es: No se puede suprimir el permiso *Explorar página*; el único permiso que se puede suprimir es *Editar página*. Para impedir que un usuario acceda a una página, la página debe ser privada (consulte `Elegir una directiva de acceso`_) y el usuario debe suprimirse de la seguridad de la página (consulte `Suprimir usuarios o grupos de una página`_).
fr: Vous n'avez pas la possibilité de supprimer la permission *Consulter la page*. Seule la permission associée à une page *Modifier la page* peut être supprimée. Pour empêcher un utilisateur d'accéder à une page, celle-ci doit être privée (voir `Choisir une politique d'accès`_) et l'utilisateur doit être supprimé de la sécurité de la page (voir `Supprimer des utilisateurs ou des groupes d'une page`_).
nl: Het is niet mogelijk om de toelating *Doorloop pagina* te verwijderen. De enige paginatoelating die kan worden verwijderd, is de toelating *Bewerk pagina*. Om te vermijden dat een gebruiker toegang heeft tot een pagina, moet de pagina privé zijn (zie `Een toegangsbeleid kiezen`_) en moet de gebruiker uit de paginaveiligheid zijn verwijderd (zie `Gebruikers of groepen van een pagina verwijderen`_).

source: Content pages created with the OpenDataSoft platform can either be accessible by anyone allowed on the portal, or restricted to specifically defined users.
es: Las páginas de contenido creadas con la plataforma OpenDataSoft pueden o bien establecerse como accesibles para cualquier usuario permitido en el portal o bien restringirse a los usuarios definidos específicamente.
fr: L'accès aux pages de contenu créées avec la plateforme OpenDataSoft peut être autorisé à toutes les personnes pouvant accéder au portail ou être restreint à des utilisateurs définis spécifiquement.
nl: Contentpagina's die aangemaakt zijn op het OpenDataSoft-portaal zijn ofwel toegankelijk voor iedereen die toegelaten is op het portaal ofwel beperkt voor specifiek gedefinieerde gebruikers.
