Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/01_creating_content_page/style.po
Languages: de, es, fr, nl

source: Customize a content page with HTML and CSS
de: Anpassen einer Content-Seite mit HTML und CSS
es: Personalizar una página de contenido con HTML y CSS
fr: Personnaliser une page de contenu grâce au HTML et à la CSS
nl: Een content pagina aanpassen met HTML en CSS

source: Once you have created a simple page using one of the predefined templates, you may want to go further. Maybe you want to add a new block below, or add a large centered header at the top?
de: Sobald Sie eine einfache Seite mit einem der vordefinierten Templates erstellt haben, möchten Sie vielleicht einen Schritt weitergehen. Vielleicht möchten Sie einen neuen Block unten oder eine große zentrierte Kopfzeile oben anfügen.
es: Después de crear una página simple con una de las plantillas predefinidas, tal vez desee avanzar un poco más. Quizás quiera añadir un bloque nuevo en la parte inferior o añadir un encabezado grande centrado en la parte superior.
fr: Une fois que vous avez créé une page simple à l'aide des modèles prédéfinis, vous pouvez aller plus loin. Vous pouvez, par exemple, ajouter un nouveau bloc en dessous ou un grand en-tête centré en haut de la page.
nl: Eenmaal u een gewone pagina hebt aangemaakt met behulp van één van de vooraf gedefinieerde templates, zal u misschien verder willen gaan. Misschien wil u onderaan een nieuw blok toevoegen of een grote gecentreerde header bovenaan toevoegen?

source: Switching to the **expert mode** lets you edit directly the underlying language behind the page, which is the HTML and CSS code.
de: Durch Umschalten auf den *Expert-Modus* können Sie direkt die hinterlegte Sprache hinter der Seite bearbeiten, d. h. den HTML- und CSS-Code.
es: El cambio al **modo experto** le permite editar directamente el lenguaje subyacente de la página, el código HTML y CSS.
fr: Le **mode expert** vous permet d'éditer directement le langage sous-jacent de la page, donc les codes HTML et CSS.
nl: Wanneer u omschakelt naar **expert modus** kan u rechtstreeks de onderliggende taal bewerken achter de pagina, die de HTML- en CSS-code is.

source: HTML and CSS are the languages behind every web page; you can do very advanced things with it, but at their core, they are designed to be expressive and easy to learn. After playing with it a bit, you usually can do simple things like changing the layout of your page, changing the size of your text...
de: HTML und CSS sind die beiden Sprachen, die hinter jeder Webseite stecken. Sie können sehr weit fortgeschrittene Dinge mit ihnen realisieren, doch im Grunde sind sie dafür entwickelt, expressiv und leicht zu erlernen zu sein. Wenn Sie sie einmal ein bisschen ausprobieren, können Sie schnell einfache Dinge realisieren, wie etwa das Layout Ihrer Seite, die Größe Ihres Textes etc. zu ändern.
es: HTML y CSS son los lenguajes que están detrás de todas las páginas web; puede realizar tareas muy avanzadas con ellos, pero esencialmente están pensados para ser expresivos y fáciles de aprender. Tras jugar un poco con sus posibilidades, podrá hacer tareas sencillas como cambiar el diseño de la página, el tamaño del texto...
fr: Le HTML et la CSS sont la base de toutes les pages Web : il est possible de faire des choses très complexes avec mais, au départ, ils sont conçus pour être explicites et faciles à utiliser. Après avoir pris vos marques, vous serez en mesure de faire des choses simples comme changer la disposition de votre page ou encore la taille de la police de votre texte.
nl: HTML en CSS zijn de talen achter elke internetpagina; u kan er zeer geavanceerde zaken mee doen, maar in essentie zijn ze ontworpen om expressief en eenvoudig te leren te zijn. Nadat u er enige tijd mee heeft gespeeld, kan u meestal eenvoudige dingen doen, zoals het wijzigen van de lay-out van uw pagina, het wijzigen van de grootte van uw tekst, ...

source: In this article, we'll walk you through a few basic changes to a standard page template. We do not aim to teach HTML and CSS, as other resources will do this much better than us; however, these are examples that you can start from and expand upon.
de: In diesem Artikel führen wir Sie anhand einiger grundlegender Änderungen an eine Standard-Seitenvorlage heran. Es ist nicht unser Ziel, Ihnen HTML und CSS beizubringen. Andere Ressourcen können dies sehr viel besser als wir; dennoch sind dies Beispiele, mit denen Sie starten und sich weiter entwickeln können.
es: En este artículo, revisaremos algunos cambios básicos en una plantilla de página estándar. No pretendemos enseñar HTML y CSS, dado que existen otros recursos mucho mejores que nosotros para ello; no obstante, estos ejemplos pueden servir de base para seguir avanzando.
fr: Dans cet article, nous allons vous expliquer comment faire quelques changements de base sur un modèle de page. Nous n'avons pas pour objectif de vous enseigner tout ce qu'il y a à savoir sur le HTML et la CSS, car d'autres le font bien mieux que nous, mais nous vous proposons quelques exemples à partir desquels vous pourrez développer vos connaissances.
nl: In dit artikel overlopen we enkele basiswijzigingen aan een standaard paginatemplate. Het is niet de bedoeling dat we HTML en CSS aanleren aangezien er anderen zijn die dit veel beter kunnen dan wij. Dit zijn echter voorbeelden waarmee u kan beginnen en waarop u kan voortborduren.

source: First, let's create a new page based on the "Main block + right column" template, as seen in the :doc:`Creating a simple content page <create>` article. Then, switch to **expert mode** using the link in the top right of the interface. You now have two "CSS" and "HTML" tabs, containing the code behing the page.
de: Lassen Sie uns zunächst eine neue Seite auf der Grundlage der Vorlage "Hauptblock + rechte Spalte" erstellen, wie im Artikel :doc:`Erstellen einer einfachen Inhaltsseite <create>` gezeigt. Wechseln Sie dann in den *Expertenmodus*, indem Sie den Link oben rechts auf der Benutzeroberfläche verwenden. Nun haben Sie zwei "CSS"- und "HTML"-Tabs, die den Code hinter der Seite beinhalten.
es: En primer lugar, vamos a crear una página nueva a partir de la plantilla "Main block + right column", como se describe en el artículo :doc:`Crear una página de contenido simple <create>`. A continuación, cambie al **modo experto** usando el vínculo de la parte superior derecha de la interfaz. Ahora tiene 2 fichas "CSS" y "HTML" con el código subyacente de la página.
fr: Commençons par créer une page sur la base du modèle "Main block + right column" (Bloc principal + colonne de droite), comme vu dans l'article :doc:`Créer une page de contenu simple <create>`. Passons ensuite en **mode expert** grâce au lien dans le coin supérieur droit de l'interface. Vous voyez désormais deux onglets, "CSS" et "HTML", qui contiennent le code de la page.
nl: We gaan eerst een nieuwe pagina aanmaken op basis van de "Hoofdblok + rechter kolom" template, zoals we gezien hebben in het artikel :doc:`Een gewone contentpagina aanmaken <create>`. Vervolgens gaan we overschakelen naar de **expertmodus** met behulp van de link bovenaan rechts van de interface. U heeft nu twee "CSS" en "HTML" tabbladen, die de code achter de pagina bevatten.

source: The CSS tab is empty for now, as there is no specific CSS code. However, the HTML of the page is here:
de: Der CSS Tab ist momentan leer, da kein spezifischer CSS-Code vorhanden ist. Die HTML der Seite ist jedoch da:
es: La ficha CSS por ahora está vacía, ya que no hay ningún código CSS específico. Sin embargo, aquí está el código HTML de la página:
fr: L'onglet CSS est vide pour le moment, car il n'y a pas de code CSS spécifique. En revanche le code HTML de la page est bien là :
nl: De CSS-tab is voorlopig nog leeg aangezien er geen specifieke CSS-code is. De HTML van de pagina is evenwel hier:

source: Adding a new row
de: Hinzufügen einer neuen Zeile
es: Añadir una fila nueva
fr: Ajouter une ligne
nl: Een nieuwe rij toevoegen

source: Each ``<div>`` tag represents a block in the page; the class attached to each block defines its appearance, like its width.
de: Jeder ``<div>`` Tag stellt einen Block auf der Seite dar; die zu jedem Block zugeordnete Klasse legt dessen Erscheinungsbild fest, wie etwa seine Breite.
es: Cada una de las etiquetas ``<div>`` representa un bloque de la página; la clase asociada a cada uno de los bloques define su apariencia, como el ancho.
fr: Chaque tag ``<div>`` représente un bloc de la page ; la classe liée à chaque bloc définit son apparence, sa largeur par exemple.
nl: Elke ``<div>`` tag vertegenwoordigt een blok in de pagina; de klasse die gekoppeld is aan elk blok bepaalt het voorkomen ervan, zoals de breedte ervan.

source: More precisely:
de: Genauer gesagt:
es: Más concretamente:
fr: Plus précisément :
nl: Meer in het bijzonder:

source: ``<div class="container-fluid">`` is the block around the entire page, making sure it takes all the available width in the browser
de: ``<div class="container-fluid">`` ist der Block rund um die ganze Seite, der sicherstellt, dass sie die gesamte im Browser zur Verfügung stehende Breite einnimmt
es: ``<div class="container-fluid">`` es el bloque alrededor de toda la página, comprobando que ocupa todo el ancho disponible del explorador.
fr: ``<div class="container-fluid">`` est un bloc entourant toute la page pour faire en sorte qu'elle occupe toute la largeur d'affichage disponible.
nl: ``<div class="container-fluid">`` is het blok rond de volledige pagina en zorgt ervoor dat de volledige beschikbare breedte in de browser wordt ingenomen

source: ``<div class="row">`` represents a row, which in turns contains other blocks. By reasoning using "rows", we make sure our blocks don't mix up if one is larger than the others.
de: ``<div class="row">`` stellt eine Zeile dar, die abwechselnd verschiedene Blöcke enthält. Durch eine angemessene Verwendung der "rows" stellen wir sicher, dass unsere Blöcke nicht durcheinander geraten, wenn einer größer als der andere ist.
es: ``<div class="row">`` representa una fila, que a su vez contiene otros bloques. Al pensar en una lógica de "filas", evitamos que los bloques se solapen por ser uno más grande que los demás.
fr: ``<div class="row">`` représente une ligne qui contient d'autres blocs. En raisonnant en termes de "lignes", nous nous assurons que les blocs ne se superposent pas si il y en a un plus grand que les autres.
nl: ``<div class="row">`` vertegenwoordigt een rij, die op haar beurt andere blokken bevat. Door te redeneren door middel van "rijen", zorgen we ervoor dat onze blokken niet door elkaar raken wanneer de ene groter is dan de anderen.

source: ``<div class="col-md-8">`` and ``<div class="col-md-4">`` are two blocks containing the "real" content (text for example). The idea with the classes ``col-md-8`` and ``col-md-4`` is to think of the available space in each row as a grid of 12 "cells"; your blocks inside this row can take a total amount of 12 cells, and each blocks uses ``col-md-X`` where X is the amount of cells it will take. So, here we wanted one blocks taking two thirds of the space, and another block taking one third, so we used 8 and 4 to divide the available 12 cells. All this logic (named "grid" logic) is detailed in the :doc:`Designing a responsive portal </customizing_look_and_feel/07_designing_responsive_portal/responsive>` article.
de: ``<div class="col-md-8">`` und ``<div class="col-md-4">`` sind zwei Blöcke, die den "echten" Inhalt enthalten (z. B. Text). Mit den Klassen ``col-md-8`` und ``col-md-4`` lässt sich der verfügbare Platz in jeder Zeile als ein Raster aus 12 "Zellen" vorstellen. Ihre Blöcke innerhalb dieser Zeile können maximal 12 Zellen enthalten, und jeder Block nutzt ``col-md-X``, wobei X die Anzahl der belegten Zellen ist. In diesem Beispiel wollen wir, dass ein Block zwei Drittel des Platzes einnimmt, und ein weiterer Block ein Drittel, daher haben wir 8 und 4 verwendet, um die verfügbaren 12 Zellen korrekt aufzuteilen. Diese gesamte Logik (genannt "Raster"-Logik) wird im Artikel :doc:`Design eines responsiven Portals </customizing_look_and_feel/07_designing_responsive_portal/responsive>` erklärt.
es: ``<div class="col-md-8">`` y ``<div class="col-md-4">`` son 2 bloques que incluyen el contenido "real" (texto, por ejemplo). La idea con las clases ``col-md-8`` y ``col-md-4`` es entender el espacio disponible de cada una de las filas como una cuadrícula de 12 "celdas"; los bloques en el interior de esta fila pueden ocupar un total de 12 celdas, y cada uno de los bloques utiliza ``col-md-X``, donde X es la cantidad de celdas que ocupará. Así, aquí queríamos que un bloque ocupara 2/3 del espacio y otro bloque ocupara 1/3, por lo que utilizamos 8 y 4 para dividir las 12 celdas disponibles. Esta lógica (denominada lógica de "cuadrícula") se describe en el artículo :doc:`Diseñar un portal con capacidad de respuesta </customizing_look_and_feel/07_designing_responsive_portal/responsive>`.
fr: ``<div class="col-md-8">`` et ``<div class="col-md-4">`` sont deux blocs qui contiennent le contenu "réel" (le texte par exemple). Le principe avec les classes ``col-md-8`` et ``col-md-4`` est de considérer chaque ligne comme une grille à 12 "cellules" ; les blocs de cette ligne ne peuvent pas dépasser un total de 12 cellules et chaque bloc utilise ``col-md-X``, où X correspond au nombre de cellules que le bloc occupera. Ici, nous voulions qu'un bloc occupe les deux tiers de l'espace et qu'un autre bloc occupe le tiers restant. Nous avons donc divisé les 12 cellules disponibles en 8 et 4. L'intégralité de cette logique (nommée "logique des grilles") est détaillée dans l'article :doc:`Concevoir un portail responsive </customizing_look_and_feel/07_designing_responsive_portal/responsive>`.
nl: ``<div class="col-md-8">`` en ``<div class="col-md-4">`` zijn twee blokken die de "echte" inhoud bevatten (tekst bijvoorbeeld). Het idee met de klassen `col-md-8`` en ``col-md-4`` is om de beschikbare ruimte in elke rij te bekijken als een rooster van 12 "cellen"; uw blokken binnen deze rij kunnen een totaal aantal van 12 cellen omvatten en elk blok gebruikt ``col-md-X`` waarbij X het aantal cellen is dat deze rij omvat. Dus hier willen we één blok dat twee derden van de ruimte inneemt en een andere blok dat één derde inneemt. Dus gebruikten we 8 en 4 om de beschikbare 12 cellen te delen. Deze logica ("grid"-logica genaamd) staat gedetailleerd beschreven in het artikel :doc:`Een responsief portaal ontwerpen </customizing_look_and_feel/07_designing_responsive_portal/responsive>`.

source: ``<div class="ods-box">`` just creates a visual block with a border and a background, more suitable to contain text.
de: ``<div class="ods-box">`` erstellt lediglich einen visuellen Block mit einem Rand und einem Hintergrund und ist damit eher für einen Text-Content geeignet.
es: ``<div class="ods-box">`` simplemente crea un bloque visual con un borde y un fondo, más apropiado para contener texto.
fr: ``<div class="ods-box">`` crée simplement un bloc visuel avec des bordures et un fond, plus adapté à contenir du texte.
nl: ``<div class="ods-box">`` maakt enkel een visueel blok aan met een rand en een achtergrond, dat meer geschikt is om tekst te bevatten.

source: Now we want to add a new line of three blocks, each taking a third of the space. Following our previous logic, we add a new row, and three blocks taking each 4 cells.
de: Nun möchten wir eine neue Zeile mit drei Blöcken hinzufügen, wobei jeder von ihnen ein Drittel des zur Verfügung stehenden Raums einnimmt. Entsprechend unserer vorher genannten Logik fügen wir eine neue Zeile hinzu sowie drei Blöcke, die je 4 Zellen belegen.
es: Ahora queremos añadir una línea nueva de 3 bloques, cada uno de los cuales con un tercio del espacio. Siguiendo con la lógica anterior, añadimos una fila nueva y 3 bloques que ocupan 4 células cada uno.
fr: Ajoutons désormais une nouvelle ligne avec trois blocs, qui occupent chacun un tiers de l'espace. En suivant la même logique que précédemment, nous ajoutons une nouvelle ligne puis trois blocs occupant 4 cellules chacun.
nl: Nu willen we een nieuwe lijn met drie blokken toevoegen, waarbij elk blok een derde van de ruimte inneemt. Volgens onze vorige logica, voegen we een nieuwe rij toe en nemen drie blokken elk 4 cellen in.

source: Our preview now looks like this:
de: Unsere Vorschau sieht nun so aus:
es: La vista previa ahora tiene este aspecto:
fr: Voici un aperçu du résultat :
nl: Onze voorbeeldweergave ziet er nu als volgt uit:

source: Setting a basic style
de: Einrichten eines Grundstils
es: Configurar un estilo básico
fr: Configurer un style simple
nl: Een basisstijl instellen

source: CSS code can be used to change the way your content is displayed: you can change the size of the text, add a colored background, borders, change the color...
de: Der CSS-Code kann zum Ändern Ihrer Content-Ansicht verwendet werden: Sie können die Textgröße ändern, einen farbigen Hintergrund und Ränder hinzufügen, die Farbe ändern etc.
es: El código CSS se puede utilizar para cambiar la manera en que se visualiza el contenido: puede cambiar el tamaño del texto, añadir un fondo de color o bordes, cambiar el color...
fr: Le code CSS peut être utilisé pour modifier le mode d'affichage de votre contenu : vous pouvez changer la taille de la police, ajouter des fonds colorés ou des bordures ou encore changer les couleurs.
nl: CSS-code kan gebruikt worden om de manier te wijzigen waarop uw content wordt weergegeven: u kan de grootte van de tekst wijzigen, een gekleurde achtergrond, randen toevoegen, de kleur wijzigen, ...

source: There are multiple ways to apply CSS "rules" to an element of your page, but a good practice to keep in mind is to always use "classes": by adding `class="myclass"` to an element in your page, you attach a "class" to your element, and then you can write rules for that class in your CSS style. This way, you can apply the same class to various elements, and if you change your page, the rules will still apply to your element.
de: Es gibt viele Möglichkeiten, die CCS-"Regeln" auf ein Element auf Ihrer Seite anzuwenden. Eine bewährte Verfahrensweise, an die Sie immer denken sollten, ist die Verwendung von "Klassen": Durch das Hinzufügen von `class="myclass"` zu einem Element auf Ihrer Seite ordnen Sie Ihrem Element eine "Klasse" zu und können nun Regeln für diese Klasse in Ihrem CSS-Style schreiben. So können Sie eine Klasse auf verschiedene Elemente anwenden, und selbst wenn Sie Ihre Seite ändern, gelten die Regeln immer noch für Ihr Element.
es: Hay varias formas de aplicar "reglas" CSS a un elemento de la página, pero una buena práctica que conviene tener presente es utilizar siempre "clases": al añadir `class="miclase"` a un elemento de la página, asocia una "clase" al elemento, y después puede escribir reglas para esa clase en el estilo CSS. Así puede aplicar la misma clase a varios elementos y, si cambia la página, las reglas seguirán aplicándose al elemento.
fr: Il y a plusieurs manières d'appliquer des "règles" CSS aux éléments de votre page, mais il est conseillé de toujours utiliser des "classes" : en ajoutant `class="myclass"` à un élément de votre page, vous y attachez une "classe". Cela vous permettra par la suite d'écrire des règles pour cette classe dans votre style CSS. Vous pouvez ainsi appliquer la même classe à plusieurs éléments, et même si vous modifiez votre page les règles continueront de s'appliquer aux éléments.
nl: Er zijn meerdere manieren om CSS-"regels" toe te passen op een element van uw pagina, maar een goede reflex die u in het achterhoofd moet houden, is om altijd "klassen" te gebruiken: door `class="myclass"` toe te voegen aan een element in uw pagina, koppelt u een "klasse" aan uw element en vervolgens kan u regels voor die klasse schrijven in uw CSS-stijl. Zo kan u dezelfde klasse toepassen op verschillende elementen en wanneer u uw pagina wijzigt, zullen de regels nog altijd van toepassing zijn op uw element.

source: Let's assume we want to make some text larger than usual. First, you need to add a class to the element containing the text, here, "Hello world!":
de: Nehmen wir an, wir wollen einen Text größer als gewöhnlich gestalten. Zunächst müssen Sie dem Element, das den Text enthält, in diesem Fall "Hallo Welt!", eine Klasse zuordnen:
es: Supongamos que queremos ampliar algún texto más de lo habitual. En primer lugar, tiene que añadir una clase al elemento que contenga el texto; en este caso, "Hello world!":
fr: Imaginons que nous voulons faire ressortir un texte en augmentant la taille de sa police. Vous devez d'abord ajouter une classe à l'élément qui contient le texte. Dans notre cas, il s'agit de "Hello world!" :
nl: Laten we ervan uitgaan dat we sommige tekst groter willen maken dan gewoonlijk. Allereerst moet u een klasse aan het element toevoegen die de tekst bevat. In dit geval "Hallo wereld!":

source: Then, we just need to add a rules in the CSS code, stating that the class "larger-text" should have a bigger text size:
de: Dann müssen wir nur noch dem CSS-Code eine Regel hinzufügen, die besagt, dass die Klasse "larger-text" eine größere Textgröße besitzen soll:
es: A continuación, simplemente necesitamos añadir una regla en el código CSS para indicar que la clase "larger-text" debe tener un tamaño de texto mayor:
fr: Il nous suffit désormais d'ajouter une règle dans le code CSS, indiquant que la classe "larger-text" doit avoir une taille de police supérieure :
nl: Vervolgens moeten we enkel een regel toevoegen in de CSS-code, waarin staat dat de klasse "larger-text" een grotere tekstgrootte zou moeten hebben:

source: There are many CSS rules you can add, to any of your elements.
de: Sie können jedem Ihrer Elemente viele verschiedene CSS-Regeln zuweisen.
es: Puede añadir muchas reglas CSS a cualquiera de los elementos.
fr: Il existe de nombreuses règles CSS que vous pouvez ajouter à vos éléments.
nl: Er zijn veel verschillende CSS-regels die u aan elk van uw elementen kan toevoegen.
