Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/01_creating_content_page/writing_page.po
Languages: de, es, fr, nl

source: Writing a content page
de: Schreiben einer Inhaltsseite
es: Escribir una página de contenido
fr: Écrire une page de contenu
nl: Een contentpagina schrijven

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: In the page header, next to the title of the page, are displayed language buttons - one for each language available in the domain. They allow multilingual content management. In case a content page has not been translated for a chosen language, when navigating from the front office, the page will remain blank for that chosen language.
de: Im Seitenkopf werden neben dem Titel der Seite die Sprach-Buttons angezeigt - einer für jede in der Domain verfügbare Sprache. Diese ermöglichen ein mehrsprachiges Inhaltsmanagement. Falls eine Inhaltsseite für eine ausgewählte Sprache nicht übersetzt wurde, bleibt die Seite beim Navigieren im Front-Office für die ausgewählte Sprache leer.
es: En el encabezado de página, al lado del título de la página, se visualizan los botones de idioma: uno para cada idioma disponible en el dominio. Permiten la gestión de contenido multilingüe. Al navegar desde el front office, en caso de que una página de contenido no haya sido traducida para un idioma determinado, la página permanecerá en blanco para el idioma seleccionado.
fr: L'en-tête de la page, en regard du titre de la page, contient des boutons de langue : un pour chaque langue disponible dans le domaine. Ils permettent de gérer le contenu multilingue. Si une page de contenu n'a pas été traduite dans une langue donnée, lorsque vous y accéderez depuis l'interface de navigation, la page restera vide pour la langue choisie.
nl: In de paginaheader staan er naast de titel van de pagina een aantal taalknoppen - één voor elke taal die beschikbaar is in het domein. Ze maken het beheer van meertalige content mogelijk. Ingeval een contentpagina niet naar een gekozen taal werd vertaald zal de pagina voor die gekozen taal blanco blijven wanneer genavigeerd wordt vanuit de front office.

source: The content of the page is written and managed from the Content tab.
de: Der Inhalt der Seite wird in der Registerkarte Inhalt geschrieben und verwaltet.
es: El contenido de la página se escribe y se gestiona desde la ficha Contenido.
fr: L'onglet Contenu permet d'écrire et de gérer le contenu de la page.
nl: De content van de pagina wordt geschreven en beheerd vanuit het tabblad Content.

source: The Content tab is composed of 2 main elements.
de: Die Registerkarte Inhalt besteht aus 2 Hauptelementen.
es: La ficha Contenido está compuesta de 2 elementos principales.
fr: Il se compose de 2 éléments principaux.
nl: Het tabblad Content is samengesteld uit 2 belangrijke elementen.

source: The drop-down template selector. By default, the selected template is the Custom one, which allows the creation of a content page from scratch. Other templates are available: they are predefined content pages made for various purposes (homepages, contact pages, etc.), that should be edited only to adapt the portal.
de: Das Dropdown-Menü "Vorlagen". Standardmäßig ist die benutzerdefinierte Vorlage ausgewählt, die eine Erstellung der Inhaltsseite von Grund auf ermöglicht. Andere Vorlagen sind verfügbar: dabei handelt es sich um vordefinierte Inhaltsseiten, die für verschiedene Zwecke (Homepages, Kontaktseiten usw.) erstellt wurden und nur bearbeitet werden sollten, um das Portal anzupassen.
es: El selector desplegable de plantillas. Por defecto, la plantilla seleccionada es la personalizada, que permite la creación de una página de contenido desde cero. Hay otras plantillas disponibles: son páginas de contenido predefinidas hechas con fines diversos (páginas de inicio, páginas de contacto, etc.), que deben editarse solo para adaptar el portal.
fr: Le sélecteur de modèles, sous forme de liste déroulante. Le modèle sélectionné par défaut est le modèle Personnalisé, qui permet de créer de A à Z une page de contenu. D'autres modèles sont également disponibles : il s'agit de pages de contenu prédéfinies, destinées à différents usages (pages d'accueil, pages de contact, etc.) qui doivent uniquement être modifiées pour s'adapter au portail.
nl: De drop-down templatekiezer. Standaard is de geselecteerde template de Gepersonaliseerde, die u toelaat een contentpagina van bij het begin aan te maken. Er zijn ook andere templates beschikbaar: dit zijn vooraf gedefinieerde contentpagina's die aangemaakt zijn voor diverse doeleinden (homepagina's, contactpagina's, enz.) die enkel zouden moet worden bewerkt om het portaal aan te passen.

source: The HTML and CSS editor. This is where the HTML content and CSS code should be written that describes the presentation of that HTML content.
de: Der HTML- und CSS-Editor. Hier sollten der HTML-Inhalt und der CSS-Code geschrieben werden, der die Darstellung dieses HTML-Inhalts beschreibt.
fr: L'éditeur HTML et CSS. C'est dans celui-ci que vous devez écrire le contenu HTML, ainsi que le code CSS qui décrit la présentation de ce contenu HTML.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Theme colors, defined in the Look & feel section of the back office, can be used in the page stylesheet as CSS variables. For more information, see the :ref:`Customizing theme and portal icon documentation<theme_colors_variables>`).
de: Themenfarben, die im Abschnitt Aussehen & Eindruck des Backoffice definiert wurden, können im Stylesheet der Seite als CSS-Variablen verwendet werden. Für zusätzliche Informationen siehe :ref:`Anpassen von Thema und Portal-Icon<theme_colors_variables>`.
fr: Les couleurs de thème sont définies dans la section Apparence de l'interface d'administration. Elles peuvent être utilisées comme variables CSS dans la feuille de style de la page. Pour plus d'informations, consultez la :ref:`documentation Personnaliser le thème et l'icône du portail<theme_colors_variables>`.

source: The final result will not be displayed in the page preview when using Internet Explorer.
de: Bei der Verwendung des Internet Explorer wird das Endergebnis nicht in der Seitenvorschau angezeigt.
fr: Le résultat final n'apparaîtra pas dans la prévisualisation de la page si vous utilisez Internet Explorer.

source: On the right of the Content tab is also displayed a Preview button. It opens a preview of the page as the users would see it on the portal, without having to save the page first.
de: Auf der rechten Seite der Registerkarte Inhalt sehen Sie eine Schaltfläche für die Vorschau. Diese öffnet eine Vorschau der Seite, wie sie die Benutzer im Portal sehen würden, ohne die Seite vorher speichern zu müssen.
es: A la derecha de la ficha Contenido también se visualiza un botón Vista previa. Este abre una vista previa de la página tal como la verían los usuarios del portal, sin tener que guardar primero la página.
fr: Un bouton Aperçu, à droite de l'onglet Contenu, permet de générer un aperçu de la page, telle qu'elle sera vue par les utilisateurs sur le portail, sans avoir à l'enregistrer au préalable.
nl: Rechts van het tabblad Content staat ook een knop Voorbeeldweergave. Deze opent een voorbeeldweergave van de pagina zoals uw gebruikers deze zouden zien op het portaal zonder eerst de pagina te moeten opslaan.

source: Using page templates
de: Verwendung von Seitenvorlagen
es: Utilizar plantillas de página
fr: Utilisation des modèles de page
nl: Paginatemplates gebruiken

source: To choose a page template:
de: Eine Seitenvorlage auswählen:
es: Para elegir una plantilla de página:
fr: Pour choisir un modèle de page :
nl: Om een paginatemplate te kiezen:

source: Click on the Template drop-down selector.
de: Klicken Sie auf das Dropdown-Menü "Vorlagen".
es: Haga clic en el selector desplegable de plantillas.
fr: Cliquez sur le sélecteur de modèles, sous forme de liste déroulante.
nl: Klik op de drop-down templatekiezer.

source: Choose a template from the selection.
de: Wählen Sie eine Vorlage aus der Auswahl aus.
es: Elija una plantilla de la selección.
fr: Choisissez un modèle dans la liste.
nl: Kies een template uit de selectie.

source: When selecting another template while one is already in place and has already been modified, a window appears to confirm the template change.
de: Wird eine neue Vorlage ausgewählt, während bereits eine andere ausgewählt und geändert wurde, erscheint ein Fenster, in dem Sie die Änderung der Vorlage bestätigen können.
es: Al seleccionar otra plantilla cuando hay una activada y ya se ha modificado, aparece una ventana para confirmar el cambio de plantilla.
fr: Quand vous sélectionnez un autre modèle que celui déjà utilisé et modifié, une fenêtre s'affiche pour vous demander de confirmer le changement de modèle.
nl: Wanneer een andere template wordt gekozen terwijl er al een klaar staat en reeds werd gewijzigd, verschijnt er een venster waarin wordt bevestigd dat van template is veranderd.

source: To reset the template, that is, to erase the custom modifications and go back to the original state of the template:
de: Um die Vorlage zurückzusetzen, also die benutzerdefinierten Änderungen löschen und in den ursprünglichen Zustand der Vorlage zurückkehren:
fr: Pour réinitialiser le template, c'est-à-dire pour supprimer les modifications personnalisées et revenir à l'état d'origine du template :

source: Click on the Reset template button. A related window appears.
de: Klicken Sie auf den Button "Zurücksetzen". Ein entsprechendes Fenster wird angezeigt.
es: Haga clic en el botón para restablecer la plantilla. Aparecerá una ventada relacionada.
fr: Cliquez sur le bouton Réinitialiser le modèle ; une fenêtre s'affiche.
nl: Klik op de knop "Template opnieuw instellen". Het eraan gekoppelde venster verschijnt.

source: Click on the "Reset the content" button to confirm the resetting of the template, and deletion of all custom modifications.
de: Klicken Sie auf den Button "Inhalt zurücksetzen", um das Zurücksetzen der Vorlage und das Löschen aller benutzerdefinierten Änderungen zu bestätigen.
es: Haga clic en el botón "Restablecer el contenido" para confirmar el restablecimiento de la plantilla y la eliminación de todas las modificaciones personalizadas.
fr: Cliquez sur le bouton "Réinitialiser le contenu" pour confirmer la réinitialisation du modèle et la suppression de toutes les modifications.
nl: Klik op de knop "De content opnieuw instellen" om het opnieuw instellen van de template te bevestigen en om alle gepersonaliseerde wijzigingen te verwijderen.

source: Although content pages can be shared using their URL, they can also be made available to the portal users via the navigation bar or even set as the portal's main landing page (homepage). These configurations are set in the Look & feel > Navigation section of the back office (see :doc:`Configuring the navigation menu </customizing_look_and_feel/02_configuring_navigation/navigation>`).
de: Inhaltsseiten können zwar über ihre URL geteilt, aber auch den Portalbenutzern über die Navigationsleiste zur Verfügung gestellt werden. Sie können sogar als Haupt-Landingpage (Homepage) des Portals eingestellt werden. Diese Einstellungen werden Backoffice-Bereich "Aussehen & Eindruck > Navigation" eingerichtet (siehe :doc:`Konfigurieren des Navigationsmenüs </customizing_look_and_feel/02_configuring_navigation/navigation>`).
fr: Les pages de contenu peuvent être partagées via leur URL, mais également être mises à la disposition des utilisateurs du portail via la barre de navigation ou encore être définies en tant que pages de renvoi principales (pages d'accueil) du portail. Ces configurations sont définies dans la section Apparence > Navigation de l'interface d'administration (voir :doc:`Configurer le menu de navigation </customizing_look_and_feel/02_configuring_navigation/navigation>`).

source: The HTML and CSS editor, where should be written the HTML content and CSS code that describes the presentation of that HTML content.
es: El editor de código HTML y CSS, donde se debe escribir el contenido HTML y el código CSS que describe la presentación de ese contenido HTML .
nl: De HTML- en CSS-editor waar de HTML-content en de CSS-code in zou moeten worden geschreven die de presentatie van de HTML-content omschrijft.

source: Theme colors, defined in the Look & feel section of the back office, can be used in the page stylesheet, as CSS variables (more information in the :ref:`Customizing theme and portal icon documentation<theme_colors_variables>`).
es: Los colores de temas, definidos en la sección Apariencia del back office, pueden usarse en la hoja de estilos de la página, como variables CSS (más información en la :ref:`documentación Personalizar el tema y el icono del portal<theme_colors_variables>`).
nl: Er kunnen themakleuren, zoals die gedefinieerd staan in de Look & Feel-sectie van de back office, als CSS-variabelen gebruikt worden in de stijlbladpagina (voor meer informatie, zie :ref:`Documentatie over het personaliseren van thema's en over het portaalicoon<theme_colors_variables>`).

source: Note that the final result will not be displayed in the page preview when using Internet Explorer.
es: Tenga presente que el resultado final no se visualizará en la vista previa de la página con Internet Explorer.
nl: Merk op dat het eindresultaat niet in de voorbeeldweergave van de pagina zal weergegeven worden wanneer Internet Explorer wordt gebruikt.

source: To reset the template (i.e. erase the custom modifications and go back to the original state of the template):
es: Para restablecer la plantilla (es decir, borrar las modificaciones personalizadas y volver al estado original de la plantilla):
nl: Om de template opnieuw in te stellen (m.a.w. de gepersonaliseerde wijzigingen wissen en terugkeren naar de oorspronkelijke staat van de template):

source: Although content pages can be shared using their URL, they can also be made available to the portal users via the navigation bar, or even set as main landing page (i.e. homepage) of the portal. These configurations are set in the Look & feel > Navigation section of the back office (see :doc:`Configuring the navigation menu </customizing_look_and_feel/02_configuring_navigation/navigation>`).
es: Aunque las páginas de contenido se pueden compartir usando su dirección URL, también se pueden poner a disposición de los usuarios del portal mediante la barra de navegación, o incluso establecerlas como página de destino principal (es decir, página de inicio) del portal. Estas configuraciones se establecen en la sección Apariencia > Navegación del back office (consulte :doc:`Configurar el menú de navegación </customizing_look_and_feel/02_configuring_navigation/navigation>`).
nl: Hoewel contentpagina's door middel van hun URL kunnen worden gedeeld, kunnen ze ook aan de gebruikers van het portaal beschikbaar worden gesteld via de navigatiebalk of zelfs worden ingesteld als de belangrijkste landingpagina (m.a.w. homepagina) van het portaal. Deze configuraties zijn ingesteld in de rubriek Look & Feel > Navigatie van de back office (zie :doc:`Het navigatiemenu configureren </customizing_look_and_feel/02_configuring_navigation/navigation>`).
