Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/02_managing_legal_information/legals.po
Languages: de, es, fr, nl

source: In the first text box, paste the link leading to the Terms & Conditions.
de: Fügen Sie im ersten Textfeld den Link zu den Geschäftsbedingungen ein.
es: En el primer cuadro de texto, pegue el vínculo que lleva a los Términos y condiciones.
fr: Dans la première zone de texte, collez le lien vers les conditions d'utilisation.
nl: Plak in het eerste tekstvak de koppeling naar de algemene voorwaarden.

source: In the second text box, paste the link leading to the Privacy Policy.
de: Fügen Sie im zweiten Textfeld den Link zur Datenschutzerklärung ein.
es: En el segundo cuadro de texto, pegue el vínculo que lleva a la Política de privacidad.
fr: Dans la deuxième zone de texte, collez le lien vers la politique de confidentialité.
nl: Plak in het tweede tekstvak de koppeling die doorverwijst naar het privacybeleid.

source: In the second text box, paste the link leading to the Cookies policy.
de: Fügen Sie im zweiten Textfeld den Link zur Cookie-Richtlinie ein.
es: En el segundo cuadro de texto, pegue el vínculo que lleva a la Política de cookies.
fr: Dans la troisième zone de texte, collez le lien vers la charte cookies.
nl: Plak in het tweede tekstvak de koppeling die doorverwijst naar het cookiebeleid.

source: Writing custom Terms and Conditions, Privacy Policy, and Cookies Policy
de: Eigene Geschäftsbedingungen, Datenschutzerklärungen und Cookie-Richtlinien verfassen
es: Escribir unos Términos y condiciones, una Política de privacidad y una Política de cookies personalizados
fr: Écrire des conditions d'utilisation, une politique de confidentialité et une charte cookies personnalisées
nl: Aangepaste algemene voorwaarden, een aangepast privacybeleid en een aangepast cookiebeleid schrijven

source: You can directly write or paste the Terms and Conditions, Privacy Policy, and Cookies Policy of use on the Opendatasoft platform.
de: Sie können die Geschäftsbedingungen, die Datenschutzerklärung und die Cookie-Richtlinie direkt auf der Opendatasoft-Plattform schreiben oder einfügen.
es: Puede escribir o pegar directamente los Términos y condiciones, la Política de privacidad y la Política de cookies de uso en la plataforma Opendatasoft.
fr: Vous pouvez écrire ou coller directement les conditions d'utilisation, la politique de confidentialité et la charte cookies utilisées sur la plateforme Opendatasoft.
nl: U kunt de algemene voorwaarden, het privacybeleid of cookiebeleid voor gebruik direct van het Opendatasoft-platform schrijven of plakken.

source: From the **Portal Terms and Conditions, Privacy Policy and Cookies Policy section**, click **Write custom Terms and Conditions, Privacy Policy and Cookies Policy**.
de: Klicken Sie in dem Bereich **Geschäftsbedingungen, Datenschutzerklärung und Cookie-Richtlinie** auf **Eigene Geschäftsbedingungen, Datenschutzerklärungen und Cookie-Richtlinien verfassen**.
es: En la sección **Términos y condiciones, Política de privacidad y Política de cookies del portal**, haga clic en **Escribir unos Términos y condiciones, una Política de privacidad y una Política de cookies personalizados**.
fr: Dans la section **Conditions d'utilisation du portail, politique de confidentialité et charte cookies**, cliquez sur **Écrire vos propres conditions d'utilisation, politique de confidentialité et charte cookies**.
nl: Vanuit de sectie **Algemene voorwaarden van het portaal, privacybeleid en cookiebeleid** klikt u op **Aangepaste algemene voorwaarden, een aangepast privacybeleid en een aangepast cookiebeleid schrijven**.

source: Toggle on **Use the same texts for all languages** to use the same documents for all available languages. If the Terms and Conditions, Privacy Policy and Cookies Policy are only written and available in the language of the portal country, for example, English, no matter the language selected by the user on the portal, the conditions of use will be displayed in English.
de: Wechseln Sie zu **Die gleichen Texte für alle Sprachen verwenden**, um dieselben Dokumente für alle verfügbaren Sprachen zu verwenden. Das bedeutet, wenn die Geschäftsbedingungen, die Datenschutzerklärung und die Cookie-Richtlinie nur in der Sprache des Landes verfügbar sind, in dem das Portal veröffentlicht wird - z.B. Englisch - werden die Nutzungsbedingungen unabhängig von der vom Benutzer auf dem Portal gewählten Sprache in Englisch angezeigt.
es: Active el botón de alternancia **Usar los mismos textos para todos los idiomas** para emplear los mismos documentos para todos los idiomas disponibles. Si los Términos y condiciones, la Política de privacidad y la Política de cookies solo estarán escritos y disponibles en el idioma del país del portal, por ejemplo inglés, independientemente del idioma que seleccione el usuario del portal, las condiciones de uso se visualizarán en inglés.
fr: Activez l'option **Utiliser les mêmes textes pour toutes les langues** pour utiliser les mêmes documents pour toutes les langues disponibles. Par exemple, si les conditions d'utilisation, la politique de confidentialité et la charte cookies sont écrites et disponibles uniquement dans la langue du pays du portail, l'anglais, les conditions d'utilisation seront affichées en anglais, quelle que soit la langue sélectionnée par l'utilisateur sur le portail.
nl: Vink het vakje **Gebruik dezelfde teksten voor alle talen** aan om dezelfde documenten voor alle beschikbare talen te gebruiken. Wanneer de algemene voorwaarden, het privacybeleid en het cookiebeleid enkel geschreven en beschikbaar zijn in de taal van het land van het portaal, bijv. het Engels, zullen de gebruiksvoorwaarden in het Engels worden weergegeven, ongeacht de taal die door de gebruiker op het portaal is geselecteerd.

source: From the **Conditions** tab, write or paste the Terms and Conditions.
de: Schreiben oder fügen Sie die Geschäftsbedingungen in der Registerkarte **Geschäftsbedingungen** ein.
es: En la ficha **Condiciones**, escriba o pegue los Términos y condiciones.
fr: Dans l'onglet **Conditions**, écrivez ou collez les conditions d'utilisation.
nl: Schrijf of plak vanuit het tabblad **Voorwaarden** de algemene voorwaarden.

source: From the **Privacy Policy** tab, write or paste the Privacy Policy.
de: Schreiben oder fügen Sie die Datenschutzerklärung in der Registerkarte **Datenschutzerklärung** ein.
es: En la ficha **Política de privacidad**, escriba o pegue la Política de privacidad.
fr: Dans l'onglet **Politique de confidentialité**, écrivez ou collez la politique de confidentialité.
nl: Schrijf of plak vanuit het tabblad **Privacybeleid** het privacybeleid.

source: From the **Cookies policy** tab, write or paste the Cookies policy.
de: Schreiben oder fügen Sie die Cookie-Richtlinie in der Registerkarte **Cookie-Richtlinie** ein.
es: En la ficha **Política de cookies**, escriba o pegue la Política de cookies.
fr: Dans l'onglet **Charte cookies**, écrivez ou collez la charte cookies.
nl: Schrijf of plak vanuit het tabblad **Cookiebeleid** het cookiebeleid.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Fill-in Terms & Conditions and Privacy Policy templates are available, based on the French law (in French and English) and the US law (in English) only.
de: Ausfüllbare Vorlagen für die Geschäftsbedingungen sowie die Datenschutzerklärung sind verfügbar, jedoch nur auf Grundlage des französischen (in französischer und englischer Sprache) oder US-amerikanischen (in englischer Sprache) Rechts.
es: Hay disponibles plantillas rellenadas de los Términos y condiciones y la Política de privacidad, únicamente con arreglo a las legislaciones francesa (en francés e inglés) y estadounidense (en inglés).
fr: Des modèles de conditions d'utilisation et de politique de confidentialité à remplir sont disponibles. Ils sont basés sur la législation française (en français et en anglais) et la législation américaine (en anglais) uniquement.
nl: Er zijn sjablonen van algemene voorwaarden en het privacybeleid, die kunnen worden ingevuld, beschikbaar enkel op basis van de Franse wetgeving (in het Frans en het Engels) en de Amerikaanse wetgeving (in het Engels).

source: Click the **Use a template** button under the box to select a template and enter the required information. You will be able to edit the generated conditions if needed.
de: Klicken Sie auf die Schaltfläche **Eine Vorlage verwenden** unter dem Textfeld, um eine Vorlage zu verwenden. Die generierten Nutzungsbedingungen können anschließend in dem Textfeld bearbeitet werden.
es: Haga clic en el botón **Utilizar una plantilla** bajo el cuadro de texto para seleccionar una plantilla y especificar la información necesaria. Después podrá editar las condiciones generadas en caso necesario.
fr: Cliquez sur le bouton **Utiliser un modèle** sous la zone de texte pour utiliser un modèle, puis saisissez les informations obligatoires. Vous pouvez modifier ultérieurement les conditions d'utilisation générées si besoin.
nl: Klik op de knop **Gebruik een sjabloon** onder het tekstvak om een sjabloon te gebruiken. Daarna kunnen de gegenereerde voorwaarden in het tekstvak worden bijgewerkt.

source: Licenses
de: Lizenzen
es: Licencias
fr: Licences
nl: Licenties

source: When configuring the metadata for a dataset in the Information tab, it is important to define the license that explicitly specifies how others can use the data.
de: Bei der Konfiguration der Metadaten für einen Datensatz in der Registerkarte "Informationen" sollte die Lizenz definiert werden, die explizit festlegt, wie andere die Daten verwenden dürfen.
es: Al configurar los metadatos de un conjunto de datos en la ficha Información, es importante definir la licencia que especifica explícitamente cómo los demás pueden usar los datos.
fr: Lors de la configuration des métadonnées d'un jeu de données dans l'onglet Informations, il est primordial de définir la licence indiquant explicitement la façon dont les autres utilisateurs peuvent utiliser les données.
nl: Wanneer de metadata voor een dataset wordt geconfigureerd in het informatietabblad, is het belangrijk om de licentie te definiëren die uitdrukkelijke specificeert hoe andere de data kunnen gebruiken.

source: Reusers - external developers, data analysts, etc. - are more likely to work with properly licensed data than contacting data producers and ask them for more information.
de: Weiterverwender - wie externe Entwickler, Datenanalysten usw. - arbeiten eher mit ordnungsgemäß lizenzierten Daten, als dass sie sich an Datenproduzenten wenden und diese um weitere Informationen bitten.
es: Es más probable que los reutilizadores (desarrolladores externos, analistas de datos, etc.) trabajen con datos debidamente bajo licencia en lugar de contactar con productores de datos para pedirles más información.
fr: Les réutilisateurs (analystes de données, développeurs externes, etc.) sont davantage susceptibles de travailler avec des données détenant les licences appropriées plutôt que de contacter les producteurs de données pour leur demander plus d'informations.
nl: Hergebruikers - externe ontwikkelaars, gegevensanalisten, enz. - zullen waarschijnlijker werken met gegevens waarvoor naar behoren een licentie is verleend dan gegevensproducenten te contacteren en hen meer informatie te vragen.

source: Work with your legal team to find the most appropriate license for your data.
de: Arbeiten Sie mit Ihrem Rechtsteam zusammen, um die am besten geeignete Lizenz für Ihre Daten ausfindig zu machen.
es: Trabaje con su equipo legal para obtener la licencia más adecuada para sus datos.
fr: Collaborez avec votre équipe juridique pour trouver la licence la plus appropriée pour vos données.
nl: Werk met uw juridisch team om de meest geschikte licentie voor uw gegevens te vinden.

source: Configure licenses
de: Lizenzen konfigurieren
es: Configurar licencias
fr: Configurer des licences
nl: Licenties configureren

source: In the back office, you can configure the licenses available when adding the metadata for a dataset.
de: Im Backoffice können Sie die verfügbaren Lizenzen konfigurieren, sobald Sie die Metadaten für einen Datensatz hinzufügen.
es: En el back office, puede configurar las licencias disponibles al añadir los metadatos de un conjunto de datos. En el menú izquierdo bajo Configuración, seleccione Legal. Vaya al área Licencias.
fr: Dans l'interface d'administration, vous pouvez configurer les licences disponibles lors de l'ajout des métadonnées à un jeu de données.
nl: In de back office kunt u de beschikbare licenties configureren wanneer de metadata voor een dataset worden toegevoegd.

source: From the left menu under **Configuration**, select **Legals**.
de: Wählen Sie im linken Menü **Konfiguration** > **Gesetzliches**.
es: En el menú izquierdo bajo **Configuración**, seleccione **Legal**.
fr: Sous **Configuration**, dans le menu de gauche, sélectionnez **Mentions légales**.
nl: Selecteer **Legals** vanuit het linkermenu onder **Configuration**.

source: Go to the **Licenses** area.
de: Wechseln Sie zu dem Bereich **Lizenzen**.
es: Vaya al área **Licencias**.
fr: Allez à la section **Licences**.
nl: Ga naar de rubriek **Licenses**.

source: In the **Labels** column, add a license label for each language available on the domain. The label will be displayed in the drop-down selection in the back office and the Information tab of the published dataset in the front office.
de: Fügen Sie in der Spalte **Beschriftung** eine Lizenzbezeichnung für jede in der Domain verfügbare Sprache hinzu. Die Bezeichnung wird im Dropdown-Menü im Backoffice und in der Registerkarte "Informationen" des veröffentlichten Datensatzes im Frontoffice angezeigt.
es: En la columna **Etiquetas**, añada una etiqueta de licencia para cada uno de los idiomas disponibles en el dominio. La etiqueta aparecerá en la selección desplegable del back office y en la ficha Información del conjunto de datos publicado en el front office.
fr: Dans la colonne **Labels**, ajoutez un label de licence pour chaque langue disponible sur le domaine. Le label s'affichera dans le menu déroulant de l'interface d'administration, ainsi que dans l'onglet Informations du jeu de données publié dans l'interface de navigation.
nl: Voeg in de kolom **Labels** een licentielabel toe voor elke taal die beschikbaar is op het domein. Het label zal worden weergegeven in de drop-down selectie in de back office en het informatietabblad van de gepubliceerde dataset in de front office.

source: Click the **Add license** button.
de: Klicken Sie auf den Button **Lizenz hinzufügen**.
es: Haga clic en el botón **Añadir licencia**.
fr: Cliquez sur le bouton **Ajouter une licence**.
nl: Klik op de knop **Licentie toevoegen**.

source: In the **URLs** column, add the URL to the official website of the defined license to find more information about that license. You can only add one URL per language available on the domain.
de: Geben Sie in der Spalte **URLs** die offizielle Website der jeweiligen Lizenz an, um weitere Informationen über diese Lizenz zu erhalten. Sie können eine URL pro Sprache auf der Domain hinzufügen.
es: En la columna de direcciones **URL**, añada la dirección URL al sitio web oficial de la licencia definida para obtener más información sobre esa licencia. Solo puede añadir una dirección URL por idioma disponible en el dominio.
fr: Dans la colonne **URL**, ajoutez l'URL correspondant au site web officiel de la licence définie, afin de trouver plus d'informations sur celle-ci. Vous pouvez uniquement ajouter une URL par langue disponible sur le domaine.
nl: Voeg in de kolom **URLs** de URL naar de officiële website van de gedefinieerde licentie toe om meer informatie te krijgen over die licentie. U kunt slechts één URL per beschikbare taal op het domein toevoegen.

source: Adding a URL for a license is optional, but it is good practice to provide an official definition of the license to make the data easily reusable. If you have a custom license, you can add the URL to a page hosted on your corporate website or your Opendatasoft platform.
de: Das Hinzufügen einer URL für eine Lizenz ist optional. Es ist jedoch eine gute Vorgehensweise, eine offizielle Definition der Lizenz bereitzustellen, um die Daten leicht wiederverwendbar zu machen. Wenn Sie über eine benutzerdefinierte Lizenz verfügen, können Sie die URL zu einer Seite hinzufügen, die auf Ihrer Unternehmens-Website oder Ihrer Opendatasoft-Plattform gehostet wird.
es: Añadir una dirección URL para una licencia es opcional, pero es recomendable facilitar una definición oficial de la licencia para facilitar la reutilización de los datos. Si tiene una licencia personalizada, puede añadir la dirección URL a una página alojada en su sitio web corporativo o su plataforma Opendatasoft.
fr: L'ajout d'une URL pour une licence est une pratique facultative, mais recommandée. En effet, cela permet de fournir une définition officielle de la licence et de simplifier la réutilisation des données. Si vous avez une licence personnalisée, vous pouvez ajouter l'URL à une page hébergée sur le site web de votre entreprise ou sur votre plateforme Opendatasoft.
nl: Een URL voor een licentie toevoegen is optioneel maar het is een goede manier van werken om een officiële definitie van de licentie te geven om de gegevens gemakkelijk herbruikbaar te maken. Indien u een gepersonaliseerde licentie hebt, kunt u de URL toevoegen aan een pagina die gehost wordt door uw bedrijfswebsite of uw Opendatasoft-platform.

source: Click the **Save** button in the top right corner of the page.
de: Klicken Sie oben rechts auf den Button **Speichern**.
es: Haga clic en el botón **Guardar** de la esquina superior derecha de la página.
fr: Cliquez sur le bouton **Enregistrer** en haut à droite de la page.
nl: Klik op de knop **Opslaan** in de rechter bovenhoek van de pagina.

source: To delete a license, click on the |icon-trash| button.
de: Klicken Sie auf das Symbol |icon-trash|, um eine Lizenz zu löschen.
es: Para eliminar una licencia, haga clic en el botón |icon-trash|.
fr: Pour supprimer une licence, cliquez sur le bouton |icon-trash|.
nl: Klik op de knop |icon-trash| om een licentie te verwijderen.

source: Default licenses
de: Standard-Lizenzen
es: Licencias predeterminadas
fr: Licences par défaut
nl: Standaard licenties

source: By default, a set of licenses, including country-specific licenses, is available.
de: Standardmäßig ist eine Reihe von Lizenzen, einschließlich länderspezifischer Lizenzen, verfügbar.
es: Por defecto, está disponible un conjunto de licencias, incluidas las licencias específicas de los países.
fr: Un ensemble de licences, notamment des licences spécifiques aux pays, est disponible par défaut.
nl: Standaard is een reeks licenties, met inbegrip van landspecifieke licenties, beschikbaar.

source: The following licenses are available on all portals:
de: Die folgenden Lizenzen sind auf allen Portalen verfügbar:
es: Las licencias siguientes están disponibles en todos los portales:
fr: Les licences suivantes sont disponibles sur tous les portails :
nl: De volgende licenties zijn beschikbaar op alle portalen:

source: Label
de: Beschriftung
es: Etiqueta

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Public domain
es: Dominio público
fr: Domaine public
nl: Publiek domein

source: The material is freely available. It can be used without any permission.
de: Das Material ist frei verfügbar. Es kann ohne jegliche Genehmigung verwendet werden.
es: El material está disponible libremente. Se puede usar sin ningún permiso.
fr: Le contenu est disponible librement et peut être utilisé sans autorisation.
nl: Het materiaal is vrij beschikbaar. Het kan zonder enige toestemming worden gebruikt.

source: The database falls under the Open Data Commons. This license grants you with "a worldwide, royalty-free, non-exclusive, terminable license to Use the Database". If you publicly use any adapted version of this database, or works produced from an adapted database, you must also offer that adapted database under the ODbL.
de: Die Datenbank gehört zu dem Projekt Open Data Commons. Diese Lizenz gewährt "eine weltweite, gebührenfreie, nicht-exklusive, kündbare Lizenz zur Nutzung der Datenbank". Wenn Sie eine angepasste Version dieser Datenbank oder Werke, die aus einer angepassten Datenbank erstellt wurden, öffentlich nutzen, müssen Sie diese angepasste Datenbank ebenfalls unter der ODbL bereitstellen.
es: La base de datos está bajo el amparo de Open Data Commons. Esta licencia otorga una "licencia mundial, libre de regalías, no exclusiva y terminable para usar la base de datos". Si usa públicamente alguna versión adaptada de esta base de datos, o creaciones producidas a partir de una base de datos adaptada, también debe ofrecer esa base de datos adaptada bajo ODbL.
fr: La base de données appartient à l'ensemble de licences Open Data Commons. Celui-ci vous octroie "une licence mondiale, gratuite, non exclusive et résiliable pour utiliser la base de données". Si vous utilisez publiquement une version adaptée de cette base de données, ou des œuvres produites à partir d'une base de données adaptée, vous devez également proposer cette base de données adaptée sous la licence ODbL.
nl: De database valt onder de Open Data Commons. Deze licentie verleent u "een wereldwijde, royaltyvrije, niet-exclusieve, opzegbare licentie om de database te gebruiken". Indien u publiekelijk een aangepaste versie van deze database gebruikt of werken produceert vanuit een aangepaste database, moet u ook de aangepaste database onder de ODbL aanbieden.

source: The material licensed under CC0 1.0 was released to the public domain by its author. You can use it without any permissions.
de: Unter CC0 1.0 lizenzierte Werke werden von den jeweiligen Autoren der Öffentlichkeit zur Verfügung gestellt. Sie können ohne jegliche Erlaubnis verwendet werden.
es: El material con licencia bajo el amparo de CC0 1.0 ha sido puesto a disposición del dominio público por su autor. Puede usarlo sin ningún permiso.
fr: Le contenu fourni sous licence CC0 1.0 a été publié dans le domaine public par son auteur. Vous pouvez l'utiliser sans autorisation.
nl: Het materiaal waaraan krachtens CC0 1.0 een licentie is verleend, werd door de auteur ervan aan het publiek domein vrijgegeven. U kunt het zonder enige toestemming gebruiken.

source: You can copy, redistribute, remix, transform, and build upon the material for any purpose, even commercially, but you must give appropriate credit to the original author.
de: Werke können für jeden Zweck (auch zu kommerziellen Zwecken) kopiert, weiterverteilt, neu zusammengestellt, verändert und verwendet werden. Voraussetzung ist die Namensnennung des ursprünglichen Autors.
es: Puede copiar, redistribuir, remezclar, transformar y crear a partir del material con cualquier fin, incluido para un uso comercial, pero debe dar el crédito correspondiente al autor original.
fr: Vous pouvez copier, redistribuer, adapter, transformer et exploiter le contenu à n'importe quelle fin, même commerciale, mais vous devez faire mention de l'auteur d'origine.
nl: U kunt het materiaal kopiëren, herverdelen, opnieuw mengen, transformeren en erop bouwen om voor het even welk doel, zelfs commercieel, maar u moet gepast krediet geven aan de oorspronkelijke auteur.
