Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/02_managing_legal_information/legals.po
Languages: de, es, fr, nl

source: You can copy, redistribute, remix, transform, and build upon the material for any purpose, even commercially, but you must give appropriate credit to the original author. You must also release your contributions under the same license as the original material.
de: Werke können für jeden Zweck (auch zu kommerziellen Zwecken) kopiert, weiterverteilt, neu zusammengestellt, verändert und verwendet werden. Voraussetzung ist die Namensnennung des ursprünglichen Autors. Außerdem müssen Beiträge unter der gleichen Lizenz wie das Originalwerk veröffentlicht werden.
es: Puede copiar, redistribuir, remezclar, transformar y crear a partir del material con cualquier fin, incluido para un uso comercial, pero debe dar el crédito correspondiente al autor original. También debe poner a disposición sus contribuciones con la misma licencia que el material original.
fr: Vous pouvez copier, redistribuer, adapter, transformer et exploiter le contenu à n'importe quelle fin, même commerciale, mais vous devez faire mention de l'auteur d'origine. Vous devez également publier vos contributions sous la même licence que celle du contenu d'origine.
nl: U kunt het materiaal kopiëren, herverdelen, opnieuw mengen, transformeren en erop bouwen om voor het even welk doel, zelfs commercieel, maar u moet gepast krediet geven aan de oorspronkelijke auteur. U moet ook uw bijdragen onder dezelfde licentie als het oorspronkelijk materiaal vrijgeven.

source: You can copy, redistribute, remix, transform, and build upon the material for non-commercial purposes, but you must give appropriate credit to the original author.
de: Werke können für nicht kommerzielle Zwecke kopiert, weiterverteilt, neu zusammengestellt, verändert und verwendet werden. Voraussetzung ist die Namensnennung des ursprünglichen Autors.
es: Puede copiar, redistribuir, remezclar, transformar y crear a partir del material con fines no comerciales, pero debe dar el crédito correspondiente al autor original.
fr: Vous pouvez copier, redistribuer, adapter, transformer et exploiter le contenu à des fins non commerciales, mais vous devez faire mention de l'auteur d'origine.
nl: U kunt het materiaal kopiëren, herverdelen, opnieuw mengen, transformeren en erop bouwen voor niet commerciële doeleinden, maar u moet gepast krediet geven aan de oorspronkelijke auteur.

source: You can copy, redistribute, remix, transform, and build upon the material for non-commercial purposes, but you must give appropriate credit to the original author. You must also release your contributions under the same license as the original material.
de: Werke können für nicht kommerzielle Zwecke kopiert, weiterverteilt, neu zusammengestellt, verändert und verwendet werden. Voraussetzung ist die Namensnennung des ursprünglichen Autors. Außerdem müssen Beiträge unter der gleichen Lizenz wie das Originalwerk veröffentlicht werden.
es: Puede copiar, redistribuir, remezclar, transformar y crear a partir del material con fines no comerciales, pero debe dar el crédito correspondiente al autor original. También debe poner a disposición sus contribuciones con la misma licencia que el material original.
fr: Vous pouvez copier, redistribuer, adapter, transformer et exploiter le contenu à des fins non commerciales, mais vous devez faire mention de l'auteur d'origine. Vous devez également publier vos contributions sous la même licence que celle du contenu d'origine.
nl: U kunt het materiaal kopiëren, herverdelen, opnieuw mengen, transformeren en erop bouwen voor niet commerciële doeleinden, maar u moet gepast krediet geven aan de oorspronkelijke auteur. U moet ook uw bijdragen onder dezelfde licentie als het oorspronkelijk materiaal vrijgeven.

source: Open Database License
nl: Open Database-licentie
