Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/02_managing_legal_information/legals.po
Languages: de, es, fr, nl

source: Displaying legals
de: Anzeigen gesetzlicher Vorgaben
es: Visualizar la información legal
fr: Afficher des mentions légales
nl: Wettelijke vermeldingen weergeven

source: Cookie banner
es: Báner de cookies
fr: Bannière de cookies

source: A cookie banner is a pop-up that informs first-time visitors that your portal uses cookies. Before visitors start using your portal, the cookie banner also asks for their consent to use certain types of cookies that track visitor data.
de: Ein Cookie-Banner ist ein Pop-up-Fenster, mit dem erstmalige Besucher darüber informiert werden, dass Ihr Portal Cookies verwendet. Bevor Besucher mit der Nutzung Ihres Portals beginnen, werden sie in diesem Fenster um ihre Zustimmung zur Verwendung bestimmter Arten von Cookies zur Analyse von Besucherdaten gebeten.
es: Un báner de cookies es un mensaje emergente que informa a los visitantes que acceden por primera vez al portal de que este utiliza cookies. Antes de que los visitantes empiecen a usar el portal, el báner de cookies también les pide su consentimiento para utilizar determinados tipos de cookies que hacen un seguimiento de los datos del visitante.
fr: Une bannière de cookies est une pop-up indiquant aux utilisateurs qui visitent votre portail pour la première fois que celui-ci utilise des cookies. Avant que les visiteurs n'utilisent votre portail, la bannière de cookies leur demande également leur consentement à utiliser certains types de cookies traçant les données des visiteurs.
nl: Een cookie banner is een pop-up scherm dat bezoekers die de eerste keer het portaal bezoeken in kennis stelt van het feit dat het portaal gebruik maakt van cookies. Alvorens bezoekers uw portaal beginnen gebruiken, vraagt de cookie banner ook om hun toestemming om bepaalde soorten cookies te gebruiken die gegevens van bezoekers opvolgen.

source: If you toggled on the **Require user consent** in the **Configuration** > **Tracking** section of the back office, the cookie banner is automatically displayed to first-time visitors.
de: Wenn Sie die Option **Einverständnis des Benutzers einholen** unter **Konfiguration** > **Tracking** im Backoffice aktiviert haben, wird bei Erstbesuchern automatisch der Cookie-Banner angezeigt.
es: Si ha activado el botón de alternancia **Requerir consentimiento de usuario** en la sección **Configuración** > **Seguimiento** del back office, el báner de cookies se visualizará de forma predeterminada a los visitantes en su primer acceso.
fr: Si vous avez activé l'option **Demander le consentement des utilisateurs** dans la section **Configuration** > **Suivi** de l'interface d'administration, la bannière de cookies s'affiche automatiquement lors de la première visite des utilisateurs sur le portail.
nl: Wanneer u hebt getoggled op **Vereis toestemming van de gebruiker** in de rubriek **Configuratie** > **Tracking** van de back office wordt de cookie banner automatisch weergegeven aan personen die het portaal de eerste keer bezoeken.

source: On Opendatasoft portals, visitors' choices are stored for six months. A link is also displayed in your portal's footer so that visitors can manage their cookie preferences at any time.
de: Auf den Portalen von Opendatasoft werden die Entscheidungen der Besucher für sechs Monate gespeichert. Außerdem wird ein Link in der Fußzeile Ihres Portals angezeigt, sodass Besucher die Cookie-Einstellungen jederzeit verwalten können.
es: En los portales Opendatasoft, las opciones elegidas por los visitantes se almacenan durante seis meses. Asimismo, en el pie de página del portal aparece un enlace para que los visitantes puedan gestionar sus preferencias de cookies en cualquier momento.
fr: Sur les portails Opendatasoft, les choix des visiteurs sont conservés pendant six mois. Un lien est également disponible dans le pied de page du portail, permettant aux visiteurs de gérer à tout moment leurs préférences en matière de cookies.
nl: De keuzes van de bezoekers worden zes maand lang op Opendatasoft-portalen bewaard. In de footer van uw portaal staat ook een link zodat bezoekers hun cookievoorkeuren te allen tijde kunnen beheren.

source: Legal compliance
de: Erfüllung gesetzlicher Vorgaben
es: Cumplimiento legal
fr: Conformité juridique
nl: Wettelijke naleving

source: By default, the platform only uses functional cookies to enable core platform functionality and are therefore always enabled. These cookies do not involve obtaining visitors' consent to comply with certain privacy laws such as the EU General Data Protection Regulation (GDPR).
de: Standardmäßig verwendet die Plattform nur funktionale Cookies, um die wichtigsten Funktionen der Plattform zu ermöglichen. Diese sind immer aktiviert. Sie benötigen keine Einholung der Zustimmung der Besucher, um bestimmte Datenschutzgesetze wie die EU-Datenschutzgrundverordnung (DSGVO) einzuhalten.
es: De forma predeterminada, la plataforma solo utiliza cookies de funcionalidad para habilitar las funciones esenciales de la plataforma y, por consiguiente, siempre están habilitadas. Estas cookies no implican obtener el consentimiento de los visitantes en cumplimiento de determinadas normativas de privacidad como el Reglamento General de Protección de Datos de la Unión Europea (RGPD).
fr: La plateforme utilise par défaut des cookies fonctionnels qui garantissent la bonne exécution de ses principales fonctionnalités ; ces cookies sont ainsi activés en permanence. Pour ce type de cookies, le consentement des visiteurs n'est pas obligatoire pour respecter certaines lois en matière de confidentialité, telles que le Règlement général sur la protection des données (RGPD) de l'UE.
nl: Standaard gebruikt het platform enkel functionele cookies om de kernfunctionaliteit van het platform te activeren en daarom zijn ze altijd geactiveerd. Voor deze cookies hoeft de toestemming van de bezoekers niet te worden bekomen om in overeenstemming te zijn met bepaalde privacywetten, zoals de Algemene Verordening Gegevensbescherming (AVG) van de EU.

source: Enabling the cookie banner
de: Den Cookie-Banner aktivieren
es: Habilitación del báner de cookies
fr: Activer la bannière de cookies
nl: De cookie banner activeren

source: You can enable a cookie banner to comply with certain privacy laws such as the EU General Data Protection Regulation (GDPR).
de: Sie können einen Cookie-Banner aktivieren, um bestimmte Datenschutzgesetze wie die EU-Datenschutzgrundverordnung (DSGVO) einzuhalten.
es: Puede habilitar un báner de cookies en cumplimiento de determinadas normativas de privacidad como el Reglamento General de Protección de Datos de la Unión Europea (RGPD).
fr: Vous pouvez activer une bannière de cookies afin de respecter certaines lois en matière de confidentialité, telles que le RGPD de l'UE.
nl: U kunt een cookie banner activeren om in overeenstemming te zijn met bepaalde privacywetten, zoals de Algemene Verordening Gegevensbescherming (AVG) van de EU.

source: In the back office, go to **Configuration** > **Legals**.
de: Öffnen Sie im Backoffice den Bereich **Konfiguration** > **Gesetzliches**.
es: En el back office, vaya a **Configuración** > **Legal**.
fr: Dans l'interface d'administration, accédez à **Configuration** > **Mentions légales**.
nl: Ga in de back office naar **Configuratie** > **Legals**.

source: Toggle on **Allow the cookie banner to be displayed to your users.**
de: Aktivieren Sie die Option **Die Anzeige des Cookie-Banners für Benutzer erlauben.**
es: Active el botón de alternancia **Permitir que el báner de cookies se muestre a los usuarios.**
fr: Activez l'option **Autoriser l'affichage de la bannière de cookies pour vos utilisateurs.**
nl: Toggle op **Toestaan dat de cookie banner weergegeven wordt aan uw gebruikers.**

source: Click **Save**.
de: Klicken Sie auf **Speichern**.
es: Haga clic en **Guardar**.
fr: Cliquez sur **Enregistrer**.
nl: Klik op **Opslaan**.

source: In the back office, go to **Look & feel** > **Theme**.
de: Öffnen Sie im Backoffice den Bereich **Aussehen & Eindruck** > **Thema**.
es: En el back office, vaya a **Apariencia** > **Tema**.
fr: Dans l'interface d'administration, accédez à **Apparence** > **Thème**.
nl: Ga in de back office naar **Look & feel** > **Thema**.

source: Select the **Footer** tab.
de: Wählen Sie die Registerkarte **Fußzeile**.
es: Seleccione la ficha **Pie de página**.
fr: Sélectionnez l'onglet **Pied de page**.
nl: Selecteer het tabblad **Footer**.

source: Add the ``##manage-cookies##`` placeholder to the footer configuration.
de: Fügen Sie den Platzhalter ``##manage-cookies##`` in die Fußzeilenkonfiguration ein.
es: Añada el marcador ``##manage-cookies##`` a la configuración del pie de página.
fr: Ajoutez l'espace réservé ``##manage-cookies##`` dans la configuration du pied de page.
nl: Voeg de vervanger ``##manage-cookies##`` toe aan de configuratie van de footer.

source: Click **Make live** to apply the configuration to your portal.
de: Klicken Sie auf **Liveschalten**, um die Konfiguration für Ihr Portal zu übernehmen.
es: Haga clic en **Activar** para aplicar la configuración al portal.
fr: Cliquez sur **Rendre cette version active** pour appliquer la configuration à votre portail.
nl: Klik op **Live maken** om de configuratie op uw portaal toe te passen.

source: Your portal will display the cookie banner upon visitors' first visit. Visitors will be able to activate some cookies rather than others. A link will also be displayed in your portal's footer so that visitors can manage their cookie preferences at any time.
de: Bei einem erstmaligen Besuch zeigt Ihr Portal das Cookie-Banner an. Besucher können einige Cookies aktivieren und deaktivieren. Außerdem wird ein Link in der Fußzeile Ihres Portals angezeigt, so dass Besucher ihre Cookie-Einstellungen jederzeit verwalten können.
es: El portal mostrará el báner de cookies a los visitantes en su primer acceso. Los visitantes podrán activar algunas cookies en lugar de otras. Asimismo, en el pie de página del portal aparecerá un enlace para que los visitantes puedan gestionar sus preferencias de cookies en cualquier momento.
fr: La bannière de cookies s'affichera pour les utilisateurs qui visitent le portail pour la première fois. Ils pourront sélectionner les cookies qu'ils souhaitent activer, et un lien sera également disponible dans le pied de page du portail, afin qu'ils puissent gérer à tout moment leurs préférences en matière de cookies.
nl: Uw portaal zal de cookie banner weergeven op het ogenblik van het eerste bezoek van bezoekers. Bezoekers zullen sommige cookies kunnen activeren en andere niet. Er zal ook een link staan in de footer van uw portaal zodat bezoekers te allen tijde hun cookievoorkeuren kunnen beheren.

source: Portal Terms and Conditions, Privacy Policy, and Cookies Policy
de: Geschäftsbedingungen des Portals, Datenschutzerklärung und Cookie-Richtlinie
es: Términos y condiciones, Política de privacidad y Política de cookies del portal
fr: Conditions d'utilisation du portail, politique de confidentialité et charte cookies
nl: Algemene voorwaarden van het portaal, privacybeleid en cookiebeleid

source: It is a legal obligation to specify the Terms and Conditions, the Privacy Policy, and the Cookies Policy of an Opendatasoft domain. Since there are none by default, each Opendatasoft domain administrator must specify these conditions of use, especially before opening the portal to all users.
de: Es ist eine gesetzliche Pflicht, die Geschäftsbedingungen, Datenschutzerklärung und Cookie-Richtlinie einer Opendatasoft-Domain anzugeben. Da es keine Standardversionen gibt, muss jeder Opendatasoft-Domain-Administrator diese Nutzungsbedingungen angeben, insbesondere bevor er das Portal für alle Benutzer freigibt.
es: Es un imperativo legal especificar los Términos y condiciones, la Política de privacidad y la Política de cookies de un dominio Opendatasoft. Dado que ninguno de estos elementos existe de forma predeterminada, son los administradores de los dominios Opendatasoft quienes deberán especificar estas condiciones de uso, sobre todo antes de abrir el portal a todos los usuarios.
fr: Indiquer les conditions d'utilisation, la politique de confidentialité et la charte cookies relatives à un domaine Opendatasoft constitue une obligation juridique. Étant donné qu'elles ne sont pas prévues par défaut, chaque administrateur de domaine Opendatasoft doit indiquer ces conditions d'utilisation, notamment avant d'ouvrir le portail à tous les utilisateurs.
nl: Het is een wettelijke verplichting om zowel de algemene voorwaarden, het privacybeleid en het cookiebeleid van een Opendatasoft-domein te specificeren. Aangezien er standaard geen zijn, moet elke beheerder van een Opendatasoft-domein deze gebruiksvoorwaarden specificeren, vooral alvorens het portaal voor alle gebruikers wordt opengesteld.

source: Accessing the Portal Terms and Conditions, Privacy Policy, and Cookies Policy
de: Zugriff auf die Geschäftsbedingungen des Portals, Datenschutzerklärung und Cookie-Richtlinie
es: Acceder a los Términos y condiciones, la Política de privacidad y la Política de cookies del portal
fr: Accéder aux conditions d'utilisation du portail, à la politique de confidentialité et à la charte cookies
nl: Toegang tot de algemene voorwaarden van het portaal, het privacybeleid en het cookiebeleid

source: Go to **Portal Terms and Conditions, Privacy Policy and Cookies Policy** section.
de: Öffnen Sie den Bereich **Geschäftsbedingungen des Portals, Datenschutzerklärung und Cookie-Richtlinie**.
es: Vaya a la sección **Términos y condiciones, Política de privacidad y Política de cookies del portal**.
fr: Rendez-vous dans la section **Conditions d'utilisation du portail, politique de confidentialité et charte cookies**.
nl: Ga naar de sectie **Algemene voorwaarden van het portaal, privacybeleid en cookiebeleid**

source: From this section, you can add the Terms and Conditions, Privacy Policy, and Cookies Policy on the domain, using links to pages hosted on a different website or directly entering custom text in the related boxes.
de: Hier können Sie Geschäftsbedingungen, die Datenschutzerklärung sowie die Cookie-Richtlinie der Domain hinzufügen. Hierzu können Sie Links zu Seiten verwenden, die auf einer anderen Website gehostet werden, oder einen eigenen Text direkt in die entsprechenden Felder eingeben.
es: En esta sección, puede añadir los Términos y condiciones, la Política de privacidad y la Política de cookies del dominio, utilizando vínculos a páginas alojadas en otro sitio web o directamente introduciendo texto personalizado en los cuadros correspondientes.
fr: Dans cette section, vous pouvez ajouter les conditions d'utilisation, la politique de confidentialité et la charte cookies sur le domaine en utilisant des liens vers des pages d'un autre site web ou en saisissant directement un texte personnalisé dans les champs associés.
nl: Vanuit deze sectie kunt u de algemene voorwaarden, het privacybeleid en het cookiebeleid op het domein toevoegen, door gebruik te maken van links naar pagina's die op een andere website worden gehost of door rechtstreeks aangepaste tekst in de betreffende vakken in te voeren.

source: For more information, see :ref:`linked-conditions` and :ref:`written-conditions`.
de: Weitere Informationen finden Sie unter :ref:`linked-conditions` und :ref:`written-conditions`.
es: Para obtener más información, consulte :ref:`linked-conditions` y :ref:`written-conditions`.
fr: Pour plus d'informations, consultez :ref:`linked-conditions` et :ref:`written-conditions`.
nl: Raadpleeg voor meer informatie :ref:`linked-conditions` en :ref:`written-conditions`.

source: Using links to pages hosted on a different website
de: Verwendung von Links zu Seiten auf einer anderen Website
es: Usar vínculos a páginas alojadas en otro sitio web
fr: Utiliser des liens vers des pages d'un autre site web
nl: Gebruik maken van links naar pagina's die op een andere website worden gehost

source: If the Terms and Conditions, Privacy Policy, and Cookies Policy are already hosted on another website, you can use links to these pages.
de: Wenn die Geschäftsbedingungen, Datenschutzerklärung und Cookie-Richtlinie bereits auf einer anderen Website gehostet werden, können Sie Links zu diesen Seiten verwenden.
es: Si los Términos y condiciones, la Política de privacidad y la Política de cookies ya están alojados en otro sitio web, puede usar vínculos a estas páginas.
fr: Si les conditions d'utilisation, la politique de confidentialité et la charte cookies sont déjà hébergées sur un autre site web, pouvez utiliser les liens vers ces pages.
nl: Als de algemene voorwaarden, het privacybeleid en het cookiebeleid reeds gehost worden op een andere website, dan kunt u links naar deze pagina's gebruiken.

source: From the **Portal Terms and Conditions, Privacy Policy and Cookies Policy section**, click **Use links to pages hosted on a different website**.
de: Klicken Sie in dem Bereich **Geschäftsbedingungen, Datenschutzerklärung und Cookie-Richtlinie** auf **Links zu Seiten auf einer anderen Website verwenden**.
es: En la sección **Términos y condiciones, Política de privacidad y Política de cookies del portal**, haga clic en **Usar vínculos a páginas alojadas en otro sitio web**.
fr: Dans la section **Conditions d'utilisation du portail, politique de confidentialité et charte cookies**, cliquez sur **Utiliser des liens vers des pages d'un autre site**.
nl: Vanuit de sectie **Algemene voorwaarden van het portaal, privacybeleid en cookiebeleid** klikt u op **Gebruik maken van links naar pagina's die op een andere website worden gehost**.

source: If the domain is available in more than one language, choose whether to display the conditions of use in only one language or to make them available in several languages:
de: Wenn die Domain in mehreren Sprachen verfügbar ist, wählen Sie, ob die Nutzungsbedingungen nur in einer Sprache oder in mehreren Sprachen angezeigt werden sollen:
es: Si el dominio está disponible en más de un idioma, elija si desea visualizar las condiciones de uso en un solo idioma o hacer que estén disponibles en varios idiomas:
fr: Si le domaine est disponible dans plusieurs langues, choisissez si vous souhaitez afficher les conditions d'utilisation dans une seule ou plusieurs langues :
nl: Wanneer het domein in meer dan één taal beschikbaar is: kies om ofwel de gebruiksvoorwaarden in slechts één taal weer te geven of om deze in verschillende talen beschikbaar te stellen:

source: Toggle on **Use the same texts for all languages** to use the same documents for all available languages. If the Terms and Conditions, Privacy Policy, and Cookies Policy are only written and available in the language of the portal country, for example, English, no matter the language selected by the user on the portal, the conditions of use will be displayed in English.
de: Wechseln Sie zu **Die gleichen Texte für alle Sprachen verwenden**, um dieselben Dokumente für alle verfügbaren Sprachen zu verwenden. Das bedeutet, wenn die Geschäftsbedingungen, die Datenschutzerklärung und die Cookie-Richtlinie nur in der Sprache des Landes verfügbar sind, in dem das Portal veröffentlicht wird - z.B. Englisch - werden die Nutzungsbedingungen unabhängig von der vom Benutzer auf dem Portal gewählten Sprache in Englisch angezeigt.
es: Active el botón de alternancia **Usar los mismos textos para todos los idiomas** para emplear los mismos documentos para todos los idiomas disponibles. Si los Términos y condiciones, la Política de privacidad y la Política de cookies solo estarán escritos y disponibles en el idioma del país del portal, por ejemplo inglés, independientemente del idioma que seleccione el usuario del portal, las condiciones de uso se visualizarán en inglés.
fr: Activez l'option **Utiliser les mêmes textes pour toutes les langues** pour utiliser les mêmes documents pour toutes les langues disponibles. Par exemple, si les conditions d'utilisation, la politique de confidentialité et la charte cookies sont écrites et disponibles uniquement dans la langue du pays du portail, l'anglais, les conditions d'utilisation seront affichées en anglais, quelle que soit la langue sélectionnée par l'utilisateur sur le portail.
nl: Vink het vakje **Gebruik dezelfde teksten voor alle talen** aan om dezelfde documenten voor alle beschikbare talen te gebruiken. Wanneer de algemene voorwaarden, het privacybeleid en het cookiebeleid enkel geschreven en beschikbaar zijn in de taal van het land van het portaal, bijv. het Engels, zullen de gebruiksvoorwaarden in het Engels worden weergegeven, ongeacht de taal die door de gebruiker op het portaal is geselecteerd.

source: Toggle off **Use the same texts for all languages** to specify different documents depending on the language. In that case, all available languages are displayed in the form of clickable grey boxes containing the code of each available language. The language codes are preceded by |icon-attention| if all documents have not been specified.
de: Deaktivieren Sie **Die gleichen Texte für alle Sprachen verwenden**, um je nach Sprache unterschiedliche Dokumente anzugeben. In diesem Fall werden alle verfügbaren Sprachen in Form von anklickbaren grauen Kästchen angezeigt, die den Code jeder verfügbaren Sprache enthalten. Den Sprachcodes ist |icon-attention| vorangestellt, wenn nicht alle Dokumente angegeben wurden.
es: Desactive el botón de alternancia **Usar los mismos textos para todos los idiomas** para especificar diferentes documentos en función del idioma. En ese caso, todos los idiomas disponibles se visualizarán en forma de casillas grises interactivas con el código de cada uno de los idiomas disponibles. Los códigos de idioma irán precedidos del icono |icon-attention| si no se han especificado todos los documentos.
fr: Désactivez l'option **Utiliser les mêmes textes pour toutes les langues** pour définir différents documents selon la langue. Dans ce cas, toutes les langues disponibles sont affichées sous la forme de cases grises contenant un code de langue et sur lesquelles vous pouvez cliquer. Les codes de langue sont précédés d'une icône |icon-attention| si tous les documents n'ont pas été spécifiés.
nl: Vink het vakje **Gebruik dezelfde teksten voor alle talen** uit om verschillende documenten te specificeren afhankelijk van de taal. In dat geval worden alle beschikbare talen weergegeven onder de vorm van grijze vakjes die kunnen worden aangevinkt en die de code van elke beschikbare taal bevatten. De taalcodes worden voorafgegaan door |icon-attention| wanneer niet alle documenten werden gespecificeerd.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: If you toggle off **Use the same texts for all languages**, repeat the following steps for each language. There must not be any |icon-attention| left.
de: Wenn Sie die Option **Die gleichen Texte für alle Sprachen verwenden** deaktivieren, sollten Sie die folgenden Schritte für jede Sprache wiederholen. Es darf kein |icon-attention| mehr vorhanden sein.
es: Si desactiva el botón de alternancia **Usar los mismos textos para todos los idiomas**, repita los pasos siguientes para cada uno de los idiomas. No puede quedar ningún icono |icon-attention|.
fr: Si vous désactivez l'option **Utiliser les mêmes textes pour toutes les langues**, répétez la procédure suivante pour chaque langue. Aucune icône |icon-attention| ne doit rester.
nl: Vinkt u **Gebruik dezelfde teksten voor alle talen** uit, herhaal dan de volgende stappen voor elke taal. Er mag geen |icon-attention| overblijven.
