Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/06_customizing_theme/theme.po
Languages: de, es, fr, it, nl

source: To collapse the header into a click-to-expand side menu below a certain viewport width, use the ``ods-responsive-menu`` directive.
de: Damit das Kopfzeile unter einem bestimmten Grenzwert der Anzeigebreite in ein aufklappbares Seitenmenü umgewandelt wird, verwenden Sie die Anweisung ``ods-responsive-menu``.
es: Para contraer el encabezado en un menú lateral de hacer clic para expandir por debajo de un ancho de ventanilla determinado, use la directiva ``ods-responsive-menu``.
fr: Pour réduire l'en-tête dans un menu latéral de type "cliquer pour développer" en dessous d'une certaine largeur de viewport, utilisez la directive ``ods-responsive-menu``.
nl: Om de koptekst te verkleinen in een click-to-expand zijmenu onder een bepaalde viewport-breedte, gebruik de ``ods-responsive-menu`` directief.

source: Placeholders can also be used when customizing the header and the footer: they will be replaced with the content specified in the domain customization options such as menu items, language selectors, and logos.
de: Bei der Personalisierung von Kopf- und Fußzeile können auch Platzhalter verwendet werden. Diese werden dann durch die in den Personalisierungsoptionen der Domain angegebenen Inhalte - wie Menü-Elemente, Sprachauswahl und Logos - ersetzt.
es: También se pueden usar marcadores de posición al personalizar el encabezado y el pie de página: estos se sustituirán por el contenido especificado en las opciones de personalización del dominio como elementos de menú, selectores de idiomas y logotipos.
fr: Des espaces réservés peuvent également être utilisés lors de la personnalisation de l'en-tête et du pied de page : ils seront remplacés par le contenu indiqué dans les options de personnalisation du domaine, comme les éléments du menu, les sélecteurs de langues et les logos.
nl: Er kunnen ook vervangers worden gebruikt bij het personaliseren van de koptekst en de voettekst: ze zullen vervangen worden door de inhoud die gespecificeerd staat in de personaliseringsopties, zoals menu-items, taalkiezers en logo's.

source: The following placeholders are available in the **Header** tab:
de: Folgende Platzhalter sind im Tab **Kopfzeile** verfügbar:
es: Los marcadores siguientes están disponibles en la ficha **Encabezado**:
fr: Les espaces réservés suivants sont disponibles dans l'onglet **En-tête** :
nl: De volgende vervangers zijn beschikbaar in het tabblad **Header**:

source: Placeholder
de: Platzhalter
es: Marcador de posición
fr: Espace réservé
nl: Vervanger

source: Main menu, with links to chosen pages
de: Hauptmenü, mit Links zu ausgewählten Seiten
es: Menú principal, con vínculos a páginas seleccionadas
fr: Menu principal, avec des liens vers des pages données
nl: Hoofdmenu met koppelingen naar gekozen pagina's

source: Menu containing links to login page and user account
de: Menü mit Links zur Anmeldeseite und zum Nutzerkonto
es: Menú con vínculos a la página de inicio de sesión y cuenta de usuario
fr: Menu contenant des liens vers la page de connexion et le compte utilisateur
nl: Menu met koppelingen naar de inlogpagina en het gebruikersaccount

source: Portal logo configured in Branding
de: Im Branding konfiguriertes Portal-Logo
es: Logotipo de portal configurado en Personalización de marca
fr: Logo du portail configuré dans Personnalisation
nl: In Branding geconfigureerd portaallogo

source: Portal brand configured in Branding
de: Im Branding konfigurierte Portal-Marke
es: Marca de portal configurada en Personalización de marca
fr: Marque du portail configurée dans Personnalisation
nl: In Branding geconfigureerd portaalmerk

source: Links to change the language of the portal
de: Links, um die Sprache des Portals zu ändern
es: Vínculos para cambiar el idioma del portal
fr: Liens pour modifier la langue du portail
nl: Koppelingen om de taal van het portaal te wijzigen

source: The following placeholders are available in the **Footer** tab:
de: Folgende Platzhalter sind im Tab **Fußzeile** verfügbar:
es: Los marcadores siguientes están disponibles en la ficha **Pie de página**:
fr: Les espaces réservés suivants sont disponibles dans l'onglet **Pied de page** :
nl: De volgende vervangers zijn beschikbaar in het tabblad **Footer**:

source: Link to the Terms & Conditions defined for the portal, configured in Legals
de: Link zu den für das Portal festgelegten Geschäftsbedingungen, die im Bereich Rechtliches konfiguriert wurden
es: Vínculo a los Términos y condiciones definidos para el portal, configurado en Legal
fr: Lien vers les conditions d'utilisation définies pour le portail, configuré dans Mentions légales
nl: Koppeling naar de Algemene Voorwaarden zoals gedefinieerd voor het portaal en geconfigureerd in Legals

source: Link for users to modify their cookies preferences. This placeholder is mandatory to enable the cookie banner. For more information, see :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
de: Link für Benutzer, um ihre Cookie-Einstellungen zu ändern. Dieser Platzhalter ist erforderlich, um das Cookie-Banner zu aktivieren. Für weitere Informationen, siehe :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
es: Enlace para que los usuarios modifiquen sus preferencias de cookies. Este marcador es obligatorio para habilitar el báner de cookies. Para obtener más información, consulte :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
nl: Link voor gebruikers om hun cookievoorkeuren te wijzigen. Deze vervanger is verplicht om de cookie banner te activeren. Voor meer informatie, zie :doc:`../../../configuring_domain/02_managing_legal_information/legals`.

source: Language picker for the languages specified for the portal
de: Sprachauswahl für die für das Portal festgelegten Sprachen
es: Selector de idiomas para los idiomas especificados del portal
fr: Sélecteur de langues pour les langues spécifiées dans le portail
nl: Taalkiezer voor de voor het portaal gespecificeerde talen

source: Opendatasoft logo
es: el logotipo Opendatasoft
fr: Logo Opendatasoft

source: JavaScript is not allowed for security reasons.
de: JavaScript ist aus Sicherheitsgründen nicht gestattet.
es: JavaScript no está permitido por motivos de seguridad.
fr: Pour des raisons de sécurité, Javascript n'est pas autorisé.
nl: Omwille van veiligheidsredenen is JavaScript niet toegelaten.

source: Catalog card
de: Katalog-Karte
es: Tarjeta de catálogo
fr: Carte de catalogue
it: Scheda del catalogo
nl: Cataloguskaart

source: The **Catalog card** tab displays an editor in which to add pure HTML. It allows to customize the catalog cards displayed in the catalog of the portal, which represent the published datasets of that portal (see :ref:`Exploring a dataset from the catalog <exploring_dataset>`).
de: Der Tab **Katalog-Karte** zeigt einen HTML-Editor an. Dieser ermöglicht die Personalisierung der im Portal-Katalog angezeigten Katalog-Karten, die die veröffentlichten Datensätze des Portals darstellen (siehe :ref:`Einen Datensatz aus dem Katalog untersuchen <exploring_dataset>`).
es: La ficha **Tarjeta de catálogo** muestra un editor donde añadir código HTML puro. Permite personalizar las tarjetas de catálogo visualizadas en el catálogo del portal, que representan los conjuntos de datos publicados de ese portal (consulte :ref:`Explorar un conjunto de datos del catálogo <exploring_dataset>`).
fr: L'onglet **Carte de catalogue** affiche un éditeur dans lequel vous pouvez ajouter du code HTML pur. Il vous permet de personnaliser les cartes de catalogue présentes dans le catalogue du portail et représentant les jeux de données publiés de ce portail (voir :ref:`Explorer un jeu de données depuis le catalogue <exploring_dataset>`).
nl: In het tabblad **Cataloguskaart** staat een editor waaraan zuivere HTML kan worden toegevoegd. Dit laat toe de cataloguskaarten die weergegeven staan in de catalogus van het portaal, die de gepubliceerde datasets weergeeft van dat portaal, te personaliseren (zie :ref:`Een dataset uit de catalogus onderzoeken<exploring_dataset>`).

source: The following directives allow to retrieve information related to a dataset, which could be included in the catalog card.
de: Die folgenden Anweisungen ermöglichen den Abruf von Informationen im Zusammenhang mit dem Datensatz, die in die Katalog-Karte integriert werden können.
es: Las directivas siguientes permiten recuperar información acerca de un conjunto de datos, que podría incluirse en la tarjeta de catálogo.
fr: Les directives suivantes permettent de récupérer des informations associées à un jeu de données, qui peuvent être incluses dans la carte de catalogue.
nl: De volgende richtlijnen laten toe informatie met betrekking tot een dataset terug te vinden die zou kunnen worden opgenomen in de cataloguskaart.

source: Directives used in the Catalog card tab come with a standard style, which can be modified in the :ref:`Stylesheet <stylesheet>` tab.
de: Die im Tab Katalog-Karte verwendeten Anweisungen verfügen über einen Standardstil, der im :ref:`Stylesheet <stylesheet>`-Tab geändert werden kann.
es: Las directivas empleadas en la ficha Tarjeta de catálogo se presentan con un estilo estándar, que se puede modificar en la ficha :ref:`Hoja de estilos <stylesheet>`.
fr: Les directives utilisées dans l'onglet Carte de catalogue ont un style standard, qui peut être modifié dans l'onglet :ref:`Feuille de style <stylesheet>`.
nl: Richtlijnen die gebruikt worden in de Cataloguskaart gaan gepaard met een standaardstijl die gewijzigd kan worden in het tabblad :ref:`Stijlblad <stylesheet>`.

source: Directive
de: Anweisung
es: Directiva
nl: Richtlijn

source: **Mandatory**. Wraps the whole catalog card for the other directives to work
de: **Mandatory**. Umfasst die gesamte Katalog-Karte, damit die anderen Anweisungen funktionieren
es: **Obligatorio**. Envuelve la tarjeta de catálogo completa para que las demás directivas funcionen.
fr: **Obligatoire**. Enveloppe toute la carte de catalogue pour que les autres directives fonctionnent
nl: **Verplicht**. Omvat de volledige cataloguskaart opdat de andere richtlijnen kunnen werken

source: Retrieves the dataset's theme and includes the related icon
de: Ruft das Thema des Datensatzes ab und beinhaltet das zugehörige Icon
es: Recupera el tema del conjunto de datos e incluye el icono relacionado.
fr: Récupère le thème du jeu de données et inclut l'icône associée
nl: Zoekt het thema van de dataset op en integreert het relevante pictogram

source: Provides useful style and behavior handling edge cases (for example, datasets without records)
de: Stellt nützliche Stile und Verhaltensweisen für Grenzfälle zur Verfügung (wie etwa Datensätze ohne Einträge)
es: Proporciona casos extremos de gran utilidad relacionados con el estilo y el comportamiento (por ejemplo, conjuntos de datos sin registros).
fr: Offre des solutions pour mettre en forme et gérer les situations complexes (par exemple, jeux de données sans enregistrements)
nl: Voorziet nuttige stijl- en gedragsregels (bijv. datasets zonder records, …)

source: Retrieves the title of the dataset
de: Ruft den Titel des Datensatzes ab
es: Recupera el título del conjunto de datos.
fr: Récupère le titre du jeu de données
nl: Zoekt de titel van de dataset op

source: Retrieves the description of the dataset
de: Ruft die Beschreibung de Datensatzes ab
es: Recupera la descripción del conjunto de datos.
fr: Récupère la description du jeu de données
nl: Zoekt de omschrijving van de dataset op

source: Retrieves the keywords defined for the dataset
de: Ruft die für den Datensatz definierten Stichwörter ab
es: Recupera las palabras clave definidas para el conjunto de datos.
fr: Récupère les mots-clés définis pour le jeu de données
nl: Zoekt de trefwoorden op zoals die gedefinieerd zijn voor de dataset

source: Takes an ``item-key`` and an ``item-title`` attributes. It retrieves a metadata property matching the ``item-key`` (see table below) from the dataset and includes it in the page using ``item-title`` as its label. It should be wrapped by a ``.ods-catalog-card__metadata`` element for better styling but with no obligation.
de: Nimmt eine ``item-key``-Eigenschaft und eine ``item-title``-Eigenschaft an. Ruft eine Metadaten-Eigenschaft ab, die mit dem ``item-key`` aus dem Datensatz übereinstimmt (siehe Tabelle unten) und fügt sie unter Verwendung von ``item-title`` als Beschriftung in die Seite ein. Sollte für eine optimierte Darstellung von einem ``.ods-catalog-card__metadata``-Element umgeben sein.
es: Toma un atributo ``item-key`` y un atributo ``item-title``. Recupera una propiedad de metadatos coincidente con ``item-key`` (consulte la tabla siguiente) del conjunto de datos y la incluye en la página utilizando ``item-title`` como etiqueta. Por una cuestión de estilo, se recomienda envolverla con un elemento ``.ods-catalog-card__metadata``, aunque no es obligatorio.
fr: Prend des attributs ``item-key``et ``item-title``, récupère une propriété de métadonnées correspondant à ``item-key`` (voir le tableau ci-dessous) dans le jeu de données et l'inclut dans la page en utilisant ``item-title`` comme label. Pour améliorer le style, vous pouvez l'envelopper dans un élément ``.ods-catalog-card__metadata``, mais ce n'est pas obligatoire.
nl: Neemt een ``item-key`` en een ``item-title`` attribuut, zoekt een metadataeigenschap die overeenstemt met het ``item-key`` (zie onderstaande tabel) uit de dataset en integreert deze in de pagina met ``item-title`` als het label ervan. Het dient omwikkeld te worden door middel van een ``.ods-catalog-card__metadata`` element voor een betere styling maar zonder enige verplichting.

source: Example: ``<ods-catalog-card-metadata-item item-title="Data" item-key="records_count"></ods-catalog-card-metadata-item>``
de: Beispiel: ``<ods-catalog-card-metadata-item item-title="Data" item-key="records_count"></ods-catalog-card-metadata-item>``
es: Ejemplo: ``<ods-catalog-card-metadata-item item-title="Data" item-key="records_count"></ods-catalog-card-metadata-item>``
fr: Exemple : ``<ods-catalog-card-metadata-item item-title="Data" item-key="records_count"></ods-catalog-card-metadata-item>``
nl: Voorbeeld: ``<ods-catalog-card-metadata-item item-title="Data" item-key="records_count"></ods-catalog-card-metadata-item>``

source: The table below lists all available metadata item keys:
de: Die Tabelle unten listet alle verfügbaren Metadaten-Element-Keys auf:
es: La tabla siguiente indica todas las claves de elementos de metadatos disponibles:
fr: Le tableau ci-dessous répertorie toutes les clés d'objet de métadonnées disponibles :
nl: In onderstaande tabel wordt een lijst gegeven van alle beschikbare metadata-itemsleutels:

source: Item key
de: Element-Key
es: Clave de elemento
fr: Clé d'objet
it: Chiave dell'elemento (item key)
nl: Itemsleutel

source: License (will be rendered as a link if possible)
de: Lizenz (wird als Link wiedergegeben, falls möglich)
es: Licencia (se presentará como vínculo si es posible).
fr: Licence (affichée sous forme de lien si possible)
it: Licenza (quando possibile, viene visualizzata sotto forma di link)
nl: Licentie (zal indien mogelijk aangeleverd worden als een koppeling)

source: Content language
de: Content-Sprache
es: Idioma del contenido.
fr: Langue du contenu
it: Lingua del contenuto
nl: Taal van de inhoud

source: Date of last modification
de: Datum der letzten Änderung
es: Fecha de la última modificación.
fr: Date de dernière modification
it: Data dell'ultima modifica
nl: Datum van laatste wijziging

source: Publisher's name
de: Veröffentlicher
es: Nombre del publicador.
fr: Nom du producteur
it: Nome dell'entità di pubblicazione
nl: Naam van de uitgever

source: Link to the original source of the data
de: Link zur Original-Datenquelle
es: Vínculo con el origen de los datos original.
fr: Lien vers la source originale des données
it: Link alla sorgente di origine dei dati
nl: Koppeling naar de oorspronkelijke born van de data

source: Link to the ODI certificate
de: Link zum ODI-Zertifikat
es: Vínculo con el certificado ODI.
fr: Lien vers le certificat ODI
it: Link al certificato ODI
nl: Koppeling naar het ODI-certificaat

source: Number of records in the dataset (regardless of filters)
de: Anzahl Einträge im Datensatz (unabhängig von Filtern)
es: Número de registros del juego de datos (al margen de los filtros).
fr: Nombre d'enregistrements dans le jeu de données (indépendamment des filtres)
it: Numero dei record del dataset (a prescindere dai filtri)
nl: Aantal records in de dataset (ongeacht filters)

source: Names of the data owner
de: Namen der Dateneigentümer
es: Nombres del propietario de los datos.
fr: Noms des propriétaires des données
it: Nomi dei proprietari dei dati
nl: Namen van de eigenaar van de data

source: For federated datasets only, the name of the domain the dataset comes from
de: Nur für verbundene Datensätze, der Domain-Name stammt aus
es: Solo para los juegos de datos federados, nombre del dominio del cual procede el juego de datos.
fr: Pour les jeux de données fédérés uniquement, le nom du domaine duquel provient le jeu de données
it: Nome del dominio da cui proviene il dataset (solo per dataset federati)
nl: Enkel voor samengevoegde datasets, de naam van het domein waar de dataset van afkomstig is

source: For federated datasets only, the original title of the dataset on its source domain
de: Der Original-Titel des Datensatzes an seiner Quelldomain, nur für verbundene Datensätze
es: Solo para los juegos de datos federados, título original del juego de datos en su dominio de origen.
fr: Pour les jeux de données fédérés uniquement, le titre d'origine du jeu de données sur son domaine source
it: Titolo del dataset nel suo dominio di origine (solo per dataset federati)
nl: Enkel voor samengevoegde datasets, de oorspronkelijke titel van de dataset op het brondomein ervan

source: For federated datasets only, the original identifier of the dataset on its source domain
de: Der Originalbezeichner des Datensatzes an seiner Quell-Domain, nur für verbundene Datensätze
es: Solo para los juegos de datos federados, identificador original del juego de datos en su dominio de origen.
fr: Pour les jeux de données fédérés uniquement, l'identifiant d'origine du jeu de données sur son domaine source
it: Identificatore del dataset nel suo dominio di origine (solo per dataset federati)
nl: Enkel voor samengevoegde datasets, de oorspronkelijke identifier van de dataset op het brondomein ervan

source: Number of data downloads for this dataset
de: Anzahl der Daten-Downloads für diesen Datensatz
es: Número de descargas de datos para este juego de datos.
fr: Nombre de téléchargements de données pour ce jeu de données
it: Numero dei download di dati per questo dataset
nl: Aantal downloads van data voor deze dataset

source: Information
nl: Informatie

source: ``license``
nl: ``licentie``

source: ``references``
nl: ``referenties``

source: ``attributions``
nl: ``attributen``

source: Customizing theme and portal icon
it: Personalizzazione del tema e dell'icona del portale

source: The theme customization is not available on freemium domains (created through the `Try it for free <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ page on `OpenDataSoft's website <https://www.opendatasoft.com>`_). If your domain is a freemium domain and would like to get this theme feature, `email us! <sales@opendatasoft.com>`_
it: La personalizzazione dei temi non è disponibile nei domini "freemium" (cioè attivati gratuitamente nella pagina `Scopri OpenDataSoft <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ del nostro `sito <https://www.opendatasoft.com>`_). Se il tuo è un dominio "freemium" e desideri ottenere questa funzionalità, `ti preghiamo di inviarci un'e-mail <sales@opendatasoft.com>`_.

source: OpenDataSoft's theme management interface can be found in the domain back-office. In order to access it, you'll have to click the ``Look & feel`` section in the navigation bar and then on the ``theme`` link.
it: L'interfaccia di gestione dei temi si trova nel back-office del dominio. Per accedervi, clicca sulla sezione ``Look & feel`` del menu di navigazione e poi su ``Tema``.

source: Using the various forms available in this page, you'll be able to customize every aspect of your portal, from basic colors to making major changes in its layout.
it: Tramite i vari moduli presenti su questa pagina, potrai personalizzare ogni aspetto del tuo portale, dai colori di base fino alle più importanti opzioni di layout.

source: Versioning
it: Creazione di più versioni

source: Before diving into the many ways to customize the portal's theme, it is very important to stress that everything you will do on this page is versioned. This is to say that your work has a version number assigned to it and you can at any moment create a new version. You'll always be working on the latest version (think of it as your working draft), but can make any version live (that is, apply it to your portal). Were you to make the latest version live, a new one would be created and would become your new working draft. Only the latest version can be edited; all previous ones are read-only.
it: Prima di affrontare le numerose personalizzazioni disponibili per i temi del portale, è importante sapere che ogni modifica effettuata su questa pagina genererà una nuova versione. In altri termini, a ogni intervento viene assegnato un numero che permette di creare in qualsiasi momento una nuova versione del tema. Anche se lavorerai sempre sull'ultima disponibile (considerala come una bozza), puoi decidere di mettere online qualunque versione, applicandola al tuo portale. Se metti online l'ultima creata, ne viene generata subito un'altra in qualità di bozza, pronta per essere modificata. Solo l'ultima versione può essere modificata, mentre tutte le altre sono disponibili unicamente in sola lettura.

source: While working on the latest version, you can preview your changes by clicking the ``Preview`` button. This will open a new window containing your portal with the current version of the theme applied to it.
it: Mentre lavori sull'ultima versione, puoi farti un'idea delle modifiche cliccando sul pulsante ``Anteprima``. Si aprirà una nuova finestra, con la versione del portale con il tema modificato.

source: Only users able to edit the domain properties can preview the latest theme version. If you were to share the URL of the preview with other users, they won't see any difference in the live version.
it: Solo gli utenti autorizzati a modificare le proprietà del dominio possono visualizzare l'anteprima dell'ultima versione di un tema. Se ad esempio condividi l'URL dell'anteprima con altri utenti, questi ultimi non noteranno alcuna differenza con la versione online.

source: You can preview the latest version of the theme at any moment and on any given page on the portal's front-office by adding the ``stage_theme=true`` parameter to the URL.
it: Puoi visualizzare l'anteprima dell'ultima versione in qualsiasi momento e in qualsiasi pagina dell'interfaccia front-office del portale aggiungendo all'URL il parametro ``stage_theme=true``.

source: The version selector will tell you explicitly if you're working on the latest version or rather viewing a previous one, as well as which version is live.
it: Grazie all'apposito menu a tendina, potrai sempre sapere se stai lavorando all'ultima versione o se ne stai visualizzando una precedente, oltre a conoscere la versione al momento online.

source: Customization options
it: Opzioni di personalizzazione
