Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/06_customizing_theme/theme.po
Languages: de, es, fr, it, nl

source: Customizing portal themes
de: Anpassen von Portal-Themen
es: Personalizar los temas del portal
fr: Personnaliser les thèmes du portail
nl: Portaalthema's personaliseren

source: The default theme of all Opendatasoft portals can be entirely customized, not only in terms of layout and colors but also regarding specific areas such as header, footer, and catalog cards. Theme configurations and managed from the **Look & feel > Theme** subsection of the back office.
de: Das Standard-Thema aller Opendatasoft-Portale kann vollständig angepasst werden, nicht nur in Bezug auf Layout und Farben, sondern auch in allen Teilbereichen wie Kopf- und Fußzeilen sowie Katalog-Karten. Themen-Konfigurationen werden über den Unterabschnitt **Aussehen & Eindruck > Thema** im Backoffice verwaltet.
es: El tema predeterminado de todos los portales de Opendatasoft se puede personalizar por completo, no solo en cuanto a diseño y colores sino también en relación con áreas concretas como encabezado, pie de página y tarjetas de catálogo. Las configuraciones del tema se gestionan en la subsección **Apariencia > Tema** del back office.
fr: Le thème par défaut de tous les portails Opendatasoft peut être entièrement personnalisé : vous pouvez modifier la disposition, les couleurs, mais aussi des zones spécifiques comme les en-têtes, les pieds de page et les cartes de catalogue. Les configurations du thème sont gérées depuis la sous-section **Apparence > Thème** de l'interface d'administration.
nl: Het standaard thema van alle Opendatasoft-portalen kan volledig worden gepersonaliseerd, niet enkel in termen van lay-out en kleuren, maar ook met betrekking tot specifieke ruimten, zoals header, footer en cataloguskaarten. Themaconfiguraties worden beheerd vanuit de subrubriek **Look & Feel > Thema** van de back-office.

source: The Theme interface comprises 3 main blocks.
de: Drei Haupt-Bausteine machen die Themen-Benutzeroberfläche aus:
es: La interfaz Tema consta de 3 grandes bloques.
fr: L'interface Thème se compose de 3 blocs principaux.
nl: De interface Thema omvat 3 belangrijke blokken.

source: The header (1) which displays not only the title of the interface but also a *Current action* drop-down menu to manage versioning (see :ref:`Versioning themes <theme_versioning>`). 3 important buttons are also displayed in the header:
de: Die Kopfzeile (1), in der nicht nur der Titel der Oberfläche angezeigt wird, sondern auch ein Dropdown-Menü *Aktuelle Aktion*, um verschiedene Versionen zu verwalten (siehe :ref:`Versionierung von Themen <theme_versioning>`). Außerdem befinden sich drei wichtige Buttons in der Kopfzeile:
es: El encabezado (1), que no solo muestra el título de la interfaz sino también un menú desplegable *Acción actual* para gestionar la asignación de versiones (consulte :ref:`Versiones de temas <theme_versioning>`). En el encabezado también aparecen 3 botones importantes:
fr: L'en-tête (1), qui affiche le titre de l'interface et un menu déroulant *Action en cours* pour gérer le versionnage (voir :ref:`Versionner des thèmes <theme_versioning>`). 3 boutons importants sont également présents dans l'en-tête :
nl: De header (1), waarin niet enkel de titel van de interface wordt weergegeven, maar ook een drop-down menu Huidige actie voor het versiebeheer (zie :ref:`Versiebeheer thema's <theme_versioning>`). In de header worden ook 3 belangrijke knoppen weergegeven:

source: Save, to save the new configurations
de: Speichern, um neue Konfigurationen zu speichern
es: Guardar, para guardar las nuevas configuraciones
fr: Enregistrer, pour enregistrer les nouvelles configurations
nl: Opslaan, om de nieuwe configuraties op te slaan

source: Preview, to open in a new tab the Opendatasoft portal with the newly applied configurations
de: Vorschau, um das Opendatasoft-Portal mit den aktualisierten Konfigurationen in einem neuen Tab zu öffnen
es: Vista previa, para abrir en una nueva ficha el portal de Opendatasoft con las nuevas configuraciones aplicadas.
fr: Aperçu, pour ouvrir le portail Opendatasoft avec les configurations nouvellement appliquées dans un nouvel onglet
nl: Voorbeeldweergave, om in een nieuw tabblad het Opendatasoft-portaal te openen met de nieuw toegepaste configuraties

source: Make live, to define the newly applied configurations as the new, live theme available on the Opendatasoft portal
de: Liveschalten, um die aktualisierten Konfigurationen als neues Live-Thema zu definieren und auf dem Opendatasoft-Portal verfügbar zu machen
es: Activar, para definir las nuevas configuraciones aplicadas como el nuevo tema activo disponible en el portal de Opendatasoft
fr: Rendre cette version active, pour définir les configurations nouvellement appliquées en tant que nouveau thème actif disponible sur le portail Opendatasoft
nl: Live maken, om de nieuw toegepaste configuraties te definiëren als het nieuw, live thema dat beschikbaar is op het Opendatasoft-portaal

source: The **API key for offline development** management block (2), which allows the use and generation of new API keys (see note right below for more information).
de: Der Baustein zur Verwaltung der **API-Schlüssel für die Offline-Entwicklung** (2), der die Verwendung und Generierung neuer API-Schlüssel ermöglicht (für zusätzliche Informationen beachten Sie den Hinweis weiter unten).
es: El bloque de gestión **Clave de API para desarrollo sin conexión en línea** (2), que permite usar y generar nuevas claves de API (consulte la nota siguiente para obtener más información).
fr: Le bloc de gestion **Clé d'API pour le développement hors connexion** (2), qui permet d'utiliser et de générer de nouvelles clés d'API (voir la remarque ci-dessous pour plus d'informations).
nl: Het beheerblok **API-sleutel voor offline ontwikkeling** (2), dat toelaat nieuwe API-sleutels te gebruiken en aan te maken (zie toelichting net hieronder voor meer informatie).

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: It is possible to create stylesheets outside the platform, with any standard web developing tool, and to push them to the platform using an API key. For an easier and quicker usage, the `Opendatasoft Portal Development Kit <https://github.com/opendatasoft/ods-portal-devkit>`_ is at disposal: it is an open-source project created by Opendatasoft that can be downloaded on Github.
de: Es ist möglich, Stylesheets außerhalb der Plattform mit einem beliebigen Standardwerkzeug zur Webentwicklung zu erstellen und sie durch die Verwendung eines API-Schlüssels auf die Plattform zu übertragen. Für eine schnellere und einfachere Nutzung steht das `OpenDataSoft-Portal-Entwicklungskit <https://github.com/opendatasoft/ods-portal-devkit>`_ zur Verfügung: ein von Opendatasoft erstelltes Open-Source-Projekt, das über Github heruntergeladen werden kann.
es: Se pueden crear hojas de estilo fuera de la plataforma con cualquier herramienta de desarrollo web estándar e insertarlas en la plataforma por medio de una clave de API. Para un uso más rápido y sencillo, dispone del `Opendatasoft Portal Development Kit <https://github.com/opendatasoft/ods-portal-devkit>`_, un proyecto de código abierto creado por Opendatasoft que se puede descargar en Github.
fr: Vous avez la possibilité de créer des feuilles de style en dehors de la plateforme (avec un outil de développement web standard, par exemple) et de les transmettre à la plateforme via une clé d'API. Pour une utilisation simplifiée et plus rapide, le `kit de développement du portail Opendatasoft <https://github.com/opendatasoft/ods-portal-devkit>`_ est à votre disposition : il s'agit d'un projet open source créé par Opendatasoft et téléchargeable sur Github.
nl: Het is mogelijk stijlbladen buiten het platform aan te maken met om het even welke standaard web ontwikkelingstool en deze naar het platform te pushen met behulp van een API-sleutel. Voor een eenvoudiger en sneller gebruik is de `Opendatasoft Portal Development Kit <https://github.com/opendatasoft/ods-portal-devkit>`_ beschikbaar: het is een open source-project dat aangemaakt is door Opendatasoft en dat op Github kan worden gedownload.

source: To find and use a theme API key, click on the **API key for offline development** block to expand it. The current API key is displayed in the block, ready to be copied and used.
de: Um den API-Schlüssel eines Themas zu finden und zu nutzen, klicken Sie auf den Baustein *API-Schlüssel für die Offline-Entwicklung**. Der ausgeklappte Baustein zeigt dann den aktuellen API-Schlüssel an, der direkt kopiert und verwendet werden kann.
es: Para encontrar y usar una clave de API del tema, haga clic en el bloque **Clave de API para desarrollo sin conexión en línea** para expandirlo. La clave de API actual aparecerá en el bloque, lista para copiar y usar.
fr: Pour chercher et utiliser une clé d'API de thème, cliquez sur le bloc **Clé d'API pour le développement hors connexion** pour le développer. La clé d'API actuelle s'affiche dans le bloc pour que vous puissiez la copier et l'utiliser.
nl: Om de API-sleutel van een thema terug te vinden en te gebruiken, klik op het blok **API-sleutel voor offline ontwikkeling** om deze te vergroten. De huidige API-sleutel staat weergegeven in het blok en is klaar om te worden gekopieerd en gebruikt.

source: It is also possible to generate a new API key by clicking on the Generate new key button. However, be careful when generating new API keys: only the current one can be used, which means that generating a new API key revokes all previous ones.
de: Es ist auch möglich, durch einen Klick auf den Button "Neuen Schlüssel generieren" einen neuen API-Schlüssel zu generieren. Seien Sie jedoch vorsichtig bei der Generierung neuer API-Schlüssel: Nur der jeweils aktuelle kann verwendet werden, das heißt, durch die Generierung eines neuen API-Schlüssels werden alle vorherigen widerrufen.
es: También es posible generar una nueva clave de API haciendo clic en el botón Generar clave nueva. Sin embargo, tenga cuidado al generar nuevas claves de API: solo se puede usar la actual, lo que significa que al generar una nueva clave de API se revocan todas las anteriores.
fr: Vous pouvez également générer une nouvelle clé d'API en cliquant sur le bouton Générer une nouvelle clé. Faites toutefois preuve de vigilance lorsque vous générez de nouvelles clés d'API : seule la clé actuelle peut être utilisée, ce qui signifie que la génération d'une nouvelle clé d'API révoque toutes les clés précédentes.
nl: Het is ook mogelijk om een nieuwe API-sleutel aan te maken door te klikken op de knop "Nieuwe sleutel aanmaken". Wees echter voorzichtig wanneer u nieuwe API-sleutels aanmaakt: enkel de huidige kan worden gebruikt. Dit betekent dat door het aanmaken van een nieuwe API-sleutel alle vorige worden herroepen.

source: A block of 6 tabs (3), each one allowing to configure a part of an Opendatasoft portal theme (see :ref:`Customizing a portal theme <theme_customization>`):
de: Ein Baustein mit sechs Tabs (3), die jeweils ermöglichen, einen Teil eines Opendatasoft-Portal-Themas zu konfigurieren (siehe :ref:`Anpassung eines Portal-Themas <theme_customization>`):
es: Un bloque de 6 fichas (3), cada una de las cuales permite configurar una parte del tema de portal de Opendatasoft (consulte :ref:`Personalizar un tema de portal <theme_customization>`):
fr: Un bloc de 6 onglets (3), qui permettent de configurer une partie d'un thème du portail Opendatasoft (voir :ref:`Personnaliser un thème du portail <theme_customization>`) :
nl: Een blok met 6 tabbladen (3). Elk ervan laat toe om een deel van het thema van een Opendatasoftportaal te configureren (zie :ref:`Een portaalthema personaliseren <theme_customization>`):

source: :ref:`Layout options <layout_options>`, to modify the general layout of the portal
de: :ref:`Layout-Optionen<layout_options>`, um das allgemeine Layout des Portals zu verändern
es: :ref:`Opciones de diseño <layout_options>`, para modificar el diseño del portal
fr: :ref:`Options de disposition <layout_options>`, pour modifier la disposition générale du portail
nl: :ref:`Lay-outopties <layout_options>`, om de algemene lay-out van het portaal te wijzigen

source: :ref:`Colors <colors>`, to change colors of backgrounds, texts, borders, links, etc.
de: :ref:`Farben<colors>`, um die Farben für Hintergründe, Texte, Rahmen, Links etc. zu verändern
es: :ref:`Colores <colors>`, para cambiar los colores de fondos, textos, bordes, vínculos, etc.
fr: :ref:`Couleurs <colors>`, pour changer les couleurs des fonds, des textes, des bordures, des liens, etc.
nl: :ref:`Kleuren <colors>`, om de kleuren van achtergronden, teksten, randen, koppelingen, enz. te wijzigen

source: :ref:`Stylesheet <stylesheet>`, to add more style to the portal with CSS
de: :ref:`Stylesheet <stylesheet>`, um dem Portal mithilfe von CSS einen eigenen Stil zu verleihen
es: :ref:`Hoja de estilos <stylesheet>`, para añadir más estilos al portal con CSS
fr: :ref:`Feuille de style <stylesheet>`, pour ajouter davantage de style au portail avec CSS
nl: :ref:`Stijlblad <stylesheet>`, om meer stijl aan het portaal toe te voegen met CSS

source: :ref:`Header <header_footer>`, to modify the header with HTML code
de: :ref:`Kopfzeile <header_footer>`, um die Kopfzeile mithilfe von HTML-Code zu verändern
es: :ref:`Encabezado <header_footer>`, para modificar el encabezado con código HTML
fr: :ref:`En-tête <header_footer>`, pour modifier l'en-tête avec du code HTML
nl: :ref:`Header <header_footer>`, om de header te wijzigen met HTML-code

source: :ref:`Footer <header_footer>`, to modify the footer with HTML code
de: :ref:`Fußzeile<header_footer>`, um die Fußzeile mithilfe von HTML-Code zu verändern
es: :ref:`Pie de página <header_footer>`, para modificar el pie de página con código HTML
fr: :ref:`Pied de page <header_footer>`, pour modifier le pied de page avec du code HTML
nl: :ref:`Footer <header_footer>`, om de footer te wijzigen met HTML-code

source: :ref:`Catalog card <catalog_card>`, to modify the catalog cards with HTML code
de: :ref:`Katalog-Karte<header_footer>`, um die Katalog-Karten mithilfe von HTML-Code zu verändern
es: :ref:`Tarjeta de catálogo <catalog_card>`, para modificar las tarjetas de catálogo con código HTML
fr: :ref:`Carte de catalogue <catalog_card>`, pour modifier les cartes de catalogue avec du code HTML
nl: :ref:`Cataloguskaart <catalog_card>`, om de cataloguskaarten te wijzigen met HTML-code

source: Versioning themes
de: Versionierung von Themen
es: Asignar versiones a temas
fr: Versionner des thèmes
nl: Versiebeheer van thema's

source: Portal themes are versioned, which means that each customized new theme has a version number assigned to it. Once a theme is finished and made live, another version is automatically created: it is the new draft theme on which to work until it is ready to be live.
de: Portal-Themen sind versioniert. Das bedeutet, dass jedem angepassten neuen Thema eine Versionsnummer zugewiesen wird. Wenn ein Thema fertiggestellt und livegeschaltet wurde, wir automatisch eine weitere Version erzeugt: Diese stellt die neue Entwurfsversion dar, an der an einem neuen Thema gearbeitet werden kann, bis es bereit für die Freischaltung ist.
es: A los temas de portal se les asignan versiones, lo que significa que cada nuevo tema personalizado tiene asignado un número de versión. Una vez completado y activado, automáticamente se crea otra versión: es el nuevo tema de borrador en que se trabajará hasta que esté listo para activarse.
fr: Les thèmes du portail font l'objet d'un versionnage. Cela signifie que chaque nouveau thème personnalisé se voit attribuer un numéro de version. Dès qu'un thème est terminé et actif, une autre version est automatiquement créée : il s'agit du nouveau thème préliminaire sur lequel vous allez travailler jusqu'à ce qu'il soit actif.
nl: De versie van portaalthema's wordt beheerd. Dit betekent dat aan elk gepersonaliseerd nieuw thema een versienummer wordt toegekend. Eenmaal een thema is voltooid en live is gemaakt, wordt automatisch een andere versie aangemaakt: het is het nieuwe ontwerpthema waaraan gewerkt wordt tot het klaar is om live te gaan.

source: The *Current action* drop-down menu displayed in the header indicates which version one is currently working on. It also allows to select previous themes that were already made live.
de: Das Dropdown-Menü **Aktuelle Aktion**, das in der Kopfzeile angezeigt wird, gibt an, welche Version aktuell bearbeitet wird. Es erlaubt außerdem, zuvor bereits livegeschaltete Themen auszuwählen.
es: El menú desplegable *Acción actual* que se muestra en el encabezado indica la versión de trabajo actual. Asimismo, permite seleccionar temas anteriores que ya se han activado.
fr: Le menu déroulant *Action en cours*, situé dans l'en-tête, indique la version sur laquelle vous travaillez actuellement. Vous pouvez également y sélectionner d'anciens thèmes déjà actifs.
nl: Het drop-down menu *Huidige actie* dat weergegeven wordt in de header geeft aan op welke versie momenteel wordt gewerkt. Het laat ook toe vorige thema's te selecteren die al live zijn gegaan.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Once a theme is live, it is completely locked: it is not possible to make any other modifications. Only the latest draft version can be modified.
de: Sobald ein Thema livegeschaltet wurde, ist es komplett gesperrt: Es sind keine Veränderungen mehr möglich. Lediglich die neueste Entwurfsversion kann bearbeitet werden.
es: Una vez activado un tema, está totalmente bloqueado: no se puede introducir en él ninguna otra modificación. Solo admite modificaciones la última versión de borrador.
fr: Dès qu'un thème est actif, il est complètement verrouillé : il est impossible d'apporter d'autres modifications. Seule la dernière version préliminaire peut être modifiée.
nl: Eenmaal een thema live is, wordt het volledig vergrendeld: het is niet meer mogelijk andere wijzigingen aan te brengen. Enkel de laatste ontwerpversie kan worden gewijzigd.

source: While working on the latest draft version of the portal theme, it is possible to preview what the portal will look like with this new theme. A Preview button is indeed displayed between the Make live and Save buttons to open a new tab with the portal configured with the draft theme.
de: Während Sie an der neuesten Entwurfsversion des Portal-Themas arbeiten, können Sie eine Vorschau des Portals mit diesem neuen Thema betrachten. Ein Vorschau-Button wird zwischen dem Liveschalten- und dem Speichern-Button angezeigt; dieser öffnet das Portal entsprechend der Themen-Konfiguration des Entwurfs in einem neuen Tab.
es: Mientras se trabaja en la última versión de borrador del tema de portal, se puede obtener una vista previa de la apariencia del portal con este nuevo tema. El botón Vista previa situado entre los botones Activar y Guardar permite abrir una nueva ficha con el portal configurado con el tema de borrador.
fr: Lorsque vous travaillez sur la dernière version préliminaire du thème du portail, vous pouvez obtenir un aperçu du portail avec ce nouveau thème. En effet, un bouton Aperçu, situé entre les boutons Rendre cette version active et Enregistrer, vous permet d'ouvrir un nouvel onglet avec le portail configuré avec le thème préliminaire.
nl: Wanneer aan de laatste ontwerpversie van het portaalthema wordt gewerkt, is het mogelijk om vooraf te bekijken hoe het portaal er zal uitzien met dit nieuwe thema. Er wordt immers een knop Voorbeeldweergave weergegeven tussen de knoppen Live maken en Opslaan, zodat een nieuw tabblad kan worden geopend met het portaal dat geconfigureerd is met het ontwerpthema.

source: Only users able to edit the domain properties can preview the latest theme version. If sharing the URL with other users who were not granted the right permissions, they would see the portal with the live theme.
de: Nur Anwender, die zum Bearbeiten der Domain-Eigenschaften berechtigt sind, können die Vorschau auf die neueste Version des Themas nutzen. Wenn die URL mit anderen geteilt wird, die über keine entsprechenden Berechtigungen verfügen, sehen diese das Portal mit dem Live-Thema.
es: Tan solo los usuarios que pueden editar las propiedades del dominio pueden obtener una vista previa de la última versión del tema. Si comparte la dirección URL con otros usuarios sin los permisos adecuados, estos verán el portal con el tema activo.
fr: Seuls les utilisateurs disposant des droits de modification des propriétés du domaine peuvent prévisualiser la dernière version du thème. En cas de partage de l'URL avec d'autres utilisateurs n'ayant pas les permissions appropriées, le portail s'affichera avec le thème actif.
nl: Enkel gebruikers die in staat zijn domeineigenschappen te bewerken kunnen een voorbeeldweergave krijgen van de laatste themaversie; Wanneer de URL wordt gedeeld met andere gebruikers aan wie niet de juiste toelatingen zijn verleend, zouden ze het portaal zien met het live thema.

source: Customizing a portal theme
de: Anpassen eines Portal-Themas
es: Personalizar un tema de portal
fr: Personnaliser un thème du portail
nl: Een portaalthema personaliseren

source: Layout options
de: Layout-Optionen
es: Opciones de diseño
fr: Options de disposition
it: Opzioni di layout
nl: Lay-outopties

source: The **Layout options** tab allows to customize the portal layout, which by default relies on a 12-columns grid system inherited from the `Bootstrap CSS framework <https://getbootstrap.com/docs/3.4/css/#grid>`_.
de: Der Tab **Layout-Optionen** ermöglicht die Anpassung des Portal-Layouts, das standardmäßig auf einem Rastersystem mit zwölf Spalten auf Grundlage des `Bootstrap CSS Framework <https://getbootstrap.com/docs/3.4/css/#grid>`_ basiert.
es: La ficha **Opciones de diseño** permite personalizar el diseño del portal, basado de forma predeterminada en un sistema de cuadrícula de 12 columnas heredado del `marco CSS de Bootstrap <https://getbootstrap.com/docs/3.4/css/#grid>`_.
fr: L'onglet **Options de disposition** permet de personnaliser la disposition du portail. Par défaut, elle repose sur un système de grille à 12 colonnes, hérité du `Bootstrap CSS framework <https://getbootstrap.com/docs/3.4/css/#grid>`_.
nl: Het tabblad **Lay-outopties** laat toe de lay-out van het portaal te personaliseren. Deze berust standaard op een rastersysteem dat uit 12 kolommen bestaat en dat geërfd werd van het `Bootstrap CSS kader <https://getbootstrap.com/docs/3.4/css/#grid>`_.

source: More specifically, in this tab, it is possible to modify:
de: In diesem Tab können insbesondere folgende Elemente angepasst werden:
es: Concretamente, en esta ficha se puede modificar lo siguiente:
fr: Dans cet onglet, vous pouvez notamment modifier les éléments suivants :
nl: In dit tabblad is het meer specifiek mogelijk het volgende te wijzigen:

source: the *Gutter width*, which is the space (in pixels) between the various elements that compose an interface of the portal (columns, rows, and boxes), and
de: die *Spaltenabstände*, also der Abstand (in Pixeln) zwischen den verschiedenen Elementen die eine Benutzeroberfläche des Portals bilden (Spalten, Reihen, Boxen), und
es: *Ancho de margen interno*: es el espacio (en píxeles) entre los diversos elementos que forman una interfaz del portal (columnas, filas y cuadros); y
fr: la *largeur des espacements*, qui correspond à l'espace (en pixels) entre les différents éléments qui composent une interface du portail (colonnes, lignes et cadres), et
nl: de *Spatiebreedte*. Dit is de ruimte (in pixels) tussen de verschillende elementen waaruit een interface van het portaal bestaat (kolommen, rijen en vakjes), en
