Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/06_customizing_theme/theme.po
Languages: de, es, fr, it, nl

source: The portal layout relies on a 12-column grid system largely inherited from the `Bootstrap CSS framework <http://getbootstrap.com/css/#grid>`_ and as such has a few internal variables used throughout its CSS. This tab allows you to set the value of some of these variables.
it: Il layout del portale si basa su una griglia di 12 colonne in gran parte ispirata al `framework CSS Bootstrap <http://getbootstrap.com/css/#grid>`_ e contiene quindi alcune variabili interne utilizzate nei CSS. Questa scheda ti permette di impostare il valore di alcune tra queste variabili.

source: The variables that can currently be overridden are the *gutter width* and the *responsive breakpoints*.
it: Le variabili che possono essere sovrascritte sono il *margine interno* e i *breakpoint responsivi*.

source: The *gutter width* is the space between columns, rows and adjacent boxes.
it: Il *margine interno* è lo spazio che separa le colonne, le righe e i riquadri adiacenti.

source: The *responsive breakpoints* are the screen widths (in pixels) at which the layout will change to better accommodate the available space. There are 4 modes available: extra-small , small , medium and large, which means that there are 3 breakpoints: extra-small to small, small to medium and medium to large. The modes are also commonly referred to as *mobile*, *tablet*, *desktop* and *large desktop*.
it: I *breakpoint responsivi* sono le larghezze dello schermo (in pixel) oltre le quali il layout verrà modificato, riorganizzando al meglio lo spazio disponibile. Esistono 4 modalità di visualizzazione sullo schermo: molto piccolo, piccolo, medio e grande. Ciò significa che è possibile impostare 3 breakpoint: da molto piccolo a piccolo, da piccolo a medio e da medio a grande. Queste modalità sono di solito denominate anche *smartphone*, *tablet*, *desktop* e *desktop grande*.

source: Bear in mind though that *mobile mode* doesn't mean that the user is actually using a mobile device, but rather that the browser on the device only offers a small display area.
it: Considera che la *modalità smartphone* non indica che l'utente stia utilizzando uno smartphone, ma semplicemente che il browser del dispositivo offre uno spazio di visualizzazione particolarmente limitato.

source: In order to reset any of the variable to its default value, just click on the clear button next to it.
it: Per annullare il valore inserito in una variabile e ripristinare quello predefinito, clicca sul pulsante Cancella presente accanto ad esso.

source: As with layout options, the OpenDataSoft platform relies on a handful of color variables for the style of the portal elements. You can use the color inputs on this tab to set some of theme. This way with just a few clicks you can brand your portal to your colors.
it: Come già per le opzioni di layout, la piattaforma OpenDataSoft utilizza variabili di colore per definire lo stile degli elementi presenti sul portale. Alcune variabili possono essere impostate grazie ai campi di questa scheda. In questo modo, in pochi clic puoi personalizzare il portale con i tuoi colori.

source: These variables will override the default theme's colors. The custom style rules you can write in the stylesheet tab will however have precedence over these colors. Which means that your color choices may not be visible if you wrote more specific CSS rules.
it: I valori inseriti sostituiranno i colori predefiniti del tema. Tuttavia, le regole di personalizzazione degli stili inserite nella scheda Foglio di stile avranno la precedenza su questi colori. In altri termini, i tuoi colori non saranno visibili se al contempo sono presenti regole CSS più specifiche.

source: If changing colors is not enough and you'd like make deeper changes, you'll have to write your own CSS. Luckily this tab enables you to input your own style rules. These will be applied on top of OpenDataSoft's default rules and have precedence over them.
it: Se la modifica dei colori non è sufficiente e hai bisogno di personalizzare il portale più nel dettaglio, dovrai scrivere i tuoi CSS. Fortunatamente questa scheda ti consente di inserire le tue regole di stile, che verranno applicate sulle regole predefinite da OpenDataSoft e avranno la precedenza su di esse.

source: To change the style of an element, you only have to find the element's class and change the desired CSS property. It won't have any side-effects (limited to this single class name) and is guaranteed to work (since the hierarchy tree is mostly flat).
it: Per modificare lo stile di un elemento, devi semplicemente trovare la classe corrispondente e modificare la proprietà CSS desiderata. L'operazione non avrà altre ripercussioni, poiché è circoscritta al nome della singola classe, e funzionerà in ogni caso poiché la struttura gerarchica è per lo più piatta.

source: This is possible because all of OpenDataSoft's CSS code is written following the `BEM methodology <http://getbem.com/introduction/>`_ and prefixed with `ods-` so that they won't conflict with your own styles and can easily be overridden. You'll find a great introduction to this methodology on the ever-useful `CSS Tricks website <https://css-tricks.com/bem-101/>`_.
it: Questo perché il codice CSS di OpenDataSoft è stato scritto seguendo la `metodologia BEM <http://getbem.com/introduction/>`_ e contrassegnato sempre con il prefisso `ods-`, in modo da evitare conflitti con il tuo stile e da essere facilmente sovrascrivibile. Un'ottima introduzione a questo tipo di metodologia è disponibile sul `sito CSS Tricks <https://css-tricks.com/bem-101/>`_.

source: In short, class names are written as *block, element, modifier* (hence the BEM) `.ods-block[--blockmodifier][__element][--elementmodifier]`. The hierarchy tree is at most 2 selectors deep. Also, the relevant style is as close to the element as possible.
it: In poche parole, i nomi delle classi sono scritti in base a tre componenti: *block, element, modifier* (da cui BEM) `.ods-block[--blockmodifier][__element][--elementmodifier]`. La struttura gerarchica arriva al massimo a 2 selettori. Inoltre, ogni stile è inserito il più vicino possibile al proprio elemento.

source: Header and footer
it: Header e footer

source: While both header and footer can already be branded using the domain's customization section and color selection panel, organizations usually want to further customize the layout and content of these areas.
it: Sebbene l'header e il footer possano già essere modificati tramite la sezione di personalizzazione del dominio e il pannello di selezione dei colori, le aziende hanno di solito bisogno di personalizzare ulteriormente il layout e il contenuto di queste aree.

source: We also provide placeholders that will be replaced with the content specified in the domain customization options such as menu items, language selectors and logos. The full list is displayed right above the code area.
it: Sono inoltre disponibili segnaposto, che verranno poi sostituiti dai contenuti specificati nelle opzioni di personalizzazione del dominio, relativi ad esempio a voci di menu, selettori di lingua e loghi. L'elenco completo è disponibile sopra l'area dedicata al codice.

source: While you can take advantage of Angular within the header and footer, standard JS is still forbidden for security reasons.
it: Se da una parte è possibile usufruire di Angular per l'header e il footer, l'uso standard di JS resta però proibito per ragioni di sicurezza.

source: On the catalog page of your domain, each dataset is represented by a single *catalog card*. These cards feature a few standard elements but you may want to radically change the way it looks, add new links or implement new behaviours.
it: Nella pagina del catalogo del tuo dominio, ogni dataset è rappresentato da una *scheda* informativa composta da alcune voci. Se lo desideri, puoi modificare in modo anche radicale l'aspetto di queste schede, nonché aggiungere nuovi link o attivare nuovi comportamenti.

source: Here are a few examples of catalog cards:
it: Ecco alcuni esempi di schede di catalogo:

source: We provide handy directives to easily retrieve and include any information relative to a dataset. These directives also come with a standard style that you can override using the *Stylesheet* tab.
it: Per recuperare e inserire facilmente le informazioni relative a un dataset sono disponibili alcune pratiche direttive, accompagnate da uno stile standard che potrai sempre sovrascrivere nella scheda *Foglio di stile*.

source: The directives are:
it: Le direttive sono:

source: `ods-catalog-card` must wrap the whole catalog card for the other directives to work.
it: `ods-catalog-card`, che ingloba l'intera scheda di catalogo, consentendo il funzionamento delle altre direttive.

source: `ods-catalog-card-theme-icon` will retrieve the dataset's theme and include the relevant icon.
it: `ods-catalog-card-theme-icon`, che recupera il tema del dataset e include l'icona corrispondente.

source: `ods-catalog-card-body` provides useful style and behaviour handling edge cases (datasets without records, API proxy...).
it: `ods-catalog-card-body`, che offre soluzioni utili per la gestione dello stile e di situazioni complesse (dataset senza record, proxy di API...).

source: `ods-catalog-card-title`, `ods-catalog-card-description` and `ods-catalog-card-keywords` are self-explanatory.
it: `ods-catalog-card-title`, `ods-catalog-card-description` e `ods-catalog-card-keywords`, le cui funzioni sono facilmente deducibili dal nome.

source: `ods-catalog-card-metadata-item` takes an `item-key` and an `item-title` attributes, retrieve a metadata property matching the `item-key` from the dataset and includes in in the page using `item-title` as its label. It should be wrapped by a `.ods-catalog-card__metadata` element for better styling but with no obligation.
it: `ods-catalog-card-metadata-item`, che recupera dal dataset la proprietà dei metadati corrispondente all'attributo `item-key` e la include nella pagina utilizzando come etichetta l'attributo `item-title`. In maniera facoltativa, è possibile migliorarne lo stile inglobando la direttiva in un elemento `.ods-catalog-card__metadata`.

source: Metadata item keys
it: Chiavi degli elementi nei metadati

source: Item title
it: Titolo dell'elemento (item title)

source: Offline development
it: Sviluppo offline

source: We've seen in the previous section that you can write detailed CSS rules that will override the portal's default theme. However, writing it all in the browser can become tedious, especially for seasoned developers used to powerful text editors. Since it only accepts pure CSS, you will have to manually ensure that your rules are correctly vendor-prefixed and won't be able to use the features frontend developers are accustomed to with pre-processors such as variables and nesting.
it: Nella sezione precedente abbiamo visto come scrivere regole CSS che sovrascrivano quelle predefinite per il tema del portale. Tuttavia, farlo direttamente nel browser può risultare scomodo, in particolare per gli sviluppatori esperti, abituati a potenti editor di testo. Poiché è possibile inserire solo puro codice CSS, in questi casi è necessario verificare manualmente che le regole includano i prefissi fornitore corretti e non è possibile utilizzare le funzionalità dei preprocessori, quali le variabili o l'annidamento.

source: For all these reasons, we've created an API enabling users with the theme API key to locally write their style rules using all the tools they want, and to just push the resulting CSS code to the platform. We've packaged a client to this API along with common tools (less preprocessor and autoprefixer) in the `OpenDataSoft Portal Development Kit <https://github.com/opendatasoft/ods-portal-devkit>`_.
it: Per questa ragione, abbiamo creato un'API che consente agli utenti in possesso della chiave API di un tema di scrivere le proprie regole di stile utilizzando gli strumenti desiderati, per poi pubblicare semplicemente il codice CSS sulla piattaforma. Per questa API abbiamo realizzato un client con gli strumenti più comuni (meno preprocessori e software per prefissi automatici) all'interno del `Kit di sviluppo del portale OpenDataSoft <https://github.com/opendatasoft/ods-portal-devkit>`_.

source: This ODS Portal DevKit is an open source project distributed for free on Github, feel free to download it and taylor it to your development workflow.
it: Il Kit di sviluppo del portale ODS è un progetto open source distribuito gratuitamente su Github. Non esitare a scaricarlo e a integrarlo nel tuo flusso di lavoro.

source: Theme API key
it: Chiave API del tema

source: You can find the theme API key on the portal theme customization page. Just expand the *API key for offline development* section and copy the key.
it: La chiave API di un tema è disponibile nella relativa pagina di personalizzazione. Espandi la sezione *Chiave API per lo sviluppo offline* e copiala.

source: By generating a new key, you'll also be revoking previous ones. As a result, developers using an old key won't be able to push their work to the platform. Just remember to forward the new key to each developer working on your portal's theme to ensure that development goes uninterrupted.
it: Quando generi una nuova chiave, annulli automaticamente quelle create in precedenza. In questo modo, gli sviluppatori che utilizzano una chiave obsoleta non potranno integrare il proprio lavoro sulla piattaforma. Per evitare di interrompere lo sviluppo del tema del portale, ricorda di inviare la nuova chiave a tutti gli sviluppatori che partecipano a questo lavoro.
