Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/06_customizing_theme/theme.po
Languages: de, es, fr, it, nl

source: the **Responsive breakpoints**, which are the various screen widths (in pixels) at which the layout should change to adapt to the available space (for example, the portal layout should differ depending on whether it is used from a mobile phone or a desktop because the screen of a mobile phone is much smaller than that of a desktop). A web interface that adapts depending on the screen width is indeed called "responsive". There are 3 configurable breakpoints between 4 standard screen size associated with common devices:
de: die **responsiven Breakpoints**, also die jeweiligen Bildschirmbreiten (in Pixeln), ab denen sich das Layout verändert, um sich besser an den verfügbaren Platz anzupassen (so sollte etwa das Portal-Layout auf einem Mobiltelefon anders angezeigt werden als auf einem Desktop-PC, da der Bildschirm deutlich kleiner ist). Eine Weboberfläche, die sich der Bildschirmbreite anpasst, wird als "responsiv" bezeichnet. Es können drei Breakpoints für vier Standard-Bildschirmgrößen herkömmlicher Geräte konfiguriert werden:
es: **Puntos de interrupción con respuesta**: indica los diversos anchos de pantalla (en píxeles) a que el diseño debe cambiar para adaptarse al espacio disponible (por ejemplo, el diseño del portal debe variar si se usa en un teléfono móvil o un equipo de escritorio, ya que la pantalla del primero es muy inferior a la del segundo). Una interfaz web que se adapta al tamaño de la pantalla es lo que se denomina "responsive" (con capacidad de respuesta). Hay 3 puntos de interrupción configurables entre 4 tamaños de pantalla estándar asociados a los dispositivos habituales:
fr: les **points de rupture responsive**, qui correspondent aux diverses largeurs d'écran (en pixels) qui déclenchent un changement de disposition pour mieux correspondre à l'espace disponible (par exemple, si vous accédez au portail depuis un ordinateur de bureau ou un téléphone, sa disposition devrait changer, puisque l'écran d'un téléphone est beaucoup plus petit que celui d'un ordinateur de bureau). De fait, une interface web qui s'adapte en fonction de la largeur de l'écran est qualifiée de "responsive". Il existe 3 points de rupture configurables entre 4 tailles d'écran standard associées aux périphériques courants :
nl: de **Responsieve breekpunten**. Dit zijn de verschillende breedtes van het scherm (in pixels) op basis waarvan de lay-out een aanpassing zal doorvoeren om de beschikbare ruimte (bijv. de lay-out van het portaal zou moeten verschillen afhankelijk van het feit of het gebruikt wordt op een mobiele telefoon of een desktop omdat het scherm van een mobiele telefoon veel kleiner is dan dat van een desktop) aan te passen. Een web interface die aanpast afhankelijk van de schermbreedte wordt immers "responsief" genoemd. Er zijn 3 breekpunten die kunnen worden geconfigureerd tussen 4 standaard schermgroottes voor gewone toestellen:

source: *Mobile to tablet*: to go from an extra-small screen to a small screen
de: *Mobiltelefon bis Tablet*: passend für extra-kleine bis kleine Bildschirme
es: *De móvil a tableta*: para pasar de una pantalla muy pequeña a otra pequeña
fr: *Téléphone vers tablette* : pour passer d'un écran très petit à un petit écran
nl: *Mobiel naar tablet*: om van een extra klein scherm naar een klein scherm te gaan

source: *Tablet to desktop*: to go from a small screen to a medium screen
de: *Tablet bis Desktop*: passend für kleine bis mittlere Bildschirme
es: *De tableta a escritorio*: para pasar de una pantalla pequeña a otra mediana
fr: *Tablette vers bureautique* : pour passer d'un petit écran à un écran moyen
nl: *Tablet naar desktop*: om van een klein scherm naar een middelgroot scherm te gaan

source: *Desktop to large desktop*: to go from a medium screen to a large screen
de: *Desktop bis großer Desktop*: passend für mittlere bis große Bildschirme
es: *De escritorio a escritorio grande*: para pasar de una pantalla mediana a otra grande
fr: *Bureautique vers bureautique large* : pour passer d'un écran moyen à un grand écran
nl: *Desktop naar grote desktop*: om van een middelgroot scherm naar een groot scherm te gaan

source: Mobile, Tablet, Desktop, and Large desktop are used as reference because they are common devices that illustrate quite well the 4 standard screen sizes (extra-small, small, medium, and large) that can be encountered. Keep in mind that Mobile, for example, doesn't mean that the user is actually using a mobile device, but rather that the browser used by the user only offers an extra-small display area.
de: Mobiltelefon, Tablet, Desktop und großer Desktop werden als Referenzen angegeben, da es sich um gebräuchliche Geräte handelt, die sich gut zur Illustration der vier Standard-Bildschirmgrößen (extra-klein, klein, mittel und groß) eignen. Bedenken Sie, dass der mobile Modus nicht zwangsläufig bedeutet, dass der Benutzer ein mobiles Gerät verwendet, sondern dass der Browser auf dem Gerät nur ein kleines Anzeigefeld bietet.
es: Se usan como referencia los términos móvil, tableta y equipo de escritorio porque estos nombres de los dispositivos más habituales ilustran bastante bien los 4 tamaños de pantalla estándar existentes (muy pequeña, pequeña, mediana y grande). Tenga presente que el término móvil, por ejemplo, no significa que el usuario esté usando realmente un móvil sino que el explorador que utiliza ofrece un área de visualización extrapequeña.
fr: Téléphone, Tablette, Bureautique et Bureautique large sont utilisés comme références puisqu'il s'agit de périphériques courants qui illustrent plutôt bien les 4 tailles d'écran standard (très petit, petit, moyen et grand) disponibles. Gardez à l'esprit que Téléphone ne signifie pas que l'utilisateur se sert d'un périphérique mobile, mais que son navigateur offre une zone d'affichage très petite.
nl: "Mobiel", "Tablet", "Desktop" en "Grote desktop" worden als referentie gebruikt omdat het gewone toestellen zijn die vrij goed de 4 standaard schermgroottes illustreren (extra klein, klein, middelgroot en groot) die men kan terugvinden. Denk er wel aan dat Mobiel bijvoorbeeld niet betekent dat de gebruiker effectief een mobiel toestel gebruikt, maar wel dat de browser die door de gebruiker gebruikt wordt enkel een extra kleine weergaveruimte biedt.

source: To modify a layout option:
de: Änderung einer Layout-Option:
es: Para modificar una opción de diseño:
fr: Pour modifier une option de disposition :
nl: Om een lay-outoptie te wijzigen:

source: Write a new width, in pixels, in the chosen textbox.
de: Notieren Sie eine neue Breite, in Pixeln, in der ausgewählten Textbox .
es: Escriba un nuevo ancho, en píxeles, en el cuadro de texto seleccionado.
fr: Saisissez une nouvelle largeur, en pixels, dans la zone de texte choisie.
nl: Schrijf in het gekozen tekstvak een nieuwe breedte, in pixels.

source: Click on the Save button in the top right corner.
de: Klicken Sie oben rechts auf den Button Speichern.
es: Haga clic en el botón Guardar en la esquina superior derecha.
fr: Cliquez sur le bouton Enregistrer en haut à droite.
nl: Klik op de knop Opslaan in de rechter bovenhoek.

source: To reset any layout option to its default value, click on the |icon-trash| button.
de: Um eine beliebige Layout-Option auf ihren Standardwert zurückzusetzen, klicken Sie auf den |icon-trash| Button.
es: Para restablecer el valor predeterminado de cualquier opción de diseño, haga clic en el botón |icon-trash|.
fr: Pour rétablir la valeur par défaut d'une option de disposition, cliquez sur le bouton |icon-trash|.
nl: Om een lay-outwaarde opnieuw in te stellen naar de standaardwaarde ervan, hoeft u enkel op de knop |icon-trash| te klikken.

source: Colors
de: Farben
es: Colores
fr: Couleurs
it: Colori
nl: Kleuren

source: The **Colors** tab allows to customize the colors used in the texts and links, backgrounds, and borders of the portal.
de: Der **Farben**-Tab ermöglicht es, die in den Texten und Links, Hintergründen sowie Rahmen verwendeten Farben anzupassen.
es: La ficha **Colores** permite personalizar los colores empleados en los textos y vínculos, fondos y bordes del portal.
fr: L'onglet **Couleurs** permet de personnaliser les couleurs utilisées dans les textes et les liens, les fonds et les bordures du portail.
nl: Het tabblad **Kleuren** laat toe de kleuren die gebruikt worden in de teksten en koppelingen, achtergronden en randen van het portaal te personaliseren.

source: If a :ref:`custom stylesheet <stylesheet>` has been created for the portal, the CSS rules that it contains will have precedence over the colors defined in the Colors tab.
de: Wenn ein :ref:`Benutzerdefiniertes Stylesheet <stylesheet>` für das Portal erstellt wurde, haben die darin enthaltenen CSS-Regeln Vorrang gegenüber den im Farben-Tab festgelegten Farben.
es: Si se ha creado una :ref:`hoja de estilos personalizada <stylesheet>` para el portal, las reglas CSS que contiene tendrán prioridad sobre los colores definidos en la ficha Colores.
fr: Si une :ref:`feuille de style personnalisée <stylesheet>` a été créée pour le portail, les règles CSS qu'elle contient prévalent sur les couleurs définies dans l'onglet Couleurs.
nl: Wanneer een :ref:`gepersonaliseerd stijlblad <stylesheet>` aangemaakt geweest is voor het portaal zullen de CSS-regels die erin staan voorrang hebben op de kleuren die gedefinieerd staan in het tabblad Kleuren.

source: The color of the following elements of an Opendatasoft portal can be configured in this tab:
de: In diesem Tab kann die Farbe der folgenden Elemente eines Opendatasoft-Portals konfiguriert werden:
es: En esta ficha se puede configurar el color de los siguientes elementos de un portal de Opendatasoft:
fr: La couleur des éléments suivants d'un portail Opendatasoft peut être configurée dans cet onglet :
nl: In dit tabblad kan de kleur van de volgende elementen van een Opendatasoft-portaal worden geconfigureerd:

source: Category
de: Kategorie
es: Categoría
fr: Catégorie
nl: Categorie

source: Configurable elements
de: Konfigurierbare Elemente
es: Elementos configurables
fr: Éléments configurables
nl: Elementen die kunnen worden geconfigureerd

source: Text
es: Texto
fr: Texte
nl: Tekst

source: *Text* (main)
de: (Fließ-)*Text*
es: *Texto* (principal)
fr: *Texte* (principal)

source: *Links*
es: *Vínculos*
fr: *Liens*

source: *Links in the header*
de: *Links in der Kopfzeile*
es: *Vínculos del encabezado*
fr: *Liens dans l'en-tête*
nl: *Links in de header*

source: *Links in the footer*
de: *Links in der Fußzeile*
es: *Vínculos del pie de página*
fr: *Liens dans le pied de page*
nl: *Links in de footer*

source: *Titles*
de: *Titel*
es: *Títulos*
fr: *Titres*

source: *Section titles*
de: *Abschnittstitel*
es: *Títulos de sección*
fr: *Titres de section*

source: *Highlight* (active element)
de: *Hervorhebung* (aktives Element)
es: *Resaltar* (elemento activo)
fr: *Surlignement* (élément actif)
nl: *Highlight* (actief element)

source: Background
de: Hintergrund
es: Fondo
fr: Fond
nl: Achtergrond

source: *Page background*
de: *Hintergrund der Seite*
es: *Fondo de página*
fr: *Fond de la page*

source: *Boxes background*
de: *Hintergrund der Boxen*
es: *Fondo de cuadros*
fr: *Fond des boîtes*

source: *Section titles background*
de: *Hintergrund der Abschnittstitel**
es: *Fondo de títulos de sección*
fr: *Fond des titres de section*

source: *Header background*
de: *Hintergrund der Kopfzeile*
es: *Fondo de encabezado*
fr: *Fond de l'en-tête*

source: *Footer background*
de: *Hintergrund der Fußzeile*
es: *Fondo de pie de página*
fr: *Fond du pied de page*

source: Borders
de: Rahmen
es: Bordes
fr: Bordures
nl: Randen

source: *Boxes border*
de: *Boxenrahmen*
es: *Borde de cuadros*
fr: *Bordure des boîtes*

source: To modify a theme color:
de: Änderung einer Themen-Farbe:
es: Para modificar un color de tema:
fr: Pour modifier une couleur de thème :
nl: Om een themakleur te wijzigen:

source: In the chosen textbox, write the hexadecimal code of the new color, or click the color button to choose a new color using either the Nice colors or the Color wheel.
de: Notieren Sie den Hexadezimalcode der neuen Farbe in der ausgewählten Textbox oder klicken Sie auf den Farben-Button, um entweder aus den Farbvorschlägen oder mit dem Farbrad eine neue Farbe auszuwählen.
es: En el cuadro de texto seleccionado, especifique el código hexadecimal del nuevo color o haga clic en el botón de color para elegirlo en Colores bonitos o con el Selector de color.
fr: Dans la zone de texte choisie, ajoutez le code hexadécimal de la nouvelle couleur ou cliquez sur le bouton Couleur pour choisir une nouvelle couleur via Jolies couleurs ou Roue colorimétrique.
nl: Schrijf in het gekozen tekstvak de hexadecimale code van de nieuwe kleur of klik op de kleurknop om een nieuwe kleur te kiezen door gebruik te maken van ofwel Mooie kleuren of het Kleurwiel.

source: To reset to the color of the currently live portal theme, click on the |icon-reset| button.
de: Um die Farbe des aktuell livegeschalteten Portal-Themas zurückzusetzen, klicken Sie auf den |icon-trash| Button.
es: Para volver al color del tema del portal activo actual, haga clic en el botón |icon-reset|.
fr: Pour réinitialiser la couleur du thème du portail actuellement actif, cliquez sur le bouton |icon-reset|.
nl: Om de kleur van het portaalthema dat momenteel live is opnieuw in te stellen, klik op de knop |icon-reset|.

source: Theme colors can be used in the domain stylesheet, as CSS variables:
de: Themenfarben können im Stylesheet der Domain als CSS-Variablen verwendet werden:
es: Los colores de temas pueden usarse en la hoja de estilos del dominio, como variables CSS:
fr: Les couleurs des thèmes peuvent être utilisées dans la fiche de style du domaine en tant que variables CSS :
nl: Er kunnen themakleuren in het stijlblad van het domein gebruikt worden als CSS-variabelen:

source: The available variables are: ``text``, ``links``, ``titles``, ``page-background``, ``highlight``, ``boxes-background``, ``boxes-border``, ``section-titles``, ``section-titles-background``, ``header-background``, ``header-links``, ``footer-background`` and ``footer-links``.
de: Folgende Variablen sind verfügbar: ``text``, ``links``, ``titles``, ``page-background``, ``highlight``, ``boxes-background``, ``boxes-border``, ``section-titles``, ``section-titles-background``, ``header-background``, ``header-links``, ``footer-background`` und ``footer-links``.
es: Las variables disponibles son: ``text``, ``links``, ``titles``, ``page-background``, ``highlight``, ``boxes-background``, ``boxes-border``, ``section-titles``, ``section-titles-background``, ``header-background``, ``header-links``, ``footer-background`` y ``footer-links``.
fr: Les variables suivantes sont disponibles : ``text``, ``links``, ``titles``, ``page-background``, ``highlight``, ``boxes-background``, ``boxes-border``, ``section-titles``, ``section-titles-background``, ``header-background``, ``header-links``, ``footer-background`` et ``footer-links``.
nl: De beschikbare variabelen zijn: ``text``, ``links``, ``titles``, ``page-background``, ``highlight``, ``boxes-background``, ``boxes-border``, ``section-titles``, ``section-titles-background``, ``header-background``, ``header-links``, ``footer-background`` en ``footer-links``.

source: These CSS variables are compatible with all browsers because the Opendatasoft platform automatically replaces all variables with their real theme color values.
de: Diese CSS-Variablen sind mit allen Browsern kompatibel, weil die Opendatasoft-Plattform alle Variablen automatisch durch ihre realen Farbwerte des Themas ersetzt.
es: Estas variables CSS son compatibles con todos los exploradores porque la plataforma Opendatasoft sustituye automáticamente todas las variables por sus valores reales de colores de temas.
fr: Ces variables CSS sont compatibles avec tous les navigateurs Internet, car la plateforme Opendatasoft les remplace automatiquement par la valeur réelle de la couleur du thème correspondante.
nl: Deze CSS-variabelen zijn compatibel met alle browsers omdat het Opendatasoft-platform automatisch alle variabelen vervangt door hun echte themakleurwaarden.

source: Stylesheet
es: Hoja de estilos
fr: Feuille de style
it: Foglio di stile
nl: Stijlblad

source: The **Stylesheet** tab displays an editor in which to add pure CSS style rules. It allows the push even further the customization of a portal theme. All rules added in this tab will have precedence over the configurations defined in the other theme tabs.
de: Der **Stylesheet**-Tab zeigt einen Editor an, in dem Stilregeln im CSS-Format eingetragen werden können. Dadurch können Sie Ihr Portal-Themas zusätzlich personalisieren. Alle in diesem Tab eingetragenen Regeln haben Vorrang gegenüber den in den anderen Themen-Tabs festgelegten Konfigurationen.
es: La ficha **Hoja de estilos** muestra un editor donde añadir reglas de estilo CSS puras. Permite personalizar aún más un tema de portal. Todas las reglas añadidas en esta ficha tendrán prioridad sobre las configuraciones definidas en las demás fichas de tema.
fr: L'onglet **Feuille de style** affiche un éditeur dans lequel vous pouvez ajouter des règles de style CSS pures. Il vous permet de personnaliser encore davantage un thème du portail. Toutes les règles ajoutées dans cet onglet prévaudront sur les configurations définies dans les autres onglets du thème.
nl: In het tabblad **Stijlblad** staat een editor waaraan zuivere CSS stijlregels kunnen worden toegevoegd. Deze laat toe de personalisering van een portaalthema nog verder door te voeren. Alle regels die in dit tabblad zijn toegevoegd hebben voorrang op de configuraties zoals die gedefinieerd zijn in de andere thematabbladen.

source: To change the style of an element, find the element's class and change the desired CSS property. Class names are written as block, element, modifier: ``.ods-block[--blockmodifier][__element][--elementmodifier]``.
de: Um den Stil eines Elements zu ändern, suchen Sie die zugehörige Klasse und ändern Sie die gewünschte CSS-Eigenschaft. Klassen werden als Baustein, Element, Modifikator notiert: ``.ods-block[--blockmodifier][__element][--elementmodifier]``.
es: Para cambiar el estilo de un elemento, localice la clase del elemento y cambie la propiedad CSS deseada. Los nombres de clases se escriben como bloque, elemento y modificador: ``.ods-bloque[--modificadorbloque][__elemento][--modificadorelemento]``.
fr: Pour changer le style d'un élément, recherchez sa classe et modifiez la propriété CSS souhaitée. La syntaxe BEM (block, element, modifier) est utilisée pour écrire les noms de classe : ``.ods-block[--blockmodifier][__element][--elementmodifier]``.
nl: Om de stijl van een element te wijzigen, hoeft u enkel de categorie van het element terug te vinden en de gewenste CSS-eigenschap te wijzigen. Categorienamen worden geschreven als block, element, modifier: ``.ods-block[--blockmodifier][__element][--elementmodifier]``.

source: When using specific images and fonts for the customization of the domain, don't hesitate to upload them as assets in the platform (see :doc:`Adding assets </customizing_look_and_feel/03_adding_assets/assets>`). It allows to easily copy the assets URLs and paste them into the CSS code.
de: Wenn Sie für die Anpassung Ihrer Domain eigene Bilder und Schriftarten nutzen, können Sie diese problemlos als Anlagen auf die Plattform laden (siehe :doc:`Anlagen hinzufügen </customizing_look_and_feel/03_adding_assets/assets>`). Dadurch kann die URL auf einfache Weise in den CSS-Code kopiert werden.
es: Si usa imágenes y fuentes específicas para la personalización del dominio, no dude en cargarlas como activos en la plataforma (consulte :doc:`Añadir activos </customizing_look_and_feel/03_adding_assets/assets>`). Esto permite copiar fácilmente las URL de activos y pegarlas en el código CSS.
fr: Lorsque vous utilisez des polices de caractères et des images spécifiques pour la personnalisation du domaine, n'hésitez pas à les charger en tant que ressources dans la plateforme (voir :doc:`Ajouter des ressources </customizing_look_and_feel/03_adding_assets/assets>`). Cela permet de copier et de coller facilement les URL des ressources dans le code CSS.
nl: Wanneer specifieke afbeeldingen en lettertypes worden gebruikt om het domein te personaliseren, aarzel dan niet om deze als eigenschappen te uploaden in het platform (zie :doc:`Eigenschappen toevoegen </customizing_look_and_feel/03_adding_assets/assets>`). Zo kunt u gemakkelijk de URL's van de eigenschappen kopiëren en deze in de CSS-code plakken.

source: Header and Footer
de: Kopf- und Fußzeile
es: Encabezado y Pie de página
fr: En-tête et pied de page
nl: Header en Footer

source: The **Header** and **Footer** tabs each display an editor in which to add pure HTML. Although both the header and the footer can be partially customized via the :ref:`Colors <colors>` tab, these tabs allow to push even further the customization of these areas of the portal.
de: Die Tabs für **Kopfzeilen** und **Fußzeilen** zeigen jeweils einen HTML-Editor an. Zwar können die Kopf- und Fußzeilen teilweise über den :ref:`Farben <colors>`-Tab angepasst werden, doch die hier beschriebenen Tabs erlauben eine noch weitergehende Personalisierung dieser Bereiche auf dem Portal.
es: Cada una de las fichas **Encabezado** y **Pie de página** muestran un editor donde añadir código HTML puro. Aunque tanto el encabezado como el pie de página se pueden personalizar parcialmente en la ficha :ref:`Colores <colors>`, estas fichas permiten personalizar aún más estas áreas del portal.
fr: Les onglets **En-tête** et **Pied de page** affichent un éditeur dans lequel vous pouvez ajouter du code HTML pur. Même si l'en-tête et le pied de page peuvent être partiellement personnalisés via l'onglet :ref:`Couleurs <colors>`, ces onglets vous permettent de personnaliser encore davantage ces zones du portail.
nl: In de tabbladen **Header** en **Footer** staat telkens een editor weergegeven waaraan zuivere HTML kan worden toegevoegd. Hoewel zowel de header als de footer gedeeltelijk gepersonaliseerd kunnen worden via het tabblad :ref:`Kleuren <colors>` kan via deze tabbladen de personaliseren van deze ruimten van het portaal nog verder worden doorgevoerd.

source: Both the header and the footer are wrapped within independent AngularJS applications, which means that standard Angular directives such as ``ng-if``, ``ng-class``, ``ng-show``, and ``ng-hide`` can be used.
de: Kopf- und Fußzeile sind in unabhängige AngularJS-Anwendungen eingebunden; das bedeutet, dass Standard-Anweisungen von Angular wie ``ng-if``, ``ng-class``, ``ng-show`` und ``ng-hide`` verwendet werden können.
es: El encabezado y el pie de página están envueltos dentro de aplicaciones AngularJS independientes, lo que significa que se pueden emplear directivas Angular estándar como ``ng-if``, ``ng-class``, ``ng-show`` y ``ng-hide``.
fr: L'en-tête et le pied de page sont enveloppés dans des applications AngularJS indépendantes, ce qui signifie que des directives Angular standard telles que ``ng-if``, ``ng-class``, ``ng-show`` et ``ng-hide`` peuvent être utilisées.
nl: Zowel koptekst als voettekst zijn opgenomen in onafhankelijke AngularJS-applicaties, m.a.w. u kunt standaard Angular-directieven, zoals ``ng-if``, ``ng-class``, ``ng-show`` en ``ng-hide`` gebruiken.
