Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/creating_dataset_with_images.po
Languages: it

source: Creating a dataset with images
it: Creazione di un dataset con immagini

source: It is possible to source images, as well as other media types of files, into the platform.
it: È possibile aggiungere immagini e altri tipi di file multimediali alla piattaforma.

source: All formats considered as images by the platform (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg) will be imported as such. It means that a thumbnail will be generated for these formats, activating the Images visualization. Other types of files (such as PDF) can also be added into a dataset, however no thumbnail will be generated and the Images visualization will not be available. Users will only be able to download these files.
it: La piattaforma importa come immagini tutti i formati considerati come tali (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg), creando un thumbnail e attivando per essi la visualizzazione immagini. Al dataset è possibile aggiungere anche altri tipi di file, ad esempio PDF, ma in questo caso non verrà generato alcun thumbnail e non sarà disponibile la visualizzazione immagini. Gli utenti potranno solo scaricare questi file.

source: There are 2 different methods to source images and add them into a dataset: with an archive file or via a URL.
it: Per utilizzare le immagini come origine e aggiungerle al dataset è possibile procedere in due modi: utilizzando un file di archivio o un URL.

source: Sourcing images with an archive file
it: Aggiunta di immagini con un file di archivio

source: This method consists in building an archive file (see :ref:`Supported compressed file formats<supportedcompressedformats>`) with the images, and then to import it into the platform.
it: Per utilizzare questo metodo è necessario creare un file di archivio (vedere :ref:`Formati di file compressi supportati<supportedcompressedformats>`) contenente le immagini e importarlo nella piattaforma.

source: Building the archive file
it: Creazione del file di archivio

source: The archive file should contain:
it: Il file di archivio deve contenere:

source: the files (images)
it: i file (immagini)

source: a CSV file listing the files (images) and their metadata
it: un file CSV con l'elenco dei file (immagini) e i relativi metadati

source: CSV file
it: File CSV

source: There must be only one CSV file, and it must only be in a CSV format.
it: Deve essere presente un solo file necessariamente in formato CSV.

source: The CSV file must contain a column with the files (images) names ; all other columns will be considered as additional fields.
it: Il file CSV deve contenere una colonna con i nomi dei file (immagini); le altre colonne sono considerate campi aggiuntivi.

source: Example:
it: Esempio:

source: Scale
it: Scala

source: Title
it: Titolo

source: Image 1
it: Immagine 1

source: Image 2
it: Immagine 2

source: Subdirectories in archive file
it: Sottodirectory del file di archivio

source: We recommend to keep all images at the same level into the archive file. However, if images are into subdirectories, keep in mind to write the whole path in the CSV file.
it: Si consiglia di mantenere tutte le immagini del file di archivio sullo stesso livello. Se le immagini sono organizzate in sottodirectory, tuttavia, è necessario includere l'intero percorso nel file CSV.

source: Sourcing the archive file
it: Aggiunta del file di archivio

source: Once the archive file is created, it can be imported into the platform.
it: Una volta creato il file di archivio è possibile importarlo nella piattaforma.

source: In Catalog > Datasets, click on the **New dataset** button.
it: In Catalogo > Dataset, clicca sul pulsante **Nuovo dataset**.

source: Click on the **Add a source** button.
it: Clicca su **Aggiungi un'origine**.

source: Click on the **Upload a file** button.
it: Clicca sul pulsante **Carica un file**.

source: Choose the archive file you created, with your images inside.
it: Scegli l'archivio che hai creato e che contiene le immagini desiderate.

source: Click on the **Open** button of the file selection window.
it: Clicca sul pulsante **Apri** della finestra di selezione dei file.

source: It is possible to simply drag and drop the file after steps 1 and 2, instead of following the whole file selection procedure.
it: Anziché selezionare il file secondo la procedura indicata sopra, è possibile trascinarlo e rilasciarlo, dopo i passi 1 e 2.

source: Sourcing images via a URL
it: Aggiunta delle immagini tramite un URL

source: This method consists in sourcing images stored in a remote server, and using a processor to define the images and extract their metadata.
it: Questo metodo consiste nell'aggiungere le immagini memorizzate in un server remoto, utilizzando un processore per definirle e per estrarne i metadati.

source: For this method, OpenDataSoft supports the following protocols: http, and its secured version https. Both link to a single file (e.g. http://example.org/mydata.csv).
it: Per questo metodo, OpenDataSoft supporta il protocollo http e la versione protetta https. Entrambi creano il collegamento a un unico file (ad es. http://esempio.org/mieidati.csv).

source: In the **Enter a URL** box, write the URL of the remote server where the images are stored.
it: Nella casella **Inserisci un URL**, immetti l'URL del server remoto in cui sono memorizzate le immagini.

source: Once the connection with the platform is made and the images sourced, click on the **Processing** tab.
it: Una volta eseguita la connessione alla piattaforma e aggiunte le immagini, clicca sulla scheda **Elaborazione**.

source: Click on the **Add a processor** button.
it: Clicca sul pulsante **Aggiungi un processore**.

source: Choose the File processor, in the Generic operations section.
it: Scegli il processore File, nella sezione delle operazioni Generiche.

source: In the File processor area, indicate which field contains the images.
it: Nell'area del processore File, indica il campo contenente le immagini.

source: *(optional)* Still in the File processor area, tick the **Extract metadata** box to import the related metadata of the images.
it: *(facoltativo)* Sempre nell'area del processore File, seleziona la casella **Estrai i metadati** per importare i metadati correlati alle immagini.

source: Displaying images
it: Visualizzazione delle immagini

source: Once the images are imported into the platform, they can be displayed in 2 different ways:
it: Una volta importate nella piattaforma, le immagini possono essere visualizzate in due modi:

source: through the default Images visualization tab: an image gallery displaying all the images and their metadata
it: mediante la scheda per la visualizzazione predefinita delle immagini, con una galleria che visualizza le immagini insieme ai relativi metadati;

source: through a slideshow, which is `an OpenDataSoft widget <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSlideshow>`_ that can be added in any code area of the platform (e.g. in the Custom view of the dataset or in a content page): in that case, images are displayed one by one
it: mediante una presentazione, cioè un `widget OpenDataSoft <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSlideshow>`_ aggiungibile a qualsiasi area di codice della piattaforma (ad esempio nella visualizzazione personalizzata del dataset o in una pagina di contenuti); in questo caso le immagini vengono visualizzate una a una.

source: Exporting and downloading images
it: Esportazione e download delle immagini

source: Images imported into the platform can only be downloaded or exported one by one. There is no way to download all the images of a dataset at the same time.
it: È possibile scaricare o esportare le immagini importate nella piattaforma solo una a una. Non è possibile scaricare tutte le immagini di un dataset contemporaneamente.

source: Downloading an image
it: Download di un'immagine

source: In the front office, go to the **Images** visualization tab of the dataset containing the image(s) to download.
it: Nell'interfaccia di front-office, seleziona la scheda di visualizzazione **Immagini** del dataset contenente le immagini da scaricare.

source: Click on the image to download.
it: Clicca sull'immagine desiderata.

source: At the end on the image's metadata, click on the **Download image** button.
it: Alla fine, nei metadati dell'immagine, clicca sul pulsante **Download immagine**.

source: Exporting dataset to retrieve image URL
it: Esportazione del dataset per richiamare l'URL di un'immagine

source: In the front office, go the **Export** tab of the dataset containing the image(s) to export.
it: Nell'interfaccia di front-office, seleziona la scheda **Esporta** del dataset contenente le immagini da esportare.

source: Export the whole dataset, or part of it if it's filtered.
it: È possibile esportare l'intero dataset o parte di esso, se si applica un filtro.

source: Open the exported dataset in the spreadsheet software of your choice.
it: Apri il dataset esportato nel software di foglio elettronico desiderato.

source: Find the field containing the URLs of the image and retrieve them.
it: Cerca il campo contenente gli URL dell'immagine e recuperali.
