Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/dataset_schema.po
Languages: de, es, fr, it, nl

source: This option lets you define the separator that will be used to interpret multi-valued fields. This option is used for multi-value facetting. For instance, let's assume that a field named *countries* and defined as a facet contains values such as *France;UK;USA*. By setting this field as multivalued and defining the separator as being the ';' character, the values displayed in the facets widget will indeed be distinct (one entry for *France*, one entry for *UK*, one entry for *USA*).
de: Mit dieser Option können Sie das Trennzeichen definieren, das zum Interpretieren mehrwertiger Felder eingesetzt werden soll. Diese Option wird zur mehrwertigen Facet-Bildung verwendet. Nehmen wir beispielsweise an, dass ein als Facet definiertes Feld mit dem Namen *Länder* Werte wie etwa *Frankreich;GB;USA* enthält. Wenn dieses Feld als mehrwertig eingerichtet wird und das Trennzeichen ';' definiert wird, so sind die im Facets-Widget angezeigten Werte in der Tat einzeln erkennbar (ein Eintrag für *Frankreich*, ein weiterer für *GB* und ein weiterer für *USA*).
es: Esta opción permite definir el separador que se usará para interpretar campos multivalor. Esta opción se utiliza para las facetas multivalor. Por ejemplo, supongamos que un campo denominado *countries* y definido como una faceta contiene valores como *France;UK;USA*. Al establecer este campo como multivalor y definir el carácter ';' como separador, efectivamente se visualizarán varios valores distintos en el widget de facetas (una entrada para *France*, otra para *UK* y otra para *USA*).
fr: Cette option vous permet de configurer un séparateur qui sera utilisé pour interpréter une valeur comme étant en réalité une liste de plusieurs valeurs. Ceci peut être utilisé pour de la catégorisation multiple. Par exemple, supposons un champ *pays* défini comme une facette et contenant des valeurs telles que *France;UK;USA*. En réglant ce champ comme multi-valué avec un séparateur ";", les valeurs affichées dans les facettes seront distinctes ("France", "UK", "USA").
it: Questa opzione permette di definire il separatore utilizzato per interpretare i campi multivalore e viene utilizzata per i facet multivalore. Ipotizziamo, ad esempio, che un campo denominato *countries* e definito come facet contenga valori come *Italia;UK;USA*. Impostando questo campo come multivalore e utilizzando il carattere ';' come separatore, i valori visualizzati nel widget dei facet saranno distinti (una voce per *Italia*, una per *UK* e una per *USA*).
nl: Deze optie laat u toe het scheidingsteken te definiëren dat gebruikt zal worden om velden met meerdere waarden te interpreteren. Deze optie wordt gebruikt voor de facettering van meerdere waarden. Bijvoorbeeld: laat ons veronderstellen dat een veld de naam *landen* heeft en gedefinieerd is als een facet dat waarden bevat zoals *Frankrijk;VK;VS*. Door dit veld in te stellen als een veld met meerdere waarden en het scheidingsteken te definiëren als zijnde het karakter ';' dan zullen de waarden die in de widget voor de facetten wordt weergegeven inderdaad gescheiden worden (één entry voor *Frankrijk*, één entry voor *VK*, één entry voor *VS*).

source: **Hierarchical**
de: **Hierarchisch**
es: **Jerárquico**
fr: **Hiérarchique**
it: **Gerarchico**
nl: **Hiërarchisch**

source: This property is used in conjunction with facetting. By default, facets are processed as a single, raw textual content. But sometimes, you may want to build a hierarchical facets navigation. This option lets you choose the hierarchy path separator to be used.
de: Diese Eigenschaft wird in Verbindung mit der Facet-Bildung verwendet. Facets werden standardmäßig als einzelner Rohtext-Content verarbeitet. Doch in bestimmten Fällen möchten Sie eventuell eine hierarchische Facets-Navigation aufbauen. Mit dieser Option können Sie das zu verwendende Hierarchiepfad-Trennzeichen auswählen.
es: Esta propiedad se utiliza junto con las facetas. De forma predeterminada, las facetas se administran como un único contenido textual sin procesar. Pero a veces puede interesarle crear una navegación jerárquica por facetas. Esta opción permite elegir qué separador de ruta de jerarquía se empleará.
fr: Cette propriété est utilisée conjointement avec le facettage. Par défaut, les facettes sont traitées comme un seul contenu texte brut. Parfois, on souhaite construire une hiérarchie de facettes pour la navigation. Cette option vous permet de choisir un séparateur pour les différents éléments du chemin.
it: Questa proprietà viene utilizzata insieme ai facet. Per impostazione predefinita, i facet sono elaborati singolarmente come contenuto testuale grezzo, ma talvolta può essere necessario per essi creare una navigazione gerarchica. Questa opzione permette di scegliere il separatore del percorso gerarchico che desideri utilizzare.
nl: Deze eigenschap wordt gebruikt in combinatie met facettering. Standaard worden facetten verwerkt als een enkelvoudige, ruwe tekstuele inhoud. Maar soms is het mogelijk dat een navigatie van hiërarchische facetten wil opbouwen. Deze optie laat u toe het scheidingsteken te kiezen voor het hiërarchische pad dat gebruikt moet worden.

source: Date and DateTime fields
de: Datums- und DateTime-Felder
es: Campos de tipo Fecha o Fecha y hora
fr: Champs Date et DateTime
it: Campi data e data/ora
nl: Datum- en DatumTijd-velden

source: **Precision**
de: **Präzision**
es: **Precisión**
fr: **Précision**
it: **Precisione**
nl: **Nauwkeurigheid**

source: This option lets you choose the precision of a temporal field (year, month and day for a Date field, hour and minute for a DateTime field).
de: Mit dieser Option können Sie die Präzision eines Zeitfelds auswählen (Jahr, Monat und Tag für die Datumsfelder, Stunde und Minute für die DateTime-Felder).
es: Esta opción permite elegir la precisión de un campo temporal (año, mes y día para un campo de fecha, hora y minuto para un campo de fecha y hora).
fr: Cette option vous permet de choisir la précision d'un champ temporel (année, mois ou jour pour un champ Date; heure ou minute pour un champ DateTime).
it: Questa opzione permette di scegliere il livello di precisione di un campo temporale (anno, mese e giorno per il campo Data, ora e minuti per un campo Data/Ora).
nl: Deze optie laat u toe de nauwkeurigheid te kiezen van een tijdelijk veld (jaar, maand en dag voor een Datumveld, uur en minuut voor een DatumTijd-veld).

source: Decimal and Integer fields
de: Dezimal- und Ganzzahlfelder
es: Campos de tipo Decimal o Entero
fr: Champs décimaux et entiers
it: Campi decimali e interi
nl: Velden decimaal en geheel getal

source: **Unit**
de: **Einheit**
es: **Unidad**
fr: **Unité**
it: **Unità**
nl: **Eenheid**

source: This option lets you define an unit associated with numerical fields. This option is used to complement the table view and is displayed next to the field's value.
de: Mit dieser Option können Sie eine Einheit für die numerischen Felder definieren. Diese Option dient als Ergänzung zur Tabellenansicht und wird neben dem Wert des Feldes angezeigt.
es: Esta opción permite definir una unidad asociada a campos numéricos. Esta opción permite complementar la vista de tabla y se visualiza junto al valor del campo.
fr: Cette option vous permet de définir une unité associée à un champ numérique. Cela permet l'affichage de l'unité à côté de la valeur dans certaines visualisations.
it: Questa opzione permette di definire l'unità da associare ai campi numerici. Serve per completare la visualizzazione delle tabelle ed è disponibile accanto al valore del campo.
nl: Deze optie laat u toe een eenheid te definiëren die verbonden is aan numerieke velden. Deze optie wordt gebruikt om de tabelweergave te vervolledigen en wordt weergegeven naast de waarde van het veld.

source: Special fields
de: Spezialfelder
es: Campos especiales
fr: Champs spéciaux
it: Campi speciali
nl: Speciale velden

source: Record id
de: Eintrags-ID
es: ID de registro
fr: Id d'enregistrement
it: ID record

source: We identify a record with a unique built-in field named *record_id*. During the processing, if two records have the same *record_id*, the first one is replaced by the second.
de: Einträge kennzeichnen wir mit einem eindeutigen vordefinierten Feld mit dem Namen *Eintrags-ID*. Wenn während der Verarbeitung zwei Einträge dieselbe *Eintrags-ID* haben, wird die erste durch die zweite ersetzt.
es: Identificamos un registro con un campo exclusivo denominado *record_id*. Durante el proceso, si 2 registros tienen el campo mismo *record_id*, el primero se sustituye por el segundo.
fr: Nous identifions les enregistrements à l'aide d'un champ intégré unique appelé *record_id*. Lors du traitement, si deux enregistrements présentent le même *record_id*, le premier est remplacé par le second.
it: Ogni record è identificato con un campo univoco e integrato, denominato *record_id*. Se durante l'elaborazione due campi hanno lo stesso *record_id*, il primo viene sostituito con il secondo.
nl: We identificeren een record met een uniek ingebouwd veld dat de naam *record_id* draagt. Tijdens het verwerken, wanneer twee records hetzelfde *record_id* hebben, wordt het eerste vervangen door het tweede.

source: The *record_id* is calculated at the end of the processing using the following principles:
de: Die *Eintrags-ID* wird am Ende der Verarbeitung unter Verwendung folgender Prinzipien berechnet:
es: El campo *record_id* se calcula al final del procesamiento utilizando las reglas siguientes:
fr: Le *record_id* est calculé à la fin du traitement sur la base des principes suivants :
it: Il *record_id* viene calcolato al termine dell'elaborazione in base ai seguenti principi:
nl: Het *record_id* wordt berekend op het einde van de verwerking, waarbij de volgende principes worden gehanteerd:

source: Filter the fields. Keep all the fields with the *ID* option or all the fields if no field has the *ID* option.
de: Felder filtern. Alle Felder mit der *ID*-Option behalten bzw. alle Felder behalten, falls kein Feld die *ID*-Option besitzt.
es: Filtrar los campos. Conservar todos los campos con la opción *ID* o todos los campos si no hay ningún campo con la opción *ID*.
fr: Filtrer les champs. Conserve tous les champs comportant l'option *ID* ou tous les champs si aucun champ ne comporte l'option *ID*.
it: Filtro dei campi. Conserva tutti i campi con l'opzione *ID*, oppure tutti i campi se nessuno di essi dispone dell'opzione *ID*.
nl: Filter de velden. Bewaar alle velden met de optie *ID* of alle velden indien geen enkel veld de optie *ID* heeft.

source: Sort the fields values.
de: Feldwerte sortieren.
es: Ordenar los valores de los campos.
fr: Trier les valeurs des champs.
it: Ordinamento dei valori dei campi.
nl: Sorteer de waarden van de velden.

source: Concat the sorted values.
de: Sortierte Werte verketten.
es: Concatenar los valores ordenados.
fr: Concaténer les valeurs triées.
it: Concatenazione dei valori ordinati.
nl: Koppel de gesorteerde waarden aaneen.

source: Apply a hash function to the result
de: Hash-Funktion auf Ergebnis anwenden
es: Aplicar una función hash al resultado.
fr: Appliquer une fonction de hachage sur le résultat.
it: Applicazione della funzione hash al risultato.
nl: Pas een klutsfunctie toe op het resultaat

source: Record timestamp
de: Zeitstempel des Eintrags
es: Marca de tiempo del registro
fr: Timestamp de l'enregistrement
it: Marca temporale del record
nl: Tijdstempel van een record

source: A *record_timestamp* field is generated for all records, it is a timestamp giving information about the creation date of the record. The value depends on the extractor type. For instance on a csv file, the *record_timestamp* is a last modified date. On a realtime dataset, the *record_timestamp* is the date when the record arrived on the platform.
de: Für jeden Eintrag wird ein Feld *Zeitstempel des Eintrags* generiert. Der Zeitstempel gibt Auskunft über das Erstellungsdatum des Eintrags. Der Wert hängt von dem Extraktortypen ab. Bei einer csv-Datei etwa ist der *Zeitstempel des Eintrags* das zuletzt geänderte Datum. Bei einem Echtzeit-Datensatz ist der *Zeitstempel des Eintrags* das Datum, an dem der Eintrag auf der Plattform erschienen ist.
es: Para todos los registros se genera un campo *record_timestamp*, una marca de tiempo que informa de la fecha de creación del registro. El valor depende del tipo de extractor. Por ejemplo, en un archivo CSV el valor de *record_timestamp* es la fecha de la última modificación. En un conjunto de datos en tiempo real, el valor de *record_timestamp* es la fecha en que el registro ha llegado a la plataforma.
fr: Un champ *record_timestamp* est généré pour tous les enregistrements. Il s'agit d'un timestamp qui fournit des informations sur la date de création de l'enregistrement. La valeur dépend du type d'extracteur. Par exemple, sur un fichier csv, la valeur *record_timestamp* est la date de dernière modification. Sur un jeu de données en temps réel, la valeur *record_timestamp* est la date à laquelle l'enregistrement a été créé sur la plateforme.
it: Per tutti i record viene generato un campo *record_timestamp* contenente la data della sua creazione. Il valore dipende dal tipo di estrattore. Ad esempio, nel caso di un file in formato csv il *record_timestamp* indica la data dell'ultima modifica. Su un dataset in tempo reale, invece, il *record_timestamp* corrisponde alla data in cui il record è giunto sulla piattaforma.
nl: Voor alle records wordt een *record_timestamp* veld aangemaakt. Het is een tijdstempel die informatie verschaft over de aanmaakdatum van het record. De waarde hangt af van het type extractor. Bijvoorbeeld, voor een CSV-bestand is de *record_timestamp* de datum van laatste wijziging. Voor een real time dataset, is de *record_timestamp* de datum waarop het record arriveerde op het platform.

source: Decimal
de: Dezimal
fr: Décimal
it: Decimale
nl: Decimaal
