Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/dataset_schema.po
Languages: de, es, fr, it, nl

source: Defining the dataset schema
de: Definieren des Datensatz-Schemas
es: Definir el esquema de conjunto de datos
fr: Définir le schéma du jeu de données
it: Definizione dello schema del dataset
nl: Het datasetschema definiëren

source: As seen in a previous article, a dataset content can be seen as a flat database table. That is:
de: Wie in einem der vorherigen Artikeln beschrieben, kann ein Datensatz-Content auch als flache Datenbanktabelle angezeigt werden. D. h.:
es: Como se ha descrito en un artículo anterior, el contenido de un juego de datos puede entenderse como una tabla de base de datos plana. Esto es:
fr: Comme vu dans un article précédent, un jeu de données peut être considéré comme un tableau de données assez classique. C'est-à-dire :
it: Come descritto in un precedente articolo, il contenuto di un dataset può essere considerato come una tabella di database flat, ovvero:
nl: Zoals we in het vorige artikel gezien hebben, kan de inhoud van een dataset beschouwd worden als een vlakke datasettabel. Dit is:

source: A schema (the list of fields along with their types and possibily some annotations)
de: Ein Schema (Liste der Felder mit ihren Typen und eventuell ein paar Anmerkungen)
es: Un esquema (la lista de campos junto con sus tipos y posiblemente algunas anotaciones).
fr: Un schéma (la liste des champs avec leur type et parfois des annotations)
it: uno schema (l'elenco dei campi, i relativi tipi ed eventualmente alcune annotazioni);
nl: Een schema (de lijst met velden samen met de types ervan en mogelijk enkele noteringen)

source: A set of records (rows or tuples) matching the schema
de: Ein Satz Einträge (Zeilen oder Tupel), die dem Schema entsprechen
es: Un conjunto de registros (filas o tuplas) que coinciden con el esquema.
fr: Un ensemble d'enregistrements (lignes) correspondant au schéma
it: una serie di record, come righe o tuple, corrispondenti allo schema.
nl: Een reeks records (rijen of tupels) die overeenstemmen met het schema

source: Whatever the original data source format is, the dataset content ends up as a flat database table content.
de: Unabhängig vom ursprünglichen Datenquellformat wird der Datensatz-Content zum flachen Datenbanktabellen-Content .
es: Independientemente del formato original del origen de datos, el contenido del juego de datos termina siendo un contenido de tabla de base de datos plana.
fr: Quel que soit le format de la source de donnée originale, le contenu finit toujours sous la forme d'une base de donnée structurée "plate" (un tableau).
it: Qualunque sia il formato dell'origine dei dati iniziale, il contenuto del dataset diventa il contenuto di una tabella di database flat.
nl: Ongeacht het formaat van de oorspronkelijke databron, eindigt de inhoud van een dataset uiteindelijk als de inhoud van een vlakke databasetabel.

source: Fields have a type. The following types are available:
de: Die Felder haben einen Typen. Es sind folgende Typen verfügbar:
es: Los campos tienen un tipo. Los tipos siguientes están disponibles:
fr: Les champs ont un type associée. Les types suivants sont disponibles :
it: Sono disponibili diversi tipi di campi:
nl: Velden hebben een type. De volgende types zijn beschikbaar:

source: Type
de: Typ
es: Tipo
it: Tipo

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Date
de: Datum
es: Fecha
it: Data
nl: Datum

source: Like ``2015/02/11`` or ``2015-02-11`` or ``02/11/2015``... . The platform will try to guess as accurately as possible the input date format. However, in case of bad detection or ambiguity, do not hesitate to use the **Date Normalizer** processor which lets you define precisely the parsing format of your date field.
de: Wie z. B. ``2015/02/11`` oder ``2015-02-11`` oder ``02/11/2015``... Die Plattform versucht das eingegebene Datumsformat so genau wie möglich zu erkennen. Falls das Datum jedoch falsch erkannt wurde bzw. zweideutig ist, nutzen Sie bitte den **Date Normalizer**-Prozessor, mit dem Sie das Parsing-Format Ihres Datumsfeldes genau festlegen können.
es: Como ``2015/02/11``, ``2015-02-11`` o ``02/11/2015``... La plataforma intentará averiguar con la mayor exactitud posible el formato de la fecha de entrada. Sin embargo, en caso de detección incorrecta o ambigüedad, no dude en utilizar el procesador **Normalizar fecha** para definir con precisión el formato de análisis del campo de fecha.
fr: Par exemple ``2015/02/11`` ou ``2015-02-11`` ou ``11/02/2015``... La plateforme va tenter de détecter le format de la date aussi précisément que possible. Cependant, si jamais la détection est fausse ou ambigüe, il est possible d'utiliser le processeur **Normaliser une date** qui vous permet de définir précisément le format à utiliser pour interpréter les valeurs de ce champ date.
it: Ad esempio ``2015/02/11`` o ``2015-02-11`` o ``02/11/2015`` e così via. La piattaforma cerca di interpretare nel modo più accurato possibile il formato della data di input. In caso di ambiguità o di errore nella rilevazione della data, utilizza il processore **Normalizzazione della data**, che permette di definire con precisione il formato di analisi del campo di data.
nl: Zoals ``2015/02/11`` of ``2015-02-11`` of ``02/11/2015``... . Het platform zal het formaat van de inputdatum zo nauwkeurig mogelijk proberen raden. In geval van een slechte detectie of dubbelzinnigheid, aarzel echter niet om de **Datum Normalizer** processor te gebruiken die u toelaat het parsing-formaat van uw datumveld nauwkeurig te definiëren.

source: DateTime
es: Fecha y hora
it: Data/ora
nl: DatumTijd

source: Like ``2015/02/11-08:09:10`` or ``2015-02-11T08:09:10`` or ``02/11/2015 08:09:10``... . Timezone specifications are also processed. The platform will try to guess as accurately as possible the input datetime format. However, in case of bad detection or ambiguity, do not hesitate to use the **Date Normalizer** processor which lets you define precisely the parsing format of your datetime field.
de: Wie z. B. ``2015/02/11-08:09:10`` oder ``2015-02-11T08:09:10`` oder ``02/11/2015 08:09:10``... Zeitzonenspezifikationen werden ebenfalls verarbeitet. Die Plattform versucht das eingegebene DateTime-Format so genau wie möglich zu erkennen. Falls das Datum jedoch falsch erkannt wurde bzw. zweideutig ist, nutzen Sie bitte den **Date Normalizer**-Prozessor, mit dem Sie das Parsing-Format Ihres DateTime-Feldes genau festlegen können.
es: Como ``2015/02/11-08:09:10``, ``2015-02-11T08:09:10`` o ``02/11/2015 08:09:10``... Las especificaciones de zona horaria también se procesan. La plataforma intentará averiguar con la mayor exactitud posible el formato de la fecha y hora de entrada. Sin embargo, en caso de detección incorrecta o ambigüedad, no dude en utilizar el procesador **Normalizar fecha** para definir con precisión el formato de análisis del campo de fecha y hora.
fr: Par exemple ``2015/02/11-08:09:10`` ou ``2015-02-11T08:09:10`` ou ``11/02/2015 08:09:10``... Les indications de fuseau horaire sont aussi utilisées. La plateforme va tenter de détecter le format de la date aussi précisément que possible. Cependant, si jamais la détection est fausse ou ambigüe, il est possible d'utiliser le processeur **Normaliser une date** qui vous permet de définir précisément le format à utiliser pour interpréter les valeurs de ce champ datetime.
it: Ad esempio ``2015/02/11-08:09:10`` o ``2015-02-11T08:09:10`` o ``02/11/2015 08:09:10`` e così via. Vengono elaborate anche le specificazioni relative al fuso orario. La piattaforma tenta di interpretare nel modo più accurato possibile il formato di data/ora immesso. In caso di ambiguità o di errore, tuttavia, utilizza il processore **Normalizzazione della data**, che permette di definire con precisione il formato di analisi del campo di data/ora.
nl: Zoals ``2015/02/11-08:09:10`` of ``2015-02-11T08:09:10`` of ``02/11/2015 08:09:10``... . Specificaties van tijdzones worden ook verwerkt. Het platform zal het formaat van de inputdatumtijd zo nauwkeurig mogelijk proberen raden. In geval van een slechte detectie of dubbelzinnigheid, aarzel echter niet om de **Datum Normalizer** processor te gebruiken die u toelaat het parsing-formaat an uw datumtijdveld nauwkeurig te definiëren.

source: A decimal number. Valid separators for the decimal part are ``.`` or ``,``. The space character can also be used as a thousands separator but not the ``,``.
de: Eine Dezimalzahl. Gültige Trennzeichen für den Dezimalteil sind ``.`` oder ``,``. Das Leerzeichen kann zudem als Tausender-Trennzeichen verwendet werden, jedoch nicht das ``,``.
es: Un número decimal. Los separadores válidos de la parte decimal son ``.`` y ``,``. También se puede usar el carácter de espacio como separador de las unidades de millar, pero ``,`` no está permitido.
fr: Un nombre décimal. Le séparateur peut être un point ``.`` ou une virgule ``,``. Le caractère espace peut également être utilisé comme séparateur des milliers, mais pas la virgule ``,``.
it: Numero decimale. Sono separatori validi per la parte decimale ``.`` o ``,``. Come separatore delle migliaia è anche possibile utilizzare lo spazio, ma non il carattere ``,``.
nl: Een decimaal getal. Geldige scheidingstekens voor het decimaalgedeelte zijn ``.`` of ``,``. Het spatiekarakter kan ook gebruikt worden als een scheidingsteken van duizendtallen, maar niet het teken ``,``.

source: Geo Point
de: Geopunkt
es: Punto geográfico
fr: Point géo

source: A single geographical location expressed in the format ``<LAT>,<LON>``, for instance ``45.8,2.5``. If your dataset contains two fields, latitude and longitude, you'll need to concatenate them with a **Concatenate Text** processor to form a valid geo point field.
de: Ein einzelner geografischer Standort, ausgedrückt im Format ``<LAT>,<LON>``, zum Beispiel ``45.8,2.5``. Wenn Ihr Datensatz zwei Felder enthält, d. h. Breitengrad und Längengrad, müssen Sie sie mit einem **Text verketten**-Prozessor verketten, um ein gültiges Geopunkt-Feld zu erstellen.
es: Una ubicación geográfica única expresada con el formato ``<LAT>,<LON>``, por ejemplo ``45.8,2.5``. Si el juego de datos contiene 2 campos, latitud y longitud, deberá concatenarlos con un procesador **Concatenar texto** para formar un campo de punto geográfico válido.
fr: Un emplacement géographique exprimé dans le format ``<LAT>,<LON>``, par exemple ``45.8,2.5``. Si le jeu de données contient deux champs séparés pour la latitude et la longitude, vous devrez les concaténer avec un processeur **Concaténer du Texte** afin de créer un champ de type géo point valide.
it: Singola ubicazione geografica espressa nel formato ``<LAT>,<LON>``, ad esempio ``45.8,2.5``. Se il dataset contiene due campi, latitudine e longitudine, è necessario concatenarli con il processore **Testo concatenato** per ottenere un campo geopoint valido.
nl: Een enkele geografische locatie uitgedrukt in het formaat ``<LAT>,<LON>``, bijvoorbeeld ``45.8,2.5``. Indien uw dataset twee velden, lengtegraad en breedtegraad, bevat, moet u deze aaneenkoppelen met een **Concatenate Text** processor om een geldig geo point-veld te vormen.

source: GeoShape
de: Geoform
es: Forma geográfica

source: A valid geo shape expressed in `GeoJSON <http://geojson.org/geojson-spec.html>`_.
de: Eine gültige Geoform, ausgedrückt in `GeoJSON <http://geojson.org/geojson-spec.html>`_.
es: Una forma geográfica válida expresada en `GeoJSON <http://geojson.org/geojson-spec.html>`_.
fr: Une forme géo valide exprimée en `GeoJSON <http://geojson.org/geojson-spec.html>`_.
it: Forma geografica valida espressa in `GeoJSON <http://geojson.org/geojson-spec.html>`_.
nl: Een geldige geo shape uitgedrukt in `GeoJSON <http://geojson.org/geojson-spec.html>`_.

source: For example :
de: Zum Beispiel:
es: Por ejemplo:
fr: Par exemple :
it: Ad esempio:
nl: Bijvoorbeeld:

source: Feature collections are not supported.
de: Funktionsgruppen werden nicht unterstützt.
es: No se permiten las colecciones de funciones.
fr: Les collections de caractéristiques ne sont pas prises en charge.
it: Le raccolte di caratteristiche non sono supportate.
nl: Functieverzamelingen worden niet ondersteund.

source: Integer
de: Ganzzahl
es: Entero
fr: Entier
it: Intero
nl: Geheel getal

source: Any valid integer value. If a floating point value is found, it is automatically cast to its integer part.
de: Ein beliebiger gültiger Ganzzahlwert. Sobald ein Gleitkommawert gefunden wird, wird er automatisch auf seinen ganzzahligen Teil übertragen.
es: Cualquier valor entero válido. Si se encuentra un valor de punto flotante, automáticamente se convierte a su parte entera.
fr: N'importe quelle valeur entière valide. S'il existe une partie non-entière, la valeur est automatiquement transformée en sa valeur entière uniquement.
it: Qualsiasi valore intero valido. Se viene rilevato un valore con virgola mobile, viene considerata automaticamente la parte intera.
nl: Elke geldige geheel getalwaarde. Wanneer een vlottende puntwaarde wordt gevonden, wordt deze automatisch gecast naar zijn geheel getalgedeelte.

source: Text
es: Texto
fr: Texte
it: Testo
nl: Tekst

source: Anything
de: Beliebig
es: Cualquiera.
fr: N'importe quelle valeur
it: Qualsiasi.
nl: Alles

source: File
de: Datei
es: Archivo
fr: Fichier
nl: Bestand

source: A file. Created from a File processor or a specific extractor.
de: Eine Datei. Von einem Dateiprozessor oder einem spezifischen Extraktor erstellt.
es: Un archivo. Creado a partir de un procesador de archivo o un extractor específico.
fr: Fichier. Créé à partir d'un processeur de fichiers ou d'un extracteur spécifique.
it: Un file. Creato con un processore di file o un estrattore specifico.
nl: Een bestand. Aangemaakt vanuit een File-verwerker of een specifieke extractor.

source: Next to their type, any field has a set of action items, which can be used to further refine your dataset schema.
de: Neben ihrem Typen besitzen die Felder einen Satz Aktionselemente, die zur weiteren Verfeinerung Ihres Datensatz-Schemas verwendet werden können.
es: Junto al tipo, cualquier campo tiene un conjunto de elementos de acción que se pueden utilizar para refinar aún más el esquema de juego de datos.
fr: A côté de leur type, chaque champ propose un certain nombre de boutons pour affiner encore le schéma du jeu de données.
it: Accanto al tipo, per ogni campo è possibile eseguire una serie di azioni con cui affinare lo schema del dataset.
nl: Naast het type ervan, heeft elk veld een reeks actie-items die gebruikt kunnen worden om het schema van uw dataset verder te verfijnen.

source: The **filter action** lets you define a **facet** for the field.
de: Mit der **Aktion Filtern** können Sie ein **Facet** für das Feld definieren.
es: La **acción de filtrar** permite definir una **faceta** para el campo.
fr: Le bouton **Facette** vous permet de définir une **facette** pour ce champ.
it: Il pulsante **Filtra** permette di definire un **facet** per il campo.
nl: De **filteractie** laat u toe een **facet** voor het veld te definiëren.

source: The **field configuration action** will be described in more details below.
de: Die **Aktion Feldkonfiguration** wird weiter unten genauer beschrieben.
es: La **acción de configurar el campo** se describe con más detalles a continuación.
fr: Le bouton **Configuration** est détaillé ci-dessous.
it: Il pulsante **Configurazione** è illustrato nel paragrafo successivo.
nl: De **veldconfiguratieactie** wordt hieronder meer in detail beschreven.

source: The **reorder fields action** lets you reorder dataset fields at your convenience. This only affects the dataset API output.
de: Mit der **Aktion Neu anordnen** können Sie Datensatzfelder beliebig neu anordnen. Dies betrifft ausschließlich die Datensatz-API-Ausgabe.
es: La **acción de reordenar los campos** permite reordenar los campos del juego de datos según convenga. Solo afecta a la salida de la API del juego de datos.
fr: Le bouton **Réordonner** vous permet de changer l'ordre des champs du jeu de données. Cela n'a d'effet que sur l'API.
it: Il pulsante **Riordina** permette di riordinare come desiderato i campi del dataset e influisce solo sull'output dell'API del dataset.
nl: De **herorden velden-actie** laat u toe de velden van de dataset te herordenen zoals u het wil. Dit heeft enkel een impact op de API-output van de dataset.

source: The **hide fields action** lets you hide specific dataset fields. Hidden fields are displayed at the right hand side of the table view and can easily be recovered.
de: Mit der **Aktion Felder verbergen** können Sie spezifische Datensatzfelder verbergen. Die verborgenen Felder werden rechts in der Tabellenansicht angezeigt und können problemlos wiederhergestellt werden.
es: La **acción de ocultar los campos** permite ocultar campos del juego de datos específicos. Los campos ocultos se visualizan a la derecha en la vista de tabla y se pueden recuperar fácilmente.
fr: Le bouton **Rejeter** vous permet de cacher un ou plusieurs champs pour ne pas les publier. Les champs cachés sont toujours disponibles à la droite des champs visibles et peuvent facilement être restaurés.
it: Il pulsante **Nascondi** permette di nascondere determinati campi del dataset. I campi nascosti vengono mostrati sulla destra della visualizzazione in tabella e possono essere facilmente recuperati.
nl: De **verberg velden-actie** laat u toe specifieke velden van de dataset te verbergen. Verborgen velden worden weergegeven op de rechterzijde van de tabelweergave en kunnen gemakkelijk worden gerecupereerd.

source: Configuring a field
de: Konfigurieren eines Feldes
es: Configurar un campo
fr: Configurer un champ
it: Configurazione di un campo
nl: Een veld configureren

source: The **field configuration button** allows you to fine tune your field's configuration.
de: Die **Schaltfläche Feldkonfiguration** ermöglicht Ihnen eine verfeinerte Feldkonfiguration.
es: El **botón de configurar el campo** permite ajustar la configuración del campo.
fr: Le bouton **Configuration** vous permet de paramétrer plus finement le champ.
it: Grazie al **pulsante Configurazione** è possibile perfezionare la configurazione del campo.
nl: De **veldconfiguratieknop** laat u toe de configuratie van uw veld te finetunen.

source: The generic option **ID** lets you define the record id computing policy. Each record is uniquely identified by its id, which is by default computed as the fingerprint of all the record fields values. The **ID** option lets you choose which fields are going to be used when computing the record id, making it possible to handle records deduplication at record fields level.
de: Mit der generischen Option **ID** können Sie die Berechnungsrichtlinie für die Eintrags-ID festlegen. Jeder Eintrag wird eindeutig durch seine ID gekennzeichnet, die standardmäßig als Fingerabdruck sämtlicher Eintragsfeldwerte berechnet wird. Mit der **ID**-Option können Sie auswählen, welche Felder bei der Berechnung der Eintrags-ID verwendet werden. Dadurch kann die Deduplizierung von Einträgen auf der Eintragsfeldebene verwaltet werden.
es: La opción genérica **ID** permite definir la política de cálculo de los ID de registro. Cada uno de los registros se identifica mediante un ID exclusivo, que de forma predeterminada se calcula como la huella digital de todos los valores de campos de registros. La opción **ID** permite elegir qué campos se utilizarán al calcular el ID de registro, lo que permite manejar la desduplicación de registros a nivel de los campos de registros.
fr: L'option **ID** vous permet de définir la façon dont l'identifiant de chaque enregistrement est généré. Chaque enregistrement est associé à un identifiant unique, qui par défaut est généré à partir d'une empreinte de l'ensemble de ses valeurs. L'option **ID** vous permet de choisir quel(s) champ(s) sont utilisés dans ce calcul, et ainsi de gérer un dédoublonnement directement en fonction des valeurs.
it: L'opzione generica **ID** consente di definire la politica di calcolo dell'ID dei record. Ciascun record è identificato in modo univoco dal proprio ID, che viene calcolato di default come l'impronta digitale di tutti i valori dei campi del record. Con l'opzione **ID** puoi scegliere quali campi verranno utilizzati nel calcolo dell'ID dei record, gestendo così la deduplicazione dei record a livello dei relativi campi.
nl: De generische optie **ID** laat u toe het beleid voor het berekenen van het record-ID te definiëren. Elk record wordt op unieke wijze geïdentificeerd door zijn ID, dat standaard berekend wordt als een vingerafdruk van alle waarden van de recordvelden. De **ID** optie laat u toe te kiezen welke velden gebruikt gaan worden voor het berekenen van het record-ID, waardoor het mogelijk wordt gemaakt om de deduplicatie van records uit te voeren op niveau van de recordvelden.

source: You then have access to a wide range of options depending on the field type.
de: Weiterhin haben Sie Zugriff auf zahlreiche Optionen, je nach Feldtyp.
es: Posteriormente accederá a diversas opciones según el tipo de campo.
fr: Vous avez ensuite accès à de nombreuses options selon le type du champ.
it: A seconda del tipo di campo sono disponibili varie opzioni.
nl: Vervolgens hebt u toegang tot een brede waaier aan opties afhankelijk van het veldtype.

source: Text fields
de: Textfelder
es: Campos de tipo Texto
fr: Champs texte
it: Campi di testo
nl: Tekstvelden

source: **Sortable**
de: **Sortierbar**
es: **Ordenable**
fr: **Triable**
it: **Ordinabile**
nl: **Sorteerbaar**

source: By default, textual fields are not sortable. This option lets you activate sorting on textual fields.
de: Textfelder sind standardmäßig nicht sortierbar. Mit dieser Option können Sie die Sortierung von Textfeldern aktivieren.
es: De forma predeterminada, los campos textuales no son ordenables. Esta opción permite activar la ordenación en los campos textuales.
fr: Par défaut, les champs de type texte ne sont pas triables. Cette option vous permet d'activer le tri sur un champ texte précis.
it: Per impostazione predefinita, i campi testuali non sono ordinabili. Questa opzione permette di attivare l'ordinamento sui campi testuali.
nl: Standaard kunnen tekstvelden niet worden gesorteerd. Deze optie laat u toe het sorteren op tekstvelden te activeren.

source: **Multivalued**
de: **Mehrwertig**
es: **Multivalor**
fr: **Multi-valué**
it: **Multivalore**
nl: **Met meerdere waarden**
