Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/federation.po
Languages: es

source: Federation
es: Federación

source: Federation is a core feature of the data network we are building. Using it is a good way to enrich your own data and it also gives a new way for others to discover and reuse them.
es: La federación es una función capital en la red de datos que estamos construyendo. Es una buena manera de enriquecer los propios datos y, al mismo tiempo, dar a los demás la oportunidad de descubrirlos y reutilizarlos.

source: Federation allows to redistribute, in full or in part, an open dataset from your domain (OpenDataSoft instance) or from another domain. It is a way to collect external sources of data on its own domain.
es: La federación permite redistribuir, total o parcialmente, un juego de datos abierto de su dominio propio (instancia de OpenDataSoft) o de otro dominio. Es una técnica para recopilar orígenes de datos externos en el dominio propio.

source: Source
es: Origen

source: To federate a dataset, simply go to the *Catalog > Dataset* page and hit **New dataset**. Then, hit the little arrow on the right side of the **Add a source** button.
es: Para federar un juego de datos, simplemente vaya a la página *Catálogo > Juego de datos* y haga clic en **Juego de datos nuevo**. A continuación, haga clic en la flechita a la derecha del botón **Añadir un origen**.

source: There is then a link **Add a dataset from the OpenDataSoft network**, it leads to a console from where it is possible to configure a new federated source.
es: Entonces aparece un vínculo **Añadir un juego de datos de la red OpenDataSoft**, que conduce a una consola desde la cual se puede configurar un origen federado nuevo.

source: Click on **Select a source dataset**.
es: Haga clic en **Seleccionar un juego de datos de origen**.

source: Different sources are available :
es: Hay varios orígenes disponibles:

source: The same domain
es: El mismo dominio

source: All open datasets from every OpenDataSoft domains
es: Todos los juegos de datos abiertos de todos los dominios OpenDataSoft

source: Domain's subdomains (optionnal)
es: Los subdominios del dominio (opcional)

source: From there the next step is to either select a whole dataset or to select a part of it. The filters are the same as in the dataset explore console, there are pre-defined filters, a query box and, if available, the geofilter.
es: A partir de ahí, el paso siguiente consiste en seleccionar un juego de datos completo o una parte de él. Los filtros son los mismos que en la consola de exploración del juego de datos; hay filtros predefinidos, un cuadro de consulta y, si está disponible, el filtro geográfico.

source: Once the data is selected the dataset appears in the backoffice like a normal one, except that there is no *Processing* tab. Indeed, the data is not duplicated and it is not possible to transform it. Only the metadata and visualization configuration can be overriden.
es: Una vez seleccionados los datos, el juego de datos aparece en el back office como otro normal, con la salvedad de que no hay ninguna ficha *Procesamiento*. Efectivamente, los datos no se duplican y no es posible efectuar la transformación. Tan solo se puede sobrescribir la configuración de la visualización y los metadatos.

source: Overriding metadata and visualizations
es: Sobrescribir metadatos y visualizaciones

source: Both metadata and visualization can be overriden. Simply hit **Override** and fill the value you want.
es: Los metadatos y las visualizaciones se pueden sobrescribir. Simplemente haga clic en **Sobrescribir** y especifique el valor deseado.

source: It is possible to come back to the original value by hitting **Return to original value**.
es: Puede recuperar el valor original haciendo clic en **Volver a valor original**.

source: Limitations
es: Limitaciones

source: The federation does not duplicate the data. Only the metadata and visualizations are duplicated, hence can be overriden. There are two reasons for that:
es: La federación no duplica los datos. Solo los metadatos y las visualizaciones se duplican y, por ende, se pueden sobrescribir. Hay 2 motivos que explican esta circunstancia:

source: It is then possible to redistribute data without impacting the size of the data defined in the contract,
es: Después se pueden redistribuir los datos sin afectar al tamaño de los datos definidos en el contrato.

source: When the data changes, the federated dataset is always up-to-date.
es: Si los datos cambian, el juego de datos federado se mantiene siempre actualizado.

source: Currently, when there is a modification in the original dataset related to the dataset schema, metadata or visualizations configuration, the federated dataset is not automatically updated. You'll then have to unpublish / republish your federated dataset to reflect the changes.
es: Actualmente, cuando hay una modificación en el juego de datos original relacionado con el esquema de juego de datos, la configuración de las visualizaciones o los metadatos, el juego de datos federado no se actualiza de forma automática. Tendrá que cancelar la publicación del juego de datos federado y volver a publicarlo para reflejar los cambios.
