Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters.po
Languages: es

source: Harvesters
es: Recopiladores

source: Harvesters provide a way for administrators to easily create and update an important number of datasets by importing them from an external source such as a CSW catalog or an ArcGIS service, among many others.
es: Los recopiladores permiten a los administradores crear y actualizar fácilmente un número importante de juegos de datos importándolos de un origen externo como un catálogo CSW o un servicio ArcGIS, entre muchos otros.

source: The two main usages of harvesters are:
es: Los 2 usos principales de los recopiladores son:

source: Bootstrap your portal with datasets from an existing portal
es: Efectuar un arranque del portal con juegos de datos de un portal ya existente

source: Keep your datasets synchronised with an external service
es: Mantener los juegos de datos sincronizados con un servicio externo

source: The harvester will create datasets, update their metadata and resources, keep them synchronized, and publish them.
es: El recopilador creará los juegos de datos, actualizará sus metadatos y recursos, los mantendrá sincronizados y los publicará.

source: Global overview
es: Visión general

source: Creating a harvester
es: Crear un recopilador

source: To get started with harvesters, click on the **harvesters** menu in your backoffice, and then on **Add harvester**. You will be asked to choose the type of the portal you want to harvest, and a name for your harvester.
es: Para empezar a trabajar con los recopiladores, haga clic en el menú **Recopiladores** del back office y, acto seguido, en **Añadir recopilador**. Se le pedirá que elija el tipo de portal que desea recopilar y un nombre para el recopilador.

source: When you are done, click on **Create harvester** and you will be redirected to the configuration form of the harvester. As it depends on the harvester type, please refer to each harvester page below for detailed instructions.
es: Cuando haya terminado, haga clic en **Crear recopilador** y se le redirigirá al formulario de configuración del recopilador. Como varía según el tipo de recopilador, consulte las instrucciones detalladas en la página de cada uno de los recopiladores.

source: Some options are available for every harvester type such as:
es: Algunas opciones están disponibles para todos los tipos de recopiladores, como las siguientes:

source: **Update on deletion**: if the source datasets are deleted on the harvested portal, delete them on this OpenDataSoft portal too. Otherwise, you may have datasets that are not available on the external service anymore (e.g: if they are deleted from the external service).
es: **Actualizar al suprimir**: Si los juegos de datos de origen se suprimen en el portal recopilado, suprimirlos también en este portal OpenDataSoft. De lo contrario, usted puede tener juegos de datos que ya no estén disponibles en el servicio externo (p. ej. al suprimirse del servicio externo).

source: **Download resources**: download resources instead of attaching them via URL. This options allows you to detach your datasets from the remote portal by permanently copying all required data on the OpenDataSoft platform. Otherwise, your datasets will be linked to the external service and will access remote datasets via their URL for every publishing.
es: **Descargar recursos**: Descargar los recursos en lugar de asociarlos mediante la dirección URL. Esta opción permite desasociar los juegos de datos del portal remoto copiando de forma permanente todos los datos necesarios en la plataforma OpenDataSoft. De lo contrario, los juegos de datos estarán vinculados al servicio externo y se accederá a los juegos de datos remotos a través de la dirección URL en cada una de las publicaciones.

source: **Restrict visibility**: make the visibility of harvested datasets restricted. Otherwise, they will have the default visibility of your portal.
es: **Restringir visibilidad**: Establecer la visibilidad de los juegos de datos recopilados como restringida. De lo contrario, tendrán la visibilidad predeterminada del portal.

source: **Default metadata**, **inspire metadata**, **DCAT metadata**: allow you to override some metadata in every harvested dataset. Useful if you want to force the theme or publisher instead of using the one used on the external service.
es: **Metadatos predeterminados**, **Metadatos Inspire**, **Metadatos DCAT**: Permiten sobrescribir algunos metadatos en todos los juegos de datos recopilados. Esta opción resulta de utilidad si se desea forzar el tema o publicador en lugar de utilizar el del servicio externo.

source: Once you are done configuring the harvester, you can click on the **Preview** button to test run it on a few datasets. If you see some titles and descriptions and they look correct, you are all set. Otherwise, please double check your configuration.
es: Cuando haya terminado de configurar el recopilador, puede hacer clic en el botón **Vista previa** para llevar a cabo una ejecución de prueba en algunos juegos de datos. Si observa títulos y descripciones con una apariencia correcta, ya ha completado la tarea. De lo contrario, revise la configuración.

source: Running a harvester
es: Ejecutar un recopilador

source: The harvesting process can be quite long on external services with many datasets or with big ones, so it is split in two phases.
es: El proceso de recopilación puede ser bastante largo en servicios externos con juegos de datos numerosos o voluminosos, por lo que se ha dividido en 2 fases.

source: First, the harvester will connect to the remote service and discover all the datasets it contains. It will then create an unpublished dataset for each remote dataset it finds. These datasets will contain all available metadata and resources (as URLs or as files depending on the *download resources* option). This happens when you click on the **Start harvester** button.
es: En primer lugar, el recopilador conectará con el servicio remoto y descubrirá todos los juegos de datos que contiene. A continuación, creará un juego de datos con publicación cancelada para cada uno de los juegos de datos remotos que encuentre. Estos juegos de datos contendrán todos los metadatos y recursos disponibles (como direcciones URL o archivos, según la opción *Descargar recursos*). Esto sucede al hacer clic en el botón **Iniciar recopilador**.

source: Next, it will process and publish all the harvested datasets. This step can take a while. This happens when you click on the **Publish** button.
es: Después procesará y publicará todos los juegos de datos recopilados. Este paso puede tardar bastante tiempo. Esto sucede al hacer clic en el botón **Publicar**.

source: Editing harvested datasets
es: Editar juegos de datos recopilados

source: Before publishing them, you can change the metadata of the harvested datasets. On the dataset page (information tab), you can manually override metadata by clicking on **Override** and adding your own value. This override will be kept even if you restart your harvester.
es: Antes de publicarlos, puede cambiar los metadatos de los juegos de datos recopilados. En la página de juego de datos (ficha de información), puede sobrescribir manualmente los metadatos haciendo clic en **Sobrescribir** y añadiendo su propio valor. El valor sobrescrito se mantiene incluso si se reinicia el recopilador.

source: Deleting a harvester
es: Suprimir un recopilador

source: When you delete a harvester by clicking the **Delete harvester** button, you can choose between keeping the harvested datasets (they will be kept as regular datasets in your catalog), or by deleting them with the harvester.
es: Al suprimir un recopilador haciendo clic en el botón **Suprimir recopilador**, puede elegir entre conservar los juegos de datos recopilados (se conservarán como juegos de datos normales del catálogo) o suprimirlos con el recopilador.

source: If you choose to keep them, please keep in mind that you will have to handle them one by one to unpublish or delete them afterwards, and that they will be duplicated if you recreate another harvester on the same external service.
es: Si decide conservarlos, tenga en cuenta que deberá manejarlos de forma individual si más tarde desea cancelar su publicación o suprimirlos, y que se duplicarán si vuelve a crear otro recopilador en el mismo servicio externo.

source: Harvester types
es: Tipos de recopilador

source: Portals
es: Portales

source: Services
es: Servicios

source: Scheduling
es: Planificación

source: From the configuration page of a harvester, it is possible to make it run periodically. To do this, scroll to the bottom of the page and click on "Set recurring runs". You can run the harvester every day, or choose the days of week or the days of month it will run on. However, you always have to choose the time of day when it will run because it can not run more than once a day.
es: En la página de configuración de un recopilador, se puede establecer que este se ejecute periódicamente. Para ello, desplácese a la parte inferior de la página y haga clic en "Establecer ejecuciones recurrentes". Puede ejecutar el recopilador todos los días o elegir qué días de la semana o mes se ejecutará. Sin embargo, siempre debe elegir la hora del día en que se ejecutará porque solo se admite una ejecución al día.

source: The periodic run will only trigger if the harvester has been run at least once.
es: La ejecución periódica tan solo se desencadenará si el recopilador se ha ejecutado como mínimo una vez.

source: At the end of a scheduled run, all the harvester's already published datasets will be republished, but unpublished datasets or new datasets will not be automatically published.
es: Al final de una ejecución planificada, se habrán vuelto a publicar los juegos de datos ya publicados de todos los recopiladores, aunque no se habrán publicado automáticamente los juegos de datos con la publicación cancelada o los juegos de datos nuevos.
