Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/processing.po
Languages: de, es, fr, it, nl

source: insee_code (integer)
de: insee_code (Ganzzahl)
es: insee_code (entero)
fr: insee_code (entier)
it: insee_code (intero)
nl: insee_code (geheel getal)

source: to obtain this result:
de: um dieses Ergebnis zu erhalten:
es: para obtener el resultado:
fr: pour obtenir ce résultat :
it: Il risultato sarà il seguente:
nl: om dit resultaat te bekomen:

source: Note that even though the insee_code was not in the same type, the matching happened. The matching worked even for the value ``1262`` in the first dataset (note the absence of leading 0, due to it being an integer value), that matched against the value ``01262`` in the second dataset.
de: Beachten Sie, dass der Abgleich trotz des unterschiedlichen Formats beim insee_code erfolgreich war. Der Abgleich funktionierte sogar für den Wert ``1262`` im ersten Datensatz (beachten Sie das Fehlen der führenden 0, da es ein Ganzzahlwert ist), der dem Wert ``01262`` im zweiten Datensatz zugeordnet wurde.
es: Tenga en cuenta que, aunque insee_code no era del mismo tipo, se ha detectado la coincidencia. La coincidencia ha funcionado incluso para el valor "1262" del primer conjunto de datos (obsérvese la ausencia de 0 inicial al tratarse de un valor entero), que ha coincidido con el valor "01262" del segundo conjunto de datos.
fr: Notez que même si insee_code n'est pas au même format, la mise en correspondance a réussi. La correspondance a réussi même pour la valeur ``1262`` dans le premier jeu de données (notez l'absence d'un 0 non significatif, car il s'agit d'une valeur entière), qui a été mise en correspondance avec la valeur ``01262`` dans le deuxième jeu de données.
it: Nota che, anche se insee_code non è dello stesso tipo, la corrispondenza è stata rilevata. Identico discorso per il valore ``1262`` del primo dataset (nota l'assenza dello 0 iniziale, poiché si tratta di un valore intero), che è stata associato al valore ``01262`` del secondo dataset.
nl: Merk op dat, hoewel de insee_code niet hetzelfde type was, de matching toch doorging. De matching werkte zelfs voor de waarde ``1262`` in de eerste dataset (merk de afwezigheid op van de leading 0, als gevolg van het feit dat het een geheel getal was), die matchte met de waarde ``01262`` in de tweede dataset.

source: While most column types can be retrieved by using the join datasets processor, file type columns do not yield the actual resource through the processor but instead yield the name of the underlying resource.
de: Während die meisten Spaltentypen mit dem Prozessor zur Datensatzverbindung abgerufen werden können, geben Dateitypspalten nicht die tatsächliche Ressource über den Prozessor an, sondern stattdessen den Namen der hinterlegten Ressource.
es: Mientras que la mayoría de los tipos de columnas se pueden recuperar mediante el procesador de unión de conjuntos de datos, las columnas de tipo archivo no generan el recurso real por medio del procesador sino que generan el nombre del recurso subyacente.
fr: Si la plupart des types de colonne peuvent être récupérés au moyen du processeur de jonction de jeu de données, les colonnes de type de fichier ne renvoient pas la ressource réelle via le processeur, mais renvoient à la place le nom de la ressource sous-jacente.
it: Se da una parte quasi tutti i tipi di colonna possono essere recuperati tramite il processore di unione dei dataset, dall'altra con quest'ultimo le colonne del tipo di file non forniscono la risorsa effettiva, ma il nome della risorsa primaria.
nl: Hoewel de meeste kolomtypes teruggevonden kunnen worden door de join datasets-processor te gebruiken, leveren de kolommen met het bestandstype niet de effectieve bron op via de processor maar in plaats daarvan de naam van de onderliggende bron.

source: By default, this processor can only be used with remote datasets that have fewer than 100000 records.
de: Standardmäßig kann dieser Prozessor nur für Remote-Datensätze mit weniger als 100.000 Einträgen verwendet werden.
es: De forma predeterminada, este procesador solo se puede utilizar con conjuntos de datos remotos que tengan menos de 100000 registros.
fr: Par défaut, ce processeur peut uniquement être utilisé avec des jeux de données distants qui contiennent moins de 100 000 enregistrements.
it: Per impostazione predefinita, questo processore può essere utilizzato solo con dataset remoti con meno di 100.000 record.
nl: Standaard zal deze processor enkel gebruikt kunnen worden met datasets op afstand die minder dan 100000 records bevatten.

source: Extract from JSON
de: Extrahieren von JSON
es: Extraer de JSON
fr: Extraire depuis un objet JSON
it: Estrai da JSON
nl: Extraheer uit JSON

source: This processor extracts values from a field containing a JSON object following a list of iJSON rules.
de: Dieser Prozessor extrahiert Werte aus einem Feld mit einem JSON-Objekt nach einer Liste von iJSON-Regeln.
es: Este procesador extrae los valores de un campo que contiene un objeto JSON siguiendo una lista de reglas iJSON.
fr: Ce processeur permet d'extraire des valeurs depuis un champ contenant un objet JSON en observant une liste de règles iJSON.
it: Questo processore estrae i valori da un campo che contiene un oggetto JSON, in base a un elenco di regole iJSON.
nl: Deze processor extraheert waarden uit een veld dat een JSON-voorwerp bevat volgens een lijst met iJSON-regels.

source: It creates target columns for the extracted data that are automatically named like the iJSON rules but replacing dots with underscores. For each iJSON rule, a column is created with the extracted value.
de: Er erzeugt Zielspalten für die extrahierten Daten, die automatisch wie die iJSON-Regeln benannt werden, aber Punkte durch Unterstriche ersetzen. Für jede iJSON-Regel wird eine Spalte mit dem extrahierten Wert erstellt.
es: Crea columnas de destino para los datos extraídos que se denominan automáticamente como las reglas iJSON pero sustituyendo los puntos por guiones bajos. Para cada una de las reglas iJSON, se crea una columna con el valor extraído.
fr: Il crée des colonnes cibles pour les données extraites qui sont automatiquement nommées de la même manière que les règles ijson, mais en remplaçant les points par des underscores ("_"). Pour chaque règle iJSON, une colonne contenant la valeur extraite est créée.
it: In tal modo, le colonne di destinazione dei dati estratti vengono create e automaticamente denominate in base alle regole iJSON, sostituendo i punti con i trattini bassi. Per ogni regola iJSON, viene creata una colonna con il valore estratto.
nl: Hij maakt doelkolommen aan voor de geëxtraheerde data die automatisch benoemd worden zoals de iJSON-regels maar waarbij puntjes vervangen worden door laag liggende streepjes. Voor elke iJSON-regel wordt een kolom aangemaakt met de geëxtraheerde waarde.

source: The processor doesn't support iJSON rules that lead to an array (containing a ``.item`` in the rule).
de: Der Prozessor unterstützt keine iJSON-Regeln, die zu einem Array führen (mit einem ".item" in der Regel).
es: El procesador no admite reglas iJSON que lleven a una matriz (con un ``.item`` en la regla).
fr: Le processeur ne prend pas en charge les règles iJSON qui entraînent la création d'un tableau (règles qui contiennent un ``.item``).
it: Il processore non supporta le regole iJSON che generano un array (regole contenenti ``.item``).
nl: De processor ondersteunt geen iJSON-regels die leiden tot een array (waarbij een ``.item`` in de regel staat).

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
it: Esempio
nl: Voorbeeld

source: Name of the field that holds the JSON object
de: Name des Feldes, das das JSON-Objekt enthält
es: Nombre del campo que contiene el objeto JSON.
fr: Nom du champ contenant l'objet JSON
it: Nome del campo che contiene l'oggetto JSON.
nl: Naam van het veld waarin het JSON-voorwerp staat

source: data
de: Daten
es: datos

source: iJSON rules
de: iJSON-Regeln
es: Reglas iJSON
fr: Règles iJSON
it: Regole iJSON
nl: iJSON-regels

source: iJSON rules to apply to extract data from the JSON object above. An iJSON rule is built with the names of all the field from the JSON root to the data to extract, separated with a dot.
de: iJSON-Regeln für die Extraktion von Daten aus dem oben genannten JSON-Objekt. Eine iJSON-Regel wird mit den Namen des gesamten Feldes aus dem JSON-Root für die zu extrahierenden Daten aufgebaut (getrennt mit einem Punkt).
es: Las reglas iJSON que se aplicarán para extraer datos del objeto JSON indicado anteriormente. Una regla iJSON se construye con los nombres de todos los campos desde la raíz JSON hasta los datos para extraer, separados por un punto.
fr: Règles iJSON à appliquer pour extraire les données de l'objet JSON ci-dessus. Une règle iJSON se construit avec les noms de tous les champs de la racine JSON des données à extraire, séparés par des points.
it: Le regole iJSON vengono applicate per estrarre i dati dall’oggetto JSON. Una regola iJSON è composta dai nomi di tutti i campi, dalla radice JSON fino ai dati da estrarre, separati da un punto.
nl: Toe te passen iJSON-regels om data te extraheren uit het bovenstaande JSON-voorwerp. Een iJSON-regel is opgebouwd met de namen van alle velden uit de JSON-root naar de data die geëxtraheerd moeten worden, gescheiden door een puntje.

source: For example, let's assume that you have this JSON object into a text field :
de: Nehmen wir zum Beispiel an, dass Sie dieses JSON-Objekt in einem Textfeld haben:
es: Por ejemplo, supongamos que tiene este objeto JSON en un campo de texto:
fr: Par exemple, supposons que cet objet JSON est présent dans un champ texte :
it: Ad esempio, ipotizziamo di avere il seguente oggetto JSON in un campo di testo:
nl: Bijvoorbeeld: veronderstel dat u dit JSON-voorwerp in een tekstveld heeft:

source: you will be able to extract the value ``Joe`` with this rule : ``metaA``
de: Sie können den Wert "Joe" mit dieser Regel extrahieren: "metaA"
es: Podrá extraer el valor ``Joe`` con esta regla: ``metaA``.
fr: vous pouvez extraire la valeur ``Joe`` avec cette règle : ``metaA``
it: è possibile estrarre il valore ``Joe`` con questa regola: ``metaA``
nl: u zal de waarde ``Joe`` kunnen extraheren met deze regel: ``metaA``

source: you will be able to extract the value ``valueB`` with this rule : ``bloc.metaB``
de: Sie können den Wert "valueB" mit dieser Regel extrahieren: "bloc.metaB"
es: Podrá extraer el valor ``valueB`` con esta regla: ``bloc.metaB``.
fr: vous pouvez extraire la valeur ``valueB`` avec cette règle : ``bloc.metaB``
it: è possibile estrarre il valore ``valueB`` con questa regola: ``bloc.metaB``
nl: u zal de waarde ``valueB`` kunnen extraheren met deze regel: ``bloc.metaB``

source: you will be able to extract the value ``5`` with this rule : ``bloc.int``
de: Sie können den Wert "5" mit dieser Regel extrahieren: "bloc.int"
es: Podrá extraer el valor ``5`` con esta regla: ``bloc.int``.
fr: vous pouvez extraire la valeur ``5`` avec cette règle : ``bloc.int``
it: è possibile estrarre il valore ``5`` con questa regola: ``bloc.int``
nl: u zal de waarde ``5`` kunnen extraheren met deze regel: ``bloc.int``

source: you will be able to extract the value ``sub_value`` with this rule : ``sub.sub_sub``
de: Sie können den Wert "sub_value" mit dieser Regel extrahieren: "sub.sub_sub"
es: Podrá extraer el valor ``sub_value`` con esta regla: ``sub.sub_sub``.
fr: vous pouvez extraire la valeur ``sub_value`` avec cette règle : ``sub.sub_sub``
it: è possibile estrarre il valore ``sub_value`` con questa regola: ``sub.sub_sub``
nl: u zal de waarde ``sub_value`` kunnen extraheren met deze regel: ``sub.sub_sub``

source: The rule ``bloc`` will extract the JSON object :
de: Die Regel "bloc" extrahiert das JSON-Objekt:
es: La regla ``bloc`` extraerá el objeto JSON:
fr: La règle ``bloc`` extrait l'objet JSON :
it: la regola ``bloc`` estrae l'oggetto JSON:
nl: De regel ``bloc`` zal het JSON-voorwerp extraheren:

source: This processor is not yet available by default. Please contact OpenDataSoft support team if you plan to use it, we will activate it for you.
de: Dieser Prozessor ist standardmäßig noch nicht verfügbar. Sollten Sie ihn benötigen, wenden Sie sich bitte an das OpenDataSoft-Supportteam, damit wir ihn aktivieren können.
es: Este procesador todavía no está disponible de forma predeterminada. Póngase en contacto con el equipo de soporte de OpenDataSoft si tiene previsto usarlo y se le activará.
fr: Ce processeur n'est pas disponible par défaut. Vous pouvez contacter l'équipe support OpenDataSoft si vous souhaitez l'utiliser, et nous pourrons vous l'activer.
it: Questo processore non è ancora disponibile in modalità predefinita. Se desideri utilizzarlo, ti invitiamo a contattare il team di assistenza OpenDataSoft, che lo attiverà per te.
nl: Deze processor is nog niet standaard beschikbaar. Gelieve contact op te nemen met het Support Team van OpenDataSoft indien u van plan bent deze te gebruiken. Wij zullen deze dan voor u activeren.

source: Expand JSON array
de: Ein JSON-Array erweitern
es: Expandir matriz JSON
fr: Développer le tableau JSON
it: Espandi l'array JSON
nl: Vergroot JSON-array

source: This processor transposes rows containing a JSON array into several rows with a new column containing each value of the array.
de: Dieser Prozessor wandelt Zeilen mit einem JSON-Array in mehrere Zeilen mit einer neuen Spalte um, die jeden Wert des Arrays enthält.
es: Este procesador transpone las filas que contiene una matriz JSON en varias filas con una columna nueva que contiene cada uno de los valores de la matriz.
fr: Ce processeur permet de transposer les lignes contenant un tableau JSON en plusieurs lignes avec une nouvelle colonne contenant chaque valeur du tableau.
it: Questo processore traspone le righe contenenti un array JSON in più righe, con una nuova colonna contenente ciascun valore dell'array.
nl: Deze processor zet rijen die een JSON array bevatten om in verschillende rijen met een nieuwe kolom die elke waarde van de array bevat.

source: The parameter "iJSON rule to array" works exactly like in the "Extract from JSON" processor and should contain the array to transpose (represented with the iJSON rule ``.item``).
de: Der Parameter "iJSON-Regel zu Array" funktioniert genau wie der Prozessor "Extrahieren von JSON" und sollte das umzuwandelnde Array beinhalten (dargestellt mit der iJSON-Regel ".item").
es: El parámetro "Regla iJSON para matriz" funciona exactamente igual que en el procesador "Extraer de JSON" y debe contener la matriz para transponer (representada con ``.item`` en la regla iJSON).
fr: Le paramètre "Règle iJSON vers tableau" fonctionne exactement de la même manière que dans le processeur "Extraire depuis un objet JSON" et doit contenir le tableau à transposer (représenté par la règle ``.item``).
it: Il parametro "regola iJSON per l'array" funziona esattamente come il processore "Estrai da JSON" e deve contenere l'array da trasporre (rappresentato con la regola iJSON ``.item``).
nl: De parameter "iJSON-regel naar array" werkt precies zoals in de processor "Extraheer uit JSON" en zou de array die omgezet moet worden, moeten bevatten (weergegeven door de iJSON-regel ``.item``).

source: If the field contains the JSON array directly, just put ``item`` as an iJSON rule.
de: Wenn das Feld das JSON-Array direkt enthält, setzen Sie einfach "item" als iJSON-Regel.
es: Si el campo contiene la matriz JSON directamente, simplemente ponga ``item`` como regla iJSON.
fr: Si le champ contient directement le tableau JSON, ajoutez simplement ``.item`` en tant que règle iJSON.
it: Se il campo contiene direttamente l'array JSON, inserisci solo ``item`` come regola iJSON.
nl: Wanneer het veld rechtstreeks de JSON-array bevat, plaats dan enkel ``item`` als een iJSON-regel.

source: If the final element is an array, the iJSON rule must end with ``.item``, meaning that the reached object should be treated as an array of items in the iJSON syntax.
de: Ist das endgültige Element ein Array, muss die iJSON-Regel mit ".item" enden, d. h. das erreichte Objekt muss wie ein Array von Elementen in der iJSON-Syntax behandelt werden.
es: Si el elemento final es una matriz, la regla iJSON debe terminar con ``.item``, lo que significa que el objeto alcanzado debe tratarse como una matriz de elementos en la sintaxis iJSON.
fr: Si l'élément final est un tableau, la règle iJSON doit se terminer par ``.item``, ce qui signifie que l'objet atteint doit toujours être traité comme un tableau d'éléments dans la syntaxe iJSON.
it: Se l'elemento finale è un array, la regola iJSON deve terminare con ``.item``, che significa che l'oggetto raggiunto deve essere trattato come un array di elementi della sintassi iJSON.
nl: Wanneer het laatste element een array is, moet de iJSON-regel eindigen met ``.item``. Dit betekent dat het bereikte voorwerp behandeld zou moeten worden als een array van items in de iJSON-syntax.

source: If you want to keep going into the items inside the array, you can keep adding key names after the ``.item``, but be careful to check that this path is valid for every object in the array.
de: Wenn Sie an den Items innerhalb des Arrays interessiert sind, können Sie nach dem ".item" Schlüsselnamen hinzufügen, achten Sie jedoch darauf, dass der Pfad für jedes Objekt im Array gültig ist.
es: Si quiere seguir con los elementos de la matriz, puede seguir añadiendo nombres de clave tras ``.item``, pero debe comprobar que esta ruta es válida para cada uno de los objetos de la matriz.
fr: Si vous souhaitez continuer à énumérer les articles dans le tableau, vous pouvez continuer à ajouter des noms de clé après ``.item``. Veillez toutefois à vous assurer que ce chemin d'accès est valide pour chaque objet dans le tableau.
it: Se desideri proseguire con gli elementi all'interno dell'array, puoi continuare ad aggiungere nomi chiave dopo ``.item``, ma verifica che questo percorso sia valido per ciascuno degli oggetti dell'array.
nl: Wanneer u wil blijven verdergaan in de items in de array, kan u kernnamen blijven toevoegen na het ``.item``. Zorg er wel voor dat u controleert of dit pad geldig is voor elk voorwerp in de array.

source: JSON array field
de: JSON-Array-Feld
es: Campo de matriz JSON
fr: Champ du tableau JSON
it: Campo array JSON
nl: JSON array-veld

source: Name of the field that holds the JSON array
de: Name des Feldes, das das JSON-Array enthält
es: Nombre del campo que contiene la matriz JSON.
fr: Nom du champ contenant le tableau JSON
it: Nome del campo che contiene l'array JSON.
nl: Naam van het veld waarin de JSON array staat

source: iJSON rule to array
de: iJSON-Regel nach Array
es: Regla iJSON para matriz
fr: Règle iJSON vers tableau
it: Regola iJSON per l'array
nl: iJSON regel naar array

source: iJSON rule to iterate in the JSON array above. An iJSON rule is built with the names of all the field from the JSON root to the data to extract, separated with a dot.
de: iJSON-Regel, um im oben genannten JSON-Array zu iterieren. Eine iJSON-Regel wird mit den Namen des gesamten Feldes aus dem JSON-Root für die zu extrahierenden Daten aufgebaut (getrennt mit einem Punkt).
es: Regla iJSON para iterar en la matriz JSON indicada anteriormente. Una regla iJSON se construye con los nombres de todos los campos desde la raíz JSON hasta los datos para extraer, separados por un punto.
fr: Règle iJSON à itérer dans le tableau JSON ci-dessus. Une règle iJSON se construit avec les noms de tous les champs de la racine JSON des données à extraire, séparés par des points.
it: Regola iJSON da iterare nel precedente array JSON. La regola iJSON viene creata con i nomi di tutti i campi dalla radice JSON fino ai dati da estrarre, separati da un punto.
nl: iJSON regel die herhaald moet worden in de bovenstaande JSON array. Een iJSON-regel is opgebouwd met de namen van alle velden uit de JSON root naar de data die geëxtraheerd moeten worden, gescheiden door een puntje.

source: Name of the field that will contain the extracted element
de: Name des Feldes, das das extrahierte Element enthalten wird
es: Nombre del campo que contendrá el elemento extraído.
fr: Nom du champ qui contiendra l'élément extrait
it: Nome del campo che conterrà l'elemento estratto.
nl: Naam van het veld dat het geëxtraheerde element zal bevatten

source: Example of iJSON rules to extract from the following JSON array field:
de: Beispiel für iJSON-Regeln, um aus dem folgenden JSON-Array-Feld zu extrahieren:
es: Ejemplo de reglas iJSON para extraer del campo de matriz JSON siguiente:
fr: Exemple de règles iJSON pour réaliser une extraction à partir du champ du tableau JSON suivant :
it: Esempio di regole iJSON per l'estrazione dal seguente campo dell'array JSON:
nl: Voorbeeld van iJSON-regels die geëxtraheerd moeten worden uit het volgende JSON array-veld:

source: ``item`` will transpose the record into two, one with each object of the array in the "Output field" column
de: "item" wird den Eintrag in zwei Einträge umwandeln, einen mit jedem Objekt des Arrays in der Spalte "Ausgabefeld"
es: ``item`` transpondrá el registro en 2, uno con cada uno de los objetos de la matriz en la columna "Campo de salida".
fr: ``item`` transpose l'enregistrement en deux enregistrements, qui contiennent chaque objet du tableau dans la colonne "Champ de sortie"
it: ``item`` traspone il record in due, uno con ogni oggetto dell'array della colonna "Campo di output".
nl: ``item`` zal het record omzetten in twee, één met elk voorwerp van de array in de kolom "Outputveld"

source: ``bloc.item`` will transpose the record into two, one with each object of the array in the "Output field" column
de: "bloc.item" wird den Eintrag in zwei Einträge umwandeln, einen mit jedem Objekt des Arrays in der Spalte "Ausgabefeld"
es: ``bloc.item`` transpondrá el registro en 2, uno con cada uno de los objetos de la matriz en la columna "Campo de salida".
fr: ``bloc.item`` transpose l'enregistrement en deux enregistrements, qui contiennent chaque objet du tableau dans la colonne "Champ de sortie"
it: ``bloc.item`` traspone il record in due, uno con ogni oggetto dell'array della colonna "Campo di output".
nl: ``bloc.item`` zal het record omzetten in twee, één met elk voorwerp van de array in de kolom "Outputveld"

source: ``bloc.item.sub`` will transpose the record into two, one with each object inside the "sub" tag of each object of the array.
de: "bloc.item.sub" wird den Eintrag in zwei Einträge umwandeln, einen mit jedem Objekt im "Sub-Tag" jedes Objektes des Arrays.
es: ``bloc.item.sub`` transpondrá el registro en 2, uno con cada uno de los objetos de la etiqueta "sub" de cada uno de los objetos de la matriz.
fr: ``bloc.item.sub`` transpose l'enregistrement en deux enregistrements, qui contiennent chaque objet à l'intérieur du tag "sub" de chaque objet du tableau.
it: ``bloc.item.sub`` traspone il record in due, uno con ogni oggetto del tag "sub" di ogni oggetto dell'array.
nl: ``bloc.item.sub`` zal het record omzetten in twee, één met elk voorwerp in de "sub" tag van elk voorwerp van de array.

source: JSON array to multivalued
de: JSON-Array zu mehrwertigem Feld
es: Matriz JSON en multivalor
fr: Tableau JSON vers valeurs multiples
it: Dall'array JSON al campo multivalore
nl: JSON array naar meerdere waarden
