Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/processing.po
Languages: de, es, fr, it, nl

source: ``NAME`` is the name of a new field which will receive the result of the extraction. This field name can only contain letters, numbers and underscores (special characters like accentuated letters or commas are not allowed).
de: "NAME" steht für den Namen des neuen Feldes, das das extrahierte Ergebnis enthalten wird. Dieser Feldname darf nur Buchstaben, Zahlen und Unterstriche enthalten (Sonderzeichen wie akzentuierte Buchstaben oder Kommas sind nicht erlaubt).
es: ``NOMBRE`` es el nombre de un campo nuevo que recibirá el resultado de la extracción. Este nombre de campo solo puede contener letras, números y guiones bajos (no se permiten caracteres especiales como letras acentuadas o comas).
fr: ``NOM`` est le nom d’un nouveau champ qui recevra le résultat de l’extraction. Ce nom ne peut contenir que des lettres, des chiffres et des underscore (``_``). Les caractères spéciaux tels que les lettres accentuées ou les virgules ne sont pas autorisés.
it: ``NAME`` è il nome di un nuovo campo che riceverà il risultato dell'estrazione. Questo nome può contenere solo lettere, numeri e trattini bassi. Caratteri speciali, come lettere accentate o virgole non sono consentiti.
nl: ``NAME`` de naam is van een nieuw veld waarin het resultaat van de extractie zal worden geplaatst. Deze veldnaam kan enkel letters, cijfers en laag liggende streepjes (speciale karakters, zoals letters met accenten of komma's zijn niet toegelaten).

source: ``REXGEXP`` is the submatch expression
de: "REXGEXP" ist der Submatch-Ausdruck
es: ``REGEXP`` es la expresión subcoincidente.
fr: ``REGEXP`` est l'expression servant à l'extraction.
it: ``REXGEXP`` è l'espressione sub-match
nl: ``REXGEXP`` de sub-match uitdrukking is

source: For example, let's assume that you want to extract a street name out of an address. That is, for the address
de: Nehmen wir zum Beispiel an, dass Sie einen Straßennamen aus einer Adresse extrahieren möchten. Das heißt, aus der Adresse
es: Por ejemplo, supongamos que desea extraer un nombre de calle de una dirección. Es decir, para la dirección:
fr: Par exemple, supposons que vous voudriez extraire le nom de rue depuis une adresse. C'est à dire, pour l'adresse
it: Ipotizziamo, ad esempio, di voler estrarre il nome della via da un indirizzo. Dall'indirizzo:
nl: Bijvoorbeeld: veronderstel dat u een straatnaam uit een adres wil extraheren. Dat wil zeggen, voor het adres

source: you might want to extract the value ``Pennsylvania Ave NW`` in a field ``street_name``.
de: möchten Sie den Wert "Pennsylvania Ave NW" in ein Feld "street_name" extrahieren.
es: puede desear extraer el valor ``Pennsylvania Ave NW`` en un campo ``street_name``.
fr: vous voudriez extraire la valeur ``Pennsylvania Ave NW`` dans un champ ``street_name``.
it: desideriamo estrarre il valore ``Pennsylvania Ave NW`` in un campo denominato ``street_name``.
nl: wil u mogelijk de waarde ``Pennsylvania Ave NW`` extraheren in een veld ``street_name``.

source: You would have to write the following expression:
de: Sie müssten den folgenden Ausdruck schreiben:
es: Tendría que escribir la expresión siguiente:
fr: Vous devriez écrire l'expression suivante :
it: Dovremo scrivere la seguente espressione:
nl: U zou de volgende uitdrukking moeten schrijven:

source: And if you want to extract the street number in a field ``street_number``, simply extend the previous expression:
de: Und wenn Sie die Straßennummer in ein Feld "street_number" extrahieren möchten, können Sie den vorherigen Ausdruck einfach verlängern:
es: Y si desea extraer el número de calle en un campo ``street_number``, simplemente debe ampliar la expresión anterior:
fr: Et si vous souhaitiez extraire le numéro depuis un champ ``street_number``, il suffirait d'étendre l'expression précédente :
it: Per estrarre il numero civico in un campo denominato ``street_number``, estendiamo l'espressione precedente:
nl: En indien u het straatnummer wil extraheren in een veld ``street_number``, breidt de vorige uitdrukking dan gewoon uit:

source: Replace Text
de: Text ersetzen
es: Sustituir texto
fr: Remplacer du texte
it: Sostituisci il testo
nl: Vervang tekst

source: Replace text in a field by a new text.
de: Den Text in einem Feld durch einen neuen Text ersetzen.
es: Sustituir texto de un campo por texto nuevo.
fr: Ce processeur permet de remplacer le texte d'un champ par un nouveau texte.
it: Sostituisce il testo di un campo con un nuovo testo.
nl: Vervang tekst in een veld door een nieuwe tekst.

source: Field that contains the text to replace
de: Feld, das den zu ersetzenden Text enthält
es: Campo que contiene el texto para sustituir.
fr: Champ contenant le texte à remplacer
it: Campo contenente il testo da sostituire.
nl: Veld dat de tekst bevat die vervangen moet worden

source: Checked: all the record's fields will be matched
de: Markiert: Alle Felder des Eintrags werden abgestimmt
es: Marcado: Se establecerá la coincidencia con todos los campos del registro.
fr: Coché : tous les champs de l'enregistrement seront pris en compte
it: Selezionato: tutti i campi del record verranno confrontati per verificare se corrispondono.
nl: Aangevinkt: de velden van alle records worden gematched

source: Old value
de: Alter Wert
es: Valor antiguo
fr: Ancienne valeur
it: Valore precedente
nl: Oude waarde

source: Extract HTML
de: HTML extrahieren
es: Extraer HTML
fr: Extraire du HTML
it: Estrai HTML

source: This processor strips HTML tags from a field's values to only keep textual content.
de: Dieser Prozessor entfernt HTML-Tags aus den Werten eines Feldes, um nur Textinhalt beizubehalten.
es: Este procesador quita las etiquetas HTML de los valores de un campo para conservar únicamente el contenido textual.
fr: Ce processeur retire les tags HTML à l'intérieur de la valeur d'un champ afin de ne conserver que le contenu textuel.
it: Questo processore elimina i tag HTML dai valori di un campo, mantenendo solo il contenuto testuale.
nl: Deze processor haalt HTML-tags uit de waarden van een veld zodat enkel de tekstuele content wordt behouden.

source: Normalize Unicode values
de: Unicode-Werte normalisieren
es: Normalizar valores Unicode
fr: Normaliser les valeurs Unicode
it: Normalizza i valori Unicode
nl: Normaliseer Unicode-waarden

source: Normalize unicode content using the Normalization Form Canonical Composition (NFC)
de: Normalisieren Sie den Unicode-Inhalt mithilfe der Normalform der kanonischen Komposition (NFC)
es: Normalizar el contenido Unicode mediante el formato NFC (Normalization Form Canonical Composition).
fr: Ce processeur permet de normaliser le contenu Unicode à l'aide de la composition par équivalence canonique (NFC)
it: Normalizza il contenuto Unicode tramite NFC (Normalization Form Canonical Composition).
nl: Normaliseer Unicode-content door gebruik te maken van de Normalization Form Canonical Composition (NFC)

source: Fields
de: Felder
es: Campos
fr: Champs
it: Campi
nl: Velden

source: Checked: all the record's fields will be normalized
de: Markiert: Alle Felder des Eintrags werden normalisiert
es: Marcado: Se normalizarán todos los campos del registro.
fr: Coché : tous les champs de l'enregistrement seront normalisés
it: Selezionato: tutti i campi del record saranno normalizzati.
nl: Aangevinkt: de velden van alle records worden genormaliseerd

source: USA
es: EE. UU.
it: Stati Uniti
nl: VS

source: +, -, not, ! (not) , ! (factorial), ^ (power)
es: +, -, not, ! (no) , ! (factorial), ^ (potencia)
fr: +, -, not, ! (not) , ! (factoriel), ^ (puissance)
it: +, -, not, ! (not) , ! (fattoriale), ^ (potenza)
nl: +, -, not, ! (niet) , ! (factorieel), ^ (kracht)

source: 69 quai Branly, 75007 Paris|69 quai Branly, 75007 Paris
es: 69 quai Branly, 75007 Paris|69 quai Branly, 75007 París

source: insee_code (text)
es: insee_code (texto)
fr: insee_code (texte)
it: insee_code (testo)
nl: insee_code (tekst)

source: city (text)
es: city (texto)
fr: city (texte)
it: city (testo)
nl: city (tekst)

source: postal_code (text)
es: postal_code (texto)
fr: postal_code (texte)
it: postal_code (testo)
nl: postal_code (tekst)

source: Geomasking
es: Geomáscara
fr: Masquage géographique
it: Mascheramento geografico

source: Insee code
es: Código INSEE
fr: Code INSEE
it: Codice INSEE

source: Country
es: País
fr: Pays
it: Paese

source: Index
es: Índice
it: Indice

source: Int
es: Entero

source: False
nl: Onwaar
