Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/processing.po
Languages: de, es, fr, it, nl

source: Maximum distance (in meters)
de: Maximaler Abstand (in Metern)
es: Distancia máxima (en metros)
fr: Distance maximale (en mètres)
it: Distanza massima (in metri)
nl: Maximale afstand (in meter)

source: INSEE Code to Geo Coordinates
de: INSEE-Code zu Geo-Koordinaten
es: Código INSEE a geocoordenadas
fr: Code INSEE vers Coordonnées Géo
it: Codice INSEE per le coordinate geografiche
nl: INSEE-code voor geografische coördinaten

source: This processor uses a French INSEE code to produce a geo coordinate.
de: Dieser Prozessor verwendet einen französischen INSEE-Code, um eine Geokoordinate zu erzeugen.
es: Este procesador utiliza un código INSEE francés para producir una geocoordenada.
fr: Ce processeur utilise un code INSEE (France) pour générer des coordonnées géographiques.
it: Questo processore utilizza il codice INSEE francese per fornire le coordinate geografiche.
nl: Deze processor gebruikt een Franse INSEE-code om een geografische coördinaat te genereren.

source: Field that contains an INSEE code
de: Feld, das den INSEE-Code enthält
es: Campo que contiene un código INSEE.
fr: Champ contenant le code INSEE
it: Campo contenente il codice INSEE.
nl: Veld dat een INSEE-code bevat

source: Field that will contain the produced WSG84 coordinates
de: Feld, das die erzeugten WGS84-Koordinaten enthält
es: Campo que contendrá las coordenadas WGS84 producidas.
fr: Champ qui contiendra les coordonnées WSG84 générées
it: Campo contenente le coordinate WSG84 ottenute.
nl: Veld dat de gegenereerde WSG84-coördinaten zal bevatten

source: IP Address to Geo Coordinates
de: IP-Adresse zu Geo-Koordinaten
es: Dirección IP a geocoordenadas
fr: Adresse IP vers Coordonnées Géo
it: Dall'indirizzo IP alle coordinate geografiche
nl: IP-adres naar geografische coördinaten

source: This processor allows you to geocode an IP address. It uses the `GeoIP <http://geolite.maxmind.com>`_ database.
de: Mit diesem Prozessor können Sie eine IP-Adresse geocodieren. Er verwendet die Datenbank `GeoIP <http://geolite.maxmind.com>`.
es: Este procesador permite geocodificar una dirección IP. Utiliza la base de datos `GeoIP <http://geolite.maxmind.com>`_.
fr: Ce processeur permet de géocoder une adresse IP. Il utilise la base de données `GeoIP <http://geolite.maxmind.com>`_.
it: Questo processore permette di ottenere la geocodifica di un indirizzo IP in base al database `GeoIP <http://geolite.maxmind.com>`_.
nl: Deze processor laat u toe een geografische code te bepalen voor een IP-adres. Hij gebruikt de `GeoIP <http://geolite.maxmind.com>`_ database.

source: IP address
de: IP-Adresse
es: Dirección IP
fr: Adresse IP
it: Indirizzo IP
nl: IP-adres

source: Field that contains the IP address
de: Feld, das die IP-Adresse enthält
es: Campo que contiene la dirección IP.
fr: Champ contenant l'adresse IP
it: Campo contenente l'indirizzo IP.
nl: Veld dat het IP-adres bevat

source: Zip Code to Geo Coordinates
de: Postleitzahl zu Geo-Koordinaten
es: Código postal a geocoordenadas
fr: Code Postal vers Coordonnées Géo
it: Dal CAP alle coordinate geografiche
nl: Postcode naar geografische coördinaten

source: This processor uses a French postal code to produce a geo coordinate.
de: Dieser Prozessor verwendet einen französische Postleitzahl, um eine Geokoordinate zu erzeugen.
es: Este procesador utiliza un código postal francés para producir una geocoordenada.
fr: Ce processeur utilise un code postal français pour générer des coordonnées géographiques.
it: Questo processore utilizza il codice postale francese per calcolare le coordinate geografiche.
nl: Deze processor gebruikt een Franse postcode om een geografische coördinaat te genereren.

source: Postal code
de: Postleitzahl
es: Código postal
fr: Code postal
it: Codice postale
nl: Postcode

source: Field that contains a French postal code
de: Feld, das eine französische Postleitzahl enthält
es: Campo que contiene un código postal francés.
fr: Champ contenant le code postal français
it: Campo contenente un codice postale francese.
nl: Veld dat een Franse postcode bevat

source: output_field
de: Ausgabefeld
fr: Champ de sortie

source: Field that will contain the produces WSG84 coordinates
de: Feld, das die erzeugten WGS84-Koordinaten enthält
es: Campo que contendrá las coordenadas WSG84 producidas.
fr: Champ qui contiendra les coordonnées WSG84 générées
it: Campo contenente le coordinate WSG84 ottenute.
nl: Veld dat de gegenereerde WSG84-coördinaten zal bevatten

source: Simplify Geo Shape
de: Geoform vereinfachen
es: Simplificar forma geográfica
fr: Simplifier une forme géo
it: Semplifica GeoShape
nl: Vereenvoudig Geo Shape

source: Simplify a geo shape to reduce processing time and dataset size.
de: Vereinfachen Sie eine Geoform, um die Bearbeitungszeit und die Datensatzgröße zu reduzieren.
es: Simplificar una forma geográfica para reducir el tiempo de procesamiento y el tamaño del conjunto de datos.
fr: Ce processeur permet de simplifier une forme géo afin de réduire le temps de traitement et la taille du jeu de données.
it: Semplifica una forma geografica per ridurre il tempo di elaborazione e le dimensioni del dataset.
nl: Vereenvoudig een geografische vorm om de verwerkingstijd en de grootte van de dataset te verkleinen.

source: Tolerance (simplification level)
de: Toleranz (Vereinfachungsniveau)
es: Tolerancia (nivel de simplificación)
fr: Tolérance (niveau de simplification)
it: Tolleranza (livello di semplificazione)
nl: Tolerantie (vereenvoudigingsniveau)

source: Tolerance indicates the value below which intermediate points will be suppressed.
de: Zwischenpunkte, die sich unter diesem Toleranzwert befinden, werden unterdrückt.
es: La tolerancia indica el valor por debajo del cual se suprimirán los puntos intermedios.
fr: La tolérance indique la valeur en dessous de laquelle les points intermédiaires seront supprimés.
it: La tolleranza indica il valore al di sotto del quale i punti intermedi vengono eliminati.
nl: Tolerantie verwijst naar waarde onder welke tussenpunten zullen worden geschrapt.

source: Depending on the shape complexity, different tolerances can be tested.
de: Je nach Formkomplexität können unterschiedliche Toleranzen getestet werden.
es: En función de la complejidad de la forma, se pueden probar distintas tolerancias.
fr: En fonction de la complexité de la forme, différentes tolérances peuvent être testées.
it: A seconda della complessità della forma, è possibile testare diverse tolleranze.
nl: Afhankelijk van de complexiteit van de vorm, kunnen verschillende toleranties worden getest.

source: You could start with a tolerance value of 0.0001. To simplify more, use a power of ten e.g. 0.001, then 0.01.
de: Sie könnten mit einem Toleranzwert von 0,0001 beginnen. Eine weitere Vereinfachung erhalten Sie mit einer Zehnerpotenz, z. B. 0,001, dann 0,01.
es: Puede empezar por el valor de tolerancia 0.0001. Para simplificarlo más, utilice una potencia de diez como p. ej. 0.001 y después 0.01.
fr: Vous pouvez commencer avec une tolérance de 0.0001. Pour simplifier plus, utilisez une puissance de 10 par ex. 0.001, puis 0.01.
it: Puoi iniziare con un valore di tolleranza di 0,0001 e per semplificare ulteriormente passare, ad esempio, a 0,001 e quindi a 0,01.
nl: U zou kunnen starten met een tolerantiewaarde van 0.0001. Om nog verder te vereenvoudigen, gebruikt een tiende macht, bijv. 0.001, daarna 0.01.

source: If you use a tolerance too high, your shapes will be overly simplified and unrecognizable. Use the preview to find out which tolerance works best for you.
de: Ist Ihr Toleranzwert zu hoch, werden die Formen übermäßig vereinfacht und sind nicht mehr erkennbar. Verwenden Sie die Vorschau, um herauszufinden, welche Toleranz sich am besten eignet.
es: Si usa una tolerancia demasiado alta, las formas serán excesivamente simplificadas e irreconocibles. Utilice la vista previa para averiguar cuál es la tolerancia idónea.
fr: Si vous utilisez une tolérance trop élevée, vos formes seront simplifiées excessivement et non reconnaissables. Utilisez la prévisualisation pour déterminer quelle tolérance est appropriée pour votre cas d'utilisation.
it: Se imposti un valore di tolleranza troppo elevato, le forme risulteranno troppo semplificate e irriconoscibili. Utilizza l'anteprima per vedere quale grado di tolleranza risponde meglio alle tue esigenze.
nl: Wanneer u een tolerantie gebruikt die te hoog is, zullen uw vormen te vereenvoudigd zijn en onherkenbaar worden. Gebruik de voorbeeldweergave om te weten te komen welke tolerantie voor u het best werkt.

source: Normalize Projection Reference
de: Projektionsreferenz normalisieren
es: Normalizar referencia de proyección
fr: Normaliser le Système de Projection
it: Normalizza il riferimento di proiezione

source: This processor can be used to handle a **Geo Point 2D** with a projection system different from `WGS84 <http://en.wikipedia.org/wiki/WGS_84>`_ field. It takes as a parameter the name of the field as well as the `EPSG <http://spatialreference.org/ref/epsg/>`_ code of the source coordinates system. The field's value is replaced with its WGS84 representation.
de: Dieser Prozessor kann verwendet werden, um einen **2D-Geopunkt** zu verarbeiten, der nicht dem Referenzsystem `WGS84 <http://en.wikipedia.org/wiki/WGS_84>`_ unterliegt. Er nutzt als Parameter den Namen des Feldes sowie den `EPSG <http://spatialreference.org/ref/epsg/>`_ Code des Quellkoordinatensystems. Der Wert des Feldes wird durch seine WGS84-Darstellung ersetzt.
es: Este procesador se puede usar para manejar un **punto geográfico en 2D** con un sistema de proyección diferente del campo `WGS84 <http://en.wikipedia.org/wiki/WGS_84>`_. Toma como parámetro el nombre del campo y el código `EPSG <http://spatialreference.org/ref/epsg/>`_ del sistema de coordenadas de origen. El valor del campo se sustituye por su representación WGS84.
fr: Ce processeur peut être utilisé pour interpréter un champ de type **point géo** avec un système de projection différent de `WGS84 <http://en.wikipedia.org/wiki/WGS_84>`. Il prend en paramètre le nom du champ ainsi que le `code EPSG <http://spatialreference.org/ref/epsg/>` du système de coordonnées source. La valeur du champ est remplacée par sa représentation en WGS84.
it: Questo processore permette di gestire un **Geopoint 2D** con un sistema di proiezione diverso dal campo `WGS84 <http://en.wikipedia.org/wiki/WGS_84>`_. Come parametro viene utilizzato il nome del campo e il codice `EPSG <http://spatialreference.org/ref/epsg/>`_ del sistema di coordinate di origine. Il valore del campo viene sostituito con la relativa rappresentazione WGS84.
nl: Deze processor kan gebruikt worden om een **Geo Point 2D** te verwerken met een projectiesysteem dat verschilt van `WGS84 <http://en.wikipedia.org/wiki/WGS_84>`_ veld. Hij neemt als parameter de naam van het veld, alsook de `EPSG <http://spatialreference.org/ref/epsg/>`_ code van het bron coördinatensysteem. De waarde van het veld wordt vervangen door de WGS84-weergave ervan.

source: For instance, if you set the EPSG code to ``27572``, the processor will consider that the original geo field contains coordinates expressed in `Lambert Zone II <http://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.
de: Wenn Sie zum Beispiel den EPSG-Code auf "27572" setzen, wird der Prozessor davon ausgehen, dass das ursprüngliche Geo-Feld Koordinaten enthält, die in `Lambert Zone II <http://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_ ausgedrückt werden.
es: Por ejemplo, si se configura el código EPSG ``27572``, el procesador considerará que el campo geográfico original contiene unas coordenadas expresadas en `Lambert Zone II <http://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.
fr: Par exemple, si vous réglez le code EPSG comme ``27572``, le processeur va considérer que les coordonnées originales sont en `Lambert Zone II <http://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.
it: Se, ad esempio, imposti il codice EPSG su ``27572``, il processore considererà che il geo campo originale contenga le coordinate della proiezione `Lambert Zone II <http://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.
nl: Bijvoorbeeld, wanneer u de EPSG-code instelt op ``27572``, zal de processor ervan uit gaan dat het oorspronkelijke geografische veld coördinaten bevat uitgedrukt in `Lambert Zone II <http://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.

source: Note that the input must be expressed with the same logic as a WGS84 geo coordinate: ``Y,X``.
de: Beachten Sie, dass die Eingabe der Logik von WGS84 Geo-Koordinaten folgen muss: "Y,X".
es: Tenga en cuenta que la entrada debe expresarse con la misma lógica que una geocoordenada WGS84: ``Y,X``.
fr: Notez que la valeur en entrée doit être écrite selon la même logique que des coordonnées WGS84 : ``Y,X``.
it: Tieni presente che l'input deve essere espresso con la stessa logica di una coordinata geografica WGS84: ``Y,X``.
nl: Merk op dat de input uitgedrukt moet worden met dezelfde logica als een WGS84 geografische coördinaat: ``Y,X``.

source: Field that will be normalized
de: Feld, das normalisiert wird
es: Campo que se normalizará.
fr: Champ qui sera normalisé
it: Campo da normalizzare.
nl: Veld dat genormaliseerd zal worden

source: Source epsg code
de: Quell-EPSG-Code
es: Código EPSG de origen
fr: Code EPSG source
it: Codice source epsg
nl: Bron EPSG-code

source: Geocode with Google
de: Geocode mit Google
es: Geocodificar con Google
fr: Géocoder avec Google
it: Geocodifica con Google
nl: Geocode met Google

source: This processor allows you to geocode full text addresses by using the Google geocoding API. You need to possess a Google API key to do so.
de: Mit diesem Prozessor können Sie Volltext-Adressen mit der Google Geocoding-API geocodieren. Zu diesem Zweck müssen Sie einen Google API-Schlüssel besitzen.
es: Este procesador permite geocodificar direcciones de texto completo mediante la API de geocodificación de Google. Para ello, se necesita una clave de API de Google.
fr: Ce processeur vous permet de géocoder des adresses en format texte en utilisant l'API de géocodage Google. Vous devez posséder une clé d'API Google.
it: Questo processore permette di eseguire la geocodifica degli indirizzi full-text mediante l'API di geocodifica Google. Per far ciò, devi disporre di una chiave dell'API Google.
nl: Deze processor laat u toe de geografische code te bepalen van adressen die volledig uit tekst bestaan door de geocoding API van Google te gebruiken. Hiervoor moet u over een Google API-sleutel beschikken.

source: Geocode with ArcGIS
de: Geocode mit ArcGIS
es: Geocodificar con ArcGIS
fr: Géocoder avec ArcGIS
it: Geocodifica con ArcGIS
nl: Geocode met ArcGIS

source: This processor allows you to geocode full text addresses by using the ArcGIS geocoding API. You need to possess an ArcGIS API key to do so.
de: Mit diesem Prozessor können Sie Volltext-Adressen mit der ArcGIS Geocoding-API geocodieren. Zu diesem Zweck müssen Sie einen ArcGIS API-Schlüssel besitzen.
es: Este procesador permite geocodificar direcciones de texto completo mediante la API de geocodificación de ArcGIS. Para ello, se necesita una clave de API de ArcGIS.
fr: Ce processeur vous permet de géocoder des adresses en format texte en utilisant l'API de géocodage ArcGIS. Vous devez posséder une clé d'API ArcGIS.
it: Questo processore permette di eseguire la geocodifica degli indirizzi full-text mediante l'API di geocodifica ArcGIS. Per far ciò, devi disporre di una chiave dell'API ArcGIS.
nl: Deze processor laat u toe de geografische code te bepalen van adressen die volledig uit tekst bestaan door de geocoding API van ArcGIS te gebruiken. Hiervoor moet u over een ArcGIS API-sleutel beschikken.

source: Retrieve Administrative Divisions
de: Verwaltungseinheiten abrufen
es: Recuperar divisiones administrativas
fr: Récupérer les divisions administratives
it: Recupera divisioni amministrative

source: This processor uses a **Geo Point 2D** to retrieve information (name, code and **Geo Shapes**) of administrative divisions. You need to choose an administrative level between 1 and 7. The available administrative divisions are referenced in the table below.
de: Dieser Prozessor verwendet einen **2D-Geopunkt**, um Informationen von Verwaltungseinheiten abzurufen (Name, Code und **Geoformen**). Sie müssen eine Verwaltungsebene zwischen 1 und 7 wählen. Die verfügbaren Verwaltungseinheiten sind in der unteren Tabelle aufgelistet.
es: Este procesador utiliza un **punto geográfico en 2D** para recuperar información (nombre, código y **formas geográficas**) de las divisiones administrativas. Debe elegir un nivel administrativo entre 1 y 7. En la tabla siguiente puede consultar las divisiones administrativas disponibles.
fr: Ce processeur utilise un **Point géo 2D** pour récupérer les informations (nom, code et **Formes géo**) des divisions administratives. Vous devez choisir un niveau administratif entre 1 et 7. Les divisions administratives disponibles sont répertoriées dans le tableau ci-dessous.
it: Questo processore utilizza un **Geopoint 2D** per recuperare le informazioni (nome, codice e **geoshape**) delle divisioni amministrative, scegliendo un livello amministrativo da 1 a 7. Le divisioni amministrative disponibili sono riportate nella tabella seguente.
nl: Deze processor gebruikt een **Geo Point 2D** om informatie (naam, code en **Geo Shapes**) van administratieve afdelingen terug te vinden. U moet een administratief niveau kiezen tussen 1 en 7. De beschikbare administratieve afdelingen staan weergegeven in onderstaande tabel.

source: This processor is not activated by default. Please contact the OpenDataSoft support team if you plan to use it.
de: Dieser Prozessor ist standardmäßig nicht aktiviert. Sollten Sie ihn benötigen, wenden Sie sich bitte an das OpenDataSoft-Supportteam.
es: Este procesador todavía no está activado de forma predeterminada. Póngase en contacto con el equipo de soporte de OpenDataSoft si tiene previsto usarlo.
fr: Par défaut, ce processeur n'est pas activé. Veuillez contacter l'équipe d'assistance OpenDataSoft si vous prévoyez de l'utiliser.
it: Questo processore non è attivato in modo predefinito. Se desideri utilizzarlo, ti preghiamo di contattare il team di assistenza OpenDataSoft.
nl: Deze processor is standaard niet geactiveerd. Gelieve contact op te nemen met het Support Team van OpenDataSoft indien u van plan bent deze te gebruiken.

source: Source
de: Quelle
es: Origen

source: Text processors
de: Textprozessoren
es: Procesadores de texto
fr: Processeurs de texte
it: Processori di testo
nl: Tekstverwerkers

source: Concatenate Text
de: Text verknüpfen
es: Concatenar texto
fr: Concaténer du Texte
it: Testo concatenato

source: This processor can be used to concatenate two fields using a separator. You'll need to define the left and right hand sides of the concatenation, as well as the separator and the resulting field.
de: Dieser Prozessor kann verwendet werden, um zwei Felder mit einem Trennzeichen zu verknüpfen. Sie müssen die linke und rechte Seite der Verknüpfung bestimmen, sowie das Trennzeichen und das daraus resultierende Feld.
es: Este procesador se puede usar para concatenar 2 campos con un separador. Deberá definir los extremos izquierdo y derecho de la concatenación, así como el separador y el campo resultante.
fr: Ce processeur peut être utilisé pour concaténer les valeurs de deux champs en utilisant un séparateur. Vous devez définir les parties gauche et droite, ainsi que le séparateur, et le champ qui recevra le résultat.
it: Questo processore permette di concatenare due campi mediante un separatore. Per utilizzarlo, è necessario definire il lato sinistro e il lato destro della concatenazione, il separatore e il campo risultante.
nl: Deze processor kan gebruikt worden om twee velden samen te voegen door gebruik te maken van een scheidingsteken. U moet de linker- en rechterzijdes van de samenvoeging definiëren, alsook het scheidingsteken en het daaruit voortvloeiende veld.

source: One common use case is to concatenate a X and Y coordinates columns in a new column with both separated by a comma, which can then be used as a ``geo point``.
de: Ein üblicher Anwendungsfall ist die Verknüpfung einer X- und Y-Koordinatenspalte in einer neuen Spalte (wobei beide durch ein Komma getrennt sind), die dann als "Geopunkt" verwendet werden kann.
es: Un caso de uso frecuente consiste en concatenar las columnas de coordenadas X e Y en una columna nueva con ambas separadas por una coma, que después se puede usar como ``Punto geográfico``.
fr: Un cas d'utilisation courant est de concaténer des coordonnés X et Y de deux colonnes dans une colonnes séparées par une virgule, et ensuite d'utiliser cette valeur comme un ``point géo``.
it: Un caso che si verifica frequentemente è la concatenazione delle colonne delle coordinate X e Y in una nuova colonna, nella quale i valori sono separati da una virgola e possono essere utilizzati come un ``geopoint``.
nl: Een vaak voorkomend geval is om kolommen met X- en Y-coördinaten samen te voegen in een nieuwe kolom waarbij beide gescheiden zijn door een komma, wat vervolgens gebruikt kan worden als een ``geo point``.

source: In this example, we concatenate the column X and Y in a new column Coordinates, which can then be used as a ``geo point``
de: In diesem Beispiel verknüpfen wir die Spalten X und Y in einer neuen Spalte Koordinaten, die dann als "Geopunkt" verwendet werden kann.
es: En este ejemplo, concatenamos las columnas X e Y en la columna nueva Coordinates, que posteriormente se puede emplear como ``Punto geográfico``.
fr: Dans cet exemple, nous concatenons les colonnes X et Y dans une nouvelle colonne Coordonnées qui peut être ensuite utilisée comme ``point géo``
it: In questo esempio, abbiamo concatenato la colonna X e Y in una nuova colonna denominata Coordinates, che potrà essere utilizzata come ``geopoint``.
nl: In dit voorbeeld voegen we de kolom X en Y samen in een nieuwe kolom Coördinaten, die vervolgens gebruikt kan worden als een ``geo point``

source: Left value
de: Linker Wert
es: Valor izquierdo
fr: Valeur gauche
it: Valore di sinistra
nl: Waarde links

source: Right value
de: Rechter Wert
es: Valor derecho
fr: Valeur droite
it: Valore di destra
nl: Waarde rechts

source: Normalize URL
de: URL normalisieren
es: Normalizar dirección URL
fr: Normaliser une URL
it: Normalizza l'URL
