Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/processing.po
Languages: de, es, fr, it, nl

source: Example of a conditional expression using the Expression processor, with the creation of the "Anomaly Detected ?" (which was not initially present in the original data source). The syntax is ``=expression ? value if the expression if true : value if false``
de: Beispiel eines bedingten Ausdrucks unter Einsatz des Ausdrucksprozessors mit der Erstellung von "Anomalie entdeckt?" (nicht in der ursprünglichen Datenquelle vorhanden). Die Syntax lautet "=expression ? value if the expression if true : value if false"
es: Ejemplo de una expresión condicional con el procesador Expresión, con la creación de "Anomaly Detected ?" (que no figuraba en el origen de datos original). La sintaxis es ``= expresión ? valor si la expresión es verdadera : valor si es falsa``
fr: Exemple d'expression conditionnelle avec le processeur Expression, avec la création de la colonne "Anomalie détectée ?" (qui n'est pas présente initialement dans le jeu de données source). La syntaxe est ``=expression ? valeur si l'expression est vraie : valeur si l'expression est fausse``
it: Esempio di espressione condizionale con il processore Espressione, con la creazione della colonna "Anomaly Detected ?", non presente in origine nel dataset. La sintassi è ``=expression ? value if the expression if true : value if false``
nl: Voorbeeld van een voorwaardelijke uitdrukking waarbij de Uitdrukkingsprocessor wordt gebruikt met de aanmaak van de kolom "Onregelmatigheid gedetecteerd?" (die aanvankelijk niet aanwezig was in de oorspronkelijke databron). De syntax is ``=uitdrukking? waarde in de uitdrukking indien waar: waarde indien onwaar``

source: The expression processor can work with both textual content and numerical content.
de: Der Ausdrucksprozessor kann sowohl mit Textinhalt als auch mit numerischem Inhalt arbeiten.
es: El procesador Expresión puede manejar contenido textual y numérico.
fr: Le processeur d'expression peut fonctionner à la fois avec des valeurs textuelles et des valeurs numériques.
it: Nel processore Espressione è possibile utilizzare sia numeri che contenuti testuali.
nl: De uitdrukkingsprocessor kan werken met zowel tekstuele content als numerieke content.

source: Literal values can be either explicit literals, such as ``"this is some text"``, or ``2`` as well as field names, such as ``price``.
de: Literale Werte können entweder explizite Literale sein, wie ``"dies ist Text"`` oder "2" sowie Feldnamen, beispielsweise "Preis".
es: Los valores literales pueden ser literales explícitos como ``"this is some text"`` o ``2``, y nombres de campo como ``price``.
fr: Les valeurs peuvent être des valeurs littérales explicite, telles que `"ceci est du texte"``, ou ``2``, mais aussi des noms des champs, tels que ``price``.
it: I valori possono essere sia letterali, come ad esempio ``"testo di esempio"`` o ``2``, sia nomi di campi, come ``prezzo``.
nl: Letterlijke waarden kunnen ofwel expliciete literals zijn, zoals ``"dit is een beetje tekst"``, of ``2`` alsook veldnamen zoals ``prijs``.

source: To enter expression mode, tap a ``=`` in the expression field box. If you do not, the expression will be interpreted as pure textual content.
de: Um in den Ausdrucksmodus zu gelangen, geben Sie "=" in das Ausdrucksfeld ein. Andernfalls wird der Ausdruck als reiner Textinhalt interpretiert.
es: Para entrar en modo de expresión, especifique ``=`` en el cuadro del campo Expresión. De lo contrario, la expresión se interpretará puramente como contenido textual.
fr: Pour entrer en mode expression, tapez ``=`` dans la boite d'expression du processeur. Si vous n'êtes pas en mode expression, le contenu de la boite sera interprété comme du texte brut.
it: Per attivare la modalità di espressione, digita ``=`` nel campo Espressione dell’apposita casella, altrimenti il contenuto inserito verrà interpretato come puro testo.
nl: Om naar uitdrukkingsmodus te gaan, typ een "=" in het veldvakje "uitdrukking". Indien u dit niet doet, zal de uitdrukking geïnterpreteerd worden als zuiver tekstuele content.

source: In expression mode, strings must be double quoted (``"foo"``).
de: Im Ausdrucksmodus müssen Zeichenfolgen in doppelte Anführungszeichen gesetzt werden (``"foo"``).
es: En el modo de expresión, las cadenas deben delimitarse mediante comillas dobles (``"foo"``).
fr: En mode expression, les chaines de caractères doivent être entourées de double-guillemets (``"foo"``).
it: In modalità espressione, le stringhe devono essere racchiuse da virgolette doppie (``"foo"``).
nl: In uitdrukkingsmodus moeten strings tussen dubbele aanhalingstekens staan (``"foo"``).

source: The following unary, binary and ternary operators are available:
de: Folgende unäre, binäre und ternäre Operatoren stehen zur Verfügung:
es: Los siguientes operadores unarios, binarios y ternarios están disponibles:
fr: Les opérateurs unaires, binaires et ternaires suivants sont disponibles :
it: Sono disponibili i seguenti operatori unari, binari e ternari:
nl: De volgende unaire, binaire en ternaire operatoren zijn beschikbaar:

source: Operator type
de: Operator-Typ
es: Tipo de operador
fr: Type d'opérateu
it: Tipo di operatore

source: Operators
de: Operatoren
es: Operadores
fr: Opérateurs
it: Operatori
nl: Operatoren

source: Unary operators
de: Unäre Operatoren
es: Operadores unarios
fr: Opérateurs unaires
it: Operatori unari
nl: Unaire operatoren

source: Binary operators
de: Binäre Operatoren
es: Operadores binarios
fr: Opérateurs binaires
it: Operatori binari
nl: Binaire operatoren

source: +, -, ``*``, /, % (euclidean division), and, &&, or, ||, >, <, >=, <=, == (evaluates to ``True`` or ``False``), & (concatenation of strings, evaluates to a string)
de: +, -, ``*``, /, % (Division mit Rest), and, &&, or, ||, >, <, >=, <=, == (evaluiert zu ``True`` oder ``False``), & (Verknüpfung von Zeichenfolgen, evaluiert zu einer Zeichenfolge)
es: +, -, ``*``, /, % (división euclidiana), and, &&, or, ||, >, <, >=, <=, == (se evalúa como ``True`` o ``False``), & (concatenación de cadenas, se evalúa como una cadena)
fr: +, -, ``*``, /, % (division euclidienne), and, &&, or, ||, >, <, >=, <=, == (évalue à ``True`` or ``False``), & (concaténation de chaines, évalue à une chaine)
it: +, -, ``*``, /, % (divisione euclidea), and, &&, or, ||, >, <, >=, <=, == (valuta ``True`` o ``False``), & (concatenazione di stringhe, valuta una stringa)
nl: +, -, ``*``, /, % (Euclidische deling), en, &&, of, ||, >, <, >=, <=, == (evalueert naar ``Waar`` of ``Onwaar``), & (samenkoppeling van strings, evalueert naar een string)

source: Ternary operators
de: Ternäre Operatoren
es: Operadores ternarios
fr: Opérateurs ternaires
it: Operatori ternari
nl: Ternaire operatoren

source: op1 ? op2 : op3 (conditional statement)
de: op1 ? op2 : op3 (bedingter Ausdruck)
es: op1 ? op2 : op3 (instrucción condicional)
fr: op1 ? op2 : op3 (expression conditionnelle)
it: op1 ? op2 : op3 (istruzione condizionale)
nl: op1 ? op2 : op3 (voorwaardelijke bewering)

source: Examples:
de: Beispiele:
es: Ejemplos:
fr: Exemples :
it: Esempi:
nl: Voorbeelden:

source: Result
de: Ergebnis
es: Resultado
fr: Résultat
it: Risultato
nl: Resultaat

source: price * 2
de: Preis * 2
nl: prijs * 2

source: 24 (if price is a field valued to 12)
de: 24 (wenn der Preis ein Feld mit dem Wert 12 ist)
es: 24 (si el valor del campo price es 12)
fr: 24 (si price est un champ de valeur 12)
it: 24 (se price è un campo con valore 12)
nl: 24 (indien prijs een veld is met waarde tot 12)

source: A rich set of functions is also available
de: Außerdem stehen zahlreiche Funktionen zur Verfügung
es: También existen multitud de funciones disponibles:
fr: Un ensemble complet de fonctions est également disponible
it: È inoltre disponibile una ricca serie di funzioni:
nl: Er is ook een brede waaier aan functies beschikbaar

source: Function type
de: Funktionstyp
es: Tipo de función
fr: Type de fonction
it: Tipo di funzione
nl: Type functie

source: Functions
de: Funktionen
es: Funciones
fr: Fonctions
it: Funzioni
nl: Functies

source: Without operand
de: Ohne Operand
es: Ningún operando
fr: Sans opérande
it: Senza operando
nl: Zonder operand

source: now
de: Jetzt
nl: nu

source: Single operand
de: Einzeloperand
es: 1 operando
fr: Simple opérande
it: Operando singolo
nl: Eén operand

source: Two operands
de: Zwei Operanden
es: 2 operandos
fr: Deux opérandes
it: Due operandi
nl: Twee operanden

source: Three operands
de: Drei Operanden
es: 3 operandos
fr: Trois opérandes
it: Tre operandi
nl: Drie operanden

source: Output field
de: Ausgabefeld
es: Campo de salida
fr: Champ de sortie
it: Campo di output
nl: Outputveld

source: Join datasets
de: Datensätze verbinden
es: Unir conjuntos de datos
fr: Joindre des jeux de données
it: Unisci dataset
nl: Datasets samenvoegen

source: This processor allows to you to join two datasets together the same way a classical database join would.
de: Dieser Prozessor ermöglicht es Ihnen, zwei Datensätze zu verbinden, auf die gleiche Weise wie bei einem klassischen Datenbank-Join.
es: Este procesador permite unir 2 conjuntos de datos igual que uniría una base de datos clásica.
fr: Ce processeur vous permet de joindre deux jeux de données de manière similaire à une jointure de base de données classique.
it: Questo processore permette di unire due dataset come avviene nei normali database.
nl: Deze processor laat u toe twee datasets samen te voegen op dezelfde manier als waarop een klassieke database zou samenvoegen.

source: Let's take an example. You have two datasets:
de: Sehen wir uns ein Beispiel an. Sie haben zwei Datensätze:
es: Tomemos un ejemplo. Tenemos 2 conjuntos de datos:
fr: Prenons un exemple. Nous avons deux jeux de données :
it: Consideriamo un esempio. Abbiamo due dataset:
nl: Laten we een voorbeeld nemen. U hebt twee datasets:

source: **First dataset**: The list of taxi stations in Paris.
de: **Erster Datensatz**: Die Liste der Taxistationen in Paris.
es: **Primer conjunto de datos**: La lista de estaciones de taxi de París.
fr: **Premier jeu de données** : La liste des stations de taxi à Paris
it: **Primo dataset**: l'elenco delle stazioni di taxi di Parigi.
nl: **Eerste dataset**: De lijst met taxistations in Parijs.

source: station_address
de: station_adresse

source: Tour Eiffel
de: Eiffelturm
nl: Eiffeltoren

source: The name of this dataset is **paris_taxis_stations**.
de: Der Name dieses Datensatzes lautet **paris_taxis_stations**.
es: El nombre de este conjunto de datos es **paris_taxis_stations**.
fr: Le nom de ce jeu de données est **paris_taxis_stations**.
it: Il nome di questo dataset è **paris_taxis_stations**.
nl: De naam van deze dataset is **paris_taxis_stations**.

source: **Second dataset**: The number of taxis waiting per station in Paris.
de: **Zweiter Datensatz**: Die Anzahl der Taxis, die pro Station in Paris warten.
es: **Segundo conjunto de datos**: El número de taxis en espera por estación de París.
fr: **Second jeu de données** : Le nombre de taxis en attente à chaque station dans Paris.
it: **Secondo dataset**: il numero dei taxi in attesa in ogni stazione di Parigi.
nl: **Tweede dataset**: Het aantal taxi's dat per station in Parijs aan het wachten is.

source: number
de: Anzahl
es: Número
nl: aantal

source: The Join processor allows you to enrich the second dataset with colums coming from the first dataset.
de: Mit dem Join-Prozessor können Sie den zweiten Datensatz mit Spalten aus dem ersten Datensatz bereichern.
es: El procesador de unión permite enriquecer el segundo conjunto de datos con columnas del primer conjunto de datos.
fr: Le processeur Joindre vous permet d'enrichir le second jeu de données avec des colonnes issues du premier jeu de données.
it: Il processore Unisci permette di arricchire il secondo dataset con le colonne tratte dal primo dataset.
nl: De Joinprocessor laat u toe de tweede dataset te verrijken met kolommen die afkomstig zijn van de eerste dataset.

source: **Resulting dataset after a Join**
de: **Der nach einem Join resultierende Datensatz**
es: **Conjunto de datos resultante después de una unión**
fr: **Jeu de données résultant d'une jointure**
it: **Dataset ottenuto dopo l'unione**
nl: **Resulterende dataset na een samenvoeging**

source: **Dataset**
de: **Datensatz**
es: **Conjunto de datos**
fr: **Jeu de données**

source: The dataset used for the join; you can select it from your own datasets, or from OpenDataSoft's network of datasets.
de: Der Datensatz, der für den Join verwendet wird; Sie können ihn aus Ihren eigenen Datensätzen oder dem Datensatznetzwerk von OpenDataSoft auswählen.
es: Conjunto de datos utilizado para la unión; puede seleccionarlo de sus propios conjuntos de datos o de la red de conjuntos de datos de OpenDataSoft.
fr: Le jeu de données utilisé pour la jointure; vous pouvez le choisir parmi vos propres jeux de données, ou parmi les jeux de données du réseau OpenDataSoft.
it: Il dataset utilizzato per l'unione. È possibile selezionarlo dai tuoi dataset o dalla rete di dataset di OpenDataSoft.
nl: De dataset die gebruikt wordt voor de samenvoeging; u kan deze selecteren uit uw eigen datasets of uit het netwerk van datasets van OpenDataSoft.

source: **Local Key**
de: **Lokaler Schlüssel**
es: **Clave local**
fr: **Clé locale**
it: **Chiave locale**
nl: **Lokale sleutel**

source: The local field that will be used to identify the corresponding records in the remote dataset. More than one key can be specified.
de: Das lokale Feld, mit dem die entsprechenden Einträge im Remote-Datensatz identifiziert werden sollen. Es kann mehr als ein Schlüssel angegeben werden.
es: Campo local que se usará para identificar los registros correspondientes en el conjunto de datos remoto. Se puede especificar más de una clave.
fr: Le champ local qui sera utilisé pour identifier les enregistrements correspondants dans le jeu de données distant. Il est possible de spécifier plus d'une clé.
it: Il campo locale che verrà utilizzato per identificare i record corrispondenti nel dataset remoto. È possibile specificare più di una chiave.
nl: Het lokale veld dat gebruikt zal worden om de overeenkomstige records in de dataset op afstand te identificeren. Er kan meer dan één sleutel worden gespecificeerd.

source: **Remote Key**
de: **Remote-Schlüssel**
es: **Clave remota**
fr: **Clé distante**
it: **Chiave remota**
nl: **Sleutel op afstand**

source: The remote field corresponding to the local key. This can be a list.
de: Das Remote-Feld mit dem lokalen Schlüssel. Hierbei kann es sich um eine Liste handeln.
es: Campo remoto correspondiente a la clave local. Puede ser una lista.
fr: Le champ distant qui doit correspondant à la clé locale. Il est possible d'en avoir plusieurs.
it: Il campo remoto corrispondente alla chiave locale. Può essere un elenco.
nl: Het veld op afstand dat overeenstemt met de lokale sleutel. Dit kan een lijst zijn.

source: **Output Fields**
de: **Ausgabefelder**
es: **Campos de salida**
fr: **Champs de sortie**
it: **Campi di output**
nl: **Outputvelden**

source: The list of fields to retrieve.
de: Die Liste der abzurufenden Felder.
es: Lista de campos para recuperar.
fr: La liste des champs à récupérer.
it: L'elenco dei campi da recuperare.
nl: De lijst met op te halen velden.

source: **Retrieve All Fields**
de: **Alle Felder abrufen**
es: **Recuperar todos los campos**
fr: **Récupérer tous les champs**
it: **Recupera tutti i campi**
nl: **Alle velden ophalen**

source: Set to retrieve all the fields of the remote dataset.
de: Um alle Felder des Remote-Datensatzes abzurufen.
es: Establecer para recuperar todos los campos del conjunto de datos remoto.
fr: Activer pour récupérer l'intégralité des champs du jeu de données distant.
it: Impostato in modo da recuperare tutti i campi del dataset remoto.
nl: Stel in om alle velden van de dataset op afstand op te halen.

source: **Case Sensitive**
de: **Groß- und Kleinschreibung beachten**
es: **Distinguir mayúsculas de minúsculas**
fr: **Sensible à la casse**
it: **Sensibile alle maiuscole**
nl: **Hoofdlettergevoelig**

source: **One line**
de: **Eine Zeile**
es: **Una línea**
fr: **Résultats sur une ligne**
it: **Una riga**
nl: **Eén lijn**

source: In some specific cases, the remote dataset may contain more than one row matching the local key. In which case, you may want to either collapse duplicates (that is, generate a single row which will contain multi-valued fields) or not. If this parameter is set, you can specify the character to use to separate values in the generated field in the **Separator** parameter.
de: In bestimmten Fällen kann der Remote-Datensatz mehr als eine Zeile enthalten, die mit dem lokalen Schlüssel übereinstimmt. In diesem Fall können Sie die Duplikate minimieren (d. h. eine einzige Zeile erzeugen, die mehrwertige Felder enthält) oder auch nicht. Wurde dieser Parameter eingestellt, können Sie das Zeichen festlegen, das verwendet werden soll, um Werte im generierten Feld zu trennen (im Parameter **Trennzeichen**).
es: En algunos casos, el conjunto de datos remoto puede contener más de una fila que coincida con la clave local. En esa circunstancia, puede interesarle contraer los duplicados (es decir, generar una única fila con campos multivalor) o no. Si se establece este parámetro, puede especificar el carácter que se usará para separar los valores en el campo generado en el parámetro **Separador**.
fr: Dans certains cas, le jeu de données distant peut contenir plus d'une seule ligne correspondant à la clé locale. Dans ce cas, on peut souhaiter soit fusionner les doublons (générer un seul enregistrement contenant des champs multi-valués), ou conserver chaque enregistrement. Si ce paramètre est actif, vous pouvez spécifier le séparateur à utiliser dans les champs multi-valués issus d'une fusion via le paramètre **Séparateur**.
it: In alcuni casi specifici, la chiave locale può corrispondere a più di una riga del dataset. In queste circostanze, puoi decidere di unire tutti i duplicati, cioè di generare un'unica riga che contenga dei campi multivalore. Se imposti questo parametro, potrai poi specificare nel parametro **Separatore** il carattere da utilizzare per separare i singoli valori del campo.
nl: In sommige specifieke gevallen is het mogelijk dat de dataset op afstand meer dan één rij bevat die overeenstemt met de lokale sleutel. In dit geval is het mogelijk dat u duplicaten al dan niet wil verkleinen (m.a.w. één enkele rij genereren die velden met meerdere waarden zal bevatten). Indien deze parameter is ingesteld, kan u het karakter specificeren dat gebruikt moet worden om de waarden in het gegenereerde veld in de parameter **Scheidingsteken** te scheiden.

source: Let's take an example and assume that the first dataset contains two rows for the first station:
de: Nehmen wir ein Beispiel und nehmen an, dass der erste Datensatz zwei Zeilen für die erste Station enthält:
es: Tomemos un ejemplo y supongamos que el primer conjunto de datos contiene 2 filas para la primera estación:
fr: Prenons un exemple et supposons que le premier jeu de données contient deux lignes pour la première station :
it: Vediamo un esempio, ipotizzando che il primo dataset contenga due righe per la prima stazione:
nl: Laten we een voorbeeld nemen en veronderstellen dat de eerste dataset twee rijen voor het eerste station bevat:

source: If **One line** is set (with **Separator** set to ``|``), the Join will result in:
de: Wenn **Eine Zeile** eingestellt ist (mit dem **Trennzeichen** `|`) bringt der Join folgendes Ergebnis hervor:
es: Si se establece **Una línea** (y se configura **Separador** como ``|``), la unión dará como resultado:
fr: Si **Résultats sur une ligne** est défini (avec **Séparateur** défini sur ``|``), la jointure donnera :
it: Se il parametro **Una riga** è configurato (con **Separatore** impostato su ``|``), l'unione risulterà in:
nl: Wanneer **Eén lijn** is ingesteld (met **Scheidingsteken** ingesteld op ``|``), zal de Join resulteren in:

source: Tour Eiffel|Quai Branly
de: Eiffelturm|Quai Branly

source: If **One line** is not set, the Join will result in:
de: Wenn **Eine Zeile** nicht eingestellt ist, bringt der Join folgendes Ergebnis hervor:
es: Si no se establece **Una línea**, la unión dará como resultado:
fr: Si **Résultats sur une ligne** n'est pas actif, la jointure donnera :
it: Se il parametro **Una riga** non è impostato, l'unione darà il seguente risultato:
nl: Indien **Eén lijn** niet is ingesteld, zal de samenvoeging resulteren in:

source: Integers, decimals and text field containing numerical values can be joined together. For example the following dataset:
de: Ganze und Dezimalzahlen sowie Textfelder mit numerischen Werten können zusammengefügt werden. Zum Beispiel der folgende Datensatz:
es: Los enteros, los decimales y los campos de texto con valores numéricos pueden juntarse. Por ejemplo, el conjunto de datos siguiente:
fr: Les champs entiers, décimaux et de texte contenant des valeurs numériques peuvent être joints. Par exemple, le jeu de données suivant :
it: È possibile unire numeri interi, numeri decimali e campi di testo contenenti valori numerici. Vediamo un esempio:
nl: Gehele getallen, decimalen en tekstveld met numerieke waarden kunnen worden samengevoegd. Bijvoorbeeld de volgende dataset:

source: bloom_competition_result (decimal)
de: bloom_competition_result (Dezimalzahl)
fr: bloom_competition_result (décimal)
it: bloom_competition_result (decimale)
nl: bloom_competition_result (decimaal)

source: can be used in a join dataset processor in the following dataset:
de: Kann in einem Prozessor zur Datensatzverbindung in folgendem Datensatz verwendet werden:
es: pueden utilizarse en un procesador de uniones de conjuntos de datos en el conjunto de datos siguiente:
fr: peut être utilisé dans un processeur de jonction de jeu de données dans le jeu de données suivant :
it: Questo dataset può essere utilizzato dal processore per un'unione con il seguente dataset:
nl: kan gebruikt worden in een join datasetprocessor in de volgende dataset:

source: bloom_ranks (integer)
de: bloom_ranks (Ganzzahl)
es: bloom_ranks (entero)
fr: bloom_ranks (entier)
it: bloom_ranks (intero)
nl: bloom_ranks (geheel getal)

source: to obtain the following result:
de: um folgendes Ergebnis zu erhalten:
es: para obtener el resultado siguiente:
fr: pour obtenir le résultat suivant :
it: per ottenere il seguente risultato:
nl: om het volgende resultaat te bekomen:

source: The matching between values ``2`` and ``2.0`` was successful despite the type difference. We can go further and apply to it a second join dataset processor, in order to obtain values from the following dataset:
de: Der Abgleich der Werte ``2`` zwischen ``2.0`` war trotz des unterschiedlichen Formats erfolgreich. Wir können noch weiter gehen und einen zweiten Prozessor zur Datensatzverbindung anwenden, um Werte des folgenden Datensatzes zu erhalten:
es: La coincidencia entre los valores ``2`` y ``2.0`` se ha detectado correctamente a pesar de la diferencia de tipo. Podemos ir más allá y aplicar un segundo procesador de uniones de conjuntos de datos para obtener valores del conjunto de datos siguiente:
fr: La mise en correspondance entre les valeurs ``2`` et ``2.0`` a réussi malgré la différence de format. Nous pouvons aller plus loin et l'appliquer à un second processeur de jonction de jeu de données, afin d'obtenir les valeurs du jeu de données suivant :
it: La corrispondenza tra i valori ``2`` e ``2.0`` è riuscita, nonostante la differenza di tipo. Possiamo anche proseguire ed eseguire un secondo processore di unione, per ottenere i valori del seguente dataset:
nl: De matching tussen de waarden ``2`` en ``2.0`` was succesvol ondanks het typeverschil. We kunnen verder gaan en dit toepassen op een tweede join datasetprocessor om waarden te bekomen uit de volgende dataset::
