Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/processing.po
Languages: de, es, fr, it, nl

source: Processing datasets
de: Datensätze bearbeiten
es: Procesar los conjuntos de datos
fr: Traiter des jeux de données
it: Elaborazione dei dataset
nl: Datasets verwerken

source: Generic processors
de: Generische Prozessoren
es: Procesadores genéricos
fr: Processeurs génériques
it: Processori generici
nl: Generische processoren

source: Add a Field
de: Ein Feld hinzufügen
es: Añadir un campo
fr: Ajouter un Champ
it: Aggiungi un campo
nl: Voeg een veld toe

source: Manually add an empty field to the dataset. It can be filled by other processors.
de: Fügen Sie dem Datensatz manuell ein leeres Feld hinzu. Es kann von anderen Prozessoren gefüllt werden.
es: Añada manualmente un campo vacío al conjunto de datos. Otros procesadores lo podrán rellenar.
fr: Ce processeur ajoute manuellement un champ vide au jeu de données. Le champ peut être rempli par d'autres processeurs.
it: Aggiunge manualmente un campo vuoto al dataset. Può essere riempito da altri processori.
nl: Voeg handmatig een leeg veld toe aan de dataset. Deze kan gevuld worden door andere processoren.

source: It takes the following parameters:
de: Es werden folgende Parameter verwendet:
es: Toma los parámetros siguientes:
fr: Il prend les paramètres suivants :
it: Richiede i seguenti parametri:
nl: Deze heeft de volgende parameters:

source: Label
de: Beschriftung
es: Etiqueta
it: Etichetta

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Type
de: Typ
es: Tipo
it: Tipo

source: Mandatory
de: Obligatorisch
es: Obligatorio
fr: Obligatoire
it: Obbligatorio
nl: Verplicht

source: Field
de: Feld
es: Campo
fr: Champ
it: Campo
nl: Veld

source: The field name
de: Der Feldname
es: Nombre del campo.
fr: Nom du champ
it: Nome del campo
nl: De veldnaam

source: String
de: Zeichenfolge
es: Cadena
fr: Chaîne de caractères
it: Stringa

source: yes
de: ja
es: Sí
fr: oui
it: sì
nl: ja

source: Copy a Field
de: Ein Feld kopieren
es: Copiar un campo
fr: Copier un Champ
it: Copia un campo
nl: Kopieer een veld

source: Copy a field value into another field.
de: Kopieren Sie einen Feldwert in ein anderes Feld.
es: Copiar el valor de un campo en otro campo.
fr: Ce processeur copie la valeur d'un champ vers un autre champ.
it: Copia il valore del campo in un altro campo.
nl: Kopieer een veldwaarde in een ander veld.

source: Field to copy
de: Zu kopierendes Feld
es: Campo para copiar
fr: Champ à copier
it: Campo da copiare
nl: Veld om te kopiëren

source: New field
de: Neues Feld
es: Campo nuevo
fr: Nouveau champ
it: Nuovo campo
nl: Nieuw veld

source: Delete record by ID
de: Eintrag nach ID löschen
es: Suprimir registro por ID
fr: Supprimer un enregistrement sur la base de l'ID
it: Elimina record per ID
nl: Verwijder record per ID

source: Send a delete order to remove an existing record of the dataset based on the unique ID.
de: Senden Sie einen Löschauftrag, um einen vorhandenen Eintrag des Datensatzes auf Grundlage der eindeutigen ID zu entfernen.
es: Enviar una orden de supresión para eliminar un registro existente del conjunto de datos según el ID exclusivo.
fr: Ce processeur ordonne la suppression d'un enregistrement existant dans le jeu de données sur la base de l'ID unique.
it: Invia un ordine di cancellazione per eliminare un record del dataset in base a un ID univoco.
nl: Stuur een verwijderopdracht om een bestaand record van de dataset te verwijderen op basis van het unieke ID.

source: Default value
de: Standardname
es: Valor predeterminado
fr: Valeur par défaut
it: Valore predefinito
nl: Standaard waarde

source: Field that contains the value to test
de: Feld, das den zu testenden Wert enthält
es: Campo que contiene el valor para probar.
fr: Champ contenant la valeur à tester
it: Campo che contiene il valore da testare
nl: Veld dat de waarde om te testen bevat

source: Value to skip
de: Zu überspringender Wert
es: Valor para omitir
fr: Valeur à ignorer
it: Valore da ignorare
nl: Waarde om over te slaan

source: Value that means the record must be deleted
de: Wert, der bedeutet, dass der Eintrag gelöscht werden muss
es: Valor que indica que el registro se debe suprimir.
fr: Valeur signifiant que l'enregistrement doit être supprimé.
it: Valore indicante che il record deve essere eliminato
nl: Waarde die betekent dat het record moet worden verwijderd

source: Expression
de: Ausdruck
es: Expresión
it: Espressione
nl: Uitdrukking

source: no
de: nein
fr: non
nl: nee

source: None
de: Keiner
es: Ninguno
fr: Aucune
it: Nessuno
nl: Geen

source: Exact match
de: Genaue Übereinstimmung
es: Coincidencia exacta
fr: Correspondance exacte
it: Corrispondenza esatta
nl: Exacte match

source: Unchecked: the field must contain the value. Checked: must be an exact match.
de: Nicht markiert: Das Feld muss den Wert enthalten. Markiert: Muss eine genaue Übereinstimmung sein.
es: Desmarcado: El campo debe contener el valor. Marcado: Debe ser una coincidencia exacta.
fr: Décoché : le champ doit contenir la valeur. Coché : la valeur doit être une correspondance exacte.
it: Non selezionato: il campo deve contenere il valore. Selezionato: il valore deve essere una corrispondenza esatta.
nl: Niet-aangevinkt: het veld moet de waarde bevatten. Aangevinkt: moet een exacte match zijn.

source: Boolean
de: Boolesch
es: Booleano
fr: Booléen
it: Booleano
nl: Booleaans

source: True
de: Wahr
nl: Waar

source: Skip Records
de: Einträge überspringen
es: Omitir registros
fr: Ignorer les enregistrements
it: Ignora i record
nl: Sla records over

source: Skip all records for which the specified field matches the specified value.
de: Überspringen Sie alle Einträge, für die das angegebene Feld mit dem angegebenen Wert übereinstimmt.
es: Omitir todos los registros para los cuales el campo especificado coincide con el valor especificado.
fr: Ce processeur ignore tous les enregistrements pour lesquels le champ spécifié correspond à la valeur spécifiée.
it: Ignora tutti i record nei quali il valore del campo indicato corrisponde a quello specificato.
nl: Sla alle records over waarvoor het gespecificeerde veld overeenstemt met de gespecificeerde waarde.

source: Name of the field
de: Name des Feldes
es: Nombre del campo.
fr: Nom du champ
it: Nome del campo
nl: Naam van het veld

source: String or Expression (if the value starts with an '=')
de: Zeichenfolge oder Ausdruck (wenn der Wert mit einem '=' beginnt)
es: Cadena o expresión (si el valor empieza por '=')
fr: Chaîne de caractères ou expression (si la valeur commence par '=')
it: Stringa o espressione (se il valore inizia con '=')
nl: String of uitdrukking (wanneer de waarde begint met een "=")

source: Checked
de: Markiert
es: Marcado
fr: Coché
it: Selezionato
nl: Aangevinkt

source: Transpose Fields
de: Felder umwandeln
es: Transponer campos
fr: Transposition de Champs
it: Trasponi i campi
nl: Velden omzetten

source: This processor makes it possible to transform field names into field values.
de: Dieser Prozessor bietet die Möglichkeit, Feldnamen in Feldwerte umzuwandeln.
es: Este procesador permite transformar los nombres de campo en valores de campo.
fr: Ce processeur permet de transformer des noms de champs en valeurs de champs.
it: Questo processore permette di trasformare i nomi dei campi in valori dei campi.
nl: Deze processor maakt het mogelijk om veldnamen om te zetten naar veldwaarden.

source: Let's take a simple example, with a dataset containing for a couple of countries the evolution of the number of inhabitants from 2020 to 2030.
de: Nehmen wir ein einfaches Beispiel mit einem Datensatz, der für einige Länder die Entwicklung der Einwohnerzahlen von 2020 bis 2030 enthält.
es: Veamos un sencillo ejemplo, con un conjunto de datos que contiene la evolución del número de habitantes en varios países de 2020 a 2030.
fr: Prenons un exemple simple, avec un jeu de données contenant pour quelques pays l'évolution du nombre d'habitants entre 2020 et 2030.
it: Ad esempio, nel caso di un dataset contenente l'andamento del numero degli abitanti di un paio di paesi negli anni dal 2020 al 2030.
nl: Laten we een eenvoudig voorbeeld nemen, met een dataset die voor een aantal landen de evolutie bevat van het aantal inwoners van 2020 tot 2030.

source: The dataset initially looks like this:
de: Der Datensatz sieht zunächst so aus:
es: Inicialmente el conjunto de datos tiene el aspecto siguiente:
fr: Le jeu de données ressemble initialement à ceci :
it: Inizialmente, il dataset si presenta come segue:
nl: De dataset ziet er aanvankelijk zo uit:

source: Country name
de: Ländername
es: Nombre de país
fr: Nom du pays
it: Nome del paese
nl: Naam van het land

source: France
de: Frankreich
es: Francia
it: Francia
nl: Frankrijk

source: UK
de: Großbritannien
es: Reino Unido
it: Regno Unito
nl: VK

source: Publishing this dataset as is would make it difficult to draw meaningful visualizations for instance.
de: Würde man diesen Datensatz in diesem Zustand veröffentlichen, wäre es schwierig, sinnvolle Visualisierungen zu erzeugen.
es: Si se publicara este conjunto de datos tal cual sería complicado dibujar visualizaciones significativas, por ejemplo.
fr: Publier ce jeu de données tel quel rendrait difficile la création de visualisations riches.
it: Se questo dataset fosse pubblicato così com'è, sarebbe difficile creare visualizzazioni significative.
nl: Wanneer deze dataset gepubliceerd wordt zoals hij is, wordt het moeilijk om bijvoorbeeld betekenisvolle weergaves te tekenen.

source: Let's have a look at an alternative way to represent this dataset.
de: Schauen wir uns eine alternative Möglichkeit zur Darstellung dieses Datensatzes an.
es: Observemos otra forma de representar este conjunto de datos.
fr: Penchons nous sur une façon différente de représenter ce jeu de données.
it: Di seguito è mostrato un modo alternativo per rappresentare questo dataset:
nl: Laten we nu een kijkje nemen naar een alternatieve manier om deze dataset weer te geven.

source: Country Name
de: Ländername
es: Nombre de país
fr: Nom du pays
it: Nome del paese
nl: Naam van het land

source: Year
de: Jahr
es: Año
fr: Année
it: Anno
nl: Jaar

source: Inhabitants
de: Einwohner
es: Habitantes
fr: Habitants
it: Abitanti
nl: Inwoners

source: With this representation, it becomes easy to build subsets of the dataset using facets based filtering mechanism.
de: Diese Darstellung vereinfacht es, Teilmengen des Datensatzes mithilfe eines Filtermechanismus auf Grundlage von Facets zu erstellen.
es: Con esta representación, es fácil crear subconjuntos del conjunto de datos mediante facetas a partir del mecanismo de filtros.
fr: Avec cette représentation, il devient facile de filtrer ce jeu de données en utilisant les facettes, afin de travailler sur des sous-ensembles du jeu de données.
it: Con questa rappresentazione è più facile filtrare il dataset con i facet e creare così dei subset.
nl: Met deze weergave wordt het gemakkelijk om subreeksen van de dataset op te bouwen door gebruik te maken van filteringmechanismen die gebaseerd zijn op facetten.

source: Fixed fields
de: Feste Felder
es: Campos fijos
fr: Champs fixes
it: Campi fissi
nl: Vaste velden

source: List of fields that must be kept as is. (e.g *Country Name*)
de: Liste der Felder, die beibehalten werden müssen (z. B. * Ländername*).
es: Lista de campos que debe conservarse tal cual (p. ej. *Nombre de país*).
fr: Liste des champs qui doivent être conservés tels quels. (par ex. *Nom du pays*)
it: Elenco dei campi che devono restare come sono, ad esempio, *Country Name*.
nl: Lijst met velden die behouden moeten worden zoals ze zijn. (bijv *Naam land*)

source: List
de: Liste
es: Lista
fr: Liste
it: Elenco
nl: Lijst

source: Invert fixed fields
de: Feste Felder umkehren
es: Invertir campos fijos
fr: Inverser les champs fixes
it: Inverti i campi fissi
nl: Vaste velden omkeren

source: Label for title column
de: Beschriftung der Titelspalte
es: Etiqueta de columna de título
fr: Label du titre
it: Etichetta per la colonna del titolo
nl: Label voor titel kolom

source: Label of the new column containing the names of fields that have been transposed (e.g *Year*)
de: Beschriftung der neuen Spalte mit den Namen der umgewandelten Felder (z. B. *Jahr*)
es: Etiqueta de la columna nueva que contiene los nombres de campos que se han transpuesto (p. ej. *Año*).
fr: Label de la nouvelle colonne contenant les noms des champs qui ont été transposés (par ex. *Année*)
it: Etichetta della nuova colonna contenente i nomi dei campi trasposti, ad es. *Anno*.
nl: Label van de nieuwe kolom die de namen van de velden bevat die werden omgezet (bijv. *Jaar*)

source: Label for value column
de: Beschriftung der Wertspalte
es: Etiqueta de columna de valor
fr: Label de la valeur
it: Etichetta per la colonna del valore
nl: Label voor waarde kolom

source: Label of the new column containing the former cell values (e.g *Inhabitants*)
de: Beschriftung der neuen Spalte mit den früheren Zellwerten (z. B. *Einwohner*)
es: Etiqueta de la columna nueva que contiene los valores de celdas anteriores (p. ej. *Habitantes*).
fr: Label de la nouvelle colonne contenant les valeurs des anciennes cellules (par ex. *Habitants*)
it: Etichetta della nuova colonna contenente i valori delle celle precedenti, ad es. *Abitanti*.
nl: Label van de nieuwe kolom die de voormalige celwaarden bevat (bijv. *Inwoners*)

source: value
de: Wert
es: Valor
fr: valeur
it: valore
nl: waarde

source: One line
de: Eine Zeile
es: Una línea
fr: Résultats sur une ligne
it: Una riga
nl: Eén lijn

source: Don't split records in several lines for each possible value, but use a separator to put all possible values in the value column.
de: Teilen Sie Einträge nicht in mehrere Zeilen für jeden möglichen Wert auf, sondern verwenden Sie Trennzeichen, um alle möglichen Werte in die Wertspalte zu setzen.
es: No dividir los registros en varias líneas para cada uno de los valores posibles, sino usar un separador para poner todos los valores posibles en la columna de valor.
fr: Ne pas séparer les enregistrements sur plusieurs lignes pour chaque valeur possible, mais utiliser un séparateur pour placer toutes les valeurs possibles dans la colonne valeurs.
it: I record non vengono suddivisi in varie righe per ogni possibile valore ma viene utilizzato un separatore per inserire tutti i possibili valori nella colonna dei valori.
nl: Verdeel records niet op in verschillende lijnen voor elke mogelijk waarde maar gebruik een scheidingsteken om alle mogelijke waarden in de waardekolom te plaatsen.

source: Separator
de: Trennzeichen
es: Separador
fr: Séparateur
it: Separatore
nl: Scheidingsteken

source: The separator used by the "One line" option
de: Das Trennzeichen, das von der Option "Eine Zeile" verwendet wird
es: Separador empleado por la opción "Una línea".
fr: Séparateur utilisé par l'option "Résultats sur une ligne"
it: Separatore utilizzato all'opzione "Una riga".
nl: Het scheidingsteken dat gebruikt wordt door de optie *Eén lijn*

source: This processor makes it possible to write complex expression patterns using field values.
de: Dieser Prozessor ermöglicht es, komplexe Ausdrucksmuster mit Feldwerten zu schreiben.
es: Este procesador permite escribir patrones de expresiones complejas mediante valores de campo.
fr: Ce processeur permet d'écrire des expressions complexes utilisant des valeurs de champs.
it: Questo processore permette di scrivere delle espressioni complesse utilizzando i valori dei campi.
nl: Deze processor maakt het mogelijk om complexe uitdrukkingspatronen te schrijven waarbij veldwaarden worden gebruikt.

source: It works similarly as formulas in a spreadsheet software, except instead of referencing cells (i.e. A1 + B2), you have to reference columns of the dataset (i.e. column_1 + column_2)
de: Er funktioniert ähnlich wie Formeln in einer Tabellenkalkulationssoftware, doch anstelle der Referenzierung von Zellen (d. h. A1 + B2) müssen Sie die Spalten des Datensatzes (d. h. Spalte_1 + Spalte_2) referenzieren.
es: Funciona de un modo parecido a las fórmulas de un programa de hojas de cálculo, salvo que en lugar de hacer referencia a las celdas (p. ej. A1 + B2), debe hacer referencia a las columnas del conjunto de datos (p. ej. column_1 + column_2).
fr: Le fonctionnement est similaire à celui des formules dans un tableur type Excel, sauf qu'au lieu d'effectuer des opérations sur des cellules (ex. A1 + B2), on va ici travailler sur des colonnes du jeu de données (ex. colonne_1 + colonne_2)
it: Funziona in modo simile alle formule di un software di foglio di calcolo, con la differenza che al posto delle celle (ad es. A1 + B2) occorre fare riferimento alle colonne del dataset (a es. column_1 + column_2).
nl: Deze werkt gelijkaardig als formules in software van een spreadsheet, behalve dat in plaats van verwijzende cellen (bijv. (i.e. A1 + B2), u moet verwijzen naar kolommen van de dataset (bijv. column_1 + column_2)

source: Example of a basic sum with the Expression processor. The "Result" column contains the result of the sum (this column was not in the data source).
de: Beispiel einer Grundsumme mit dem Ausdrucksprozessor. Die Spalte "Ergebnis" enthält das Ergebnis der Summe (diese Spalte war nicht in der Datenquelle).
es: Ejemplo de una suma básica con el procesador Expresión. La columna "Result" contiene el resultado de la suma (esta columna no figuraba en el origen de los datos).
fr: Exemple de d'expression simple d'addition avec le processeur "Expression". La colonne "Résultat" contient le résultat du calcul (elle est crée par le processeur, elle n'est pas présente initialement dans le jeu de données)
it: Esempio di una semplice somma calcolata con il processore Espressione. La colonna "Result" (che non era presente in origine nel dataset) contiene il risultato della somma.
nl: Voorbeeld van een basissom met de Uitdrukkingsprocessor. De kolom "Resultaat" bevat het resultaat van de som (deze kolom stond niet in de databron).

source: Be careful to use the **technical name** instead of the column label in the expression. This technical name can be found by clicking on the gears icon.
de: Achten Sie darauf, im Ausdruck den **technischen Namen** anstelle der Spaltenbeschriftung zu verwenden. Sie sehen diesen technischen Namen, wenn Sie auf das Zahnradsymbol klicken.
es: No olvide utilizar el **nombre técnico** en lugar de la etiqueta de columna en la expresión. Este nombre técnico se puede encontrar haciendo clic en el icono de engranaje.
fr: Attention à bien utiliser le **nom technique** au lieu du libellé de colonne dans les expressions. Ce nom technique est accessible en cliquant sur l'icône avec les engrenages dans l'entête de colonne.
it: Nell'espressione, occorre prestare attenzione a utilizzare il **nome tecnico** e non l'etichetta della colonna. Il nome tecnico può essere visualizzato cliccando sull'icona dell'ingranaggio.
nl: Zorg ervoor om de **technische naam** te gebruiken in plaats van het kolomlabel in de uitdrukking. Deze technische naam is terug te vinden door op het tandwielpictogram te klikken.

source: Technical name of a column
de: Technischer Name einer Spalte
es: Nombre técnico de una columna
fr: Nom technique d'une colonne
it: Nome tecnico di una colonna
nl: Technische naam van een kolom

source: Here are some common use cases :
de: Hier einige häufige Anwendungsfälle:
es: He aquí casos de uso frecuentes:
fr: Parmi les cas d'usages les plus courants on trouve :
it: Di seguito sono riportati alcuni dei casi di utilizzo più comuni:
nl: Hier volgen enkele vaak gebruikte gevallen:

source: Numerical operations (like the sum example above)
de: Numerische Operationen (wie die im Beispiel genannte Summenrechnung)
es: Operaciones numéricas (como el ejemplo de suma anterior)
fr: Calcul numérique (comme dans l'exemple ci-dessus)
it: Operazioni numeriche, come la somma dell'esempio precedente.
nl: Numerieke operaties (zoals het somvoorbeeld hierboven)

source: Mathematical or text function (round, log, cosinus, change text to upper case, ...)
de: Mathematische oder Textfunktion (rund, Logarithmus, Kosinus, Textwechsel zu Großbuchstaben...)
es: Función matemática o textual (redondeo, logaritmo, coseno, cambiar un texto a mayúsculas...)
fr: Application d'une fonction sur une colonne (arrondi, logarithme, cosinus, mettre en majuscule, etc...)
it: Funzioni matematiche o di testo (arrotondamento, logaritmo, coseno, cambia testo in lettere maiuscole e così via).
nl: Wiskundige of tekstfunctie (rond, log, cosinus, wijzig tekst naar hoofdletters, ...)

source: Example of a mathematical function using the Expression processor
de: Beispiel einer mathematischen Funktion mit dem Ausdrucksprozessor
es: Ejemplo de una función matemática con el procesador Expresión
fr: Exemple de fonction mathématique avec le processeur Expression
it: Esempio di funzione matematica calcolata con il processore Espressione
nl: Voorbeeld van een wiskundige functie waarbij de Uitdrukkingsprocessor wordt gebruikt

source: Conditional expression : the idea is to create a new column (e.g for filtering) which values depends on condition on values of another column of the dataset. For example, a new column named "Anomaly Detected ?" containing YES/NO, depending of values of another column being in a certain range (see screenshot below)
de: Bedingter Ausdruck: Die Idee ist es, eine neue Spalte zu erstellen (beispielsweise zum Filtern). Ihre Werte hängen von den Werten einer anderen Spalte des Datensatzes ab. So kann beispielsweise eine neue Spalte mit der Bezeichnung "Anomalie entdeckt?" und dem Inhalt JA/NEIN abhängig von den Werten einer anderen Spalte sein, die sich in einem bestimmten Bereich befindet (siehe Screenshot unten).
es: Expresión condicional: La idea es crear una columna nueva (p. ej. para filtrar) cuyos valores dependan como una condición de los valores de otra columna del conjunto de datos. Por ejemplo, una columna nueva denominada "Anomaly Detected ?" que contenga YES/NO en función de que los valores de otra columna estén dentro de un rango determinado (vea la captura de pantalla siguiente).
fr: Expression conditionnelle : l'idée est de créer une nouvelle colonne (par exemple pour filtrer) dont le contenu dépend de la valeur d'une autre colonne du jeu de données. Par exemple, une nouvelle colonne "Anomalie détectée ?" contenant OUI/NON en fonction de valeurs d'une autre colonne.
it: Espressione condizionale: l'idea consiste nel creare una nuova colonna (ad esempio per filtrare il dataset), i cui valori dipendano in modo condizionale da quelli di un'altra colonna. Ad esempio: una nuova colonna denominata "Anomaly Detected ?", nella quale i valori YES/NO dipendano dalla possibilità che i valori di un'altra colonna si trovino o meno in un determinato intervallo (confronta nella schermata riportata sotto).
nl: Voorwaardelijke uitdrukking: het idee is om een nieuwe kolom aan te maken (bijv. om te filteren) waarvan de waarden afhangen van voorwaarden omtrent waarden van een andere kolom van de dataset. Bijvoorbeeld: een nieuwe kolom met de naam "Onregelmatigheid gedetecteerd?" die JA/NEE bevat, afhankelijk van waarden van een andere kolom die in een bepaald bereik zit (zie screenshot hieronder)
