Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/processing.po
Languages: de, es, fr, it, nl

source: This processor extracts multiple values from a field containing a JSON array and concatenates them into a multivalued field.
de: Dieser Prozessor extrahiert mehrere Werte aus einem Feld mit einem JSON-Array und verknüpft sie in einem mehrwertigen Feld.
es: Este procesador extrae varios valores de un campo que contiene una matriz JSON y los concatena en un campo multivalor.
fr: Ce processeur extrait les différentes valeurs d'un champ contenant un tableau JSON et les concatène dans un champ à valeurs multiples.
it: Questo processore estrae valori multipli da un campo che contiene un array JSON e li concatena in un campo multivalore.
nl: Deze processor extraheert meerdere waarden uit een veld dat een JSON array bevat en voegt deze samen in een veld met meerdere waarden.

source: Note: the ``multivalued`` property will not be set automatically in the field, so don't forget to enable it on the field's parameters, along with the same separator as in the processor.
de: Hinweis: die Eigenschaft "Mehrwertig" wird nicht automatisch im Feld gesetzt, weshalb Sie sie in den Feldparametern aktivieren müssen, gemeinsam mit dem gleichen Trennzeichen wie im Prozessor.
es: Nota: La propiedad ``Multivalor`` no se definirá automáticamente en el campo, por lo que recuerde activarla en los parámetros del campo, junto con el mismo separador que en el procesador.
fr: Remarque : la propriété ``multivalued`` ne sera pas définie automatiquement dans le champ, n'oubliez donc pas de l'activer dans les paramètres du champ et d'utiliser les mêmes séparateurs que dans le processeur.
it: Nota bene: la proprietà ``multivalore`` non verrà impostata automaticamente nel campo, quindi non dimenticare di attivarla nei relativi parametri e di utilizzare lo stesso delimitatore del processore.
nl: Opmerking: de eigenschap ``multivalued`` zal niet automatisch ingesteld worden in het veld. Dus vergeet niet om deze te activeren op de parameters van het veld, samen met hetzelfde scheidingsteken als in de processor.

source: Original value
de: Ursprünglicher Wert
es: Valor original
fr: Valeur d'origine
it: Valore originale
nl: Oorspronkelijke waarde

source: After processor
de: Nach dem Prozessor
es: Después del procesador
fr: Après le processeur
it: Dopo il processore
nl: Na processor

source: The parameter "iJSON rule to array" works exactly like in the "Extract from JSON" processor and should contain the array to concatenate (represented with the iJSON rule ``.item``).
de: Der Parameter "iJSON-Regel zu Array" funktioniert genau wie der Prozessor "Extrahieren von JSON" und sollte das zu verknüpfende Array beinhalten (dargestellt mit der iJSON-Regel ".item").
es: El parámetro "Regla iJSON para matriz" funciona exactamente igual que en el procesador "Extraer de JSON" y debe contener la matriz para concatenar (representada con ``.item`` en la regla iJSON).
fr: Le paramètre "Règle iJSON vers tableau" fonctionne exactement de la même manière que dans le processeur "Extraire depuis un objet JSON" et doit contenir le tableau à concaténer (représenté par la règle iJSON ``.item``).
it: Il parametro "regola iJSON per l'array" funziona esattamente come il processore "Estrai da JSON" e deve contenere l'array da concatenare (rappresentato con la regola iJSON ``.item``).
nl: De parameter "iJSON-regel naar array" werkt precies zoals in de processor "Extraheer uit JSON" en zou de array die samengevoegd moet worden, moeten bevatten (weergegeven door de iJSON-regel ``.item``).

source: iJSON rule to iterate in the JSON array above. An iJSON rule is built with the names of all the field from the JSON root to the data to extract, separated with a dot. The position of the array is indicated with the ``item`` keyword.
de: iJSON-Regel, um im oben genannten JSON-Array zu iterieren. Eine iJSON-Regel wird mit den Namen des gesamten Feldes aus dem JSON-Root für die zu extrahierenden Daten aufgebaut (getrennt mit einem Punkt). Die Position des Arrays wird mit dem Keyword "item" angegeben.
es: Regla iJSON para iterar en la matriz JSON indicada anteriormente. Una regla iJSON se construye con los nombres de todos los campos desde la raíz JSON hasta los datos para extraer, separados por un punto. La posición de la matriz se indica con la palabra clave ``item``.
fr: Règle iJSON à itérer dans le tableau JSON ci-dessus. Une règle iJSON se construit avec les noms de tous les champs de la racine JSON des données à extraire, séparés par des points. La position du tableau est indiquée par le mot-clé ``item``.
it: Regola iJSON da iterare nel precedente array JSON. La regola iJSON viene creata con i nomi di tutti i campi dalla radice JSON fino ai dati da estrarre, separati da un punto. La posizione dell'array è indicata dalla parola chiave dell'``item``.
nl: iJSON regel die herhaald moet worden in de bovenstaande JSON array. Een iJSON-regel is opgebouwd met de namen van alle velden uit de JSON root naar de data die geëxtraheerd moeten worden, gescheiden door een puntje. De positie van de array staat aangegeven door het trefwoord "item".

source: Character or string used to separate the different values found
de: Zeichen oder Zeichenfolge, mit dem/der die verschiedenen gefundenen Werte getrennt werden
es: Carácter o cadena utilizado para separar los distintos valores encontrados
fr: Caractère ou chaîne de caractères utilisé pour séparer les différentes valeurs trouvées
it: Il carattere o la stringa utilizzati per separare i diversi valori trovati
nl: Karakter of string die gebruikt wordt om de verschillende teruggevonden waarden te scheiden

source: Extract bit range
de: Bitbereich extrahieren
es: Extraer rango de bits
fr: Extraire une plage de bits
it: Estrai intervallo di bit
nl: Extraheer bitbereik

source: This processor allows you to extract an arbitrary bit range from an hexadecimal content and to convert it into one of the following data types: integer, unsigned integer and float.
de: Mit diesem Prozessor können Sie einen beliebigen Bitbereich aus einem hexadezimalen Inhalt extrahieren und ihn in einen der folgenden Datentypen umwandeln: Ganzzahl, vorzeichenlose Ganzzahl und Gleitkommazahl.
es: Este procesador permite extraer un rango de bits arbitrario de un contenido hexadecimal y convertirlo en uno de los tipos de datos siguientes: entero, entero sin signo o flotante.
fr: Ce processeur vous permet d'extraire une plage de bits arbitraire depuis un contenu hexadécimal et de la convertir dans l'un des types de données suivants : entier, entier non signé et float.
it: Questo processore permette di estrarre un intervallo di bit arbitrari da un contenuto in formato esadecimale e di convertirlo in uno dei seguenti tipi di dati: intero, intero senza segno e con virgola mobile.
nl: Deze processer laat u toe een willekeurig bitbereik te extraheren uit een hexadecimale content en deze om te zetten in één van de volgende datatypes: geheel getal, ongetekend geheel getal en float.

source: This might be useful, for example, when processing data coming from a network of sensors as sensors often encode their payloads as hexadecimal content.
de: Dies könnte zum Beispiel bei der Verarbeitung von Daten aus einem Netzwerk von Sensoren nützlich sein, da Sensoren ihre Datenmengen häufig als hexadezimalen Inhalt kodieren.
es: Puede ser útil, por ejemplo, al procesar datos de una red de sensores ya que los sensores suelen codificar sus cargas útiles en forma de contenido hexadecimal.
fr: Cela peut se révéler utile, par exemple lors du traitement de données provenant d'un réseau de sondes, car celles-ci encodent souvent leur charge utile sous la forme de contenu hexadécimal.
it: Può essere utile, ad esempio, quando si elaborano dati provenienti da una rete di sensori, poiché spesso i sensori codificano il payload come contenuto esadecimale.
nl: Dit zou bijvoorbeeld nuttig kunnen zijn wanneer data worden verwerkt die afkomstig zijn van een netwerk van sensoren aangezien sensoren vaak hun payloads encoderen als hexadecimale content.

source: This processor can either create a new field or update an existing field.
de: Dieser Prozessor kann entweder ein neues Feld erstellen oder ein bestehendes Feld aktualisieren.
es: Este procesador puede crear un campo nuevo o actualizar uno ya existente.
fr: Ce processeur peut créer un champ ou mettre à jour un champ existant.
it: Questo processore può creare un nuovo campo o aggiornarne uno già esistente.
nl: Deze processor kan ofwel een nieuw veld aanmaken ofwel een bestaand veld updaten.

source: The processor works with masks, it expects
de: Der Prozessor arbeitet mit Masken, er setzt voraus
es: El procesador funciona con máscaras, y espera lo siguiente:
fr: Ce processeur fonctionne avec des masques, il attend ce qui suit :
it: Il processore utilizza le maschere e prevede quanto segue:
nl: De processor werkt met maskers, hij verwacht

source: Start bit offset
de: Bitversatz starten
es: Offset de bit de inicio
fr: Décalage du bit de départ
it: Inizia offset bit
nl: Start bit offset op

source: The starting offset corresponding of the position of the first bit
de: Der Ausgangsversatz entsprechend der Position des ersten Bits
es: El offset de inicio correspondiente a la posición del primer bit.
fr: Décalage de départ correspondant à la position du premier bit
it: L'offset iniziale corrispondente alla posizione del primo bit.
nl: De begin-offset die overeenstemt met de positie van de eerste bit

source: Integer
de: Ganzzahl
es: Entero
fr: Entier
it: Intero

source: Stop bit offset
de: Bitversatz stoppen
es: Offset de bit de parada
fr: Décalage du bit d'arrêt
it: Interrompi offset bit

source: The ending offset corresponding of the position of the last bit
de: Der Abschlussversatz entsprechend der Position des letzten Bits
es: El offset de finalización correspondiente a la posición del último bit.
fr: Décalage d'arrêt correspondant à la position du dernier bit
it: L'offset finale corrispondente alla posizione dell'ultimo bit.
nl: De slot-offset die overeenstemt met de positie van de laatste bit

source: Convert to
de: Umwandeln in
es: Convertir en
fr: Convertir en
it: Converti in
nl: Converteer naar

source: The wanted format to output and convert the data
de: Das gewünschte Format zum Ausgeben und Konvertieren der Daten
es: El formato deseado para enviar a la salida y convertir los datos.
fr: Format dans lequel les données doivent être renvoyées et converties
it: Il formato in cui si desidera ottenere l'output e convertire i dati.
nl: Het gewenste formaat om te outputten en de data te converteren

source: For example, let's assume you have a temperature sensor that sends and hexadecimal value.
de: Nehmen wir zum Beispiel an, dass Sie einen Temperatursensor haben, der einen hexadezimalen Wert sendet.
es: Por ejemplo, supongamos que tiene un sensor de temperatura que envía un valor hexadecimal.
fr: Imaginons par exemple que vous disposez d'une sonde de température qui envoie une valeur hexadécimale.
it: Ad esempio, ipotizziamo di avere un sensore di temperatura che invia un valore in formato esadecimale.
nl: Bijvoorbeeld: veronderstel dat u een temperatuursensor hebt die een hexadecimale waarde stuurt.

source: This hexadecimal value contains: - a decimal value encoded on 2 bytes - the sensor status on a bit.
de: Dieser hexadezimale Wert beinhaltet: einen Dezimalwert, der auf 2 Bytes codiert ist - den Sensorstatus auf einem Bit.
es: Este valor hexadecimal contiene: un valor decimal codificado en 2 bytes y el estado del sensor en un bit.
fr: Cette valeur hexadécimale contient : - une valeur encodée sur 2 octets - l'état de la sonde sur un bit.
it: Tale valore esadecimale contiene: - un valore decimale codificato su 2 byte - lo stato del sensore in un bit.
nl: Deze hexadecimale waarde bevat - een decimale waarde geëncodeerd op 2 bytes - de status van de sensor op een bit.

source: The first byte '00010110' is the integer part of the temperature, the second byte '00000100' is the floating part of the temperature, the last bit '1' is the boolean status, working or not.
de: Das erste Byte '00010110' ist der ganzzahlige Teil der Temperatur, das zweite Byte '00000100' ist der Gleitkommawert der Temperatur, das letzte Bit '1' ist der boolesche Status (funktioniert oder nicht).
es: El primer byte '00010110' es la parte entera de la temperatura, el segundo byte '00000100' es la parte flotante de la temperatura y el último bit '1' es el estado booleano (en funcionamiento o no).
fr: Le premier octet '00010110' est la partie entière de la température, le second octet '00000100' est la partie flottante de la température, le dernier bit '1' est l'état booléen, marche ou arrêt.
it: Il primo byte '00010110' è la parte intera della temperatura, il secondo '00000100' è la parte a virgola mobile della temperatura e l'ultimo bit '1' è lo stato booleano, funzionante oppure no.
nl: De eerste byte '00010110' is het geheel getal van de temperatuur, de tweede byte '00000100' is het vlottende deel van de temperatuur, de laatste byte '1' is de booleaanse status die al dan niet werkt.

source: You will need to concatenante the integer and the floating part (after the comma) in order to get the temperature value.
de: Sie müssen die Ganzzahl und den Gleitkommateil (hinter dem Komma) miteinander verknüpfen, um den Temperaturwert zu erhalten.
es: Deberá concatenar la parte entera y la flotante (después del separador decimal) para obtener el valor de temperatura.
fr: Vous devrez concaténer la partie entière et la partie flottante (après la virgule) afin d'obtenir la valeur de la température.
it: Per ottenere il valore della temperatura, è necessario concatenare la parte intera e la parte a virgola mobile, dopo la virgola.
nl: U moet het geheel getal en het vlottende deel (na de komma) samenvoegen om de temperatuurwaarde te krijgen.

source: Therefore, the processing pipeline will contains 3 **Extract bit mask** processors, and 1 **Expression** processor to concatenate:
de: Die Verarbeitungspipeline enthält zu diesem Zweck 3 Prozessoren des Typs **Bitmaske extrahieren** und einen **Ausdruck** Prozessor, um Folgendes miteinander zu verknüpfen:
es: En consecuencia, la canalización de procesamiento tendrá 3 procesadores **Extraer máscara de bits** y 1 procesador **Expresión** para concatenar:
fr: Par conséquent, le pipeline de traitement contiendra 3 processeurs **Extraire le masque de bits** et 1 processeur **Expression** pour concaténer :
it: La pipeline di elaborazione, pertanto, conterrà 3 processori **Estrai maschera di bit** e 1 processore **Espressione** per la concatenazione:
nl: Daarom zal de verwerkingspijplijn 3 **Extraheer bit maskers**-processoren bevatten en 1 **Uitdrukking** processor om samen te voegen:

source: one **Extract bit mask** from 0 to 7 to convert into integer -> int_temperature
de: einen **Bitmaske extrahieren** von 0 bis 7 zur Umwandlung in die Ganzzahl -> int_temperature
es: 1 procesador **Extraer máscara de bits** de 0 a 7 para convertir en entero -> int_temperature
fr: un processeur **Extraire le masque de bits** de 0 à 7 pour convertir en entier -> int_temperature
it: un **Estrai maschera di bit** da 0 a 7 per la conversione in intero -> int_temperature;
nl: één **Extraheer bit masker** van 0 tot 7 om te converteren in geheel getal -> int_temperature

source: one **Extract bit mask** from 8 to 15 to convert into integer -> decimal_temperature
de: einen **Bitmaske extrahieren** von 8 bis 18 zur Umwandlung in die Ganzzahl -> decimal_temperature
es: 1 procesador **Extraer máscara de bits** de 8 a 15 para convertir en entero -> decimal_temperature
fr: un processeur **Extraire le masque de bits** de 8 à 15 pour convertir en entier -> decimal_temperature
it: un **Estrai maschera di bit** da 8 a 15 per la conversione in un intero -> decimal_temperature;
nl: één **Extraheer bit masker** van 8 tot 15 om te converteren in geheel getal -> decimal_temperature

source: one **Extract bit mask** from 15 to 16 to convert into boolean -> status
de: einen **Bitmaske extrahieren** von 15 bis 16 zur Umwandlung in booleschen -> Status
es: 1 procesador **Extraer máscara de bits** de 15 a 16 para convertir en booleano -> status
fr: un processeur **Extraire le masque de bits** de 15 à 16 pour convertir en booléen -> status
it: un **Estrai maschera di bit** da 15 a 16 per la conversione in valore booleano -> stato;
nl: één **Extraheer bit masker** van 15 tot 16 om te converteren in booleaans -> status

source: one **Expression** to concatenate first from 8 to 16 to convert into integer
de: einen **Ausdruck**, um zunächst von 8 bis 16 zu verknüpfen und in eine Ganzzahl umzuwandeln
es: 1 procesador **Expresión** para concatenar primero de 8 a 16 para convertir en entero
fr: un processeur **Expression** pour concaténer tout d'abord de 8 à 16 pour la conversion en entier
it: una **Espressione** per concatenare prima da 8 a 16 da convertire in intero.
nl: één **Uitdrukking** om eerst samen te voegen van 8 tot 16 om te converteren in geheel getal

source: **Extract bit mask 1**
de: **Bitmaske extrahieren 1**
es: **Extraer máscara de bits 1**
fr: **Extraire le masque de bits 1**
it: **Estrai maschera di bit 1**
nl: **Extraheer bit masker 1**

source: **Extract bit mask 2**
de: **Bitmaske extrahieren 2**
es: **Extraer máscara de bits 2**
fr: **Extraire le masque de bits 2**
it: **Estrai maschera di bit 2**
nl: **Extraheer bit masker 2**

source: **Extract bit mask 3**
de: **Bitmaske extrahieren 3**
es: **Extraer máscara de bits 3**
fr: **Extraire le masque de bits 3**
it: **Estrai maschera di bit 3**
nl: **Extraheer bit masker 3**

source: **Expression**
de: **Ausdruck**
es: **Expresión**
it: **Espressione**
nl: **Uitdrukking**

source: **Temperature**
de: **Temperatur**
es: **Temperatura**
fr: **Température**
it: **Temperatura**
nl: **Temperatuur**

source: Date processors
de: Datumsprozessoren
es: Procesadores de fecha
fr: Processeurs de dates
it: Processori di data
nl: Datumverwerkers

source: Normalize Date
de: Datum normalisieren
es: Normalizar fecha
fr: Normaliser une Date
it: Normalizza la data
nl: Normaliseer datum

source: Date normalization is one of the most commonly used processors. It allows you to parse a date in a format that would otherwise not be understood by the platform.
de: Die Normalisierung des Datums gehört zu den am häufigsten genutzten Prozessoren. Er ermöglicht Ihnen, ein Datum in ein Format zu zerlegen, das sonst nicht von der Plattform verstanden werden würde.
es: El procesador Normalizar fecha es uno de los más utilizados. Permite analizar una fecha en un formato que, de lo contrario, la plataforma no entendería.
fr: La normalisation de date est un des processeurs les plus utilisés. Il permet d'interpréter la date dans un format qui n'aurait autrement pas été détecté par la plateforme.
it: La normalizzazione della data è uno dei processori più utilizzati. Esso permette di analizzare una data in un formato che, altrimenti, non verrebbe compreso dalla piattaforma.
nl: Datumnormalisatie is één van de meest vaak gebruikte processoren. Het stelt u in staat een datum te ontleden in een formaat dat anders niet begrepen zou worden door het platform.

source: The most common common case is when dates are in the DD/MM/YYYY format : by default the platform will parse dates using the MM/DD/YYYY format (US). For example January 10 2016 written 10/01/2016 (French format) will be interpreted as October 1 2016.
de: Der am häufigsten auftretende Fall ist, wenn das Datum im Format DD/MM/YYYY vorliegt: die Plattform zerlegt die Daten standardmäßig unter Einsatz des Formats MM/DD/YYYY (USA). Wird der 10. Januar 2016 beispielsweise im europäischen Format (10/01/2016) geschrieben, wird dies als der 1. Oktober 2016 interpretiert.
es: El caso más frecuente es aquel en que las fechas tienen el formato DD/MM/AAAA: de forma predeterminada, la plataforma analizará las fechas con el formato MM/DD/AAAA (EE. UU.). Por ejemplo, el 10 de enero de 2016 escrito como 10/01/2016 (formato francés) se interpretará como 1 de octubre de 2016.
fr: Le cas le plus courant est lorsque les dates sont dans le format JJ/MM/AAAA : par défaut, la plateforme interprétera les dates dans le format MM/JJ/AAAA (format américain). Par exemple, le 10 janvier 2016 écrit 10/01/2016 sera interprété comme le 1er octobre 2016.
it: Il caso più comune si verifica quando le date sono espresse nel formato GG/MM/AAAA. Per impostazione predefinita, la piattaforma analizza le date utilizzando il formato statunitense MM/GG/AAAA. Il 10 gennaio 2016 espresso come 10/01/2016 (formato italiano) verrebbe quindi interpretato come 1 ottobre 2016.
nl: Het vaakst voorkomende geval is wanneer data in het DD/MM/JJJJ formaat staan: standaard zal het platform data ontleden volgens het MM/DD/JJJJ formaat (VS). Bijvoorbeeld: 10 januari 2016 dat geschreven wordt als 10/01/2016 (Frans formaat) zal geïnterpreteerd worden als 1 oktober 2016.

source: The Date Normalization processor can then be used to correct this problem, by simply specifying the date format pattern to use in the **Date format** parameter. In this case, the format we want is DD/MM/YYYY, which will be written **%d/%m/%Y** (see below for more details on patterns) :
de: Der Prozessor zur Normalisierung des Datums kann verwendet werden, um dieses Problem zu beheben, indem das Datumsformatmuster im Parameter **Datumsformat** angegeben wird. In diesem Fall ist das von uns gewünschte Format DD/MM/YYYY und es wird auf diese Weise geschrieben: **%d/%m/%Y** (weiter unten erhalten Sie weitere Einzelheiten zu den Mustern):
es: Después se puede usar el procesador Normalizar fecha para corregir este problema, simplemente especificando el patrón de formato de fecha en el parámetro **Formato de fecha**. En este caso, el formato que queremos es DD/MM/AAAA, que se escribirá **%d/%m/%Y** (vea a continuación para obtener más detalles acerca de los patrones):
fr: Le processeur Normaliser une Date peut dans ce cas être utilisé pour corriger ce problème, en indiquant simplement le format de date à utiliser dans le champ **Date format**. Dans l'exemple précédent, le format voulu est JJ/MM/AAAA, qui s'écrira **%d/%m/%Y** dans le champ (voir ci-dessous pour plus de détails sur la syntaxe des différents formats) :
it: Il processore di normalizzazione della data permette di risolvere questo problema, specificando il pattern del formato di data da utilizzare nel parametro **Formato data**. In questo caso, il formato che desideriamo ottenere è GG/MM/AAAA, che verrà scritto **%d/%m/%Y** (per ulteriori informazioni sui pattern, vedere più avanti) :
nl: De Date Normalization processor kan vervolgens gebruikt worden om dit probleem op te lossen door gewoon het datumformaatpatroon te specificeren dat gebruikt moet worden in de parameter **Datumformaat**. In dit geval is het formaat dat we willen DD/MM/JJJJ, wat geschreven zal worden als **%d/%m/%Y** (zie hieronder voor meer details over patronen):

source: By default, 12/04/2016 and 03/10/2016 are interpreted respectively as December 4 2016 and March 10 2016
de: Standardmäßig werden Angaben wie 12/04/2016 und 03/10/2016 als 4. Dezember 2016 bzw. 10. März 2016 interpretiert.
es: De forma predeterminada, 12/04/2016 y 03/10/2016 se interpretan respectivamente como 4 de diciembre de 2016 y 10 de marzo de 2016.
fr: Par défaut, 12/04/2016 et 03/10/2016 sont interprétés respectivement en 4 décembre 2016 et 10 mars 2016
it: Per impostazione predefinita, 12/04/2016 e 03/10/2016 sono interpretati rispettivamente come 4 dicembre 2016 e 10 marzo 2016.
nl: Standaard worden 12/04/2016 en 03/10/2016 geïnterpreteerd als respectievelijk 4 december 2016 en 10 maart 2016
