Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/processing.po
Languages: de, es, fr, it, nl

source: This processor can be used to normalize a field value that should contain a valid URL. It can be used for instance when the field's value contains leading or trailing spaces, or does not have any scheme specification (in which case 'http://' is prepended to the field's value).
de: Dieser Prozessor kann verwendet werden, um einen Feldwert zu normalisieren, der eine gültige URL enthalten sollte. Er kann beispielsweise verwendet werden, wenn der Feldwert voran- oder nachgestellte Leerzeichen enthält oder keine Schemaspezifikation aufweist (in diesem Fall wird dem Feldwert "http://" vorangestellt).
es: Este procesador se puede utilizar para normalizar el valor de un campo que debería contener una dirección URL válida. Se puede emplear por ejemplo cuando el valor del campo contiene espacios iniciales o finales, o no tiene ninguna especificación de esquema (en ese caso, se antepone 'http://' al valor del campo).
fr: Ce processeur peut être utilisé pour normaliser les valeurs d'un champ qui est supposé contenir des URL valides. Il peut être utilisé par exemple quand les valeurs risquent de comprendre des espaces au début ou à la fin, ou quand l'URL ne contient pas le protocole au début (auquel cas 'http://' est préfixé à la valeur).
it: Questo processore permette di normalizzare il valore di un campo che deve contenere un URL valido. Può essere utilizzato, ad esempio, quando il valore del campo contiene spazi iniziali o finali o quando non è stato specificato alcuno schema (nel qual caso, il prefisso 'http://' viene anteposto al valore del campo).
nl: Deze processor kan gebruikt worden om een veldwaarde, die een geldige URL zou moeten bevatten, te normaliseren. Dit kan bijvoorbeeld gebruikt worden wanneer de waarde van het veld "leading spaces" of "trailing spaces" bevat of geen schemaspecificatie heeft (in dit geval wordt 'http://' vóór de waarde van het veld geplaatst).

source: Field that contains the URL to normalize
de: Feld, das eine zu normalisierende URL enthält
es: El campo que contiene la dirección URL para normalizar.
fr: Champ contenant l'URL à normaliser
it: Campo contenente l'URL da normalizzare.
nl: Veld dat de URL bevat die genormaliseerd moet worden

source: Extract URLs
de: URLs extrahieren
es: Extraer direcciones URL
fr: Extrait les liens
it: Estrai URL

source: This processor extracts URLs from HTML or text content. It extracts http and https links into a field, the links are separated by a space.
de: Dieser Prozessor extrahiert URLs aus HTML- oder Textinhalten. Er extrahiert HTTP- und HTTPS-Links in ein Feld. Die Links werden durch ein Leerzeichen getrennt.
es: Este procesador extrae las direcciones URL de contenido textual o HTML. Extrae vínculos http y https en un campo; los vínculos están separados por un espacio.
fr: Ce processeur extrait les URLs depuis du contenu HTML ou texte. Les URLs extraites sont copiés dans un champ, et séparés par un espace lorsqu'il y en a plusieurs.
it: Questo processore estrae gli URL dal contenuto HTML o di testo. Estrae i link http e https in un campo, separandoli da uno spazio.
nl: Deze processor extraheert URL's uit HTML of text content. Hij extraheert http- en https-koppelingen in een veld, waarbij de koppelingen worden gescheiden door een spatie.

source: The field that contains HTML or text content
de: Das Feld, das den HTML- oder Textinhalt enthält
es: El campo que contiene contenido textual o HTML.
fr: Champ contenant du code HTML ou du texte
it: Campo che include il contenuto HTML o di testo.
nl: Het veld dat HTML of text content bevat

source: Decode HTML entities
de: HTML-Entities dekodieren
es: Descodificar entidades HTML
fr: Décoder les entités HTML
it: Decodifica entità HTML
nl: Decodeer HTML-entiteiten

source: Decode HTML entities from a text, to transform it into valid HTML.
de: Dekodiert HTML-Entities aus einem Text, um sie in gültiges HTML umzuwandeln.
es: Descodificar entidades HTML de un texto para convertirlo en HTML válido.
fr: Ce processeur permet de décoder les entités HTML d'un texte, afin de le transformer en code HTML valide.
it: Decodifica le entità HTML da un testo, trasformandolo in un HTML valido.
nl: Decodeer HTML-entiteiten uit een tekst om deze te transformeren naar geldige HTML.

source: All fields
de: Alle Felder
es: Todos los campos
fr: Tous les champs
it: Tutti i campi
nl: Alle velden

source: Replace via Regexp
de: Ersetzen mittels RegExp
es: Sustituir mediante Regexp
fr: Remplacer à l'aide d'expressions régulières
it: Sostituisci tramite Regexp

source: This processor can be used to replace or remove any part of a text or a number or a combination of both.
de: Dieser Prozessor kann verwendet werden, um irgendeinen Teil eines Textes oder einer Zahl oder einer Kombination von beiden zu ersetzen oder zu entfernen.
es: Este procesador se puede utilizar para sustituir o eliminar cualquier parte de un texto o número o una combinación de ambos.
fr: Ce processeur peut être utilisé pour remplacer ou enlever n'importe quelle chaîne alphabétique, numérique ou une combinaison des deux.
it: Questo processore permette di sostituire o rimuovere qualsiasi parte di un testo o di un numero, o una combinazione di entrambi.
nl: Deze processor kan gebruikt worden om een deel van een tekst of een getal of een combinatie van beide te vervangen of te verwijderen.

source: One use case is keeping only a part of a number, for example from a french Zip code to keep only the area code, e.g from 44100 (Nantes city) keep only 44 (Loire-Atlantique area).
de: Ein Anwendungsfall ist die Beibehaltung eines Teils einer Zahl - wie bei einer französischen Postleitzahl, um nur die Ordnungszahl des Départements beizubehalten, z. B. von 44100 (die Stadt Nantes) zu 44 (das Département Loire-Atlantique).
es: Un caso de uso consiste en conservar solo una parte de un número, como conservar solo el código de área de un código postal francés. P. ej. de 44100 (ciudad de Nantes), conservar solo 44 (región Loira Atlántico).
fr: Un autre cas d'utilisation est de garder seulement une partie d'un numéro, par exemple d'un code postal français, ne garder que le code du département, de 44100 (Nantes) garder seulement 44 (département Loire-Atlantique)
it: Un esempio potrebbe riguardare la necessità di mantenere solo una parte di un numero, come il codice d'area contenuto in un CAP francese. In questo caso, dal codice 44100 (città di Nantes) verrà conservato solo 44 (area Loira-Atlantico).
nl: Een voorbeeld is om slechts een deel van een getal te behouden, zoals voor een Franse postcode enkel de regiocode, bijvoorbeeld voor 44100 (stad Nantes) behoud enkel 44 (regio Loire-Atlantique).

source: In this example, the regular expression processor is configured with the pattern ``[0-9]{3}$``, and a replacement by nothing. The pattern means "select 3 digits from the end", with ``[0-9]`` meaning any digit, ``{3}`` meaning exactly 3 occurences, and ``$`` meaning the end of the text. These 3 digits from the end are then replaced by nothing, so only the first 2 digits will stay.
de: In diesem Beispiel wird der Prozessor für reguläre Ausdrücke mit dem Muster "[0-9]{3}$" und einem Ersatz durch Nichts konfiguriert. Das Muster bedeutet "3 Ziffern vom Ende wählen": "[0-9]" bezieht sich auf irgendeine Ziffer, "{3}" bedeutet exakt 3 Vorkommen und "$" bezieht sich auf das Ende des Textes. Diese 3 Ziffern vom Ende werden dann durch Nichts ersetzt, also bleiben nur die ersten 2 Ziffern.
es: En este ejemplo, el procesador de expresiones regulares se ha configurado con el patrón ``[0-9]{3}$`` y la sustitución por nada. El patrón significa "seleccionar 3 dígitos del final", con ``[0-9]`` que significa cualquier dígito, ``{3}`` que significa exactamente 3 apariciones y ``$`` que significa el final del texto. Estos 3 dígitos del final se sustituyen por nada, de modo que solo se conservan los 2 primeros dígitos.
fr: Dans cet exemple, le processeur d'expression régulière est configuré avec la chaine ``[0-9]{3}$``, et un remplacement par rien. La chaîne signifie : "sélectionner 3 caractères de la fin", ``[0-9]`` pour n'importe quel chiffre, ``{3}`` pour exactement 3 occurrences et ``$`` qui signifie fin du texte. Ces 3 numéros à la fin sont remplacés par rien, il ne restera que les 2 premiers numéros.
it: In questo esempio, il processore dell'espressione regolare è configurato con il pattern ``[0-9]{3}$`` e nessuna sostituzione. Il pattern significa "seleziona 3 cifre a partire dalla fine". ``[0-9]`` vuol dire qualsiasi cifra, ``{3}`` significa esattamente 3 occorrenze e ``$`` indica la fine del testo. Queste 3 cifre dalla fine non vengono sostituite con niente, quindi rimangono solo le prime 2 cifre.
nl: In dit voorbeeld wordt de Regular Expression-processor geconfigureerd met het patroon ``[0-9]{3}$`` en een vervanging door niets. Het patroon betekent "selecteer 3 karakters van het einde", waarbij ``[0-9]`` staat voor een karakter, ``{3}`` betekent dat het precies 3 keer plaatsvindt en ``$`` staat voor het einde van de tekst. Deze 3 karakters van het einde worden vervolgens vervangen door niets, waardoor enkel de eerste 2 karakters overblijven.

source: See `<http://en.wikipedia.org/wiki/Regular_expression>`_ for more details on how to write a regular expressions. You can test your regexp expressions with an online debugger tool like `Regex101 <https://regex101.com/>`_.
de: Weitere Informationen darüber, wie man reguläre Ausdrücke schreibt, finden Sie hier: `<https://de.wikipedia.org/wiki/Regul%C3%A4rer_Ausdruck>`_. Sie können Ihre RegExp-Ausdrücke mit einem Online-Debugger-Tool wie `Regex101 <https://regex101.com/>`_ testen.
es: Consulte `<http://en.wikipedia.org/wiki/Regular_expression>`_ para obtener más detalles acerca de cómo escribir las expresiones regulares. Puede probar las expresiones regexp con una herramienta de depuración en línea como `Regex101 <https://regex101.com/>`_.
fr: Voir `<http://fr.wikipedia.org/wiki/Expression_rationnelle>`_ pour plus d'informations sur l'utilisation des expressions rationnelles. Vous pouvez tester vos expressions rationnelles à l'aide d'un débogueur en ligne comme `Regex101 <https://regex101.com/>`_.
it: Per ulteriori informazioni su come scrivere le espressioni regolari, consulta la pagina `<http://en.wikipedia.org/wiki/Regular_expression>`_. È possibile testare le espressioni regolari con uno strumento di debug online, come ad esempio `Regex101 <https://regex101.com/>`_.
nl: Zie `<http://en.wikipedia.org/wiki/Regular_expression>`_ voor meer details over hoe regelmatige uitdrukkingen moeten worden geschreven. U kan uw regex-uitdrukkingen testen met een online debugger tool zoals `Regex101 <https://regex101.com/>`_.

source: Regular expression
de: Regulärer Ausdruck
es: Expresión regular
fr: Expression régulière
it: Espressione regolare
nl: Regelmatige uitdrukking

source: New value
de: Neuer Wert
es: Valor nuevo
fr: Nouvelle valeur
it: Nuovo valore
nl: Nieuwe waarde

source: Case insensitive regular expression
de: Regulärer Ausdruck (Groß- und Kleinschreibung nicht beachtend)
es: Expresión regular sin distinguir mayúsculas de minúsculas
fr: Expression régulière non sensible à la casse
it: Espressione regolare non sensibile alle maiuscole
nl: Hoofdletterongevoelige regelmatige uitdrukking

source: Multiline regular expression
de: Mehrzeiliger regulärer Ausdruck
es: Expresión regular multilínea
fr: Expression régulière sur plusieurs lignes
it: Espressione regolare su più righe
nl: Regelmatige uitdrukking over meerdere lijnen

source: '.' character match newlines
de: Das Zeichen '.' steht für Zeilenumbrüche
es: Nuevas líneas con coincidencias de carácter '.'
fr: Le caractère '.' correspond aux nouvelles lignes
it: Il carattere '.' identifica i nuovi capoversi
nl: '.' karakter stemt overeen met nieuwe lijnen

source: Split Text
de: Text aufteilen
es: Dividir texto
fr: Séparer le Texte
it: Dividi il testo

source: This processor can be used to split a field's value and to extract the Nth element to a new field.
de: Dieser Prozessor kann verwendet werden, um den Wert eines Feldes aufzuteilen und das n-te Element in ein neues Feld zu extrahieren.
es: Este procesador se puede utilizar para dividir el valor de un campo y extraer el elemento enésimo N en un campo nuevo.
fr: Ce processeur peut être utilisé pour séparer la valeur d'un champ et extraire le Nième élément issu de cette séparation vers un nouveau champ.
it: Questo processore permette di dividere il valore di un campo e di estrarre l'ennesimo elemento in un nuovo campo.
nl: Deze processor kan gebruikt worden om de waarde van een veld op te splitsen en het Nth-element te extraheren naar een nieuw veld.

source: The number of the part extracted is specified in the ``index`` parameter. Note that the numbering starts at 0.
de: Die Nummer des extrahierten Teils wird im Parameter "index" angegeben. Beachten Sie, dass die Nummerierung mit 0 beginnt.
es: El número de la parte extraída se especifica en el parámetro ``Índice``. Tenga presente que la numeración empieza por 0.
fr: Le numéro de la partie extraite est spécifié dans le paramètre `ìndex`. La numération commence à 0.
it: Il numero della parte estratta è specificato nel parametro ``index``. La numerazione parte da 0.
nl: Het getal van het geëxtraheerde deel staat gespecificeerd in de "index"-parameter. Merk op dat de nummering begint bij 0.

source: Field that contains the text to split
de: Feld, das den aufzuteilenden Text enthält
es: Campo que contiene el texto para dividir.
fr: Champ contenant le texte à séparer
it: Campo contenente il testo da dividere.
nl: Veld dat de tekst bevat die opgesplitst moet worden

source: String or character to split with
de: Zeichenfolge oder Zeichen für die Aufteilung
es: Cadena o carácter con que se realiza la división.
fr: Chaîne de caractères ou caractère servant à la séparation
it: Stringa o carattere con cui eseguire la divisione.
nl: String of karakter waarmee moet worden opgesplitst

source: Index of the element to extract in the new field
de: Index des in das neue Feld zu extrahierenden Elements
es: Índice del elemento para extraer en el campo nuevo.
fr: Index de l'élément à extraire dans le nouveau champ
it: Indice dell'elemento da estrarre nel nuovo campo.
nl: Index van het element om te extraheren in het nieuwe veld

source: Extract text
de: Text extrahieren
es: Extraer texto
fr: Extraire du texte
it: Estrai testo

source: This processor can be used to extract any part of a text or a number or a combination of both into a new column. It's similar to the Replace Regexp processor, except instead of replacing the content in place the same column, a new column is created with the selected text.
de: Dieser Prozessor kann verwendet werden, um einen Teil eines Textes oder einer Zahl oder einer Kombination von beiden in eine neue Spalte zu extrahieren. Er funktioniert ähnlich wie der Prozessor "Ersetzen mittels RegExp", doch anstatt den Inhalt in der gleichen Spalte zu ersetzen, wird eine neue Spalte mit dem ausgewählten Text erstellt.
es: Este procesador se puede utilizar para extraer cualquier parte de un texto o número o una combinación de ambos en una columna nueva. Es parecido al procesador Sustituir Regexp, salvo que al sustituir el contenido en lugar de usar la misma columna se crea una columna nueva con el texto seleccionado.
fr: Ce processeur peut être utilisé pour remplacer ou enlever n'importe quelle chaîne alphabétique, numérique ou une combinaison des deux. Il est identique au processeur Remplacer par expression régulière, mais au lieu de remplacer le contenu en place dans la même colonne, une nouvelle colonne est créée avec le texte sélectionné.
it: Questo processore permette di estrarre qualsiasi parte di un testo o di un numero o una combinazione di entrambi in una nuova colonna. È simile al processore Sostituisci tramite Regexp, ma anziché sostituire il contenuto nella stessa colonna crea una colonna nuova con il testo selezionato.
nl: Deze processor kan gebruikt worden om elk deel van een tekst of een getal of een combinatie van beide te extraheren in een nieuwe kolom. Hij is gelijkaardig aan de Replace Regexp-processor, behalve dat in plaats van de context wordt vervangen in dezelfde kolom, er een nieuwe kolom wordt aangemaakt met de geselecteerde tekst.

source: The idea is to put the part we want to extract in parenthesis. This part will then be extracted in a new column.
de: Dahinter steckt die Idee, den zu ersetzenden Teil in Klammern zu setzen. Dieser Teil wird dann in eine neue Spalte extrahiert.
es: La idea es colocar la parte que queremos extraer entre paréntesis. Después, esta parte se extraerá en una columna nueva.
fr: L'idée est de placer la partie à extraire entre parenthèses. Cette partie sera extraite dans une nouvelle colonne.
it: La parte da estrarre viene inserita tra parentesi e quindi estratta in una nuova colonna.
nl: Het idee is om het deel dat we willen extraheren tussen haakjes te plaatsen. Dit deel zal vervolgens worden geëxtraheerd in een nieuwe kolom.

source: Using the same example as for the Replace Regexp processor (from a french zip code like 44100, keep only the area code 44), the Extract Text processor can be used to create another column with the area code selected, instead of replacing the content like with the Replace Regexp processor.
de: Verwenden wir das gleiche Beispiel wie beim RegExp-Prozessor (aus der französischen Postleitzahl 44100 soll nur die Ordnungszahl des Départements 44 beibehalten werden): Der Prozessor zum Extrahieren des Textes kann verwendet werden, um eine weitere Spalte mit der ausgewählten Ordnungszahl zu erstellen, anstatt den Inhalt zu ersetzen, wie es der RegExp-Prozessor tut.
es: Siguiendo con el ejemplo del procesador Sustituir Regexp (de un código postal francés como 44100, conservar solo el código de área 44), el procesador Extraer texto se puede usar para crear otra columna con el código de área seleccionado, en lugar de sustituir el contenido como con el procesador Sustituir Regexp.
fr: En utilisant le même exemple que le processeur Remplacer avec une expression régulière (d'un code postal français tel que 44100, ne garder que le début 44), le processeur Extraire du texte peut être utilisé pour créer une autre colonne avec le code du département sélectionné au lieu de remplacer le contenu comme avec le processeur Remplacer avec une expression régulière.
it: Utilizzando lo stesso esempio impiegato per il processore Sostituisci tramite Regexp (dal codice CAP francese 44100, si desidera mantenere solo il codice di area 44), il processore Estrai testo permette di creare un'altra colonna con il codice di area selezionato, anziché sostituire il contenuto come nel caso del processore Sostituisci con Regexp.
nl: We gebruiken hetzelfde voorbeeld als voor de Replace Regexp-processor (behoud van een Franse postcode, zoals 44100, enkel de regiocode 44). De Extract Text-processor kan gebruikt worden om een andere kolom aan te maken met de geselecteerde regiocode, in plaats van de content te vervangen, zoals bij de Replace Regexp-processor.

source: In this example, we use the pattern ``(?P<area>[0-9]{2})[0-9]{3}``. ``[0-9]`` means any digit, and ``{2}`` or ``{3}`` means the number of digits we are looking for. In this case we want to extract the first two digits, so we put them in parenthesis, then after the parenthesis we put the rest of the sequence that we don't want to extract, here the remaining 3 digits. The special expression ``?P<area>`` is just for specifiying the new column name
de: In diesem Beispiel verwenden wir das Muster "(?P<area>[0-9]{2})[0-9]{3}". "[0-9]" bezieht sich auf irgendeine Ziffer und "{2}" oder "{3}" bezieht sich auf die Anzahl der von uns gewünschten Ziffern. In diesem Fall wollen wir die ersten beiden Ziffern extrahieren, deshalb setzen wir sie in Klammern. Nach der Klammer setzen wir den Rest der Sequenz ein, die wir nicht extrahieren möchten, in diesem Fall die restlichen 3 Ziffern. Der Sonderausdruck "?P<area>" dient nur zur Angabe des neuen Spaltennamens.
es: En este ejemplo, empleamos el patrón ``(?P<area>[0-9]{2})[0-9]{3}``. ``[0-9]`` significa cualquier dígito, y ``{2}`` o ``{3}`` significa el número de dígitos que buscamos. En este caso, como queremos extraer los 2 primeros dígitos, los incluimos entre paréntesis y después del paréntesis ponemos el resto de la secuencia que no deseamos extraer, en este caso los 3 dígitos restantes. La expresión especial ``?P<area>`` solo es para especificar el nombre de la columna nueva.
fr: Dans cet exemple, nous utilisons la chaine ``(?P<area>[0-9]{2})[0-9]{3}``. ``[0-9]`` signifie n'importe quel numéro et ``{2}`` ou ``{3}`` signifient le nombre de numéro recherchés. Dans ce cas, nous voulons extraire les deux premiers numéros, nous utilisons donc les parenthèses; après les parenthèses, nous plaçons le reste de la chaîne que nous ne voulons pas écrire, ici les 3 numéros restants. L'expression spéciale ``?P<area>`` permet de spécifier le nom de la nouvelle colonne.
it: In questo esempio, utilizziamo il pattern ``(?P<area>[0-9]{2})[0-9]{3}``. ``[0-9]`` significa qualsiasi cifra e ``{2}`` o ``{3}`` indicano il numero di cifre desiderate. In questo caso, intendiamo estrarre le prime due cifre, quindi è necessario racchiuderle tra parentesi; dopo la parentesi riportiamo il resto della sequenza che non deve essere estratta, in questo caso le 3 cifre restanti. L'espressione speciale ``?P<area>`` serve solo per specificare il nome della nuova colonna.
nl: In dit voorbeeld gebruiken we het patroon ``(?P<area>[0-9]{2})[0-9]{3}``. ``[0-9]`` betekent elk karakter en ``{2}`` of ``{3}`` betekent het aantal karakters waar we naar op zoek zijn. In dit geval willen we de eerste twee karakters extraheren, dus zetten we ze tussen haakjes. Vervolgens zetten we na de haakjes de rest van de sequentie die we niet willen extraheren, in dit geval de resterende 3 karakters. De speciale uitdrukking ``?P<area>`` is enkel voor het specificeren van de naam van de nieuwe kolom.

source: From a more technical point of view, this processor can be used to extract an arbitrary pattern expressed as a regular expression out of a string using sub matching.
de: Aus technischer Sicht kann dieser Prozessor verwendet werden, um ein beliebiges Muster zu extrahieren, das als regulärer Ausdruck aus einer Zeichenkette unter Verwendung von Sub-Matching ausgedrückt wird.
es: Desde un punto de vista técnico, este procesador se puede utilizar para extraer un patrón arbitrario expresado como una expresión regular de una cadena utilizando la subcoincidencia.
fr: D'un point de vue technique, ce processeur peut être utilisé pour extraire un certain motif exprimé sous forme d'expression régulière depuis une chaine de caractère en utilisant la correspondance.
it: Da un punto di vista più tecnico, questo processore può servire per estrarre un pattern arbitrario espresso da una stringa sotto forma di espressione regolare mediante il submatch.
nl: Vanuit een meer technisch oogpunt, kan de processor gebruikt worden om een willekeurig uitgedrukt patroon te extraheren als een regelmatige uitdrukking uit een string door gebruik te maken van sub matching.

source: The syntax of the sub-matching expression to specify is the following: ``(?P<NAME>REGEXP)``. Where:
de: Die Syntax des anzugebenen Sub-Matching-Ausdrucks lautet: "(?P<NAME>REGEXP)". Wobei:
es: La sintaxis de la expresión subcoincidente para especificar es esta: ``(?P<NOMBRE>REGEXP)``. Donde:
fr: La syntaxe de l'expression d'extraction est la suivante: ``(?P<NOM>REGEXP)``. Où :
it: La sintassi dell'espressione di sub-match da specificare è la seguente: ``(?P<NOME>REGEXP)``. Dove:
nl: De syntax van de sub-matching uitdrukking die moet worden gespecificeerd, is de volgende: ``(?P<NAME>REGEXP)``. Waarbij:
