Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/processing.po
Languages: de, es, fr, it, nl

source: With the Date normalization processor and the pattern %d/%m/%Y (DD/MM/YYYY), the dates are interpreted as April 12 2016 and October 3 2016
de: Mit dem Prozessor zur Normalisierung der Daten und dem Muster %d/%m/%Y (DD/MM/YYYY), werden die Daten als 12. April 2016 und 3. Oktober 2016 interpretiert
es: Con el procesador Normalizar fecha y el patrón %d/%m/%Y (DD/MM/AAAA), las fechas se interpretan como 12 de abril de 2016 y 3 de octubre de 2016.
fr: Avec le processeur Normaliser une date et le format %d/%m/%Y (JJ/MM/AAAA), les dates sont interprétées en 12 avril 2016 et 3 octobre 2016
it: Con il processore di normalizzazione della data e il pattern %d/%m/%Y (GG/MM/AAAA), le date vengono interpretate come 12 aprile 2016 e 3 ottobre 2016.
nl: Met de Date Normalization processor en het patroon %d/%m/%Y (DD/MM/JJJJ), worden de data geïnterpreteerd als 12 april 2016 en 3 oktober 2016

source: In general, it is preferred to have date in the unambiguous format YYYY-MM-DD to avoid these problems (note that Excel files are usually not affected by these issues).
de: Im Allgemeinen ist es zu bevorzugen, das Datum im eindeutigen Format YYYY-MM-DD vorliegen zu haben, um diese Probleme zu vermeiden (beachten Sie, dass Excel-Dateien in der Regel nicht von diesen Problemen betroffen sind).
es: En general, para evitar estos problemas, se prefiere el formato de fecha AAAA-MM-DD dada su falta de ambigüedad (tenga en cuenta que los archivos Excel no suelen verse afectados por estos temas).
fr: De manière générale, il est préférable d'utiliser des dates dans le format AAAA-MM-JJ qui est sans ambiguïtés pour éviter ces problèmes (les fichiers Excel ne sont pas concernés)
it: In generale, è preferibile esprimere la data nel formato non ambiguo AAAA-MM-GG, per evitare questi problemi. I file Excel generalmente non presentano queste difficoltà.
nl: Algemeen beschouwd verdient het de voorkeur om de datum te hebben in een ondubbelzinnig formaat JJJJ-MM-DD om deze problemen te vermijden (merk op dat Excel-bestanden meestal niet te kampen hebben met deze problemen).

source: A pattern is an arbitrary string containing one of the following directives.
de: Ein Muster ist eine beliebige Zeichenfolge, die eine der folgenden Richtlinien enthält.
es: Un patrón es una cadena arbitraria que contiene una de las directivas siguientes.
fr: Un format est une chaine de caractère utilisant les directives suivantes.
it: Un pattern è una stringa arbitraria contenente una delle seguenti direttive.
nl: Een patroon is een willekeurige string die één van de volgende richtlijnen bevat.

source: Directive
de: Richtlinie
es: Directiva
it: Direttiva
nl: Richtlijn

source: Meaning
de: Bedeutung
es: Significado
fr: Signification
it: Significato
nl: Betekenis

source: Weekday as locale’s abbreviated name.
de: Wochentag als abgekürzter Name im Locale.
es: Día de la semana como nombre abreviado en la configuración regional.
fr: Jour de la semaine en abrégé et en anglais
it: Giorno della settimana come nome locale abbreviato.
nl: Weekdag als de verkorte naam van locale.

source: Sun, Mon, ..., Sat
de: So, Mo, ..., Sa
it: Lun, mar, ..., dom
nl: Zon, Maa, ..., Zat

source: Weekday as locale’s full name.
de: Wochentag als vollständiger Name im Locale.
es: Día de la semana como nombre completo en la configuración regional.
fr: Jour de la semaine en entier et en anglais
it: Nome della settimana come nome locale completo.
nl: Weekdag als volledige naam van locale

source: Sunday, Monday, ..., Saturday
de: Sonntag, Montag, ..., Samstag
it: Lunedì, martedì,..., domenica
nl: Zondag, Maandag, ..., Zaterdag

source: Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.
de: Wochentag als Dezimalzahl, wobei 0 für Sonntag und 6 für Samstag steht.
es: Día de la semana como número decimal, donde 0 es domingo y 6 es sábado.
fr: Jour de la semaine sous forme de numéro, sachant que 0 est dimanche et 6 est samedi.
it: Giorno della settimana come numero decimale, in cui 0 è domenica e 6 è sabato.
nl: Weekdag als een decimaal getal, waarbij 0 zondag is en 6 zaterdag.

source: Day of the month as a zero-padded decimal number.
de: Tag des Monats als mit Null aufgefüllte Dezimalzahl.
es: Día del mes como número decimal rellenado con 0.
fr: Jour du mois sous forme de nombre à 2 chiffres.
it: Giorno del mese come numero decimale preceduto da zero.
nl: Dag van de maand als een decimaal getal waarvoor een nul wordt geplaatst..

source: Month as locale’s abbreviated name.
de: Monat als abgekürzter Name im Locale.
es: Mes como nombre abreviado en la configuración regional.
fr: Mois en abrégé et en anglais
it: Mese come nome locale abbreviato.
nl: Maand als de afgekorte naam van locale.

source: Jan, Feb, ..., Dec
de: Jan, Feb, ..., Dez
it: gen, feb..., dic

source: Month as locale’s full name.
de: Monat als vollständiger Name im Locale.
es: Mes como nombre completo en la configuración regional.
fr: Mois en entier et en anglais
it: Mese come nome locale completo.
nl: Maand als volledige naam van locale

source: January, February, ..., December
de: Januar, Februar, ..., Dezember
it: gennaio, febbraio..., dicembre
nl: Januari, Februari, ..., December

source: Month as a zero-padded decimal number.
de: Monat als mit Null aufgefüllte Dezimalzahl.
es: Mes como número decimal rellenado con 0.
fr: Mois sous forme de nombre à 2 chiffres.
it: Mese come numero decimale preceduto da zero.
nl: Maand als een decimaal getal waarvoor een nul wordt geplaatst..

source: Year without century as a zero-padded decimal number.
de: Jahr ohne Jahrhundert als mit Null aufgefüllte Dezimalzahl.
es: Año sin siglo como número decimal rellenado con 0.
fr: Année sans le siècle sous forme de 2 chiffres.
it: Anno senza il secolo come numero decimale preceduto da zero.
nl: Jaar zonder eeuw als een decimaal getal waarvoor een nul wordt geplaatst.

source: Year with century as a decimal number.
de: Jahr mit Jahrhundert als Dezimalzahl.
es: Año con siglo como número decimal.
fr: Année avec le siècle sous forme de nombre.
it: Anno con il secolo come numero decimale.
nl: Jaar met eeuw als een decimaal getal.

source: Hour (24-hour clock) as a zero-padded decimal number.
de: Stunde (24-Stunden-Uhr) als mit Null aufgefüllte Dezimalzahl.
es: Hora (reloj de 24 horas) como número decimal rellenado con 0.
fr: Heure (en 24 heures) sous forme de nombre à 2 chiffres.
it: Ora (in formato a 24 ore) come numero decimale preceduto da zero.
nl: Uur (24 urenklok) als een decimaal getal waarvoor een nul wordt geplaatst.

source: Hour (12-hour clock) as a zero-padded decimal number.
de: Stunde (12-Stunden-Uhr) als mit Null aufgefüllte Dezimalzahl.
es: Hora (reloj de 12 horas) como número decimal rellenado con 0.
fr: Heure (en 12 heures) sous forme de nombre à 2 chiffres.
it: Ora (in formato a 12 ore) come numero decimale preceduto da zero.
nl: Uur (12 urenklok) als een decimaal getal waarvoor een nul wordt geplaatst.

source: Locale’s equivalent of either AM or PM.
de: Lokales Äquivalent zu AM oder PM.
es: Equivalente en el entorno regional de AM o PM.
fr: Indique AM ou PM selon le matin ou l'après-midi.
it: Equivalente locale di AM o PM.
nl: Equivalent van locale van ofwel AM of PM

source: Minute as a zero-padded decimal number.
de: Minute als mit Null aufgefüllte Dezimalzahl.
es: Minutos como número decimal rellenado con 0.
fr: Minute sous forme de nombre à 2 chiffres.
it: Minuti come numero decimale preceduto da zero.
nl: Minuut als een decimaal getal waarvoor een nul wordt geplaatst..

source: Second as a zero-padded decimal number.
de: Sekunde als mit Null aufgefüllte Dezimalzahl.
es: Segundos como número decimal rellenado con 0.
fr: Secondes sous forme de nombre à 2 chiffres.
it: Secondi come numero decimale preceduto da zero.
nl: Seconde als een decimaal getal waarvoor een nul wordt geplaatst..

source: Microsecond as a decimal number, zero-padded on the left.
de: Mikrosekunde als Dezimalzahl, auf der linken Seite mit Null aufgefüllt.
es: Microsegundos como número decimal rellenado con 0 a la izquierda.
fr: Microsecondes sous forme de nombre à 6 chiffres.
it: Microsecondi come numero decimale preceduto da zero sulla sinistra.
nl: Microseconde als een decimaal getal, waarbij links een nul wordt geplaatst.

source: Day of the year as a zero-padded decimal number.
de: Tag des Jahres als mit Null aufgefüllte Dezimalzahl.
es: Día del año como número decimal rellenado con 0.
fr: Jour de l'année sous forme de nombre à 3 chiffres.
it: Giorno dell'anno come numero decimale preceduto da zero.
nl: Dag van het jaar als een decimaal getal waarvoor een nul wordt geplaatst..

source: Week number of the year (Sunday as the first day of the week) as a zero padded decimal number. All days in a new year preceding the first Sunday are considered to be in week 0.
de: Wochennummer des Jahres (Sonntag gilt als erster Tag der Woche) als mit Null aufgefüllte Dezimalzahl. Alle Tage in einem neuen Jahr vor dem ersten Sonntag gelten als in Woche 0.
es: Número de semana del año (el domingo es el primer día de la semana) como número decimal rellenado con 0. Todos los días de un año nuevo anteriores al primer domingo se consideran pertenecientes a la semana 0.
fr: Numero de semaine dans l'année sous forme de nombre à 2 chiffres (en considérant qu'une semaine démarre le dimanche). Tous les jours d'une nouvelle année précédant le premier dimanche sont considérés comme étant dans la semaine 0.
it: Numero della settimana dell'anno (con domenica come primo giorno della settimana) come numero decimale preceduto da zero. Tutti i giorni di un nuovo anno che precedono la prima domenica si considerano appartenenti alla settimana 0.
nl: Nummer van de week van het jaar (Zondag als de eerste dag van de week) als een decimaal getal waarvoor een nul wordt geplaatst. Alle dagen in een nieuw jaar voorafgaand aan de eerste zondag worden beschouwd te liggen in week 0.

source: Week number of the year (Monday as the first day of the week) as a decimal number. All days in a new year preceding the first Monday are considered to be in week 0.
de: Wochennummer des Jahres (Montag gilt als erster Tag der Woche) als Dezimalzahl. Alle Tage in einem neuen Jahr vor dem ersten Montag gelten als in Woche 0.
es: Número de semana del año (el lunes es el primer día de la semana) como número decimal. Todos los días de un año nuevo anteriores al primer lunes se consideran pertenecientes a la semana 0.
fr: Numero de semaine dans l'année sous forme de nombre à 2 chiffres (en considérant qu'une semaine démarre le lundi). Tous les jours d'une nouvelle année précédant le premier lundi sont considérés comme étant dans la semaine 0.
it: Numero della settimana dell'anno (con lunedì come primo giorno della settimana) come numero decimale. Tutti i giorni del nuovo anno che precedono il primo lunedì si considerano appartenenti alla settimana 0.
nl: Nummer van de week van het jaar (maandag als de eerste dag van de week) als een decimaal getal. Alle dagen in een nieuw jaar voorafgaand aan de eerste maandag worden beschouwd te liggen in week 0.

source: For the directives %a, %A, %b, %B and %p, we only support representations of their values in the locale *en_US*.
de: Für die Richtlinien %a, %A, %b, %B und %p, unterstützen wir nur die Darstellungen der Werte im Locale *en_US*.
es: En el caso de las directivas %a, %A, %b, %B y %p, solo se admiten las representaciones de los valores en la configuración regional *en_US*.
fr: Pour les directives %a, %A, %b, %B et %p, seules les représentations en anglais sont supportées (locale *en_US*).
it: Per le direttive %a, %A, %b, %B e %p, sono supportate solo le rappresentazioni dei valori locali *en_US*.
nl: Voor de richtlijnen %a, %A, %b, %B en %p ondersteunen we enkel weergaves van de waarden ervan in de lokale *en_US*.

source: Field containing the date
de: Feld, das das Datum enthält
es: Campo que contiene la fecha.
fr: Champ contenant la date
it: Campo contenente la data
nl: Veld dat de datum bevat

source: Date format
de: Datumsformat
es: Formato de fecha
fr: Format de date
it: Formato data
nl: Datumformaat

source: Set Timezone
de: Zeitzone einstellen
es: Establecer zona horaria
fr: Définir le fuseau horaire
it: Imposta fuso orario
nl: Stel tijdzone in

source: This processor can be used to force the timezone of a datetime field. This might be useful when, for instance, the source outputs timestamps with no timezone indication.
de: Dieser Prozessor kann verwendet werden, um die Zeitzone eines Datumsfeldes durchzusetzen. Dies könnte nützlich sein, wenn etwa die Quelle einen Zeitstempel ohne Zeitzonenangabe ausgibt.
es: Este procesador se puede utilizar para forzar la zona horaria de un campo de fecha y hora. Puede resultar de utilidad, por ejemplo, cuando el origen genera salida con marcas de tiempo sin indicación de zona horaria.
fr: Ce processeur peut être utilisé pour forcer la définition du fuseau horaire d'un champ datetime. Ce peut être utile par exemple lorsque la donnée source n'a aucune indication de fuseau horaire.
it: Questo processore permette di forzare il fuso orario di un campo data/ora. Può essere utile quando, ad esempio, l'origine crea come output delle marche temporali senza indicazione del fuso orario.
nl: Deze processor kan gebruikt worden om de tijdzone van een datumtijdveld te forceren. Dit kan nuttig zijn wanneer bijvoorbeeld de bron tijdstempels als resultaat geeft zonder indicatie van de tijdzone.

source: For example, if a dataset contains a date field with an absent or incorrect timezone, this processor can force the timezone to "UTC", or "Europe/Paris".
de: Wenn zum Beispiel ein Datensatz ein Datumsfeld mit fehlender oder falscher Zeitzone enthält, kann dieser Prozessor die Zeitzone "UTC" oder "Europa/Paris" durchsetzen.
es: Por ejemplo, si un conjunto de datos contiene un campo de fecha con una zona horaria ausente o incorrecta, este procesador puede forzar que la zona horaria sea "UTC" o "Europe/Paris".
fr: Par exemple, si un jeu de données contient un champ de date sans fuseau horaire ou avec un fuseau horaire incorrect, le processeur peut forcer le fuseau horaire sur "UTC", ou "Europe/Paris".
it: Ad esempio, se un dataset contiene un campo di data con fuso orario mancante o errato, questo processore può forzarlo su "UTC" o "Europa/Roma".
nl: Bijvoorbeeld, wanneer een dataset een datumveld bevat met een afwezige of onjuiste tijdzone, kan deze processor de tijdzone forceren naar "UTC" of "Europa/Parijs".

source: "2016-12-08T08:51:53Z" (timezone is incorrectly set to UTC) would become "2016-12-08T08:51:53+01:00" if you set "Europe/Paris" as a timezone, or "2016-12-08T08:51:53" (timezone is not set) would become "2016-12-08T08:51:53+00:00" if you set "UTC" as a timezone.
de: "2016-12-08T08:51:53Z" (Zeitzone ist fälschlicherweise auf UTC eingestellt) würde zu "2016-12-08T08:51:53+01:00" werden, wenn Sie die Zeitzone "Europe/Paris" einstellen, oder "2016-12-08T08:51:53" (Zeitzone ist nicht eingestellt) würde zu "2016-12-08T08:51:53+00:00" werden, wenn Sie die Zeitzone "UTC" einstellen.
es: "2016-12-08T08:51:53Z" (zona horaria establecida erróneamente en UTC) se transformaría en "2016-12-08T08:51:53+01:00" si se configurara la zona horaria "Europe/Paris", o "2016-12-08T08:51:53" (zona horaria sin establecer) se transformaría en "2016-12-08T08:51:53+00:00" si se configurara la zona horaria "UTC".
fr: "2016-12-08T08:51:53Z" (fuseau horaire défini de manière incorrecte sur UTC) devient "2016-12-08T08:51:53+01:00" si vous définissez le fuseau horaire sur "Europe/Paris", ou "2016-12-08T08:51:53" (le fuseau horaire n'est pas défini) devient "2016-12-08T08:51:53+00:00" si vous définissez le fuseau horaire sur "UTC".
it: "2016-12-08T08:51:53Z" (fuso orario impostato per errore su UTC) diventerebbe "2016-12-08T08:51:53+01:00" se si imposta "Europa/Roma" come fuso orario, o ancora "2016-12-08T08:51:53" (fuso orario non impostato) diventerebbe "2016-12-08T08:51:53+00:00" impostando "UTC" come fuso orario.
nl: "2016-12-08T08:51:53Z" (tijdzone is onjuist ingesteld op UTC) zou "2016-12-08T08:51:53+01:00" worden wanneer u "Europa/Parijs" instelt als een tijdzone, of "2016-12-08T08:51:53" (tijdzone is niet ingesteld) zou "2016-12-08T08:51:53+00:00" worden wanneer u "UTC" instelt als een tijdzone.

source: Timezone
de: Zeitzone
es: Zona horaria
fr: Fuseau horaire
it: Fuso orario
nl: Tijdzone

source: Geographical processors
de: Geografische Prozessoren
es: Procesadores geográficos
fr: Processeurs géographiques
it: Processori geografici
nl: Geografische processoren

source: Country Code to Geo Coordinates
de: Ländercode zu Geokoordinaten
es: Código de país a geocoordenadas
fr: Code Pays vers Coordonnées Géo
it: Dal codice paese alle coordinate geografiche
nl: Landcode naar geografische coördinaten

source: This processor uses a country ISO code to produce a geo coordinate.
de: Dieser Prozessor verwendet einen Länder-ISO-Code, um eine Geokoordinate zu erzeugen.
es: Este procesador utiliza un código de país ISO para producir una geocoordenada.
fr: Ce processeur utilise le code ISO d'un pays pour générer des coordonnées géographiques.
it: Questo processore utilizza il codice ISO del paese per ottenere le coordinate geografiche.
nl: Deze processor gebruikt de ISO-code van een land om een geografische coördinaat te genereren.

source: Country iso code
de: Länder-ISO-Code
es: Código de país ISO
fr: Code ISO du pays
it: Codice ISO Paese
nl: ISO-code van een land

source: The field containing the country ISO code
de: Das Feld mit dem Länder-ISO-Code
es: Campo que contiene el código de país ISO.
fr: Champ contenant le code ISO du pays
it: Campo contenente il codice ISO del paese.
nl: Het veld dat de ISO-code van het land bevat

source: Name of the field that will contain the WGS84 coordinate
de: Name des Feldes, das die WGS84-Koordinate enthält
es: Nombre del campo que contendrá la coordenada WGS84.
fr: Nom du champ qui contiendra les coordonnées WGS84
it: Nome del campo che conterrà la coordinata WGS84.
nl: Naam van het veld dat de WGS84-coördinaat zal bevatten

source: Coordinates system conversion
de: Koordinatensystemumwandlung
es: Conversión de sistema de coordenadas
fr: Conversion du système de coordonnées
it: Conversione del sistema delle coordinate
nl: Coördineert systeemconversie

source: This processor converts a degrees, minutes, seconds geo coordinate to a standard geo coordinate.
de: Dieser Prozessor wandelt eine Grad-, Minuten- und Sekunden-Geokoordinate in eine Standard-Geokoordinate um.
es: Este procesador convierte una geocoordenada de grados, minutos y segundos a una geocoordenada estándar.
fr: Ce processeur convertit des coordonnées géographiques en degrés, minutes, secondes vers des coordonnées géographiques standard.
it: Questo processore converte i gradi, i minuti e i secondi delle coordinate geografiche in una coordinata geografica standard.
nl: Deze processor zet een geografische coördinaat met graden, minuten, seconden om naar een standaard geografische coördinaat.

source: The following formats can be converted:
de: Folgende Formate können konvertiert werden:
es: Se pueden convertir los formatos siguientes:
fr: Les formats suivants peuvent être convertis :
it: È possibile convertire i seguenti formati:
nl: De volgende formaten kunnen worden geconverteerd:

source: 48° 51′ 24″ Nord2° 21′ 07″ Est
de: 48° 51′ 24″ Nord 2° 21′ 07″ Ost

source: 48° 51′ 24″N 2° 21′ 07″ E
de: 48° 51′ 24″N 2° 21′ 07″ O

source: N48° 51′ 24″ E2° 21′ 07″
de: N48° 51′ 24″ O2° 21′ 07″

source: The signs can be:
de: Die Zeichen können Folgendes sein:
es: Los signos pueden ser:
fr: Les signes peuvent être :
it: I segni possono essere:
nl: De tekens kunnen zijn:

source: Signs
de: Zeichen
es: Signos
fr: Signes
it: Segni
nl: Tekens

source: North/South
de: Nord/Süd
es: Norte/Sur
it: Nord/Sud

source: +, -, N, S, Nord, North, Sud, South
de: +, -, N, S, Nord, North, Süd, South

source: East/West
de: Ost/West
es: Este/Oeste
it: Est/Ovest

source: +, -, E, O, W, Est, East, Ouest, West
de: +, -, E, O, W, Ost, East, West, West

source: Coordinate separator
de: Symbol zur Trennung der Koordinatenwerte
es: Separador de coordenadas
fr: Séparateur de coordonnées
it: Separatore delle coordinate
nl: Scheidingsteken voor coördinaten

source: Degree mark
de: Gradmarke
es: Signo de grados
fr: Marqueur des degrés
it: Simbolo dei gradi
nl: Graadaanduiding

source: Minute mark
de: Minutenmarke
es: Signo de minutos
fr: Marqueur des minutes
it: Simbolo dei minuti
nl: Minuutaanduiding

source: Second mark
de: Sekundenmarke
es: Signo de segundos
fr: Marqueur des secondes
it: Simbolo dei secondi
nl: Secondeaanduiding

source: Coordinates
de: Koordinaten
es: Coordenadas
fr: Coordonnées
it: Coordinate
nl: Coördinaten

source: Field that contains the coordinates
de: Feld, das die Koordinaten enthält
es: Campo que contiene las coordenadas.
fr: Champ contenant les coordonnées
it: Campo contenente le coordinate.
nl: Veld dat de coördinaten bevat

source: Name of the field that will contain the WGS84 coordinates
de: Name des Feldes, das die WGS84-Koordinaten enthält
es: Nombre del campo que contendrá las coordenadas WGS84.
fr: Nom du champ qui contiendra les coordonnées WGS84
it: Nome del campo che conterrà le coordinate WGS84.
nl: Naam van het veld dat de WGS84-coördinaten zal bevatten

source: Compute Geo distance
de: Geo-Distanz berechnen
es: Calcular distancia geográfica
fr: Calculer la distance géographique
it: Calcolo della distanza geografica
nl: Bereken geografische afstand

source: This processor computes the distance between two coordinates.
de: Dieser Prozessor berechnet den Abstand zwischen zwei Koordinaten.
es: Este procesador calcula la distancia entre 2 coordenadas.
fr: Ce processeur calcule la distance entre deux coordonnées.
it: Questo processore calcola la distanza tra due coordinate.
nl: Deze processor berekent de afstand tussen twee coördinaten.

source: Coordinates A
de: Koordinaten A
es: Coordenadas A
fr: Coordonnée A
it: Coordinate A
nl: Coördinaten A

source: Coordinates B
de: Koordinaten B
es: Coordenadas B
fr: Coordonnée B
it: Coordinate B
nl: Coördinaten B

source: Field that will contain the computed distance
de: Feld, das den berechneten Abstand enthält
es: Campo que contendrá la distancia calculada.
fr: Champ qui contiendra la distance calculée
it: Campo che contiene la distanza calcolata.
nl: Veld dat de berekende afstand zal bevatten

source: Provides privacy protection by approximating a geographical location within a specific radius.
de: Bietet Datenschutz durch Annäherung an einen geografischen Standort innerhalb eines bestimmten Radius.
es: Aporta protección de privacidad por aproximación a una ubicación geográfica dentro de un radio específico.
fr: Ce processeur offre une protection de la vie privée en indiquant la position approximative d'un lieu géographique dans un rayon donné.
it: Questo processore tutela la privacy, indicando in modo approssimato una località geografica in un raggio specifico.
nl: Biedt privacybescherming door een geografische locatie binnen een specifieke radius bij benadering te bepalen.

source: Field containing the coordinates you want to approximate
de: Feld, das die Koordinaten enthält, denen Sie sich annähern wollen
es: Campo que contiene las coordenadas a las cuales desea aproximarse.
fr: Champ contenant les coordonnées à transformer en position approximative
it: Filtro contenente le coordinate da approssimare.
nl: Veld dat de coördinaten bevat die u bij benadering wil bepalen

source: Minimum distance (in meters)
de: Mindestabstand (in Metern)
es: Distancia mínima (en metros)
fr: Distance minimale (en mètres)
it: Distanza minima (in metri)
nl: Minimale afstand (in meter)

source: Double
de: Doppelt
es: Doble
it: Doppio
nl: Dubbel
