Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/realtime.po
Languages: de, es, fr, it, nl

source: A mimimal example of the api usage for a dataset with a single field named "message", using curl, would be
de: Nachfolgend ein Minimalbeispiel einer API-Verwendung für einen Datensatz mit einem einzigen Feld namens "Nachricht", das Curl verwendet:
es: Este sería un ejemplo mínimo del uso de la API para un conjunto de datos con un único campo denominado "message", utilizando curl:
fr: Voici un exemple simple d'utilisation de l'API avec la commande curl pour un jeu de données présentant un seul champ nommé "message"
it: Un esempio minimo dell'utilizzo dell'API per un dataset con un unico campo denominato "message", utilizzando curl, sarebbe:
nl: Een minimaal voorbeeld van het gebruik van de API voor een dataset met een enkel veld met de naam "bericht", waarbij een URL wordt gebruikt, zou zijn

source: A minimal example with the same dataset, using the array form to send multiple records at once would be
de: Nachfolgend ein Minimalbeispiel mit demselben Datensatz, den das Array-Formular zum gleichzeitigen Versenden mehrerer Einträge verwendet:
es: Este sería un ejemplo mínimo con el mismo conjunto de datos, utilizando el formulario de matriz para enviar varios registros a la vez:
fr: Voici un autre exemple avec le même jeu de données, qui utilise cette fois un tableau pour envoyer plusieurs enregistrements simultanément
it: Un esempio minimo dello stesso dataset, utilizzando il formato array per inviare più record contemporaneamente sarebbe:
nl: Een minimaal voorbeeld met dezelfde dataset, waarbij het array-formulier om meerdere records in één keer te versturen, wordt gebruikt, zou zijn

source: If the records have been received correctly, the server will respond the following message.
de: Wenn die Einträge korrekt empfangen wurden, antwortet der Server mit folgender Nachricht.
es: Si los registros se han recibido correctamente, el servidor mostrará el mensaje siguiente.
fr: Si les enregistrements ont été correctement reçus, le serveur répond alors avec le message suivant.
it: Se i record sono stati ricevuti correttamente, il server risponderà con il seguente messagio:
nl: Wanneer de records correct ontvangen werden, zal de server het volgende bericht sturen.

source: If an error happened while trying to push a record, the response will specify the error.
de: Falls bei dem Versuch, einen Eintrag zu pushen, ein Fehler auftritt, wird dieser Fehler in der Antwort angegeben.
es: Si se ha producido un error al intentar insertar un registro, la respuesta especificará el error.
fr: Si une erreur se produit lorsque vous essayez de pousser un enregistrement, la réponse indiquera l'erreur.
it: Se durante il pushing del record si è verificato un errore, la risposta specificherà di che cosa si tratta.
nl: Wanneer er een fout is opgetreden tijdens het proberen pushen van een record, zal in het antwoord de fout gespecificeerd worden.

source: Pushing a field of type file
de: Pushen eines Felds oder einer Typ-Datei
es: Insertar un campo de tipo archivo
fr: Pousser un champ de type de fichier
it: Pushing di un campo di tipo immagine
nl: Een veld van een type bestand pushen

source: In order to push a field of type image, a json object containing the base64-encoded content and the mimetype of the file needs to be sent, as such.
de: Um ein Feld vom Typ Bild zu pushen, muss ein JSON-Objekt mit dem Base64-kodierten Content und dem MIME-Typ der Datei gesendet werden.
es: Para insertar un campo de tipo imagen, es preciso enviar un objeto JSON con el contenido con codificación Base 64 y el tipo MIME del archivo, de este modo:
fr: Afin de pousser un champ de type image, un objet JSON contenant les données encodées en Base64 et le type de mime du fichier doit être envoyé, comme suit.
it: Per eseguire il pushing di un campo di tipo immagine, è necessario inviare un oggetto JSON che includa il contenuto codificato in base 64 e il mimetype del file.
nl: Om een veld van het type afbeelding te pushen, moet een JSON-voorwerp dat de base64-encoded content en het mimetype van het bestand als dusdanig worden opgestuurd.

source: Update data by defining a unique key
de: Aktualisieren von Daten durch Definieren eines eindeutigen Schlüssels
es: Actualizar los datos definiendo una clave exclusiva
fr: Mettre à jour les données en définissant une clé unique
it: Aggiornamento dei dati tramite definizione di una chiave univoca
nl: Data updaten door het definiëren van een unieke sleutel

source: Sometimes it is useful to update the existing records instead of just pushing new ones. An example for this would be a dataset that tracks the number of copies available for each books in a public library. Suppose that we have such a dataset with two fields: ``isbn``, representing the `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ number of the book, and ``number_of_copies`` tracking the current number of copies available in the library. It would not make a lot of sense to add one record for each new value of ``number_of_copies``, instead, it would be better to set the new ``number_of_copies`` value to the record corresponding to the book ``isbn``.
de: In manchen Fällen ist es sinnvoll, die bestehenden Einträge zu aktualisieren, anstatt immer wieder neue zu pushen. Ein Beispiel hierfür ist etwa ein Datensatz, der die Anzahl der verfügbaren Ausgaben für jedes Buch in einer städtischen Bibliothek verfolgt. Angenommen, wir haben einen solchen Datensatz mit zwei Feldern: `isbn``, steht für `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ die Nummer des Buchs, und ``Anzahl_Ausgaben``, das die Anzahl der momentan in der Bibliothek verfügbaren Ausgaben verfolgt.
es: En ocasiones, es útil actualizar los registros existentes en lugar de simplemente insertar otros nuevos. Un ejemplo de esto sería un conjunto de datos que hace el seguimiento del número de copias disponibles de cada uno de los libros de una biblioteca pública. Supongamos que tenemos este conjunto de datos con 2 campos: ``isbn``, que representa el número `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ del libro, y ``number_of_copies`` que hace el seguimiento del número actual de copias disponibles en la biblioteca. No tendría mucho sentido añadir un registro para cada uno de los valores nuevos de ``number_of_copies``; sería mucho mejor establecer el valor ``number_of_copies`` nuevo como el registro correspondiente al valor ``isbn`` del libro.
fr: Parfois, il peut être utile de mettre à jour les enregistrements existants plutôt que d'en pousser de nouveaux. Prenons par exemple le cas d'un jeu de données ayant pour fonction de surveiller le nombre d'exemplaires disponibles de chaque livre d'une bibliothèque publique. Supposons que ce jeu de données présente deux champs : ``isbn``, qui représente le numéro `ISBN <https://fr.wikipedia.org/wiki/International_Standard_Book_Number>`_ du livre, et ``number_of_copies``, qui suit le nombre d'exemplaires actuellement disponibles dans la bibliothèque. Cela n'aurait pas de sens d'ajouter un enregistrement pour chaque nouvelle valeur du champ ``number_of_copies``, il est en effet préférable de définir la nouvelle valeur ``number_of_copies`` sur l'enregistrement correspondant au numéro ``isbn`` du livre.
it: Talvolta, è utile aggiornare i record esistenti anziché eseguire il pushing di quelli nuovi. Ciò si verifica, ad esempio, con un dataset che registrail numero di copie disponibile per ogni libro di una biblioteca pubblica. Supponiamo che tale dataset includa due campi: ``isbn``, contenente il codice `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ del libro, e ``number_of_copies``, che registra il numero di copie disponibili in quel momento nella biblioteca. Aggiungere un record per ogni nuovo valore di ``number_of_copies`` non avrebbe senso, al contrario, è meglio impostare il nuovo valore ``number_of_copies`` nel record corrispondente al codice ``isbn`` del libro.
nl: Soms is het nuttig om de bestaande records te updaten in plaats van gewoon nieuwe te pushen. Een voorbeeld hiervan zou zijn: een dataset die het aantal kopieën opvolgt dat voor elk boek beschikbaar is in een openbare bibliotheek. Veronderstel dat we een dergelijke dataset hebben met twee velden: ``isbn``, dat het `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ nummer van het boek vertegenwoordigt, en ``number_of_copies`` dat het huidige aantal kopieën dat beschikbaar is in de bibliotheek opvolgt. Het zou niet echt zinvol zijn om één record voor elke nieuwe waarde van ``number_of_copies`` toe te voegen. In plaats daarvan zou het beter zijn om de nieuwe ``number_of_copies`` waarde in te stellen voor het record dat overeenstemt met de ``isbn`` van het boek.

source: In order to set up such a system with the OpenDataSoft platform, the fields that will be used as a unique key must be marked as so. In our example, the unique key would be isbn, because the rest of the data is linked to individual books, and these books are identified by the ISBN. This can be done in the processing view, in the menu that pops when the configuration button is pressed. It is possible to set multiple fields as unique keys. Then, after saving and publishing, if a new record whose key value is equal to an existing record is pushed, the new record will overwrite the old record. In our library case, if your dataset has ``isbn`` as the unique key, and contains these two records.
de: Zum Konfigurieren eines solchen Systems mit der OpenDataSoft-Plattform müssen die Felder, die als eindeutiger Schlüssel verwendet werden sollen, als solche gekennzeichnet sein. In unserem Beispiel wäre der eindeutige Schlüssel die ISBN, da die übrigen Daten mit einzelnen Büchern verbunden sind und diese Bücher durch die ISBN gekennzeichnet sind. Dies kann in der Bearbeitungsansicht in dem Menü geschehen, das aufgeht, wenn auf die Konfigurationsschaltfläche geklickt wird. Mehrere Felder können als eindeutige Schlüssel eingerichtet werden. Wenn dann nach dem Speichern und Veröffentlichen ein neuer Eintrag gepusht wird, dessen Schlüsselwert dem eines bestehenden Eintrags entspricht, überschreibt der neue den alten Eintrag.
es: Para configurar un sistema de este tipo con la plataforma OpenDataSoft, los campos que se usarán a modo de clave exclusiva deben marcarse como tal. En nuestro ejemplo, la clave exclusiva sería isbn, dado que los demás datos están vinculados con los libros individuales y estos se identifican por el ISBN. Esta tarea se puede realizar en la vista de procesamiento, en el menú que aparece al pulsar el botón de configuración. Se pueden establecer varios campos como claves exclusivas. A continuación, una vez guardado y publicado, si se inserta un registro nuevo cuyo valor clave es igual a un registro existente, el registro nuevo sobrescribirá el antiguo. En nuestro ejemplo de biblioteca, si el conjunto de datos tiene ``isbn`` como clave exclusiva y contiene estos 2 registros.
fr: Afin de configurer un système de ce type avec la plateforme OpenDataSoft, les champs qui seront utilisés en tant que clés uniques doivent être identifiés. Dans notre exemple, la clé unique serait le numéro ISBN, car le reste des données est lié à chaque livre et chaque livre est identifié par son numéro ISBN. L'identification peut être réalisée dans la vue de traitement, depuis le menu qui s'affiche en cliquant sur le bouton en forme d'engrenage. Il est possible de définir plusieurs champs en tant que clés uniques. Ensuite, après avoir enregistré les modifications et publié le jeu de données, si un nouvel enregistrement dont la valeur de clé est égale à celle d'un enregistrement existant est poussé, le nouvel enregistrement écrase l'ancien. C'est-à-dire si votre jeu de données utilise la valeur ``isbn`` en tant que clé unique et s'il contient deux de ces enregistrements dans le cas de notre bibliothèque.
it: Per configurare questo sistema nella piattaforma OpenDataSoft, i campi da utilizzare come chiave univoca devono essere impostati come tali. Nel nostro esempio, la chiave univoca è il codice isbn, poiché il resto dei dati è collegato ai singoli libri, e tali libri sono identificati dall'ISBN. Questa impostazione può essere eseguita nella visualizzazione Elaborazione, nel menu che viene visualizzato premendo il pulsante Configurazione. È possibile impostare più campi come chiavi univoche. Dopo il salvataggio e la pubblicazione, se so esegue il pushing di un nuovo record il cui valore chiave è uguale a quello di un record esistente, il nuovo record sovrascriverà quello precedente. Nel caso della nostra biblioteca, il dataset ha ``isbn`` come chiave univoca e contiene questi due record.
nl: Om een dergelijk systeem binnen het OpenDataSoft-platform op te zetten, moeten de velden die als unieke sleutel gebruikt zullen worden, als dusdanig gemarkeerd moeten worden. In ons voorbeeld zou de unieke sleutel isbn zijn, omdat de rest van de data gekoppeld is aan individuele boeken en deze boeken worden geïdentificeerd op basis van de ISBN. Dit kan gedaan worden in de verwerkingsweergave, in het menu dat tevoorschijn komt wanneer op de configuratieknop wordt geklikt. Het is mogelijk om meerdere velden in te stellen als unieke sleutels. Vervolgens, na het opslaan en publiceren, wanneer een nieuw record waarvan de sleutelwaarde gelijk is aan een bestaand record, wordt gepusht, zal het nieuwe record het oude record overschrijven. In het geval van onze bibliotheek, wanneer uw dataset ``isbn`` als unieke sleutel heeft, en deze twee records bevat.

source: If somebody borrows a copy of Zen and the Art of Motorcycle Maintenance, and you push the following record, you will still have two records, the first one being updated with the new value.
de: Wenn nun jemand eine Ausgabe von "Zen and the Art of Motorcycle Maintenance" ausleiht und Sie den folgenden Eintrag pushen, haben Sie immer noch zwei Einträge, wobei der erste mit dem neuen Wert aktualisiert wurde.
es: Si alguien toma en préstamo una copia de *Zen and the Art of Motorcycle Maintenance* y se inserta el registro siguiente, seguirá habiendo 2 registros, el primero actualizado con el valor nuevo.
fr: Si quelqu'un emprunte un exemplaire de Traité du zen et de l'entretien des motocyclettes, et si vous poussez l'enregistrement ci-dessous, vous disposez toujours de deux enregistrements, le premier étant mis à jour avec la nouvelle valeur.
it: Se qualcuno prende in prestito una copia de "Lo zen e l'arte della manutenzione della motocicletta" e si esegue il pushing del record seguente, continueranno ad essere presenti due record, il primo aggiornato con il nuovo valore.
nl: Wanneer iemand een kopie van Zen en the Art of Motorcyle Maintenance leent en u het volgende record pusht, zal u nog steeds twee records hebben, waarbij het eerste up-to-date wordt gebracht met de nieuwe waarde.

source: Delete data
de: Löschen von Daten
es: Suprimir datos
fr: Supprimer des données
it: Eliminazione dei dati
nl: Data verwijderen

source: There are two entrypoints that allow for deleting a pushed records. One that uses the records values and one that uses the record ID.
de: Zwei verschiedene Einstiegspunkte ermöglichen das Löschen gepushter Einträge. Der eine verwendet Eintragswerte und der andere die Eintrags-ID.
es: Hay 2 puntos de entrada que permiten suprimir los registros insertados: uno utiliza los valores de registro; y otro, el ID de registro.
fr: Il existe deux points d'entrée permettant de supprimer les enregistrements poussés. Le premier utilise les valeurs des enregistrements, tandis que le second utilise l'ID des enregistrements.
it: Vi sono due entrypoint che permettono di eliminare i record inviati in modalità push. Uno utilizza i valori dei record e l'altro l'ID del record.
nl: Er zijn twee entrypoints die het mogelijk maken om gepushte records te verwijderen. Eén dat de waarden van records gebruikt en één dat het record-ID gebruikt.

source: Using the record values
de: Verwenden der Eintragswerte
es: Usar los valores de registro
fr: Utiliser les valeurs des enregistrements
it: Utilizzo dei valori dei record
nl: De recordwaarden gebruiken

source: To delete a record knowing the record fields values, POST the record as if you were adding it for the first time, but replace ``/push/`` with ``/delete/`` in the push URL. If your push URL path is ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>``, then use instead ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>``. A minimal example to delete the record we pushed earlier follows.
de: Zum Löschen eines Eintrags bei bekannten Eintragsfeldwerten POSTEN Sie den Eintrag, als würden Sie ihn zum ersten Mal hinzufügen, ersetzen Sie dabei jedoch ``/push/`` durch ``/delete/`` in der Push-URL. Falls Ihr Push-URL-Pfad ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>`` lautet, verwenden Sie stattdessen ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>``. Es folgt ein Minimalbeispiel der Löschung eines Eintrags, den wir zuvor gepusht hatten.
es: Para suprimir un registro sabiendo los valores de los campos de registro, ejecute POST para el registro como si lo añadiera por primera vez, pero sustituya ``/push/`` por ``/delete/`` en la dirección URL de inserción. Si la ruta de dirección URL de inserción es ``/api/push/1.0/realtime-dataset/<CONJUNTO_DATOS>/push/?pushkey=<CLAVE_API_INSERCIÓN>``, utilice en su lugar ``/api/push/1.0/realtime-dataset/<CONJUNTO_DATOS>/push/delete/?pushkey=<CLAVE_API_INSERCIÓN>``. A continuación se muestra un ejemplo mínimo de supresión del registro insertado anteriormente.
fr: Pour supprimer un enregistrement dont vous connaissez les valeurs des champs, utilisez la méthode POST sur l'enregistrement comme si vous l'ajoutiez pour la première fois, mais remplacez ``/push/`` par ``/delete/`` dans l'URL Push. Si votre chemin d'URL Push est ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>``, utilisez alors ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>``. Vous trouverez ci-dessous un exemple rapide illustrant la suppression de l'enregistrement que nous avions précédemment poussé.
it: Per eliminare un record conoscendo i valori dei relativi campi, esegui il POST del record come se stessi aggiungendolo per la prima volta, ma sostituisci ``/push/`` conh ``/delete/`` nell'URL push. Se il percorso dell'URL push è ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>``, utilizza invece ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>``. Un esempio minimo di eliminazione del record di cui abbiamo eseguito il pushing in precedenza è il seguente:
nl: Om een record, waarvan u de waarden van de recordvelden kent, te verwijderen, POST het record alsof u dit voor de eerste keer zou toevoegen, maar vervang ``/push/`` door ``/delete/`` in de push URL. Wanneer uw push URL-pad ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>`` is, gebruik dan in plaats daarvan ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>``. Een minimaal voorbeeld om het record dat we eerder hebben gepusht, te verwijderen, volgt.

source: If you know the record ID of the record you want to delete, simply make a GET request to the URL you get by replacing ``/push/`` with ``/<RECORD_ID>/delete/`` in the push URL. A minimal example of this follows.
de: Wenn Sie die Eintrags-ID des Eintrags kennen, den Sie löschen möchten, führen Sie einfach eine GET-Anfrage an die URL aus, die Sie beim Ersetzen von ``/push/`` durch ``/<RECORD_ID>/delete/`` in der Push-URL erhalten. Es folgt ein Minimalbeispiel hierfür.
es: Si sabe el ID de registro del registro que desea suprimir, basta con efectuar una solicitud GET para la dirección URL que se obtiene sustituyendo ``/push/`` por ``/<ID_REGISTRO>/delete/`` en la dirección URL de inserción. A continuación se muestra un ejemplo mínimo de esta operación.
fr: Si vous connaissez l'ID de l'enregistrement que vous souhaitez supprimer, effectuez simplement une requête GET sur l'URL obtenue en remplaçant ``/push/`` par ``/<RECORD_ID>/delete/`` dans l'URL Push. Vous trouverez ci-dessous un exemple rapide.
it: Se conosci l'ID del record da eliminare, invia una richiesta GET all'URL ottenuto sostituendo ``/push/`` con ``/<RECORD_ID>/delete/`` nell'URL push. Un esempio minimo è il seguente:
nl: Wanneer u het record-ID van het record dat u wil verwijderen, kent, doe dan gewoon een GET-aanvraag aan de URL die u krijgt door ``/push/`` te vervangen door ``/<RECORD_ID>/delete/`` in de push URL. Een minimaal voorbeeld hiervan volgt.

source: Get notified in case of inactivity
de: Benachrichtigung bei Inaktivität
es: Recibir una notificación en caso de inactividad
fr: Être notifié en cas d'inactivité
it: Impostazione della notifica in caso di inattività
nl: Krijg een bericht in geval van inactiviteit

source: If you expect a system to push data to the platform often, you may want to be notified if no record has been received by the platform in a while. In order to get notified, you can enable the "Alerting" option in the source configuration, and setup a time threshold in minutes. If a time span greater than the threshold has occured during which no record has been received, you will receive an email.
de: Wenn ein System oft Daten zur Plattform pushen soll, möchten Sie eventuell benachrichtigt werden, wenn die Plattform innerhalb einer gewissen Zeit keinen Eintrag mehr empfängt. Um benachrichtigt zu werden, können Sie die "Warn"-Option in der Quell-Konfiguration aktivieren und einen Zeitschwellenwert in Minuten festlegen. Sobald die Zeitdauer, während der kein Eintrag empfangen wurde, den Schwellenwert überschreitet, erhalten Sie eine E-Mail.
es: Si prevé que un sistema inserte datos en la plataforma con frecuencia, tal vez desee recibir una notificación si la plataforma no recibe ningún registro durante un tiempo. Para recibir una notificación, puede activar la opción "Alertas" en la configuración de origen y configurar un umbral de tiempo en minutos. Si no recibe ningún registro durante un intervalo de tiempo superior al umbral, se le enviará un correo electrónico.
fr: Si vous vous attendez à ce que des données soient fréquemment poussées sur la plateforme, il peut être utile de recevoir une notification dans le cas où la plateforme n'aurait reçu aucun enregistrement depuis un certain temps. Afin d'obtenir des notifications, vous pouvez activer l'option "Alertes" dans la configuration de la source et définir un délai en minutes. Si aucun enregistrement n'a été reçu pendant une période supérieure au délai défini, vous recevrez un e-mail.
it: Se prevedi che il sistema esegua spesso il pushing dei dati dalla piattaforma, puoi impostare l'invio di una notifica nel caso in cui dalla piattaforma non venga ricevuto alcun dato per un determinato periodo di tempo. Per ricevere la notifica, puoi attivare l'opzione "Avvisi" nella configurazione dell'origine e impostare una soglia di tempo in minuti. Nel caso non venga ricevuto alcun record per un tempo maggiore di quello indicato, riceverai un'e-mail.
nl: Wanneer u verwacht dat een systeem vaak data naar het platform zal pushen, is het mogelijk dat u hiervan in kennis wordt gesteld wanneer er al een tijdje geen record werd ontvangen door het platform. Om in kennis gesteld te worden, kan u de optie "Waarschuwing" activeren in de bronconfiguratie en een tijddrempel instellen in minuten. Wanneer een periode verstreken is die langer is dan de drempel en waarin geen enkel record werd ontvangen, ontvangt u een e-mail.
