Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/realtime.po
Languages: de, es, fr, it, nl

source: Keeping data up to date
de: Daten auf dem neuesten Stand halten
es: Mantener los datos actualizados
fr: Maintenir les données à jour
it: Come mantenere aggiornati i tuoi dati
nl: Data up-to-date houden

source: The OpenDataSoft platform makes it possible, in the very same data catalog, to handle completely static datasets (which need to be published only once) and live datasets (which need to be regularly updated). Two different mechanisms are made available to handle datasets refresh.
de: Mit der OpenDataSoft-Plattform ist es möglich, im selben Datenkatalog ganze statische Datensätze (die nur einmal veröffentlicht werden müssen) sowie Live-Datensätze (die regelmäßig aktualisiert werden müssen) zu bearbeiten. Es stehen zwei verschiedene Mechanismen zur Bearbeitung von Datensatzaktualisierungen zur Verfügung.
es: La plataforma OpenDataSoft permite, dentro del mismo catálogo de datos, manejar conjuntos de datos totalmente estáticos (que necesitan publicarse una sola vez) y conjuntos de datos dinámicos (que precisan actualizaciones periódicas). Para llevar a cabo la renovación de los conjuntos se datos, dispone de 2 mecanismos diferentes.
fr: La plateforme OpenDataSoft permet, au sein d'un même catalogue de données, de gérer des jeux de données entièrement statiques (qui n'ont besoin d'être publiés qu'une seule fois) et des jeux de données en temps réel (qui doivent être régulièrement mis à jour). Vous disposez de deux mécanismes pour gérer l'actualisation des jeux de données.
it: La piattaforma OpenDataSoft permette di gestire, nello stesso catalogo di dati, dataset completamente statici (che devono essere pubblicati una sola volta) e dataset dinamici (che devono essere aggiornati periodicamente). Per l'aggiornamento dei dataset sono disponibili due diversi meccanismi.
nl: Het OpenDataSoft-platform maakt het mogelijk om, in precies dezelfde datacatalogus, statische datasets (die slechts één keer moeten worden gepubliceerd) en live datasets (die regelmatig up-to-date moeten worden gebracht), volledig te behandelen. Er worden twee verschillende mechanismen beschikbaar gesteld om het hernieuwen van datasets uit te voeren.

source: The first one is called **scheduling** and consists in having a dataset being automatically republished at fixed intervals. This mode is most useful for datasets with a remote resource which is regularly updated.
de: Der erste ist der **Zeitplan**. Er ermöglicht eine automatische Wiederveröffentlichung von Datensätzen in festgelegten Abständen. Dieser Modus ist sehr nützlich bei Datensätzen aus einer Remote-Quelle, die regelmäßig aktualisiert wird.
es: El primero, denominado **planificación**, consiste en volver a publicar automáticamente un conjunto de datos en intervalos fijos. Este modo resulta de especial utilidad para los conjuntos de datos con un recurso remoto de actualización periódica.
fr: Le premier est appelé **planification** et consiste à republier automatiquement un jeu de données à intervalles réguliers. Ce mode se révèle particulièrement utile pour les jeux de données dotés d'une ressource distante régulièrement mise à jour.
it: Il primo è chiamato **pianificazione** e consiste nel ripubblicare automaticamente un dataset a intervalli stabiliti. Questa modalità è molto utile per i dataset con una risorsa remota che viene aggiornata periodicamente.
nl: Het eerste wordt **planning** genoemd en bestaat erin dat een dataset met vaste tussenpozen automatisch opnieuw wordt gepubliceerd. Dit mechanisme is nuttig voor datasets met een bron op afstand die regelmatig up-to-date wordt gebracht.

source: The second one consists in pushing data on the OpenDataSoft platform using a dedicated API end point. This mode is most useful when the data can be sent directly by the system that produces the data points, such as a computer program sending event metrics or a set of sensors sending their readings.
de: Der zweite Mechanismus besteht darin, Daten mit einem speziellen API-Endpunkt auf die OpenDataSoft-Plattform zu pushen. Dieser Modus ist sehr nützlich, wenn die Daten direkt vom System gesendet werden können, das die Datenpunkte generiert, wie etwa ein Computerprogramm, das eine Ereignismetrik sendet bzw. ein Sensorensatz, der seine Daten sendet.
es: El segundo consiste en insertar datos en la plataforma OpenDataSoft mediante un extremo de API específico. Este método resulta de especial utilidad cuando los datos pueden ser enviados directamente por el sistema que produce los puntos de datos (como un programa informático que envía métricas de eventos o un conjunto de sensores que envían lecturas).
fr: Le second consiste à pousser les données sur la plateforme OpenDataSoft par l'intermédiaire du point d'entrée d'une API dédiée. Ce mode se révèle particulièrement utile lorsque les données peuvent être directement envoyées par le système produisant les points de données, par exemple un logiciel qui envoie des métriques d'événement ou un ensemble de sondes qui envoie ses mesures.
it: Il secondo consiste nell'invio dei dati in modalità push sulla piattaforma OpenDataSoft tramite un endpoint API dedicato. Questa modalità è molto utile quando è possibile inviare i dati direttamente dal sistema che genera i punti dati, ad esempio nel caso di un programma che invia le metriche degli eventi o una serie di sensore che invia le proprie letture.
nl: Het tweede mechanisme bestaat eruit dat data op het OpenDataSoft-platform wordt gepusht door gebruik te maken van een speciaal API-eindpunt. Dit mechanisme is het nuttigst wanneer de data rechtstreeks door het systeem worden gestuurd dat de datapunten produceert, zoals een computerprogramma dat cijfers van een evenement doorstuurt of een reeks sensoren die hun afleesresultaten doorsturen.

source: Using scheduling to keep a dataset up to date
de: Verwenden des Zeitplan-Modus, um einen Datensatz auf dem neuesten Stand zu halten
es: Utilizar la planificación para mantener actualizado un conjunto de datos
fr: Utiliser la planification pour maintenir un jeu de données à jour
it: Uso della programmazione per l'aggiornamento dei dati
nl: Planning gebruiken om een dataset up-to-date te houden

source: This solution is the easiest to implement, it does not require any development, only a remote source and some settings in the dataset configuration.
de: Diese Lösung ist am einfachsten zu implementieren. Sie erfordert keinerlei Entwicklung, sondern lediglich eine Remote-Quelle und ein paar Einstellungen in der Datensatzkonfiguration.
es: Esta solución es la más fácil de implementar; no requiere ningún desarrollo, únicamente un origen remoto y una serie de valores en la configuración del conjunto de datos.
fr: Cette solution est la plus facile à mettre en œuvre, elle ne nécessite aucun développement, seulement une source distante et quelques paramètres dans la configuration du jeu de données.
it: Si tratta della soluzione più semplice da adottare, poiché non richiede sviluppo, ma solo una fonte remota e la configurazione appropriata dei dataset.
nl: Deze oplossing is het gemakkelijkst om te implementeren. Ze vereist geen enkele ontwikkeling, enkel een bron op afstand en enkele instellingen in de datasetconfiguratie.

source: Specifying a resource
de: Festlegen einer Ressource
es: Especificar un recurso
fr: Spécifier une ressource
it: Come specificare una risorsa
nl: Een bron specificeren

source: To be able to schedule a dataset, its underlying resource must be a remote one, specified as a URL (http or ftp work well) and not an uploaded file. To add such a resource, simply paste a URL in the URL input.
de: Um einen Datensatz planen zu können, muss ihre hinterlegte Ressource remote und als URL angegeben sein (http oder ftp funktionieren gut), sie darf jedoch keine hochgeladene Datei sein. Zum Hinzufügen einer solchen Ressource einfach eine URL in die URL-Eingabe hineinkopieren .
es: A fin de poder planificar un conjunto de datos, su recurso subyacente debe ser un recurso remoto, especificado como una dirección URL (http o ftp funcionan bien), y no un archivo cargado. Para añadir un recurso de este tipo, simplemente pegue una dirección URL en la entrada de dirección URL.
fr: Afin de pouvoir utiliser la planification d'un jeu de données, la ressource dont il dépend doit être distante, spécifiée sous la forme d'une URL (les protocoles http et ftp sont utilisables) et non d'un fichier téléchargé. Pour ajouter une ressource distante, collez simplement une URL dans le champ URL.
it: Per eseguire la pianificazione di un dataset, la risorsa sottostante deve essere remota, specificata con un URL (http o ftp) e non un file caricato. Per aggiungere questa risorsa, è sufficiente incollare l'URL nella relativa casella.
nl: Om een dataset te kunnen plannen, moet de onderliggende bron ervan een op afstand zijn, gespecificeerd als een URL (http of ftp werken goed) en geen geüpload bestand. Om een dergelijke bron toe te voegen, dient u de URL enkel te plakken in de URL input.

source: Specifying scheduling interval
de: Festlegen des Zeitplanintervalls
es: Especificar el intervalo de planificación
fr: Spécifier un intervalle de planification
it: Impostazione dell'intervallo di pianificazione
nl: Planningsinterval specificeren

source: Once a dataset is saved with a remote resource, the scheduling tab is activated. The minimum interval is the minute, but it is not activated by default. Please contact OpenDataSoft's support if you need minute level scheduling on your domain. You can add as many schedule as you want. For instance, if it fits your needs, you could decide to schedule a dataset to be reprocessed every Monday morning and every Wednesday afternoon.
de: Sobald ein Datensatz mit einer Remote-Ressource gespeichert wurde, wird der Zeitplan-Tab aktiviert. Das kleinste Intervall ist die Minute, es ist jedoch nicht standardmäßig aktiviert. Bitte kontaktieren Sie den OpenDataSoft-Support, falls Sie eine Zeitplanung auf Minutenebene für Ihre Domain benötigen. Sie können beliebig viele Zeitpläne hinzufügen. Sie können etwa bei Bedarf einen Datensatz so planen, dass er jeden Montagmorgen und jeden Mittwochnachmittag verarbeitet wird.
es: Una vez que un conjunto de datos se guarda con un recurso remoto, se activa la ficha Planificación. El intervalo mínimo es el minuto, pero no se activa de forma predeterminada. Póngase en contacto con el equipo de soporte de OpenDataSoft si necesita una planificación a nivel de minutos en el dominio. Puede añadir tantas planificaciones como desee. Por ejemplo, según sus necesidades, puede decidir planificar que se vuelva a procesar un conjunto de datos todos los lunes por la mañana y miércoles por la tarde.
fr: Une fois qu'un jeu de données est enregistré et qu'il dispose d'une ressource distante, l'onglet planification est activé. L'intervalle minimum est d'une minute, mais il n'est pas activé par défaut. Veuillez contacter l'assistance OpenDataSoft si vous avez besoin d'une planification à des intervalles précis à la minute sur votre domaine. Vous pouvez ajouter autant de planifications que vous le souhaitez. Par exemple, si nécessaire, vous pouvez décider de planifier le retraitement d'un jeu de données chaque lundi matin et chaque mercredi après-midi.
it: Dopo aver salvato il dataset come risorsa remota, si attiva la scheda Pianificazione. L'intervallo minimo è il minuto, tuttavia esso non viene attivato in modo predefinito. Se desideri utilizzare la pianificazione a livello dei minuti sul tuo dominio, ti preghiamo di contattare l'assistenza OpenDataSoft. È possibile aggiungere tutte le pianificazioni desiderate. Ad esempio, puoi decidere di pianificare la rielaborazione di un dataset ogni lunedì mattina e ogni mercoledì pomeriggio.
nl: Eenmaal de dataset is opgeslagen met een bron op afstand, wordt het planningstabblad geactiveerd. De minimale interval is een minuut, maar deze wordt niet standaard geactiveerd. Gelieve contact op te nemen met het Support Team van OpenDataSoft wanneer u een planningsniveau van één minuut op uw domein nodig hebt. Wanneer dit beantwoordt aan uw noden, zou u kunnen beslissen om een dataset zodanig te plannen dat deze elke maandagmorgen en elke woensdagnamiddag opnieuw wordt verwerkt.

source: Pushing real time data
de: Pushen von Echtzeitdaten
es: Insertar datos en tiempo real
fr: Pousser des données en temps réel
it: Invio dei dati in modalità push in tempo reale
nl: Real time data pushen

source: For some types of data, it can be useful to push data instead of the more traditional model of having the data being pulled from a resource by the platform. To address this need, the OpenDataSoft platform offers a realtime push API. It is not to be confused with the ability to schedule a dataset processing. When scheduling, the dataset will periodically pull the resource and process the data that is inside of it, whereas with the push API, the dataset is fed by an application through a push API and records are processed one by one as soon as they are received.
de: Bei manchen Datentypen kann es sinnvoll sein, die Daten zu pushen, anstatt nach dem eher traditionellen Modell vorzugehen (bei dem die Daten von der Plattform aus einer Ressource gepullt werden). Um diese Anforderung zu erfüllen, bietet die OpenDataSoft-Plattform eine Echtzeit-Push-API. Dies ist jedoch nicht mit der Fähigkeit zur Zeitplanung einer Datensatzverarbeitung zu verwechseln. Bei der Zeitplanung pullt der Datensatz die Ressource in bestimmten Zeitabständen und verarbeitet die Daten, die diese enthält; durch die Push-API hingegen wird der Datensatz von einer Anwendung eingespeist und die Einträge werden nacheinander bei ihrem Empfang verarbeitet.
es: En el caso de algunos tipos de datos, puede ser útil insertar los datos en lugar de seguir el método tradicional por el cual la plataforma extrae los datos de un recurso. Para atender esta necesidad, la plataforma OpenDataSoft ofrece una API de inserción en tiempo real. No debe confundirse con la posibilidad de planificar el procesamiento de un conjunto de datos. Con la planificación, el conjunto de datos periódicamente extrae el recurso y procesa los datos de su interior; en cambio, con la API de inserción, una aplicación alimenta el conjunto de datos a través de la API de inserción y los registros se procesan uno a uno a medida que se reciben.
fr: Pour certains types de données, il peut être utile de pousser les données au lieu de les extraire, comme c'est le cas traditionnellement, depuis une ressource via la plateforme. Pour répondre à ce besoin, la plateforme OpenDataSoft propose une API Push (pousser) en temps réel. Elle ne doit pas être confondue avec la capacité à planifier le traitement d'un jeu de données. Avec la planification, le jeu de données extrait périodiquement la ressource et traite les données qu'elle contient, tandis qu'avec l'API Push, le jeu de données est alimenté par une application via une API Push, et les enregistrements sont traités un par un dès leur réception.
it: Per alcuni tipi di dati, può essere utile inviare i dati in modalità push anziché estrarli normalmente da una risorsa della piattaforma. Per rispondere a questa esigenza, la piattaforma OpenDataSoft offre un'API push in tempo reale, che non deve essere confusa con la possibilità di pianificare l'elaborazione del dataset. Quando si esegue la pianificazione, il dataset recupera periodicamente la risorsa ed elabora i dati che essa contiene, mentre con l'API push il dataset è inviato da un'applicazione mediante l'API stessa e i record vengono elaborati appena sono ricevuti.
nl: Voor sommige types data kan het nuttig zijn om data te pushen in plaats van het meer traditionele model te gebruiken waarbij de data door het platform wordt weggehaald uit een bron. Om aan deze behoefte te beantwoorden, biedt het OpenDataSoft-platform een real time push-API. Deze mag niet verward worden met de mogelijkheid om de verwerking van een dataset te plannen. Wanneer gepland wordt, zal de dataset op periodieke basis de bron weghalen en de data die erin staan verwerken, terwijl met de push-API de dataset gevoed wordt door een applicatie via een push-API en records één voor één worden verwerkt zodra ze worden ontvangen.

source: As this feature is still in beta, it is not activated by default. Please contact OpenDataSoft's support to try it out.
de: Diese Funktion läuft gegenwärtig in der Beta-Version und steht nicht standardmäßig zur Verfügung. Bitte kontaktieren Sie den OpenDataSoft-Support, wenn Sie sie ausprobieren möchten.
es: Al ser una función todavía en fase beta, no está activada de forma predeterminada. Póngase en contacto con el equipo de soporte de OpenDataSoft para probarla.
fr: Cette fonctionnalité étant actuellement en version bêta, elle n'est pas activée par défaut. Veuillez contacter l'assistance OpenDataSoft si vous souhaitez l'essayer.
it: Poiché si tratta di una funzionalità ancora in fase beta, non è attivata in modo predefinito. Se desideri utilizzarla, ti preghiamo di contattare l'assistenza OpenDataSoft.
nl: Aangezien deze functie zich nog steeds in een bètaversie bevindt, is deze niet standaard geactiveerd. Gelieve contact op te nemen met het Support Team van OpenDataSoft wanneer u deze wil uitproberen.

source: Configuring the dataset schema
de: Konfigurieren des Datensatz-Schemas
es: Configurar el esquema de conjunto de datos
fr: Configurer le schéma du jeu de données
it: Configurazione dello schema del dataset
nl: Het datasetschema configureren

source: To create a realtime dataset, start by navigating to the dataset creation interface. Here, select "add a realtime source".
de: Zur Erstellung eines Echtzeit-Datensatzes navigieren Sie zunächst zu der Datensatz-Erstellungsschnittstelle. Wählen Sie hier "Echtzeit-Quelle hinzufügen" aus.
es: Para empezar a crear un conjunto de datos en tiempo real, desplácese a la interfaz de creación del conjunto de datos y seleccione "Añadir un origen en tiempo real".
fr: Pour créer un jeu de données en temps réel, accédez tout d'abord à l'interface de création de jeux de données. De là, sélectionnez "Ajouter une source en temps réel".
it: Per creare un dataset in tempo reale, apri prima di tutto l'interfaccia di creazione del dataset e seleziona "Aggiungi un'origine in tempo reale".
nl: Om een real time dataset aan te maken, ga naar de aanmaakinterface van de dataset. Selecteer hier "voeg een real time bron toe".

source: You will be prompted to enter some bootstrap data and to optionnally fill in additional options. The bootstrap data should have all the fields that will be sent through the API. Please note that the bootstrap data is not used in the dataset: its sole purpose is to allow setting up the dataset.
de: Sie werden zur Eingabe einiger Bootstrapdaten sowie zum optionalen Ausfüllen zusätzlicher Optionen aufgefordert. Die Bootstrapdaten müssen alle Felder enthalten, die durch die API gesendet werden. Bitte beachten Sie, dass die Bootstrapdaten nicht im Datensatz verwendet werden: Ihr einziger Zweck besteht darin, den Datensatz einzurichten.
es: Se le pedirá que especifique los datos de arranque y, si lo desea, algunas opciones adicionales. Los datos de arranque deben tener todos los campos que se enviarán a través de la API. Tenga presente que los datos de arranque no se utilizan en el conjunto de datos: su única finalidad es hacer posible la configuración del conjunto de datos.
fr: Il vous sera demandé de saisir les données d'amorçage et, éventuellement, de renseigner des options supplémentaires. Les données d'amorçage doivent contenir tous les champs qui seront envoyés via l'API. Veuillez noter que les données d'amorçage ne sont pas utilisées dans le jeu de données : elles ont pour seule fonction de permettre la configuration du jeu de données.
it: Il sistema richiede di immettere alcuni dati bootstrap e, se desiderato, di completare le opzioni aggiuntive. I dati bootstrap devono includere tutti i campi che saranno inviati mediante l'API. I dati bootstrap non vengono utilizzati nel dataset ma servono solo per la sua configurazione.
nl: Er zal u worden gevraagd om enkele bootstrap-gegevens in te voeren en om optioneel extra opties in te vullen. De bootstrap-gegevens zouden alle velden moeten hebben die via de API worden gestuurd. Gelieve te noteren dat de bootstrap-gegevens niet gebruikt worden in de dataset: ze hebben enkel als doel het mogelijk te maken de dataset op te zetten.

source: Using the push url
de: Verwenden der Push-URL
es: Utilizar la dirección URL de inserción
fr: Utiliser l'URL Push
it: Utilizzo dell'URL push
nl: De push-URL gebruiken

source: Once your dataset is saved with the correct realtime resource settings, a URL path containing a push api key will appear. This path, appended to your domain base URL is where the platform will expect data to be sent after publication. As is the case with the bootstrap data, the data is expected to be sent in the JSON format, either as a single JSON object for a single record, or an array of JSON objects to push multiple records at once.
de: Sobald Ihr Datensatz mit den korrekten Echtzeit-Ressourceneinstellungen gespeichert ist, erscheint ein URL-Pfad mit einem Push-API-Schlüssel. Dieser Pfad ist Ihrer Domain-Basis-URL angehängt. Die Plattform muss die Daten nach ihrer Veröffentlichung an diesen Pfad senden. Wie bei den Bootstrapdaten müssen die Daten im JSON-Format gesendet werden, entweder als einzelnes JSON-Objekt für einen einzelnen Eintrag, oder als Array aus JSON-Objekten, um mehrere Einträge auf einmal zu pushen.
es: Una vez que el conjunto de datos se guarda con la configuración de recurso en tiempo real correspondiente, aparecerá una ruta de dirección URL con una clave de API de inserción. Esta ruta, anexada a la dirección URL base del dominio, es donde la plataforma espera que se envíen los datos tras la publicación. Al igual que con los datos de arranque, los datos deben enviarse en formato JSON, o bien como un único objeto JSON para un único registro o bien como una matriz de objetos JSON para insertar varios registros a la vez.
fr: Une fois votre jeu de données enregistré avec les paramètres de ressource en temps réel corrects, un chemin d'URL contenant la clé d'API s'affiche. Ce chemin, qui vient s'ajouter à l'URL de base de votre domaine, indique l'adresse à laquelle la plateforme attendra les données après leur publication. Tout comme pour les données d'amorçage, les données doivent être envoyées au format JSON, soit sous la forme d'un objet JSON pour un enregistrement simple, soit sous la forme d'un tableau JSON pour pousser plusieurs enregistrements simultanément.
it: Una volta che il dataset viene salvato con le corrette impostazioni della risorsa in tempo reale, verrà visualizzato un percorso URL contenente una chiave dell'API push. Questo percorso, aggiunto all'URL di base del tuo dominio, è il punto a cui la piattaforma si aspetta che vengano inviati i dati dopo la pubblicazione. Come per i dati bootstrap, anche questi dati dovranno essere inviati in formato JSON, come oggetto JSON singolo per un record singolo o come un array di oggetti JSON per il pushing di più record contemporaneamente.
nl: Eenmaal uw dataset is opgeslagen met de juiste real time broninstellingen, verschijnt er een URL-pad dat een push API-sleutel bevat. Dit pad, dat aan de basis-URL van uw domein wordt gekoppeld, is waar verwacht wordt dat het platform data naar toe zal sturen na publicatie. Net zoals bij bootstrap-gegevens, wordt verwacht dat de data verstuurd wordt in JSON-formaat, ofwel als een enkel JSON-voorwerp voor een enkel record of een array van JSON-voorwerpen om meerdere records in één keer te pushen.
