Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/realtime.po
Languages: de, es, fr, it, nl

source: Unpublishing and disabling the api
de: Aufheben der Veröffentlichung und Deaktivierung der API
es: Cancelar la publicación y desactivar la API
fr: Dépublier et désactiver l'API
it: Annullamento della pubblicazione e disabilitazione dell'API
nl: De publicatie van de API ongedaan maken en deze deactiveren

source: Beware of unpublishing your dataset, as this will not keep existing records for the next time the dataset is published. If you desire to avoid getting new data, you should instead click the "disable push" button in the resource setting. This will prevent the usage of the push API but will have no effect on existing data. If data is pushed while push is disabled on the resource, no data will be added and an error will be sent.
de: Vorsicht beim Aufheben der Veröffentlichung Ihres Datensatzes. Dabei werden bestehende Einträge nicht für die nächste Veröffentlichung des Datensatzes gespeichert. Wenn Sie es vermeiden möchten, neue Daten zu erhalten, sollten Sie stattdessen auf die Schaltfläche "Push deaktivieren" in den Ressourceneinstellungen klicken. So verhindern Sie die Verwendung der Push-API. Dies hat jedoch keinerlei Auswirkung auf die bestehenden Daten. Wenn Daten gepusht werden, während der Push in der Ressource deaktiviert ist, können keine Daten hinzugefügt werden, und Sie erhalten eine Fehlermeldung.
es: Tenga cuidado al cancelar la publicación del conjunto de datos, ya que no se conservarán los registros existentes para la próxima vez que se publique el conjunto de datos. Por contra, si desea evitar obtener datos nuevos, haga clic en el botón "Desactivar inserción" en la configuración del recurso. De este modo se evitará el uso de la API de inserción, aunque no afectará a los datos actuales. Si se insertan datos mientras la inserción está desactivada en el recurso, no se añadirán datos y se enviará un error.
fr: Attention : en cas de dépublication de votre jeu de données, les enregistrements existants ne seront pas conservés pour la prochaine publication du jeu de données. Si vous souhaitez éviter de recevoir de nouvelles données, utilisez plutôt le bouton "Désactiver le Push" dans les paramètres de la ressource. Cela empêchera l'utilisation de l'API Push, mais n'aura aucun effet sur les données existantes. Si des données sont poussées alors que le Push est désactivé sur la ressource, aucune donnée ne sera ajoutée et une erreur sera signalée.
it: Occorre prestare attenzione ad annullare la pubblicazione dei dataseti, poiché ciò non impedirà che i record esistenti vengano inclusi la volta successiva che il dataset viene pubblicato. Per evitare di ottenere nuovi dati, clicca invece sul pulsante "Disattiva notifiche push" nelle impostazioni della risorsa. In tal modo avrai disattivato l'utilizzo dell'API push senza però influire sui dati esistenti. Se vi sono dati in pushing mentre l'API viene disabilitata sulla risorsa, verrà generato un errore e non sarà aggiunto alcun dato.
nl: Opgelet wanneer u de publicatie van uw dataset ongedaan maakt, aangezien hierdoor bestaande records niet worden bijgehouden voor de volgende keer dat de dataset wordt gepubliceerd. Wanneer u wil vermijden dat u nieuwe data krijgt, dient u in plaats daarvan te klikken op "push deactiveren" in de broninstelling. Hiermee wordt voorkomen dat de push API wordt gebruikt, maar dit zal geen impact hebben op bestaande data. Wanneer data worden gepusht terwijl push gedeactiveerd is op de bron, zullen geen data worden toegevoegd en zal er een fout worden gestuurd.

source: Recovery
de: Wiederherstellung
es: Recuperación
fr: Récupération
it: Recupera
nl: Recuperatie

source: In the event of data loss, for instance when the dataset has been unpublished or when a processor has been misconfigured, there is a possibility of recovering the lost records. To do so, the recovery option must have been activated prior to the records being pushed to the platform.
de: Bei Datenverlust, etwa wenn die Veröffentlichung des Datensatzes aufgehoben oder ein Prozessor falsch konfiguriert wurde, besteht die Möglichkeit, die verlorenen Einträge wiederherzustellen. Dafür muss die Wiederherstellungsoption vor dem Pushen der Einträge auf die Plattform aktiviert worden sein.
es: En caso de pérdida de datos, por ejemplo si se ha cancelado la publicación del conjunto de datos o se ha configurado erróneamente un procesador, existe la posibilidad de recuperar los registros perdidos. Para ello, debe haberse activado la opción de recuperación antes de insertar los registros en la plataforma.
fr: En cas de perte de données, par exemple lorsque le jeu de données a été dépublié ou lorsqu'un processeur a été configuré de manière incorrecte, il est possible de récupérer les enregistrements perdus. Pour cela, l'option de récupération doit avoir été activée avant que les enregistrements n'aient été poussés vers la plateforme.
it: In caso di perdita di dati, ad esempio quando la pubblicazione del dataset è stata disattivata o quando un processore è stato configurato in modo errato, è possibile recuperare i record perduti. A tal fine, è necessario aver attivato l'opzione Recupera prima che fosse eseguito il pushing dei record alla piattaforma.
nl: In geval van verlies van data, bijvoorbeeld wanneer de publicatie van de dataset ongedaan werd gemaakt of wanneer een processor verkeerd werd geconfigureerd, is er een mogelijkheid om de verloren gegane records te recupereren. Hiervoor moet de recuperatie-optie geactiveerd zijn vóór de records naar het platform werden gepusht.

source: When the recovery is activated every subsequent record received will be backed up, and will be elligible for recovery. In order to recover eligible records, the "recover data" button on the source configuration page can be used.
de: Wenn die Wiederherstellung aktiviert ist, wird jeder darauf folgende Eintrag gesichert und lässt sich wiederherstellen. Um Backup-fähige Einträge wiederherzustellen, kann die Schaltfläche "Daten wiederherstellen" auf der Quell-Konfigurationsseite verwendet werden.
es: Una vez activada la recuperación, se realizará una copia de seguridad de todos los registros posteriores que se reciban, de modo que serán válidos para recuperarse. Para recuperar los registros válidos, se puede emplear el botón "Recuperar datos" de la página Configuración de origen.
fr: Lorsque la récupération est activée, tous les enregistrements reçus par la suite seront sauvegardés et seront éligibles à la récupération. Pour récupérer les enregistrements éligibles, utilisez le bouton "Récupérer des données" sur la page de configuration de la source.
it: A partire dall'attivazione del recupero, per ogni record ricevuto verrà eseguito il backup e sarà possibile recuperarlo. Per recuperare i record per i quali tale operazione è possibile, utilizza il pulsante "Recupera i dati" nella pagina di configurazione dell'origine.
nl: Wanneer de recuperatie is geactiveerd zal van elk daarop volgend record dat ontvangen wordt een back-up worden gemaakt en deze zal in aanmerking komen om te worden gerecupereerd. Om records te recupereren die in aanmerking komen, kan de knop "recupereer data" op de configuratiepagina van de bron gebruikt worden.
