Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/sourcing_data.po
Languages: fr

source: Sourcing data
fr: Collecte de données

source: There are 3 different methods to add data to a dataset:
fr: Trois méthodes sont proposées pour ajouter des données à un jeu de données :

source: by uploading a static, local file into the platform
fr: en téléchargeant un fichier local et statique sur la plateforme ;

source: by connecting the platform to a remote service (e.g. an API, a geographical information system, an FTP, etc.): it enables the platform to retrieve what that the remote service contains while staying synchronized with it
fr: en connectant la plateforme à un service distant (par ex. une API, un système d'information géographique, un FTP, etc.) : cela permet à la plateforme de récupérer ce que le service distant contient tout en restant synchronisé avec ;

source: by pasting data and uploading it into the platform
fr: en collant les données et en les téléchargeant sur la plateforme.

source: Supported file formats
fr: Types de fichiers supportés

source: Before sourcing data and particularly files into the platform, you might want to check the formats supported by the OpenDataSoft platform (see :doc:`Supported formats</sourcing_and_processing_data/supported_formats>`).
fr: Avant de collecter des données, et en particulier, des fichiers pour la plateforme, vous souhaitez peut-être vérifier les formats pris en charge par la plateforme OpenDataSoft (voir :doc:`Formats pris en charge</sourcing_and_processing_data/supported_formats>`).

source: Uploading a file
fr: Téléchargement d'un fichier

source: This method consists in directly uploading a file into the platform, in order to attach a static file to a new dataset.
fr: Cette méthode consiste à télécharger directement un fichier sur la plateforme, afin d'associer un fichier statique à un nouveau jeu de données.

source: In Catalog > Datasets, click on the **New dataset** button.
fr: Dans Catalogue > Jeu de données, cliquez sur le bouton **Nouveau jeu de données**.

source: Click on the **Add a source** button.
fr: Cliquez sur le bouton **Ajouter une source**.

source: Click on the **Upload a file** button.
fr: Cliquez sur le bouton **Ajouter un fichier**.

source: Choose the file to upload into the platform.
fr: Choisissez le fichier à télécharger sur la plateforme.

source: Click on the **Open** button of the file selection window.
fr: Dans la fenêtre de sélection de fichiers, cliquez sur le bouton **Ouvrir**.

source: File size limit
fr: Limite de la taille de fichier

source: The size limit for a file is 240Mo. If your file is too big you can compress it before uploading it in the platform (see :ref:`Supported compressed file formats<supportedcompressedformats>`).
fr: La limite de taille d'un fichier est de 240 Mo. Si vos fichiers sont trop volumineux, vous pouvez les compresser avant de les télécharger sur la plateforme (voir :ref:`Formats de fichiers compressés pris en charge<supportedcompressedformats>`).

source: It is possible to simply drag and drop the file after steps 1 and 2, instead of following the whole file selection procedure.
fr: Après les étapes 1 et 2, vous pouvez simplement glisser et déposer le fichier, plutôt que de suivre l'intégralité de la procédure de sélection de fichiers.

source: Sourcing remote data via a URL
fr: Collecte de données distantes via une URL

source: This method consists in connecting the platform to:
fr: Cette méthode consiste à connecter la plateforme à :

source: either a remote server via its URL, to import files stored on this remote server
fr: un serveur distant via son URL pour importer les fichiers stockés sur ce serveur distant ;

source: or, a remote data source exposing data records over an API
fr: ou à une source de données distante qui expose ses données sur une API.

source: Scheduling updates and pushing real-time data
fr: Planification de mises à jour et envoi de données en temps réel

source: These connections with the platform allow the automation of data update, by scheduling or pushing real-time data (see :doc:`Keeping data up to date</sourcing_and_processing_data/scheduling_updates>`).
fr: Ces connexions à la plateforme permettent l'automatisation de la mise à jour des données en planifiant et en envoyant des données en temps réel (consultez :doc:`Maintenir les données à jour</sourcing_and_processing_data/scheduling_updates>`).

source: Connecting to a remote server
fr: Connexion à un serveur distant

source: In the **Enter a URL** box, write the URL of the remote server where the files are stored.
fr: Dans le champ **Saisir une URL**, saisissez l'URL du serveur distant sur lequel les fichiers sont stockés.

source: OpenDataSoft supports the following protocols:
fr: OpenDataSoft prend en charge les protocoles suivants :

source: http and https, which link to a single file (e.g. http://example.org/mydata.csv)
fr: http et https, qui permettent d'accéder à un fichier simple (par ex. http://example.org/mydata.csv) ;

source: ftp and ftps, which link to a single file (e.g. ftp://example.org/my_dir/mydata.csv) or to a directory (e.g. ftp://example.org/my_dir/). Using a directory is often the prefered solution to automate incremental updates between a customer's information system and the platform. All the files in the directory need to have the same format and schema (e.g. CSV files with the same column titles). In case of automation, whenever the dataset is published, new and updated files are fetched from the remote location and processed and thanks to OpenDataSoft's native deduplication strategy, similar records are not processed twice (see :doc:`Special fields documentation</sourcing_and_processing_data/defining_a_dataset_schema>`).
fr: ftp et ftps, qui permettent d'accéder à un fichier simple (par ex. ftp://example.org/my_dir/mydata.csv) ou à un répertoire (par ex. ftp://example.org/my_dir/). L'utilisation d'un répertoire est souvent la solution privilégiée quand il s'agit d'automatiser les mises à jour incrémentielles entre le système d'information d'un client et la plateforme. Tous les fichiers contenus dans le répertoire doivent être au même format et avoir le même schéma (par ex. des fichiers CSV dont les titres de colonne sont identiques). En cas d'automatisation, lors de la publication du jeu de données, les nouveaux fichiers et les fichiers mis à jour sont récupérés depuis l'emplacement distant et sont traités. Grâce à la stratégie de dédoublonnement native d'OpenDataSoft, les enregistrements identiques ne sont pas traités deux fois (consultez la :doc:`documentation relative aux champs spéciaux</sourcing_and_processing_data/defining_a_dataset_schema>`).

source: Deleted files in FTP server
fr: Fichiers supprimés sur le serveur FTP

source: When synchronizing from a remote FTP location, OpenDataSoft keeps a persistent cache and does not automatically prune files missing from the remote directory. Please contact OpenDataSoft's support if you need some cleanup to be performed.
fr: Lors de la synchronisation depuis un emplacement FTP distant, OpenDataSoft conserve un cache persistant et ne nettoie pas automatiquement les fichiers absents du répertoire distant. Veuillez contacter l'assistance OpenDataSoft pour tout besoin de nettoyage.

source: SFTP protocol
fr: Protocole SFTP

source: We do not support the sftp protocol, which is completely different from the ftps protocol.
fr: Nous ne prenons pas en charge le protocole sftp, qui est complètement différent du protocole ftps.

source: Connecting to an API
fr: Connexion à une API

source: In the **Enter a URL** box, write the URL of the API.
fr: Dans le champ **Saisir une URL**, saisissez l'URL du serveur de l'API.

source: OpenDataSoft natively supports the following APIs:
fr: OpenDataSoft prend en charge nativement les API suivantes :

source: Connectors activation
fr: Activation des connecteurs

source: Contact your local support team to get these connectors activated on your domain.
fr: Contactez l'équipe de support pour activer ces connecteurs sur votre domaine.

source: OpenDataSoft can also develop and integrate customer specific Web APIs. OpenDataSoft connectivity toolkit makes it possible to develop performant and secured connectors supporting incremental data processing.
fr: OpenDataSoft peut également développer et intégrer des APIs web spécifiques. Notre toolkit dédié permet de développer des connecteurs performants et sécurisés supportant le traitement incremental des fichiers.

source: Available options when configuring a connector
fr: Options disponibles lors de la configuration d'un connecteur

source: Pasting data
fr: Collage des données

source: This method consists in pasting data in a CSV format. This method is most useful for quick tests.
fr: Cette méthode consiste à coller des données au format CSV. Elle est privilégiée pour effectuer des tests rapides.

source: In the **Paste data** area, write or paste data in a CSV format.
fr: Dans la section **Coller les données**, saisissez ou collez des données au format CSV.

source: Click on the **Send data** button.
fr: Cliquez sur le bouton **Envoyer les données**.
