Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_sharing_and_reusing_data/using_api.po
Languages: de, es, fr

source: Using the API
de: Verwenden der API
es: Utilizar la API
fr: Utiliser l'API

source: An API (Application Programming Interface) is an interface for programs to communicate and exchange data.
de: Eine API (Application Programming Interface bzw. Programmierschnittstelle) ist eine Schnittstelle für Programme zur Kommunikation und zum Datenaustausch.
es: Una API (interfaz de programación de aplicaciones) es una interfaz destinada a la comunicación y el intercambio de datos de los programas.
fr: Une API (Application Programming Interface, interface de programmation applicative) est une interface permettant aux programmes de communiquer et d'échanger des données.

source: Note
de: Hinweis
es: Nota
fr: Remarque

source: To know more about what APIs are and why and how they are used, you can read the article "`You don’t need analogies to understand APIs <https://kitchen.opendatasoft.com/you-dont-need-analogies-to-understand-apis-14da4513f970>`_" written by one of our OpenDataSoft developers.
de: Um mehr darüber zu erfahren, was APIs sind und warum und wie sie verwendet werden, können Sie den folgenden Artikel lesen, der von einem unserer OpenDataSoft-Entwickler geschrieben wurde: <https://kitchen.opendatasoft.com/you-dont-need-analogies-to-understand-apis-14da4513f970>`_"
es: Para ampliar información sobre qué son las API y cómo se utilizan, puede leer el artículo "`No necesita analogías para entender las API <https://kitchen.opendatasoft.com/you-dont-need-analogies-to-understand-apis-14da4513f970>`_" escrito por uno de nuestros desarrolladores de OpenDataSoft.
fr: Pour en apprendre davantage sur les API et leur utilisation, vous pouvez consulter l'article "`You don’t need analogies to understand APIs (Pas besoin d'analogies pour comprendre les API - article en anglais) <https://kitchen.opendatasoft.com/you-dont-need-analogies-to-understand-apis-14da4513f970>`_" écrit par l'un de nos développeurs OpenDataSoft.

source: OpenDataSoft provides access to 6 APIs, that can be put into 3 categories:
de: OpenDataSoft bietet Zugriff auf 6 APIs, die in 3 Kategorien eingeteilt werden können:
es: OpenDataSoft da acceso a 6 interfaces API, que pueden dividirse en 3 categorías:
fr: OpenDataSoft met à votre disposition 6 API pouvant être classées en 3 catégories :

source: `ODS Search API v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ and `ODS Search API v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_: OpenDataSoft's own APIs, used internally by the platform and the `ODS widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_
de: `ODS Search API v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ und `ODS Search API v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_: Die eigenen APIs von OpenDataSoft, die intern von der Plattform verwendet werden sowie `ODS-Widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_
es: `API de búsqueda de ODS V1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ y `API de búsqueda de ODS V2 <https://docs.opendatasoft.com/api/explore/v2.html>`_: API propias de OpenDataSoft, usadas internamente por la plataforma y `ODS widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_
fr: `API ODS Search v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ et `API ODS Search v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_ : les propres API d'OpenDataSoft, utilisées en interne par la plateforme et les `widgets ODS <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_

source: `Triple Pattern Fragments API <https://docs.opendatasoft.com/api/explore/tpf.html>`_: ODS API for triple pattern querying over datasets from OpenDataSoft portals
de: `Triple Pattern Fragments API <https://docs.opendatasoft.com/api/explore/tpf.html>`_: ODS API für Triple-Pattern-Abfrage der Datensätze auf den OpenDataSoft-Portalen
es: `API de Triple Pattern Fragments <https://docs.opendatasoft.com/api/explore/tpf.html>`_: API de ODS para la consulta de patrón triple en los conjuntos de datos de los portales OpenDataSoft
fr: `API Triple Pattern Fragments <https://docs.opendatasoft.com/api/explore/tpf.html>`_: API ODS pour interroger les jeux de données des portails OpenDataSoft à l'aide de Triple Pattern Fragments

source: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_, `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ and `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_, 3 standard protocols supported and provided by OpenDataSoft
de: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_, `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ und `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_, 3 Standardprotokolle, die von OpenDataSoft unterstützt und bereitgestellt werden
es: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_, `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ y `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_: 3 protocolos estándar soportados y proporcionados por OpenDataSoft
fr: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_, `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ et `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_, 3 protocoles standard pris en charge et proposés par OpenDataSoft

source: All these APIs provide access to any data pushed to the platform, no matter their source or format, as long as the security rules defined by the data owner allow that access.
de: All diese APIs bieten Zugriff auf alle Daten, die auf die Plattform übertragen werden, unabhängig von ihrer Quelle oder ihrem Format. Einzige Voraussetzung ist, dass die vom Dateneigner definierten Sicherheitsregeln diesen Zugriff erlauben.
es: Todas estas API ofrecen acceso a los datos insertados en la plataforma, independientemente de su origen o formato, siempre que las reglas de seguridad definidas por el propietario de los datos permitan ese acceso.
fr: Toutes ces API permettent d'accéder aux données envoyées à la plateforme, quels que soient leur source ou leur format, dans la mesure où les règles de sécurité définies par le propriétaire des données autorisent cet accès.

source: These APIs can be used, for example, to search for datasets and data, to compute analysis or to perform geographic aggregations. Still developer-oriented, but for more concrete examples of what can be done with APIs: applications as data reuses. Some of OpenDataSoft customers have indeed seen their datasets being reused through their API, to create applications (i.e. `Qui dit miam ! <http://quiditmiam.fr/>`_ and `Y'A D Frites! <https://www.opendatasoft.fr/2016/10/17/y-a-d-frites-application-avec-de-lopen-data-dedans/>`_ 2 applications that display the school canteen menu of French cities, Toulouse, Rennes and Saint-Malo).
de: Diese APIs können beispielsweise dazu verwendet werden, um nach Datensätzen und Daten zu suchen, Analysen zu berechnen oder geografische Aggregationen durchzuführen. Ebenfalls entwicklerorientiert, jedoch konkretere Beispiele für den Einsatz von APIs sind Anwendungen als Daten-Weiterverwendungen. So wurden die Datensätze einiger OpenDataSoft-Kunden über ihre API wiederverwendet, um neue Anwendungen zu entwickeln (z. B.: `Qui dit miam ! <http://quiditmiam.fr/>`_ und `Y'A D Frites! <https://www.opendatasoft.fr/2016/10/17/y-a-d-frites-application-avec-de-lopen-data-dedans/>`_ 2 Anwendungen, die die Menüs der Schulkantinen der französischen Städte Toulouse, Rennes und Saint-Malo anzeigen.)
es: Estas API se pueden usar, por ejemplo, para buscar conjuntos de datos y datos, calcular análisis o realizar agregaciones geográficas. Pese a estar orientadas a los desarrolladores, le invitamos a ver ejemplos más concretos de lo que se puede hacer con las API: aplicaciones como reutilizaciones de datos. En efecto, algunos de los clientes de OpenDataSoft han visto cómo se reutilizaban sus conjuntos de datos a través de su API para crear aplicaciones (`Qui dit miam ! <http://quiditmiam.fr/>`_ y `Y'A D Frites! <https://www.opendatasoft.fr/2016/10/17/y-a-d-frites-application-avec-de-lopen-data-dedans/>`_ son 2 aplicaciones que visualizan el menú de cafeterías escolares de las ciudades francesas de Toulouse, Rennes y Saint-Malo).
fr: Ces API peuvent par exemple être utilisées pour rechercher des jeux de données et des données, effectuer des analyses ou encore des agrégations géographiques. Autre exemple, toujours orienté développeurs, mais plus concret, de ce que vous pouvez faire avec les API : réutiliser des données pour créer des applications. Les données de certains clients d'OpenDataSoft ont en effet été réutilisées via leurs API pour créer des applications (par exemple, `Qui dit miam ! <http://quiditmiam.fr/>`_ et `Y'A D Frites! <https://www.opendatasoft.fr/2016/10/17/y-a-d-frites-application-avec-de-lopen-data-dedans/>`_ 2 applications qui affichent le menu des cantines scolaires dans les villes françaises de Toulouse, Rennes et Saint-Malo).

source: Important
de: Wichtig
es: Importante

source: Before using any of the available APIs, it is very important to be familiar with the nature of this data. Everything within the platform is built according to a tree structure (there are of course more types of data within the platform, but they are only relevant in very specific contexts). OpenDataSoft can thus be seen as such:
de: Vor der Verwendung einer der verfügbaren APIs ist es sehr wichtig, mit der Art dieser Daten vertraut zu sein. Alles auf der Plattform ist nach einer Baumstruktur aufgebaut (es gibt natürlich mehre Datentypen auf der Plattform, aber sie sind nur in sehr spezifischen Kontexten relevant). OpenDataSoft kann also folgendermaßen verstanden werden:
es: Antes de usar alguna de las API disponibles, es muy importante estar familiarizado con la naturaleza de sus datos. Todo el contenido de la plataforma está construido con una estructura de árbol (obviamente, hay más tipos de datos en la plataforma, pero solo son relevantes en contextos muy específicos). En consecuencia, OpenDataSoft se puede ver en estos términos:
fr: Avant d'utiliser l'une des API disponibles, il est primordial que vous connaissiez la nature de ces données. Tous les éléments au sein de la plateforme sont conçus par rapport à une arborescence (bien entendu, davantage de types de données résident dans la plateforme, mais elles sont uniquement pertinentes dans des contextes très spécifiques). OpenDataSoft peut donc être représenté comme suit :

source: The OpenDataSoft platform is a network of OpenDataSoft portals.
de: Die OpenDataSoft-Plattform ist ein Netzwerk aus mehreren OpenDataSoft-Portalen.
es: La plataforma OpenDataSoft es una red de portales OpenDataSoft.
fr: La plateforme OpenDataSoft est un réseau de portails OpenDataSoft.

source: A portal provides a catalog of all of its datasets.
de: Ein Portal stellt einen Katalog aller seiner Datensätze bereit.
es: Un portal proporciona un catálogo de todos sus conjuntos de datos.
fr: Un portail fournit un catalogue de tous ses jeux de données.

source: Each dataset is defined by a dictionary of metadata, a data schema (specifying fields names and types) and a collection of records.
de: Jeder Datensatz wird durch ein Metadaten-Wörterbuch, ein Datenschema (das Feldnamen und -typen angibt) und eine Sammlung an Einträgen definiert.
es: Cada uno de los conjuntos de datos está definido por un diccionario de metadatos, un esquema de datos (que especifica los nombres y tipos de campos) y una colección de registros.
fr: Chaque jeu de données est défini par un dictionnaire de métadonnées, un schéma de données (qui spécifie les noms et les types de champs) et une collection d'enregistrements.

source: Each record provides values for each of the dataset's fields.
de: Jeder Eintrag bietet Werte für jedes einzelne Datensatzfeld.
es: Cada uno de los registros suministra valores para cada uno de los campos del conjunto de datos.
fr: Chaque enregistrement fournit des valeurs pour chacun des champs du jeu de données.

source: ODS Search
es: Búsqueda de ODS

source: This ODS Search API is used internally by the OpenDataSoft platform and widgets. To develop an application, we recommand using this API.
de: Die ODS Search API wird intern von der OpenDataSoft-Plattform und den Widgets genutzt. Wir empfehlen diese API zur Entwicklung einer Anwendung.
es: Esta API de búsqueda de ODS es usada internamente por la plataforma OpenDataSoft y los widgets. Para desarrollar una aplicación, recomendamos usar esta API.
fr: L'API ODS Search est utilisée en interne par la plateforme et les widgets OpenDataSoft. Si vous souhaitez développer une application, nous vous recommandons d'utiliser cette API.

source: There are currently 2 versions of the ODS Search API: the `v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ and the `v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_ which is still under development. Listed below, the main differences between the 2 versions.
de: Derzeit gibt es 2 Versionen der ODS Search API: `v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ und `v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_ die sich noch in der Entwicklung befindet. Nachfolgend sind die wichtigsten Unterschiede zwischen beiden Versionen aufgeführt.
es: En la actualidad existen 2 versiones de la API de búsqueda de ODS: `V1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ y `V2 <https://docs.opendatasoft.com/api/explore/v2.html>`_, en fase de desarrollo. A continuación figuran las principales diferencias entre ambas versiones.
fr: Actuellement, deux versions de l'API ODS Search sont disponibles : l'API `v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ et l'API `v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_ qui est en cours de développement. Vous trouverez ci-dessous les principales différences entre les 2 versions.

source: The ODS Search API v2 introduces a better implementation of REST principles. Each API entry-point provides links to easily navigate between linked resources (HATEOAS).
de: Die ODS Search API v2 bietet eine bessere Implementierung für REST-Prinzipien. Jeder API-Einstiegspunkt bietet Links zum einfachen Navigieren zwischen verlinkten Ressourcen (HATEOAS).
es: La API de búsqueda de ODS V2 introduce una mejor implementación de los principios REST. Cada uno de los puntos de entrada de la API suministra vínculos para navegar fácilmente entre los recursos vinculados (HATEOAS).
fr: L'API ODS Search v2 améliore l'implémentation des principes REST. Chaque point d'entrée de l'API présente des liens permettant de naviguer facilement entre les différentes ressources liées (HATEOAS).

source: Key changes in the v2:
de: Wichtige Änderungen in v2:
es: Cambios clave en V2:
fr: Principales modifications dans l'API v2 :

source: a more complete query language (ODSQL) is available, with new functions and arithmetic expressions
de: eine umfassendere Abfragesprache (ODSQL) mit neuen Funktionen und arithmetischen Ausdrücken
es: Está disponible un lenguaje de consulta más completo (ODSQL), con nuevas funciones y expresiones aritméticas.
fr: un langage de requêtes plus complet (ODSQL) comportant de nouvelles fonctions et expressions arithmétiques est disponible,

source: special filters (such as geofilter and facet filters) are now directly integrated to ODSQL, in the ``where`` parameter (i.e ``geofilter.distance='42,1,100'`` is replaced by ``where=distance(geo_field,geom'Point(42 1)',100)``)
de: spezielle Filter (Geofilter oder Facet-Filter) sind direkt in der ODSQL integriert, und zwar im "Where"-Parameter (so wird z. B. "geofilter.distance='42,1,100'" ersetzt durch "where=distance(geo_field,geom'Point(42 1)',100)")
es: Los filtros especiales (como los filtros geográficos y de facetas) ahora están integrados directamente en ODSQL, en el nuevo parámetro ``where`` (es decir, ``geofilter.distance='42,1,100'`` se ha sustituido por ``where=distance(geo_field,geom'Point(42 1)',100)``).
fr: des filtres spéciaux (comme des filtres de facettes ou des filtres géographiques) sont désormais intégrés directement au langage de requêtes ODSQL, dans le paramètre ``where`` (par exemple, ``geofilter.distance='42,1,100'`` est remplacé par where=distance(geo_field,geom'Point(42 1)',100)``),

source: the aggregation API (former analyze API) now shares the same structure and ODSQL language as the Search API, and is available on both the catalog (to aggregate datasets) and the dataset (to aggregate records) APIs
de: die Aggregations-API (früher Analyse-API) hat die gleiche Struktur und ODSQL-Sprache wie die Search API und ist im Katalog (zur Aggregation von Datensätzen) und den Datensatz-APIs (zur Aggregation von Einträgen) verfügbar.
es: La API de agregación (antes, API de análisis) ahora comparte la estructura y el lenguaje ODSQL de la API de búsqueda, y está disponible en las API de catálogos (para agregar conjuntos de datos) y conjuntos de datos (para agregar registros).
fr: l'API d'agrégation (anciennement API d'analyse) partage maintenant la même structure et le même langage de requêtes ODSQL que l'API Search et est disponible pour les API de catalogue (pour agréger des jeux de données) et de jeu de données (pour agréger les enregistrements),

source: exporters have their own entry-point under ``/api/catalog/exports`` and ``/api/catalog/datasets/<dataset_id>/exports``
de: Die Exporter haben ihren eigenen Einstiegspunkt unter `/api/catalog/exports`` und ``/api/catalog/datasets/<dataset_id>/exports``
es: Los exportadores tienen su propio punto de entrada bajo ``/api/catalog/exports`` y ``/api/catalog/datasets/<dataset_id>/exports``.
fr: les exportateurs disposent de leur propre point d'entrée sous ``/api/catalog/exports`` et ``/api/catalog/datasets/<dataset_id>/exports``,

source: navigation search (former facet search) and standard search are completely splitted
de: Die Navigationssuche (früher Facet-Suche) und die Standardsuche sind vollständig getrennt
es: La búsqueda de navegación (antes, búsqueda de facetas) y la búsqueda estándar se han separado totalmente.
fr: la recherche dans la navigation (anciennement la recherche de facettes) et la recherche standard sont complètement séparées.

source: The `Triple Pattern Fragments (TPF) API <https://docs.opendatasoft.com/api/explore/tpf.html>`_ enables dataset querying in Resource Description Framework (RDF) format. This work is still in progress and is part of a PhD that aims to improve OpenDataSoft datasets quality using semantic web technologies.
de: Die `Triple Pattern Fragments (TPF) API <https://docs.opendatasoft.com/api/explore/tpf.html>`_ ermöglicht die Abfrage von Datensätzen im Resource Description Framework (RDF) Format. Die Arbeit an diesem Projekt läuft noch und ist Teil einer Dissertation, die das Ziel verfolgt, die Qualität der Datensätze von OpenDataSoft unter Einsatz von semantischen Web-Technologien zu verbessern.
es: La `API de Triple Pattern Fragments (TPF) <https://docs.opendatasoft.com/api/explore/tpf.html>`_ hace posible la consulta de conjuntos de datos en formato RDF (Resource Description Framework). Este trabajo sigue en curso y forma parte de un proyecto de PhD que pretende mejorar la calidad de los conjuntos de datos de OpenDataSoft mediante tecnologías de semántica web.
fr: `L'API Triple Pattern Fragments (TPF) <https://docs.opendatasoft.com/api/explore/tpf.html>`_ permet d'interroger les jeux de données au format Resource Description Framework (RDF). Cette API est toujours en cours de développement et s'inscrit dans une thèse visant à améliorer la qualité des jeux de données OpenDataSoft à l'aide des technologies du web sémantique.

source: OData, WFS and CSW
de: OData, WFS und CSW
es: OData, WFS y CSW
fr: OData, WFS et CSW

source: OData, WFS and CSW refer to other standards implemented by the platform. We recommand to users who are not familiar with these 3 APIs to stick to the ODS Search API since it provides the most comprehensive access to the data.
de: OData, WFS und CSW beziehen sich auf weitere Standards, die von der Plattform implementiert werden. Nutzer, die nicht mit diesen Standards nicht vertraut sind, sollten bei der ODS Search API bleiben, da sie den umfassendsten Zugang zu den Daten bietet.
es: Las siglas OData, WFS y CSW hacen referencia a otros estándares que implementa la plataforma. Recomendamos a los usuarios que no estén familiarizados con estas 3 API que se ciñan a la API de búsqueda de ODS ya que proporciona el acceso más amplio a los datos.
fr: OData, WFS et CSW désignent les autres normes mises en œuvre par la plateforme. Nous recommandons aux utilisateurs qui ne connaissent pas ces 3 API d'utiliser l'API ODS Search, car elle offre l'accès aux données le plus complet.

source: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_: standard for REST APIs that provides a common language to be used across APIs to perform requests. The trade-off for this norm's generic approach is its higher complexity compared to traditional custom REST APIs. OpenDataSoft has implemented this norm for the simple operations (searching for datasets and records) ; for the more complex ones (analysis, aggregations, geographic computations etc.) our ODS Search APIs (v1 and v2) must be used.
de: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_: Standard für REST-APIs, die eine gemeinsame, API-übergreifende Sprache zur Durchführung von Anfragen bieten. Der generische Ansatz dieser Norm hat zugleich eine höhere Komplexität im Vergleich zu herkömmlichen REST-APIs. OpenDataSoft hat diese Norm für einfache Vorgänge (Suche nach Datensätzen und Einträgen) implementiert; für komplexere Vorgänge (wie Analysen, Aggregationen, geografische Berechnungen,...) müssen unsere ODS Search APIs (v1 und v2) verwendet werden.
es: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_: Estándar de interfaces API REST que proporciona un lenguaje común para realizar solicitudes en las API. El inconveniente del paradigma genérico de esta norma es su mayor complejidad en comparación con las API REST personalizadas tradicionales. OpenDataSoft ha implementado esta norma para las operaciones simples (buscar conjuntos de datos y registros), pero para las más complejas (como análisis, agregaciones, cálculos geográficos, etc.) deben utilizarse nuestras API de búsqueda de ODS (V1 y V2).
fr: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_: norme pour les API REST qui offre un langage commun pouvant être utilisé avec les différentes API, afin d'effectuer des demandes. L'approche générique de cette norme présente l'inconvénient d'être plus complexe que les API REST personnalisées classiques. OpenDataSoft a mis en œuvre cette norme pour les opérations simples (la recherche de jeux de données et d'enregistrements) ; pour les opérations plus complexes (l'analyse, les agrégations, les calculs géographiques, etc.), nos API ODS Search (v1 et v2) doivent être utilisées.
