Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_sharing_and_reusing_data/using_api.po
Languages: de, es, fr

source: `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ and `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_: standards focusing on geographic data. They are especially relevant for example to interface the platform with other GIS software.
de: `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ und `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_: Standards, die sich auf geografische Daten konzentrieren. Sie sind daher besonders wichtig, falls Sie die Plattform mit weiterer GIS-Software koppeln möchten.
es: `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ y `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_: Estándares que se centran en los datos geográficos. Por ejemplo, son especialmente relevantes para que la plataforma interactúe con otro software GIS.
fr: `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ et `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_: normes portant sur les données géographiques. Elles sont particulièrement utiles pour créer une interface entre la plateforme et d'autres logiciels GIS par exemple.
