Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/configuring_blocks/add-kpi.po
Languages: de, es, fr, nl

source: Choose how to compute the ratio using the parameters from the **KPI content** section:
de: Wählen Sie aus, wie das Verhältnis berechnet werden soll. Verwenden Sie dazu die Parameter aus dem Abschnitt **KPI-Inhalt**:
es: Elija cómo calcular la ratio utilizando los parámetros de la sección **Contenido de KPI**:
fr: Choisissez comment calculer le ratio à l'aide des paramètres de la section **Contenu du KPI** :
nl: Kies hoe de ratio moet worden berekend door gebruik te maken van de parameters uit de rubriek **KPI-content**:

source: From the **Ratio direction** drop-down list, select either **Set 1 on Set 2** or **Set 2 on Set 1**.
de: Wählen Sie in der Dropdown-Liste **Verhältnisrichtung** entweder **Satz 1 zu Satz 2** oder **Satz 2 zu Satz 1**.
es: En la lista desplegable **Dirección de ratio**, seleccione **Conjunto 1 en Conjunto 2** o **Conjunto 2 en Conjunto 1**.
fr: Dans la liste déroulante **Sens du ratio**, sélectionnez **Jeu 1 sur jeu 2** ou **Jeu 2 sur jeu 1**.
nl: Selecteer uit de drop-downlijst **Ratiorichting** ofwel **Set 1 op Set 2** of **Set 2 op Set 1**.

source: Step 5: Configure the visualization styles
de: 5. Schritt: Konfiguration der Visualisierungsstile
es: Paso 5: Configurar los estilos de visualización
fr: Étape 5 : configurer les styles de visualisation
nl: Stap 5: Configureer de weergavestijlen

source: The Studio includes several predefined layouts for KPIs to display the appropriate data. These layouts help you control how the KPI appears on the page to make it easier to understand.
de: Das Studio enthält mehrere vordefinierte Layouts für KPIs, um die entsprechenden Daten anzuzeigen. Mit diesen Layouts können Sie bestimmen, wie die KPI auf der Seite angezeigt wird, damit es leichter zu verstehen ist.
es: Studio incluye varios diseños predefinidos de los KPI para visualizar los datos correspondientes. Estos diseños ayudan a controlar cómo se muestra el KPI en la página de modo que sea más fácil de entender.
fr: Le studio inclut plusieurs dispositions prédéfinies pour que les KPI affichent les données appropriées. Ces dispositions vous aident à contrôler l'affichage du KPI sur la page, afin qu'il soit plus facile à comprendre.
nl: De Studio omvat verschillende vooraf gedefinieerde lay-outs voor KPI's om de juiste data weer te geven. Deze lay-outs helpen u te controleren hoe de KPI op de pagina verschijnt om ervoor te zorgen dat deze gemakkelijker wordt begrepen.

source: Some KPI colors are inherited from portal theme colors configured in the back office:
de: Einige KPI-Farben werden von den Farben des im Back-Office konfigurierten Portal-Themas übernommen:
es: Algunos colores de KPI se heredan de los colores de los temas del portal configurados en el back office:
fr: Certaines couleurs de KPI sont héritées de couleurs de thème du portail configurées dans l'interface d'administration :
nl: Sommige KPI-kleuren zijn geërfd uit themakleuren voor portalen die geconfigureerd zijn in de back office:

source: KPI element
es: Elemento KPI
fr: Élément de KPI

source: Portal theme element
de: Portal-Thema-Element
es: Elemento de tema del portal
fr: Élément de thème du portail
nl: Thema-element van het portaal

source: KPI title
de: KPI-Titel
es: Titulo de KPI
fr: Titre de KPI
nl: KPI-titel

source: Titles
de: Titel
es: Títulos
fr: Titres
nl: Titels

source: KPI context
de: KPI-Kontext
es: Contexto de KPI
fr: Contexte de KPI

source: Text
es: Texto
fr: Texte
nl: Tekst

source: Block borders
de: Blockränder
es: Bordes de bloques
fr: Bordures de bloc
nl: Blokranden

source: Boxes border
de: Boxenränder
es: Borde de cuadros
fr: Bordure des boîtes
nl: Randen van vakjes

source: For more information about configuring portal theme colors, see :ref:`colors`.
de: Weitere Informationen zur Konfiguration der Farben des Portal-Themas finden Sie unter :ref:`colors`.
es: Para obtener más información sobre cómo configurar los colores de los temas del portal, consulte :ref:`colors`.
fr: Pour plus d'informations sur la configuration des couleurs de thème du portail, consultez :ref:`colors`.
nl: Voor meer informatie over het configureren van themakleuren voor portalen, zie :ref:`colors`.

source: The block background is white and cannot be configured.
de: Der Hintergrund des Blocks ist weiß und kann nicht konfiguriert werden.
es: El fondo del bloque es blanco y no se puede configurar.
fr: L'arrière-plan du bloc est de couleur blanche et ne peut pas être configuré.
nl: De achtergrond van het blok is wit en kan niet worden geconfigureerd.

source: To configure the visualization styles:
de: Zur Konfiguration der Visualisierungsstile:
es: Para configurar los estilos de visualización:
fr: Pour configurer les styles de visualisation :
nl: Om de weergavestijlen te configureren:

source: Select a layout.
de: Wählen Sie ein Layout.
es: Seleccione un diseño.
fr: Sélectionnez une disposition.
nl: Selecteer een lay-out

source: Depending on the selected layout, you can add elements to your KPI: a context, a title, or an image. You can either add an image previously uploaded into the plaform, or a public image from the Internet. a. To use an image from your domain, copy its URL from the back office **Assets** page to the **Image asset URL** field. b. To use an image that is not on your domain, paste its URL to the **Image asset URL** field.
de: Je nach ausgewähltem Layout können Sie Ihrer KPI Elemente hinzufügen: einen Kontext, einen Titel oder ein Bild. Sie können entweder ein Bild hinzufügen, das Sie zuvor in das Formular hochgeladen haben, oder ein öffentliches Bild aus dem Internet. a. Um ein Bild aus Ihrer Domain zu verwenden, kopieren Sie dessen URL von der Back-Office-Seite **Assets** in das Feld **Bild-Asset-URL**. b. Um ein Bild zu verwenden, das sich nicht auf Ihrer Domain befindet, fügen Sie dessen URL in das Feld **Bild-Asset-URL** ein.
es: En función del diseño seleccionado, puede añadir algunos elementos al KPI: un contexto, un título o una imagen. Puede añadir una imagen que haya cargado antes en la plataforma o una imagen pública obtenida de Internet. a. Para usar una imagen del dominio, copie su dirección URL de la página **Activos** del back office en el campo **Dirección URL de activo de imagen**. b. Para usar una imagen que no esté en el dominio, pegue su dirección URL en el campo **Dirección URL de activo de imagen**.
fr: En fonction de la disposition sélectionnée, vous pouvez ajouter des éléments à votre KPI : un contexte, un titre ou une image. Vous pouvez ajouter un image préalablement chargée dans la plateforme ou une image publique issue d'Internet. a. Pour utiliser une image de votre domaine, copiez son URL depuis la page **Ressources** de l'interface d'administration vers le champ **URL de ressource d'image**. b. Pour utiliser une image qui n'est pas sur votre domaine, collez son URL dans le champ **URL de ressource d'image**.
nl: Afhankelijk van de geselecteerde lay-out, kunt u elementen toevoegen aan uw KPI: een context, een titel of een afbeelding. U kunt ofwel een afbeelding toevoegen die voorheen geüploaded werd in het platform of een publieke afbeelding van het internet. a. Om een afbeelding uit uw domein te gebruiken, kopieer deze URL uit de pagina **Activa** van de back office naar het veld **Afbeelding activa-URL**. b. Om een afbeelding te gebruiken die niet op uw domein staat, plak deze URL naar het veld **Afbeelding activa-URL**.

source: Click **Finish**.
de: Klicken Sie auf **Beenden**.
es: Haga clic en **Finalizar**.
fr: Cliquez sur **Terminer**.
nl: Klik op **Voltooien**.

source: You can see a summary of the block configuration parameters in the side pane.
de: Im Seitenfenster sehen Sie eine Zusammenfassung der Parameter der Blockkonfiguration.
es: Puede consultar el resumen de los parámetros de configuración del bloque en el panel lateral.
fr: Vous pouvez visualiser un résumé des paramètres de configuration du bloc dans le volet latéral.
nl: U kunt in het zijpaneel een overzicht zien van de configuratieparameters van het blok.

source: Check the block configuration and click **Save**.
de: Überprüfen Sie die Blockkonfiguration und klicken Sie auf **Speichern**.
es: Consulte la configuración del bloque y haga clic en **Guardar**.
fr: Vérifiez la configuration du bloc et cliquez sur **Sauvegarder**.
nl: Vink de blokconfiguratie aan en klik op **Opslaan**.

source: Your KPI appears in the preview pane.
de: Ihre KPI wird im Vorschaufenster angezeigt.
es: El KPI aparece en el panel de vista previa.
fr: Votre KPI apparaît dans le volet d'aperçu.
nl: Uw KPI verschijnt in het voorbeeldweergavevenster.

source: Once you completed the block configuration, you can click the block again in the preview pane to check and edit the KPI parameters in the side pane.
de: Sobald Sie die Konfiguration des Blocks abgeschlossen haben, können Sie im Vorschaufenster erneut auf den Block klicken, um die KPI-Parameter im Seitenfenster zu überprüfen und zu bearbeiten.
es: Cuando haya terminado de configurar el bloque, puede volver a hacer clic en el bloque en el panel de vista previa para comprobar y editar los parámetros del KPI en el panel lateral.
fr: Une fois la configuration du bloc terminée, vous pouvez à nouveau cliquer sur le bloc dans le volet d'aperçu pour vérifier et modifier les paramètres du KPI dans le volet latéral.
nl: Eenmaal u de blokconfiguratie hebt voltooid, kunt u opnieuw op het blok klikken in het voorbeeldweergavevenster om te controleren en de KPI-parameters in het zijpaneel te bewerken.
