Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/configuring_blocks/add-kpi.po
Languages: de, es, fr, nl

source: Adding a key performance indicator (KPI)
de: Einen Leistungsindikator (KPI) hinzufügen
es: Añadir un indicador clave de rendimiento (KPI)
fr: Ajouter un indicateur clé de performance (KPI)
nl: Een kritieke prestatie-indicator (KPI) toevoegen

source: You can use a key performance indicator (KPI) to translate one phenomenon that lies within data into a simple message. There are three types of KPIs available in the Studio:
de: Sie können einen Leistungsindikator (Key Performance Indicator, KPI) verwenden, um ein datenbasiertes Phänomen in eine einfache Nachricht zu übersetzen. Es gibt drei Arten von KPIs, die im Studio verfügbar sind:
es: Puede utilizar un indicador clave de rendimiento (KPI) para traducir un fenómeno subyacente de los datos en un mensaje sencillo. Hay 3 tipos de KPI disponibles en Studio:
fr: Vous pouvez utiliser un indicateur clé de performance (KPI) pour traduire un phénomène se trouvant dans les données en un message simple. Il existe trois types de KPI disponibles dans le studio :
nl: U kunt een kritieke prestatie-indicator (KPI) gebruiken om één fenomeen dat binnen data ligt, te vertalen in een eenvoudig bericht. Er zijn drie soorten KPI's beschikbaar in de Studio:

source: Simple KPIs highlight a piece of information. For example, you can create a simple KPI to show the sum of inhabitants in the city in 2021.
de: Einfache KPIs verdeutlichen eine bestimmte Information. Sie können zum Beispiel eine einfache KPI erstellen, der die Summe der Einwohner der Stadt im Jahr 2021 angibt.
es: Los KPI simples destacan una información. Por ejemplo, puede crear un KPI simple para mostrar la suma de habitantes de una ciudad en 2021.
fr: Les KPI simples mettent en avant une information. Par exemple, vous pouvez créer un KPI simple pour afficher la somme d'habitants dans le ville en 2021.
nl: Simple KPI's beklemtonen een stukje informatie. Bijvoorbeeld, u kunt een simple KPI aanmaken om de som van de inwoners van de stad in 2021 weer te geven.

source: Comparison KPIs compare two subsets of data or two populations. For example, you create a comparison KPI to show the evolution of bike users over time by comparing the number of bike users between 2020 and 2021.
de: Vergleichende KPIs vergleichen zwei Daten-Untersätze oder zwei Populationen. Sie können zum Beispiel eine vergleichende KPI erstellen, um die Entwicklung der Fahrradnutzer im Laufe der Zeit zu zeigen, indem Sie die Anzahl der Fahrradnutzer zwischen 2020 und 2021 vergleichen.
es: Los KPI de comparación comparan 2 subconjuntos de datos o 2 poblaciones. Por ejemplo, puede crear un KPI de comparación para mostrar la evolución a lo largo del tiempo de los usuarios de bicicletas comparando el número de usuarios de bicicletas entre 2020 y 2021.
fr: Les KPI de comparaison comparent deux sous-ensembles de données ou deux populations. Par exemple, vous créez un KPI de comparaison pour montrer l'évolution du nombre d'utilisateurs de vélo dans le temps, entre 2020 et 2021.
nl: Comparison KPI's vergelijken twee subreeksen van data of twee populaties. Bijvoorbeeld, u kunt een comparison KPI aanmaken om de evolutie van de fietsgebruikers na verloop van tijd weer te geven door het aantal fietsgebruikers tussen 2020 en 2021 met elkaar te vergelijken.

source: Ratio KPIs gives the proportion of a population within a larger one. For example, you can create a ratio KPI to know the percentage of women in the total population of your country.
de: Verhältnis-KPIs geben den Anteil einer Bevölkerung innerhalb einer größeren Bevölkerung an. Sie können zum Beispiel eine Verhältnis-KPI erstellen, um den Anteil der Frauen an der Gesamtbevölkerung Ihres Landes zu ermitteln.
es: Los KPI de ratio indican la proporción de una población en el seno de otra más grande. Por ejemplo, puede crear un KPI de ratio para saber el porcentaje de mujeres del total de población de un país.
fr: Les KPI de ratio donnent la proportion d'une population au sein d'une population plus large. Par exemple, vous pouvez créer un KPI de ratio pour connaître le pourcentage de femmes par rapport à la population totale de votre pays.
nl: Ratio KPI's geven de verhouden van een populatie binnen een grotere. Bijvoorbeeld, u kunt een ratio KPI aanmaken om het percentage vrouwen in de totale populatie van uw land te kennen.

source: We recommend that you follow some key principles to build clear KPIs:
de: Bitte beachten Sie einige wichtige Grundsätze, um eindeutige KPIs zu erstellen:
es: Recomendamos seguir una serie de principios clave para crear KPI claros:
fr: Nous vous recommandons de suivre certains principes clés pour créer des KPI clairs :
nl: We raden u aan dat u enkele belangrijke principes volgt om duidelijke KPI's op te bouwen:

source: A KPI must convey a single message so that a single indicator is emphasized.
de: Eine KPI muss eine einzige Botschaft übermitteln, d.h. es wird eine einzige Leistungskennzahl hervorgehoben.
es: Un KPI debe transmitir un único mensaje para destacar un único indicador.
fr: Un KPI doit transmettre un message unique de façon qu'un seul indicateur soit mis en avant.
nl: Een KPI moet een enkele boodschap overbrengen zodat een enkele indicator wordt benadrukt.

source: A KPI needs some context so that anyone browsing the page can understand what the KPI is related to.
de: Eine KPI braucht auch einen gewissen Kontext, damit jeder, der die Seite besucht, versteht, worauf sich die KPI bezieht.
es: Un KPI necesita contexto para que cualquier usuario que explore la página pueda entender a qué hace referencia el KPI.
fr: Un KPI a besoin de contexte pour que les utilisateurs parcourant la page puissent comprendre à quoi le KPI fait référence.
nl: Een KPI heeft enige context nodig zodat iemand die de pagina doorbladert kan begrijpen waar de KPI verband mee houdt.

source: A KPI must be meaningful. If you add a picture, a pictogram, or colors, it must serve the message you want to convey.
de: Eine KPI muss aussagekräftig sein. Wenn Sie ein Bild, ein Piktogramm oder Farben hinzufügen, müssen diese im Einklang mit der zu vermittelnden Botschaft stehen.
es: Un KPI debe ser significativo. Si añade una imagen, un pictograma o colores, todo ello debe servir al mensaje que desea transmitir.
fr: Un KPI doit avoir du sens. Si vous ajoutez une image, un pictogramme ou des couleurs, ces éléments doivent être en lien avec le message que vous souhaitez transmettre.
nl: Een KPI moet betekenisvol zijn. Wanneer u een foto, een pictogram of kleuren toevoegt, moet dit in het belang zijn van de boodschap die u wilt overbrengen.

source: Step 1: Select the block type
de: 1. Schritt: Blocktyp auswählen
es: Paso 1: Seleccionar el tipo de bloque
fr: Étape 1 : sélectionner le type de bloc
nl: Stap 1: Selecteer het bloktype

source: You need to define the block type before you can configure the content you want to add.
de: Sie müssen zunächst den Blocktyp definieren, bevor Sie den Inhalt konfigurieren können, den Sie hinzufügen möchten.
es: Tiene que definir el tipo de bloque antes de configurar el contenido que desea añadir.
fr: Vous devez définir le type de bloc avant de pouvoir configurer le contenu que vous souhaitez ajouter.
nl: U moet het bloktype definiëren alvorens u de content die u wilt toevoegen, kunt configureren.

source: From the preview pane, click the block you want to edit.
de: Klicken Sie im Vorschaufenster auf den Block, den Sie bearbeiten möchten.
es: En el panel de vista previa, haga clic en el bloque que desea editar.
fr: Dans le volet d'aperçu, cliquez sur le bloc que vous souhaitez modifier.
nl: Klik vanuit het voorbeeldweergavevenster op het blok dat u wilt bewerken.

source: From the left side pane, select **KPI** as the block type.
de: Wählen Sie auf der linken Seite **KPI** als Blocktyp.
es: En el panel izquierdo, seleccione **KPI** como tipo de bloque.
fr: Sélectionnez **KPI** en tant que type de bloc dans le volet de gauche.
nl: Selecteer in het zijpaneel links **KPI** als het bloktype.

source: Click **Next**.
de: Klicken Sie auf **Weiter**.
es: Haga clic en **Siguiente**.
fr: Cliquez sur **Suivant**.
nl: Klik op **Volgende**.

source: If you change your mind, you can change the block type afterward. The block configuration will be reset after you change the block type.
de: Wenn Sie Ihre Meinung ändern, können Sie den Blocktyp auch nachträglich ändern. Die Blockkonfiguration wird zurückgesetzt, sobald Sie den Blocktyp geändert haben.
es: Si cambia de opinión, puede cambiar el tipo de bloque más adelante. La configuración del bloque se restablecerá una vez que haya cambiado el tipo de bloque.
fr: Si vous changez d'avis, vous pourrez modifier le type de bloc ultérieurement. La configuration du bloc sera réinitialisée une fois que vous aurez modifié le type de bloc.
nl: Indien u van gedacht verandert, kunt u later het bloktype nog wijzigen. De blokconfiguratie zal opnieuw worden ingesteld nadat u het bloktype hebt gewijzigd.

source: Step 2: Select the dataset
de: 2. Schritt: Datensatz auswählen
es: Paso 2: Seleccionar el conjunto de datos
fr: Étape 1 : sélectionner le jeu de données
nl: Stap 2: Selecteer de dataset

source: Select the source dataset to create a graphic representation of the data.
de: Wählen Sie den Quelldatensatz aus, um eine grafische Darstellung der Daten zu erstellen.
es: Seleccione el conjunto de datos de origen para crear una representación gráfica de los datos.
fr: Sélectionnez le jeu de données source pour créer une représentation graphique des données.
nl: Selecteer de bron dataset om een grafische weergave van de data aan te maken.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: The dataset is only selected for the current block. If you add some content to another block afterward, you will need to select an input dataset again.
de: Der Datensatz wird nur für den aktuellen Block ausgewählt. Wenn Sie später einen Inhalt zu einem anderen Block hinzufügen, müssen Sie einen weiteren Eingabedatensatz auswählen.
es: El conjunto de datos solo está seleccionado para el bloque actual. Si añade contenido a otro bloque más adelante, tendrá que volver a seleccionar un conjunto de datos de entrada.
fr: Le jeu de données est uniquement disponible pour le bloc actuel. Si vous ajoutez du contenu à un autre bloc ultérieurement, vous devrez une nouvelle fois sélectionner un jeu de données d'entrée.
nl: De dataset wordt enkel geselecteerd voor het huidige blok. Indien u later content aan een ander blok toevoegt, zult u de input dataset opnieuw moeten selecteren.

source: From the left side pane, select the desired dataset from the list.
de: Wählen Sie im linken Fenster den gewünschten Datensatz aus der Liste aus.
es: En el panel izquierdo, seleccione el conjunto de datos deseado en la lista.
fr: Depuis le volet gauche, sélectionnez le jeu de données souhaité dans la liste.
nl: Selecteer uit het zijpaneel links de gewenste dataset uit de lijst.

source: A preview of the first 20 records opens in the preview pane.
de: Eine Vorschau der ersten 20 Datensätze wird im Vorschaufenster geöffnet.
es: Se abre una vista previa de los 20 primeros registros en el panel de vista previa.
fr: Un aperçu des 20 premiers enregistrements d'affiche dans le volet d'aperçu.
nl: Een voorbeeldweergave van de eerste 20 records wordt geopend in het voorbeeldweergavevenster.

source: Click **Next** to continue with the configuration.
de: Klicken Sie auf **Weiter**, um mit der Konfiguration fortzufahren.
es: Haga clic en **Siguiente** para continuar con la configuración.
fr: Cliquez sur **Suivant** pour poursuivre la configuration.
nl: Klik op **Volgende** om verder te gaan met de configuratie.

source: Step 3: Select the KPI type
de: 3. Schritt: KPI-Typ auswählen
es: Paso 3: Seleccionar el tipo de KPI
fr: Étape 3 : sélectionner le type de KPI
nl: Stap 3: Selecteer het KPI-type

source: After selecting a block type and the input dataset, you can now select the type of KPI to be inserted into the block.
de: Nachdem Sie einen Blocktyp und den Eingabedatensatz ausgewählt haben, können Sie nun die Art der KPI auswählen, die in den Block eingefügt werden soll.
es: Después de seleccionar un tipo de bloque y el conjunto de datos de entrada, ya puede seleccionar el tipo de KPI que se insertará en el bloque.
fr: Après avoir sélectionné un type de bloc et le jeu de données d'entrée, vous pouvez sélectionner le type de KPI à insérer dans le bloc.
nl: Na het selecteren van een bloktype en de input dataset, kunt het type KPI selecteren dat in het blok moet worden ingevoegd.

source: From the left side pane, select **Simple KPI**, **Comparison KPI** or **Ratio KPI**.
de: Wählen Sie im linken Fenster die Option **Einfache KPI**, **Vergleichende KPI** oder **Verhältnis-KPI**.
es: En el panel izquierdo, seleccione **KPI simples**, **KPI de comparación** o **KPI de ratio**.
fr: Dans le volet de gauche, sélectionnez **KPI simple**, **KPI de comparaison** ou **KPI de ratio**.
nl: Selecteer uit het zijpaneel links **Simple KPI**, **Comparison KPI** of **Ratio KPI**.

source: Step 4: Configure the visualization parameters
de: 4. Schritt: Konfiguration der Visualisierungsparameter
es: Paso 4: Configurar los parámetros de visualización
fr: Étape 4 : configurer les paramètres de visualisation
nl: Stap 4: Configureer de weergaveparameters

source: Configure the visualization parameters for a simple KPI
de: Konfigurieren Sie die Visualisierungsparameter einer einfachen KPI
es: Configurar los parámetros de visualización de un KPI simple
fr: Configurer les paramètres de visualisation pour un KPI simple
nl: Configureer de weergaveparameters voor een simple KPI

source: From the left side pane, select the function to apply and the field to be used for value computation. When using a date field, select the time scale to be used.
de: Wählen Sie im linken Bereich die anzuwendende Funktion und das Feld aus, das für die Wertberechnung verwendet werden soll. Wenn Sie ein Datumsfeld verwenden, wählen Sie die zu verwendende Zeitskala.
es: En el panel izquierdo, seleccione la función que se aplicará y el campo que se utilizará para el cálculo del valor. Al usar un campo de fecha, seleccione la escala temporal que se debe usar.
fr: Dans le volet de gauche, sélectionnez la fonction à appliquer et le champ à utiliser pour le calcul des valeurs. Lorsque vous utilisez un champ de date, sélectionnez l'échelle de temps à utiliser.
nl: Selecteer vanuit het zijpaneel links de functie die moet worden toegepast en het veld dat moet worden gebruikt voor het berekenen van de waarde. Wanneer een datumveld wordt gebruikt, selecteer dan de tijdschaal die moet worden gebruikt.

source: You can also refine the data shown on the KPI:
de: Sie können die in der KPI angezeigten Daten auch verfeinern:
es: También puede refinar los datos que se muestran en el KPI:
fr: Vous pouvez également affiner les données affichées sur le KPI :
nl: U kunt ook de data verfijnen die getoond worden op de KPI:

source: Click **Add a condition**.
de: Klicken Sie auf **Eine Bedingung hinzufügen**.
es: Haga clic en **Añadir una condición**.
fr: Cliquez sur **Ajouter une condition**.
nl: Klik op **Een voorwaarde toevoegen**.

source: Select the field from the input dataset.
de: Wählen Sie das Feld aus dem Eingabedatensatz aus.
es: Seleccione el campo del conjunto de datos de entrada.
fr: Sélectionnez le champ dans le jeu de données d'entrée.
nl: Selecteer het veld uit de input dataset.

source: Select an operator. Depending on the field type, the available operators may vary.
de: Wählen Sie einen Operator. Je nach Feldtyp können die verfügbaren Operatoren unterschiedlich sein.
es: Seleccione un operador. Según el tipo de campo, los operadores disponibles pueden variar.
fr: Sélectionnez un opérateur ; en fonction du type de champ, les opérateurs disponibles peuvent varier.
nl: Selecteer een operator. De beschikbare operatoren kunnen verschillen afhankelijk van het veldtype.

source: Click **Confirm**.
de: Klicken Sie auf **Bestätigen**.
es: Haga clic en **Confirmar**.
fr: Cliquez sur **Confirmer**.
nl: Klik op **Bevestigen**.

source: For more information, see :ref:`refining-data`.
de: Weitere Informationen finden Sie unter :ref:`refining-data`.
es: Para obtener más información, consulte :ref:`refining-data`.
fr: Pour plus d'informations, consultez :ref:`refining-data`.
nl: Voor meer informatie, zie :ref:`refining-data`.

source: (optional) In the **Unit** field, you can enter the unit associated to the indicator. By default, this unit is placed on the right side of the indicator. You can place it on the left by using the swap toggle.
de: (optional) In das Feld **Einheit** können Sie die der Leistungskennzahl zugeordnete Einheit eingeben. Standardmäßig wird diese Einheit auf der rechten Seite der Leistungskennzahl angezeigt. Sie können sie auf der linken Seite platzieren, indem Sie die Umschalttaste zum Tauschen verwenden.
es: (Opcional) En el campo **Unidad**, puede especificar la unidad asociada al indicador. De forma predeterminada, esta unidad se coloca a la derecha del indicador. Puede colocarla a la izquierda mediante el botón de intercambio.
fr: (facultatif) Dans le champ **Unité**, vous pouvez saisir l'unité associée à l'indicateur. Par défaut, cette unité est placée à droite de l'indicateur. Vous pouvez la placer à gauche à l'aide de l'option d'échange.
nl: (optioneel) In het veld **Eenheid** kunt u de eenheid invoeren die gekoppeld is aan de indicator. Standaard wordt deze eenheid aan de rechterzijde van de indicator geplaatst. U kunt deze aan de linkerzijde plaatsen door de swap toggle te gebruiken.

source: Configure the visualization parameters for a comparison KPI
de: Konfigurieren Sie die Visualisierungsparameter einer vergleichenden KPI
es: Configurar los parámetros de visualización de un KPI de comparación
fr: Configurer les paramètres de visualisation pour un KPI de comparaison
nl: Configureer de weergaveparameters voor een comparison KPI

source: When creating a comparison KPI, you create two sets of data so that you can compare them between each other and identify differences.
de: Bei der Erstellung einer vergleichenden KPI erstellen Sie zwei Datensätze, um sie miteinander zu vergleichen und Unterschiede zu ermitteln.
es: Al crear un KPI de comparación, se crean 2 conjuntos de datos para poderlos comparar entre sí e identificar las diferencias.
fr: Lors de la création d'un KPI de comparaison, vous créez deux jeux de données de façon à pouvoir les comparer et à identifier leurs différences.
nl: Wanneer een comparison KPI wordt aangemaakt, maakt u twee sets data aan zodat u deze onderling kunt vergelijken en verschillen kunt identificeren.

source: From the left side pane, select the function to apply and the field to be used in the first set of data.
de: Wählen Sie im linken Bereich die anzuwendende Funktion und das Feld aus, das im ersten Datensatz verwendet werden soll.
es: En el panel izquierdo, seleccione la función que se aplicará y el campo que se utilizará en el primer conjunto de datos.
fr: Dans le volet de gauche, sélectionnez la fonction à appliquer et le champ à utiliser dans le premier jeu de données.
nl: Selecteer vanuit het zijpaneel links de functie die moet worden toegepast en het veld dat gebruikt moet worden in de eerste set data.

source: You can also filter or refine the data shown on the KPI:
de: Sie können die in der KPI angezeigten Daten auch filtern oder verfeinern:
es: También puede filtrar o refinar los datos que se muestran en el KPI:
fr: Vous pouvez également filtrer ou affiner les données affichées sur le KPI :
nl: U kunt ook de data die getoond worden op de KPI filteren of verfijnen:

source: Under the desired set, click **Add a condition**.
de: Klicken Sie unter dem entsprechenden Satz auf **Eine Bedingung hinzufügen**.
es: Bajo el conjunto deseado, haga clic en **Añadir una condición**.
fr: Sous le jeu de données souhaité, cliquez sur **Ajouter une condition**.
nl: Klik onder de gewenste set op **Een voorwaarde toevoegen**.

source: Repeat the previous instructions to configure the second set of data.
de: Wiederholen Sie die vorherigen Anweisungen, um den zweiten Datensatz zu konfigurieren.
es: Repita las instrucciones anteriores para configurar el segundo conjunto de datos.
fr: Répétez les instructions précédentes pour configurer le second jeu de données.
nl: Herhaal de vorige instructies om de tweede set data te configureren.

source: Configure how to display the comparison between the two sets of data using the parameters from the **KPI content** section:
de: Konfigurieren Sie, wie der Vergleich zwischen den beiden Datensätzen angezeigt werden soll. Verwenden Sie dazu die Parameter aus dem Abschnitt **KPI-Inhalt**:
es: Configure cómo mostrar la comparación entre los 2 conjuntos de datos utilizando los parámetros de la sección **Contenido de KPI**:
fr: Configurez l'affichage de la comparaison entre les deux jeux de données à l'aide des paramètres de la section **Contenu du KPI** :
nl: Configureer hoe de vergelijking tussen de twee sets data moet worden weergegeven door gebruik te maken van de parameters uit de rubriek **KPI-content**:

source: From the **Comparison direction** drop-down list, select either **Set 1 compared to Set 2** or **Set 2 compared to Set 1**.
de: Wählen Sie in der Dropdown-Liste **Vergleichsrichtung** entweder **Satz 1 im Vergleich zu Satz 2** oder **Satz 2 im Vergleich zu Satz 1**.
es: En lista desplegable **Dirección de comparación**, seleccione **Conjunto 1 en comparación con Conjunto 2** o **Conjunto 2 en comparación con Conjunto 1**.
fr: Dans la liste déroulante **Sens de comparaison**, sélectionnez **Jeu 1 comparé au jeu 2** ou **Jeu 2 comparé au jeu 1**.
nl: Selecteer uit de drop-downlijst **Vergelijkingsrichting** ofwel **Set 1 vergeleken met Set 2** of **Set 2 vergeleken met Set 1**.

source: From the **Comparison format** drop-down list, select either **Difference** or **Ratio percentage**.
de: Wählen Sie in der Dropdown-Liste **Vergleichsformat** entweder **Differenz** oder **Verhältnis in Prozent**.
es: En la lista desplegable **Formato de comparación**, seleccione **Diferencia** o **Porcentaje de ratio**.
fr: Dans la liste déroulante **Format de comparaison**, sélectionnez **Différence** ou **Pourcentage du ratio**.
nl: Selecteer uit de drop-downlijst **Vergelijkingsformaat** ofwel **Verschil** ofwel **Ratiopercentage**.

source: Configure the visualization parameters for a ratio KPI
de: Konfigurieren Sie die Visualisierungsparameter einer Verhältnis-KPI
es: Configurar los parámetros de visualización de un KPI de ratio
fr: Configurer les paramètres de visualisation pour un KPI de ratio
nl: Configureer de weergaveparameters voor een ratio KPI

source: When creating a ratio KPI, you create two sets of data so that you measure the proportion of one within the other.
de: Bei der Erstellung einer Verhältnis-KPI erstellen Sie zwei Datensätze, um das Verhältnis des einen zum anderen messen können.
es: Al crear un KPI de ratio, se crean 2 conjuntos de datos para poder medir la proporción de uno en el seno del otro.
fr: Lors de la création d'un KPI de ratio, vous créez deux jeux de données de façon à pouvoir mesurer la proportion de l'un par rapport à l'autre.
nl: Wanneer een ratio KPI wordt aangemaakt, maakt u twee sets data aan zodat u de verhouding van de ene binnen de andere kunt meten.

source: You can also filter or refine the data :
de: Sie können die Daten auch filtern oder verfeinern:
es: También puede filtrar o refinar los datos:
fr: Vous pouvez également filtrer ou affiner les données :
nl: U kunt de data ook filteren of verfijnen:
