Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/configuring_blocks/add-chart.po
Languages: de, es, fr, nl

source: Adding a chart
de: Ein Diagramm hinzufügen
es: Añadir un gráfico
fr: Ajouter un graphique
nl: Een grafiek toevoegen

source: You can use charts to create a graphic representation of your data.
de: Sie können Diagramme verwenden, um Ihre Daten grafisch darzustellen.
es: Puede utilizar gráficos para crear una representación gráfica de los datos.
fr: Vous pouvez utiliser les graphiques pour créer une représentation graphique de vos données.
nl: U kunt grafieken gebruiken om een grafische weergave van uw data te creëren.

source: Step 1: Select the block type
de: 1. Schritt: Blocktyp auswählen
es: Paso 1: Seleccionar el tipo de bloque
fr: Étape 1 : sélectionner le type de bloc
nl: Stap 1: Selecteer het bloktype

source: You need to define the block type before you configure the content you want to add.
de: Sie müssen zunächst den Blocktyp definieren, bevor Sie den Inhalt konfigurieren, den Sie hinzufügen möchten.
es: Tiene que definir el tipo de bloque antes de configurar el contenido que desea añadir.
fr: Vous devez définir le type de bloc avant de configurer le contenu que vous souhaitez ajouter.
nl: U moet eerst het bloktype definiëren alvorens u de content die u wilt toevoegen kunt configureren.

source: From the preview pane, click the block you want to edit.
de: Klicken Sie im Vorschaufenster auf den Block, den Sie bearbeiten möchten.
es: En el panel de vista previa, haga clic en el bloque que desea editar.
fr: Dans le volet d'aperçu, cliquez sur le bloc que vous souhaitez modifier.
nl: Klik vanuit het voorbeeldweergavevenster op het blok dat u wilt bewerken.

source: From the left side pane, select **Chart** as the block type.
de: Wählen Sie auf der linken Seite **Diagramm** als Blocktyp.
es: En el panel izquierdo, seleccione **Gráfico** como tipo de bloque.
fr: Sélectionnez le type de bloc **Graphique** dans le volet de gauche.
nl: Selecteer in het zijpaneel links **Grafiek** als het bloktype.

source: Click **Next**.
de: Klicken Sie auf **Weiter**.
es: Haga clic en **Siguiente**.
fr: Cliquez sur **Suivant**.
nl: Klik op **Volgende**.

source: If you change your mind, you can change the block type afterward. The block configuration will be reset after you change the block type.
de: Wenn Sie Ihre Meinung ändern, können Sie den Blocktyp auch nachträglich ändern. Die Blockkonfiguration wird zurückgesetzt, sobald Sie den Blocktyp geändert haben.
es: Si cambia de opinión, puede cambiar el tipo de bloque más adelante. La configuración del bloque se restablecerá una vez que haya cambiado el tipo de bloque.
fr: Si vous changez d'avis, vous pourrez modifier le type de bloc ultérieurement. La configuration du bloc sera réinitialisée une fois que vous aurez modifié le type de bloc.
nl: Indien u van gedacht verandert, kunt u later het bloktype nog wijzigen. De blokconfiguratie zal opnieuw worden ingesteld nadat u het bloktype hebt gewijzigd.

source: Step 2: Select the dataset
de: 2. Schritt: Datensatz auswählen
es: Paso 2: Seleccionar el conjunto de datos
fr: Étape 2 : sélectionner le jeu de données
nl: Stap 2: Selecteer de dataset

source: Select the source dataset to create a graphic representation of the data.
de: Wählen Sie den Quelldatensatz aus, um eine grafische Darstellung der Daten zu erstellen.
es: Seleccione el conjunto de datos de origen para crear una representación gráfica de los datos.
fr: Sélectionnez le jeu de données source pour créer une représentation graphique des données.
nl: Selecteer de bron dataset om een grafische weergave van de data aan te maken.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: The dataset is only selected for the current block. If you add some content to another block afterward, you will need to select an input dataset again.
de: Der Datensatz wird nur für den aktuellen Block ausgewählt. Wenn Sie später einen Inhalt zu einem anderen Block hinzufügen, müssen Sie einen weiteren Eingabedatensatz auswählen.
es: El conjunto de datos solo está seleccionado para el bloque actual. Si añade contenido a otro bloque más adelante, tendrá que volver a seleccionar un conjunto de datos de entrada.
fr: Le jeu de données est uniquement sélectionné pour le bloc actuel. Si vous ajoutez du contenu à un autre bloc ultérieurement, vous devrez à nouveau sélectionner un jeu de données d'entrée.
nl: De dataset wordt enkel geselecteerd voor het huidige blok. Indien u later content aan een ander blok toevoegt, zult u de input dataset opnieuw moeten selecteren.

source: From the left side pane, select the desired dataset from the list.
de: Wählen Sie im linken Fenster den gewünschten Datensatz aus der Liste aus.
es: En el panel izquierdo, seleccione el conjunto de datos deseado en la lista.
fr: Depuis le volet de gauche, sélectionnez le jeu de données souhaité dans la liste.
nl: Selecteer uit het zijpaneel links de gewenste dataset uit de lijst.

source: A preview of the first 20 records opens in the preview pane.
de: Eine Vorschau der ersten 20 Datensätze wird im Vorschaufenster geöffnet.
es: Se abre una vista previa de los 20 primeros registros en el panel de vista previa.
fr: Un aperçu des 20 premiers enregistrements s'affiche dans le volet d'aperçu.
nl: Een voorbeeldweergave van de eerste 20 records wordt geopend in het voorbeeldweergavevenster.

source: Click **Next** to continue with the configuration.
de: Klicken Sie auf **Weiter**, um mit der Konfiguration fortzufahren.
es: Haga clic en **Siguiente** para continuar con la configuración.
fr: Cliquez sur **Suivant** pour poursuivre la configuration.
nl: Klik op **Volgende** om verder te gaan met de configuratie.

source: Step 3: Select the visualization type
de: 3. Schritt: Visualisierungstyp auswählen
es: Paso 3: Seleccionar el tipo de visualización
fr: Étape 3 : sélectionner le type de visualisation
nl: Stap 3: Selecteer het weergavetype

source: After selecting a block type and the input dataset, you can now select the type of chart to be inserted into the block.
de: Nachdem Sie einen Blocktyp und den Eingabedatensatz ausgewählt haben, können Sie nun die Art des Diagramms auswählen, das in den Block eingefügt werden soll.
es: Después de seleccionar un tipo de bloque y el conjunto de datos de entrada, ya puede seleccionar el tipo de gráfico que se insertará en el bloque.
fr: Après avoir sélectionné un type de bloc et le jeu de données d'entrée, vous pouvez sélectionner le type de graphique à insérer dans le bloc.
nl: Na het selecteren van een bloktype en de input dataset, kunt u nu het type grafiek selecteren dat in het blok moet worden ingevoegd.

source: From the left side pane, select the desired type of chart.
de: Wählen Sie im linken Fenster den gewünschten Diagrammtyp aus.
es: En el panel izquierdo, seleccione el tipo de gráfico deseado.
fr: Depuis le volet de gauche, sélectionnez le type de graphique souhaité.
nl: Selecteer in het zijpaneel links het gewenste grafiektype.

source: Step 4: Configure the visualization parameters
de: 4. Schritt: Konfiguration der Visualisierungsparameter
es: Paso 4: Configurar los parámetros de visualización
fr: Étape 4 : configurer les paramètres de visualisation
nl: Stap 4: Configureer de weergaveparameters

source: From the left side pane, configure the data your chart will display:
de: Konfigurieren Sie im linken Fenster die Daten, die Ihr Diagramm anzeigen soll:
es: En el panel izquierdo, configure los datos que visualizará el gráfico:
fr: Depuis le volet de gauche, configurez les données que votre graphique affichera :
nl: Configureer in het zijpaneel links de data die uw grafiek zal weergeven:

source: The first section is used to compartimentalize the data into different categories. Those categories can be names, dates, numbers. Charts have different purposes, therefore settings may vary from one chart to another. Even though the name of this section varies (horizontal axis, sectors, categories), it always has the same effect on the chart.
de: Der erste Abschnitt dient dazu, die Daten in verschiedene Kategorien zu unterteilen. Diese Kategorien können Namen, Daten oder Zahlen sein. Die Diagramme dienen unterschiedlichen Zwecken, daher können die Einstellungen von einem Diagramm zum anderen unterschiedlich sein. Auch wenn der Name dieses Abschnitts anders lautet (horizontale Achse, Sektoren, Kategorien), hat er immer die gleiche Auswirkung auf das Diagramm.
es: La primera sección permite compartimentar los datos en categorías. Las categorías pueden ser nombres, fechas o números. Los gráficos tienen diferentes propósitos, por lo que los ajustes pueden variar de un gráfico a otro. Aunque el nombre de esta sección varía (eje horizontal, sectores, categorías), siempre tiene el mismo efecto en el gráfico.
fr: La première section permet de compartimenter les données en différentes catégories, qui peuvent être des noms, des dates, des nombres, etc. Les graphiques ont divers objectifs, et leurs paramètres peuvent donc être sensiblement différents. Même si le nom de cette section varie (axe horizontal, secteurs, catégories), l'effet sur le graphique est toujours le même.
nl: De eerste rubriek wordt gebruikt om de data in verschillende categorieën onder te brengen. Die categorieën kunnen namen, data, getallen zijn. Grafieken hebben verschillende doeleinden. Daarom kunnen de instellingen van de ene grafiek tot de andere verschillen.. Zelfs al verschilt de naam van deze sectie (horizontale as, sectoren, categorieën), heeft dit altijd dezelfde impact op de grafiek.

source: The second section is used to compute the data that will be projected onto the chart. Select the function to apply and the field to use. This section name may vary from chart to chart (vertical axis, or values), however it always has the same effect on the chart.
de: Der zweite Abschnitt dient zur Berechnung der Daten, die auf das Diagramm übertragen werden sollen. Der Name dieses Abschnitts kann von Diagramm zu Diagramm unterschiedlich sein (vertikale Achse oder Werte), hat aber immer die gleiche Auswirkung auf das Diagramm.
es: La segunda sección permite calcular los datos que se proyectarán en el gráfico. Seleccione la función que se aplicará y el campo que se usará. El nombre de esta sección puede variar de un gráfico a otro (eje vertical o valores), pero siempre tiene el mismo efecto en el gráfico.
fr: La deuxième section permet de calculer les données qui seront projetées sur le graphique. Sélectionnez la fonction à appliquer, ainsi que le champ à utiliser. Le nom de cette section peut varier d'un graphique à l'autre (axe vertical ou valeurs), mais elle a toujours le même effet sur le graphique.
nl: De tweede rubriek wordt gebruikt om de data te berekenen die op de grafiek geprojecteerd zal worden. Selecteer de functie die moet worden toegepast en het veld dat moet worden gebruikt. De naam van deze sectie kan van grafiek tot grafiek verschillen (verticale as of waarden), maar heeft altijd dezelfde impact op de grafiek.

source: (optional) You can also refine the data shown on the chart:
de: (optional) Sie können die im Diagramm angezeigten Daten auch verfeinern:
es: (Opcional) También puede refinar los datos que se muestran en el gráfico:
fr: (facultatif) Vous pouvez également affiner les données affichées sur le graphique :
nl: (optioneel) U kunt ook de data die getoond wordt op de grafiek verfijnen:

source: Under the second section, click **Add a condition**.
de: Klicken Sie unter dem zweiten Abschnitt auf **Eine Bedingung hinzufügen**.
es: En la segunda sección, haga clic en **Añadir una condición**.
fr: Sous la seconde section, cliquez sur **Ajouter une condition**.
nl: Klik onder de tweede rubriek op **Een voorwaarde toevoegen**.

source: Select the field from the input dataset.
de: Wählen Sie das Feld aus dem Eingabedatensatz aus.
es: Seleccione el campo del conjunto de datos de entrada.
fr: Sélectionnez le champ dans le jeu de données d'entrée.
nl: Selecteer het veld uit de input dataset.

source: Select an operator. Depending on the field type, the available operators may vary.
de: Wählen Sie einen Operator. Je nach Feldtyp können die verfügbaren Operatoren unterschiedlich sein.
es: Seleccione un operador. Según el tipo de campo, los operadores disponibles pueden variar.
fr: Sélectionnez un opérateur ; en fonction du type de champ, les opérateurs disponibles peuvent varier.
nl: Selecteer een operator. De beschikbare operatoren kunnen verschillen afhankelijk van het veldtype.

source: Click **Confirm**.
de: Klicken Sie auf **Bestätigen**.
es: Haga clic en **Confirmar**.
fr: Cliquez sur **Confirmer**.
nl: Klik op **Bevestigen**.

source: For more information, see :ref:`refining-data`.
de: Weitere Informationen finden Sie unter :ref:`refining-data`.
es: Para obtener más información, consulte :ref:`refining-data`.
fr: Pour plus d'informations, consultez :ref:`refining-data`.
nl: Voor meer informatie, zie :ref:`refining-data`.

source: (optional) To configure the number of results to be displayed, toggle on **Limit the number of results to display** and enter the number of results to be displayed.
de: (optional) Um die Anzahl der anzuzeigenden Ergebnisse zu konfigurieren, aktivieren Sie die Option **Anzahl der anzuzeigenden Ergebnisse begrenzen** und geben Sie die Anzahl der anzuzeigenden Ergebnisse ein.
es: (Opcional) Para configurar el número de resultados que se mostrarán, active **Limitar el número de resultados al visualizar** y especifique el número de resultados que se mostrarán.
fr: (facultatif) Pour configurer le nombre de résultats à afficher, activez l'option **Limiter le nombre de résultats à afficher** et saisissez le nombre de résultats à afficher.
nl: (optioneel) Om het aantal resultaten dat moet worden weergegeven te configureren, vinkt u **Het aantal resultaten dat moet worden weergegeven, beperken** aan en voert u het aantal resultaten dat moet worden weergegeven in.

source: (optional) To configure how results are sorted, select **Descending order** or **Ascending order** from the **Sort results** drop-down list.
de: (optional) Um die Sortierung der Ergebnisse zu konfigurieren, wählen Sie **Absteigende Reihenfolge** oder **Aufsteigende Reihenfolge** aus der Dropdown-Liste **Ergebnisse sortieren**.
es: (Opcional) Para configurar cómo se ordenarán los resultados, seleccione **Orden descendente** u **Orden ascendente** en la lista desplegable **Ordenar resultados**.
fr: (facultatif) Pour configurer le tri des résultats, sélectionnez **Ordre décroissant** ou **Ordre croissant** dans la liste déroulante **Trier les résultats**.
nl: (optioneel) Om te configureren hoe resultaten worden gesorteerd, selecteer **Dalende volgorde** of **Stijgende volgorde** uit de drop-downlijst **Resultaten sorteren**.

source: Step 5: Configure the visualization styles
de: 5. Schritt: Konfiguration der Visualisierungsstile
es: Paso 5: Configurar los estilos de visualización
fr: Étape 5 : configurer les styles de visualisation
nl: Stap 5: Configureer de weergavestijlen

source: The Studio includes several predefined layouts for charts to display the appropriate data. These layouts help you control how the chart appears on the page to make it easier to understand.
de: Das Studio enthält mehrere vordefinierte Layouts für Diagramme, um die entsprechenden Daten anzuzeigen. Mit diesen Layouts können Sie bestimmen, wie das Diagramm auf der Seite angezeigt wird, damit es leichter zu verstehen ist.
es: Studio incluye varios diseños predefinidos de los gráficos para visualizar los datos correspondientes. Estos diseños ayudan a controlar cómo se muestra el gráfico en la página de modo que sea más fácil de entender.
fr: Le studio inclut plusieurs dispositions prédéfinies pour que les graphiques affichent les données appropriées. Ces dispositions vous permettent de contrôler l'affichage du graphique sur la page et de garantir sa lisibilité.
nl: De Studio omvat verschillende vooraf gedefinieerde lay-outs voor grafieken om de juiste data weer te geven. Deze lay-outs helpen u te controleren hoe de grafiek verschijnt op de pagina zodat deze gemakkelijker kan worden begrepen.

source: A default layout is selected to help you through the chart setting. You can change it by clicking on the card **information layout** and selecting another layout.
de: Es ist ein Standardlayout ausgewählt, das Sie bei der Einstellung der Diagramme unterstützt. Sie können es ändern, indem Sie auf die Karte **Informationslayout** klicken und ein anderes Layout auswählen.
es: Un diseño predeterminado está seleccionado para ayudarle a configurar el gráfico. Puede cambiarlo haciendo clic en la tarjeta **Diseño de información** y seleccionando otro diseño.
fr: Une disposition par défaut est sélectionnée pour vous aider à configurer le graphique. Vous pouvez la changer en cliquant sur la carte **Disposition des informations**, puis en sélectionnant une autre disposition.
nl: Er is een standaard lay-out geselecteerd om u doorheen de grafiekinstellingen te helpen. U kunt deze altijd wijzigen door op de kaart **Lay-out van de informatie** te klikken en een andere lay-out te selecteren.

source: Enter the required details in the corresponding fields (chart title, chart subtitle, axis labels). Those details are mandatory because they help the future visitors to read and understand your charts better. They are also used by screenreader softwares for accessibility purposes.
de: Geben Sie die erforderlichen Details in die entsprechenden Felder ein (Titel des Diagramms, Untertitel des Diagramms, Achsenbeschriftungen). Diese Angaben sind obligatorisch, da sie den zukünftigen Besuchern helfen, Ihre Diagramme besser zu verstehen. Sie werden auch von Screenreader-Programmen für die Barrierefreiheit verwendet.
es: Especifique los detalles necesarios en los campos correspondientes (título del gráfico, subtítulo del gráfico y etiquetas de ejes). Estos detalles son obligatorios puesto que ayudan a los futuros visitantes a leer y entender mejor los gráficos. También son utilizados por programas lectores de pantalla con fines de accesibilidad.
fr: Saisissez les données obligatoires dans les champs correspondants (titre du graphique, sous-titre du graphique, labels des axes). Ces données sont obligatoires car elles garantissent la lisibilité et la compréhension du graphique pour les futurs visiteurs. Elles sont également utilisées par les logiciels de synthèse vocale à des fins d'accessibilité.
nl: Voer de vereiste details in de overeenkomstige velden (titel van de grafiek, subtitel van de grafiek, aslabels) in. Deze details zijn verplicht omdat ze toekomstige bezoekers helpen uw grafieken te lezen en beter te begrijpen. Ze worden ook door schermleessoftware gebruikt voor toegankelijkheidsdoeleinden.

source: Click **Finish**.
de: Klicken Sie auf **Beenden**.
es: Haga clic en **Finalizar**.
fr: Cliquez sur **Terminer**.
nl: Klik op **Voltooien**.

source: You can see the summary of the block configuration parameters in the side pane.
de: Im Seitenfenster sehen Sie eine Zusammenfassung der Parameter der Blockkonfiguration.
es: Puede consultar el resumen de los parámetros de configuración del bloque en el panel lateral.
fr: Vous pouvez visualiser le résumé des paramètres de configuration du bloc dans le volet latéral.
nl: In het zijpaneel kunt u het overzicht van de configuratieparameters van het blok zien.

source: Check the block configuration and click **Save**.
de: Überprüfen Sie die Blockkonfiguration und klicken Sie auf **Speichern**.
es: Consulte la configuración del bloque y haga clic en **Guardar**.
fr: Vérifiez la configuration du bloc et cliquez sur **Sauvegarder**.
nl: Vink de blokconfiguratie aan en klik op **Opslaan**.

source: Your chart appears in the preview pane.
de: Ihr Diagramm wird im Vorschaufenster angezeigt.
es: El gráfico aparece en el panel de vista previa.
fr: Votre graphique apparaît dans le volet d'aperçu.
nl: Uw grafiek verschijnt in het voorbeeldweergavevenster.

source: Once you completed the block configuration, you can click the block again in the preview pane to check and edit the chart parameters in the side pane.
de: Sobald Sie die Konfiguration des Blocks abgeschlossen haben, können Sie im Vorschaufenster erneut auf den Block klicken, um die Diagrammparameter im Seitenfenster zu überprüfen und zu bearbeiten.
es: Cuando haya terminado de configurar el bloque, puede volver a hacer clic en el bloque en el panel de vista previa para comprobar y editar los parámetros del gráfico en el panel lateral.
fr: Une fois la configuration du bloc terminée, vous pouvez à nouveau cliquer sur le bloc dans le volet d'aperçu pour vérifier et modifier les paramètres du graphique dans le volet latéral.
nl: Eenmaal u de configuratie van het blok hebt voltooid, kunt u opnieuw op het blok klikken in het voorbeeldweergavevenster om de grafiek te controleren en om de parameters van de grafiek in het zijpaneel te bewerken.
