Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/configuring_blocks/add-text.po
Languages: de, es, fr, nl

source: Adding text
de: Text hinzufügen
es: Añadir texto
fr: Ajouter du texte
nl: Tekst toevoegen

source: You can add some text to a block using the text editor.
de: Mit dem Texteditor können Sie einen Text zu einem Block hinzufügen.
es: Puede añadir un texto a un bloque por medio del editor de texto.
fr: Vous pouvez ajouter du texte à un bloc grâce à l'éditeur de texte.
nl: U kunt met een tekstbewerker tekst toevoegen aan een blok.

source: Selecting the block type
de: Blocktyp auswählen
es: Seleccionar el tipo de bloque
fr: Sélectionner le type de bloc
nl: Het bloktype selecteren

source: You need to define the block type before you configure the content you want to add.
de: Sie müssen zunächst den Blocktyp definieren, bevor Sie den Inhalt konfigurieren, den Sie hinzufügen möchten.
es: Tiene que definir el tipo de bloque antes de configurar el contenido que desea añadir.
fr: Vous devez définir le type de bloc avant de configurer le contenu que vous souhaitez ajouter.
nl: U moet eerst het bloktype definiëren alvorens u de content die u wilt toevoegen kunt configureren.

source: From the preview pane, click the block you want to edit.
de: Klicken Sie im Vorschaufenster auf den Block, den Sie bearbeiten möchten.
es: En el panel de vista previa, haga clic en el bloque que desea editar.
fr: Dans le volet d'aperçu, cliquez sur le bloc que vous souhaitez modifier.
nl: Klik vanuit het voorbeeldweergavevenster op het blok dat u wilt bewerken.

source: From the left side pane, select **Text** as the block type.
de: Wählen Sie auf der linken Seite **Text** als Blocktyp.
es: En el panel izquierdo, seleccione **Texto** como tipo de bloque.
fr: Sélectionnez le type de bloc **Texte** dans le volet de gauche.
nl: Selecteer uit het zijpaneel links **Tekst** als het bloktype.

source: Click **Next**.
de: Klicken Sie auf **Weiter**.
es: Haga clic en **Siguiente**.
fr: Cliquez sur **Suivant**.
nl: Klik op **Volgende**.

source: If you change your mind, you can change the block type afterward. The block configuration will be reset after you change the block type.
de: Wenn Sie Ihre Meinung ändern, können Sie den Blocktyp auch nachträglich ändern. Die Blockkonfiguration wird zurückgesetzt, sobald Sie den Blocktyp geändert haben.
es: Si cambia de opinión, puede cambiar el tipo de bloque más adelante. La configuración del bloque se restablecerá una vez que haya cambiado el tipo de bloque.
fr: Si vous changez d'avis, vous pourrez modifier le type de bloc ultérieurement. La configuration du bloc sera réinitialisée une fois que vous aurez modifié le type de bloc.
nl: Indien u van gedacht verandert, kunt u later het bloktype nog wijzigen. De blokconfiguratie zal opnieuw worden ingesteld nadat u het bloktype hebt gewijzigd.

source: Adding text to a block
de: Text zu einem Block hinzufügen
es: Añadir texto a un bloque
fr: Ajouter du texte à un bloc
nl: Tekst toevoegen aan een blok

source: Click **Next** to continue with the configuration.
de: Klicken Sie auf **Weiter**, um mit der Konfiguration fortzufahren.
es: Haga clic en **Siguiente** para continuar con la configuración.
fr: Cliquez sur **Suivant** pour poursuivre la configuration.
nl: Klik op **Volgende** om verder te gaan met de configuratie.

source: Enter your text in the block.
de: Geben Sie Ihren Text in den Block ein.
es: Especifique el texto en el bloque.
fr: Saisissez votre texte dans le bloc.
nl: Voer uw tekst in het blok in.

source: Format the text using the text editor and the toolbar.
de: Formatieren Sie den Text mit Hilfe des Texteditors und der Symbolleiste.
es: Dé formato al texto con el editor de texto y la barra de herramientas.
fr: Mettez le texte en forme avec l'éditeur de texte et la barre d'outils.
nl: Formateer de tekst met de tekstbewerker en de toolbar.

source: Click **Save** to save your work.
de: Klicken Sie auf **Speichern**, um Ihre Arbeit zu speichern.
es: Haga clic en **Guardar** para guardar el trabajo.
fr: Cliquez sur **Sauvegarder** pour enregistrer votre travail.
nl: Klik op **Opslaan** om uw werk op te slaan.

source: Text editor overview
de: Texteditor-Übersicht
es: Visión general del editor de texto
fr: Vue d'ensemble de l'éditeur de texte
nl: Overzicht van de tekstbewerker

source: The left side pane of the text editor allows you to perform the following actions:
de: Im linken Fenster des Texteditors können Sie folgende Aktionen durchführen:
es: El panel izquierdo del editor de texto permite llevar a cabo estas acciones:
fr: Le volet de gauche de l'éditeur de texte vous permet d'effectuer les actions suivantes :
nl: Met het zijpaneel links van de tekstbewerker kunt u de volgende acties uitvoeren:

source: Controlling block alignment (right, center, or left)
de: Anpassung der Blockausrichtung (rechts, mittig oder links)
es: Controlar la alineación del bloque (derecha, centrada o izquierda)
fr: Contrôler l'alignement des blocs (à droite, au centre ou à gauche)
nl: De uitlijning van het blok controleren (rechts, midden of links)

source: Inserting or removing lists
de: Listen einfügen oder entfernen
es: Insertar o eliminar listas
fr: Insérer ou supprimer des listes
nl: Lijsten invoegen of verwijderen

source: Inserting separators
de: Trennzeichen einfügen
es: Insertar separadores
fr: Insérer des séparateurs
nl: Scheidingstekens invoegen

source: Undoing and redoing actions
de: Aktionen rückgängig machen und wiederherstellen
es: Deshacer y rehacer acciones
fr: Annuler et refaire des actions
nl: Acties ongedaan maken of opnieuw uitvoeren

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: When configuring the alignment, you can only use a single option (right, center, or left) for the whole block. You cannot define a different text alignment for a heading, a paragraph, or a list within a block.
de: Bei der Konfiguration der Ausrichtung können Sie nur eine einzige Option (rechts, mittig oder links) für den gesamten Block verwenden. Sie können keine unterschiedliche Textausrichtung für eine Überschrift, einen Absatz oder eine Liste innerhalb eines Blocks festlegen.
es: Al configurar la alineación, puede usar una sola opción (derecha, centrada o izquierda) para todo el bloque. No puede definir una alineación de texto distinta para un encabezado, un párrafo o una lista de un bloque.
fr: Lorsque vous configurez l'alignement, vous ne pouvez utiliser qu'une seule option (à droite, au centre ou à gauche) pour l'intégralité du bloc. Vous ne pouvez pas définir d'alignement de texte différent pour un titre, un paragraphe ou une liste dans un bloc.
nl: Wanneer u de uitlijning configureert, kunt u alleen één enkele optie (rechts, midden of links) gebruiken voor het volledige blok. U kunt geen andere tekstuitlijning definiëren voor een heading, een paragraaf of een lijst binnen een blok.

source: Formatting text using the toolbar
de: Text mit Hilfe der Symbolleiste formatieren
es: Dar formato a texto con la barra de herramientas
fr: Mettre en forme du texte avec la barre d'outils
nl: Tekst formateren met de toolbar

source: When entering some text in a block, you can format it using the editor toolbar.
de: Wenn Sie einen Text in einen Block eingeben, können Sie ihn über die Symbolleiste des Editors formatieren.
es: Al introducir un texto en un bloque, puede darle formato con la barra de herramientas del editor.
fr: Lorsque vous saisissez du texte dans un bloc, vous pouvez le mettre en forme avec la barre d'outils de l'éditeur de texte.
nl: Wanneer tekst in een blok wordt ingevoerd, kunt u deze formateren met de bewerkingstoolbar.

source: Format text
de: Text formatieren
es: Dar formato a texto
fr: Mettre en forme du texte
nl: Tekst formateren

source: In the text block, select the text you want to format.
de: Wählen Sie im Textblock den Text aus, den Sie formatieren möchten.
es: En el bloque de texto, seleccione el texto al que desea aplicar el formato.
fr: Dans le bloc de texte, sélectionnez le texte que vous souhaitez mettre en forme.
nl: Selecteer in het tekstblok de tekst die u wilt formateren.

source: Use the icons from the toolbar that appears to format your text.
de: Verwenden Sie die Symbole in der angezeigten Symbolleiste, um Ihren Text zu formatieren.
es: Use los iconos de la barra de herramientas que aparece para dar formato al texto.
fr: Utilisez les icônes de la barre d'outils qui s'affiche pour mettre en forme votre texte.
nl: Gebruik de pictogramman uit de toolbar die verschijnt om uw tekst te formateren.

source: Toolbar overview
de: Übersicht über Symbolleiste
es: Visión general de la barra de herramientas
fr: Vue d'ensemble de la barre d'outils
nl: Ovezicht van de toolbar

source: Annotation
de: Anmerkung
es: Anotación
nl: Aantekening

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Headings
de: Überschriften
es: Encabezados
fr: Titres

source: You can choose from three levels of headings:
de: Sie können zwischen drei Überschriftenebenen wählen:
es: Puede elegir entre 3 niveles de encabezado:
fr: Vous pouvez choisir parmi les trois niveaux de titres suivants :
nl: U kunt kiezen uit drie niveaus van headings:

source: Heading 1 (H1)
de: Überschrift 1 (H1)
es: Encabezado 1 (H1)
fr: Titre 1 (T1)

source: Heading 2 (H2)
de: Überschrift 2 (H2)
es: Encabezado 2 (H2)
fr: Titre 2 (T2)

source: Heading 3 (H3)
de: Überschrift 3 (H3)
es: Encabezado 3 (H3)
fr: Titre 3 (T3)

source: Paragraph
de: Absatz
es: Párrafo
fr: Paragraphe
nl: Paragraaf

source: Adds regular body text.
de: Fügt normalen Text hinzu.
es: Añade texto de cuerpo normal.
fr: Ajoute un corps de texte normal.
nl: Voegt regelmatige bodytekst toe.

source: Bold
de: Fett
es: Negrita
fr: Gras
nl: Vet

source: Makes the text bold.
de: Der Text wird fett dargestellt.
es: Establece el texto en negrita.
fr: Met le texte en gras.
nl: Zet de tekst in vet.

source: Italic
de: Kursiv
es: Cursiva
fr: Italique
nl: Cursief

source: Italicizes the text.
de: Der Text wird kursiv dargestellt.
es: Establece el texto en cursiva.
fr: Met le texte en italique.
nl: Zet de tekst in cursief.

source: Highlight
de: Hervorheben
es: Resaltar
fr: Surlignage
nl: Beklemtonen

source: Highlights the text.
de: Der Text wird hervorgehoben.
es: Resalta el texto.
fr: Surligne le texte.
nl: Beklemtoont de tekst.

source: Ordered list
de: Geordnete Liste
es: Lista ordenada
fr: Liste triée
nl: Geordende lijst

source: Creates an ordered list from the selected text.
de: Erzeugt eine geordnete Liste aus dem markierten Text.
es: Crea una lista ordenada del texto seleccionado.
fr: Crée une liste triée à partir du texte sélectionné.
nl: Maakt een geordende lijst van de geselecteerde tekst.

source: Unordered list
de: Ungeordnete Liste
es: Lista desordenada
fr: Liste non triée
nl: Niet-geordende lijst

source: Creates an unordered list from the selected text.
de: Erzeugt eine ungeordnete Liste aus dem markierten Text.
es: Crea una lista desordenada del texto seleccionado.
fr: Crée une liste non triée à partir du texte sélectionné.
nl: Maakt een niet-geordende lijst van de geselecteerde tekst.

source: Undo and redo
de: Rückgängig machen und wiederherstellen
es: Deshacer y rehacer
fr: Annuler et refaire
nl: Ongedaan maken en opnieuw doen

source: Undoes and redoes the last actions that you performed.
de: Macht die zuletzt durchgeführten Aktionen rückgängig und stellt sie wieder her.
es: Deshace y rehace las últimas acciones que se han llevado a cabo.
fr: Annule et refait les dernières actions que vous avez effectuées.
nl: Maakt de laatste acties die u hebt uitgevoerd ongedaan of voert deze opnieuw uit.
