Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/configuring_blocks/refine-data.po
Languages: de, es, fr, nl

source: Refining data
de: Daten verfeinern
es: Refinar datos
fr: Affiner des données
nl: Data verfijnen

source: Conditions refine the data shown on a chart or a KPI. They are the equivalent of refinements in widgets, but you can preview instantly the refined data in the preview pane of the Studio.
de: Mit Bedingungen werden die in einem Diagramm oder einer KPI angezeigten Daten verfeinert. Sie sind das Äquivalent zu den Verfeinerungen in Widgets. Sie können die verfeinerten Daten jedoch sofort im Vorschaufenster des Studios ansehen.
es: Las condiciones refinan los datos que se muestran en un gráfico o un KPI. Equivalen a los refinamientos de los widgets, pero se puede obtener una vista previa instantánea de los datos refinados en el panel de vista previa de Studio.
fr: Des conditions affinent les données affichées sur un graphique ou un KPI. Elles sont équivalentes aux affinements dans les widgets, mais vous pouvez obtenir un aperçu instantané des données affinées dans le volet d'aperçu du studio.
nl: Voorwaarden verfijnen de data die getoond worden op een grafiek of een KPI. Ze zijn gelijkwaardig aan verfijningen in widgets, maar u kunt onmiddellijk een voorbeeldweergave krijgen van de verfijnde in het voorbeeldweergavevenster van de Studio.

source: When editing a page, you can apply a condition to a chart or a KPI using the Studio.
de: Wenn Sie eine Seite bearbeiten, können Sie mit dem Studio eine Bedingung auf ein Diagramm oder eine KPI anwenden.
es: Al editar una página, puede aplicar una condición a un gráfico o un KPI por medio de Studio.
fr: Lorsque vous modifiez une page, vous pouvez appliquer une condition à un graphique ou à un KPI à l'aide du studio.
nl: Wanneer een pagina wordt bewerkt, kunt u een voorwaarde op een grafiek of een KPI toepassen door gebruik te maken van de Studio.

source: Combining conditions
de: Bedingungen kombinieren
es: Combinar condiciones
fr: Associer des conditions
nl: Voorwaarden combineren

source: You can use one or more conditions. By default, conditions are combined using an "AND" operator: it is then true if all conditions are met.
de: Sie können eine oder mehrere Bedingungen verwenden. Standardmäßig werden die Bedingungen mit einem "AND"-Operator kombiniert: Wenn alle Bedingungen erfüllt sind, ist es wahr.
es: Puede usar una o más condiciones. De forma predeterminada, las condiciones se combinan usando un operador "AND": el resultado es verdadero si se cumplen todas las condiciones.
fr: Vous pouvez utiliser une ou plusieurs conditions. Par défaut, les conditions sont associées avec l'opérateur "AND" : toutes les conditions sont ensuite appliquées si elles sont toutes respectées.
nl: U kunt een of meerdere voorwaarden gebruiken. Standaard worden voorwaarden gecombineerd door een "AND" operator te gebruiken: het is dan waar wanneer aan alle voorwaarden is voldaan.

source: You can also combine conditions using the "OR" operator: it is then true if any conditions are met.
de: Sie können Bedingungen auch mit dem Operator "OR" kombinieren: Wenn alle Bedingungen erfüllt sind, ist es wahr.
es: También puede combinar condiciones usando el operador "OR": el resultado es verdadero si se cumple alguna de las condiciones.
fr: Vous pouvez également associer des conditions avec l'opérateur "OR" : les conditions qui sont respectées sont ensuite appliquées.
nl: U kunt ook voorwaarden combineren door gebruik te maken van de "OR" operator. Het is dan waar wanneer aan sommige voorwaarden is voldaan.

source: You can also combine conditions using both operators. The "AND" operator has then precedence over the "OR" operator.
de: Sie können auch Bedingungen mit beiden Operatoren kombinieren. Dabei hat der Operator "AND" Vorrang vor dem Operator "OR".
es: También puede combinar condiciones usando ambos operadores. El operador "AND" tiene prioridad sobre el operador "OR".
fr: Enfin, vous pouvez aussi associer des conditions avec ces deux opérateurs. L'opérateur "AND" est prioritaire par rapport à l'opérateur "OR".
nl: U kunt ook voorwaarden combineren door beide operatoren te gebruiken. De "AND" operator heeft dan voorrang op de "OR" operator.

source: Configuring conditions
de: Bedingungen konfigurieren
es: Configurar condiciones
fr: Configurer des conditions
nl: Voorwaarden configureren

source: A condition includes the following elements:
de: Eine Bedingung umfasst die folgenden Elemente:
es: Una condición incluye los elementos siguientes:
fr: Une condition inclut les éléments suivants :
nl: Een voorwaarde omvat de volgende elementen:

source: One field from the input dataset.
de: Ein Feld aus dem Eingabedatensatz.
es: Un campo del conjunto de datos de entrada.
fr: Un champ dans le jeu de données d'entrée.
nl: EÃ©n veld uit de input dataset.

source: An operator that varies according to the field type
de: Ein Operator, der je nach Feldtyp unterschiedlich ist
es: Un operador que varía según el tipo de campo.
fr: Un opérateur qui varie en fonction du type de champ.
nl: Een operator die verschilt afhankelijk van het veldtype

source: Field types
de: Feldtypen
es: Tipos de campo
fr: Types de champs
nl: Veldtypes

source: Available operators
de: Verfügbare Operatoren
es: Operadores disponibles
fr: Opérateurs disponibles
nl: Beschikbare operatoren

source: Text
es: Texto
fr: Texte
nl: Tekst

source: contains
de: enthält
es: contiene
fr: contient
nl: bevat

source: does not contain
de: enthält nicht
es: no contiene
fr: ne contient pas
nl: bevat niet

source: is empty
de: ist leer
es: está vacío
fr: est vide
nl: is leeg

source: is not empty
de: ist nicht leer
es: no está vacío
fr: n'est pas vide
nl: is niet leeg

source: Numeric
de: Numerisch
es: Numérico
fr: Numérique
nl: Numeriek

source: strictly superior to
de: eindeutig höher als
es: estrictamente superior a
fr: strictement supérieur à
nl: strikt groter dan

source: strictly inferior to
de: eindeutig niedriger als
es: estrictamente inferior a
fr: strictement inférieur à
nl: strikt kleiner dan

source: equal to
de: gleich
es: igual a
fr: égal à
nl: gelijk aan

source: superior or equal to
de: höher oder gleich als
es: superior o igual a
fr: supérieur ou égal à
nl: groter dan of gelijk aan

source: inferior or equal to
de: niedriger oder gleich als
es: inferior o igual a
fr: inférieur ou égal à
nl: kleiner dan of gelijk aan

source: Date
de: Datum
es: Fecha
nl: Datum

source: strictly prior to
de: eindeutig vor
es: estrictamente anterior a
fr: strictement antérieur à
nl: strikt voorafgaand aan

source: strictly post
de: eindeutig nach
es: estrictamente posterior
fr: strictement ultérieur à
nl: strikt na

source: prior or equal to
de: vor oder gleich
es: anterior o igual a
fr: antérieur ou égal à
nl: voorafgaand aan of gelijk aan

source: post or equal to
de: nach oder gleich
es: posterior o igual a
fr: ultérieur ou égal à
nl: na of gelijk aan

source: One or more values.
de: Ein oder mehr Werte.
es: Uno o varios valores.
fr: Une ou plusieurs valeurs.
nl: Een of meerdere waarden.

source: Managing conditions
de: Bedingungen verwalten
es: Gestionar condiciones
fr: Gérer des conditions
nl: Voorwaarden beheren

source: Adding a condition
de: Eine Bedingung hinzufügen
es: Añadir una condición
fr: Ajouter une condition
nl: Een voorwaarde toevoegen

source: When editing a chart or a KPI, you configure the visualization styles. At this step, you can add a condition to refine the data shown to the audience:
de: Bei der Bearbeitung eines Diagramms oder einer KPI können Sie die Visualisierungsstile konfigurieren. In diesem Schritt können Sie eine Bedingung hinzufügen, um die Daten zu verfeinern, die den Besuchern angezeigt werden:
es: Al editar un gráfico o un KPI, se configuran los estilos de visualización. En este paso, puede añadir una condición para refinar los datos que se muestran al público:
fr: Lorsque vous modifiez un graphique ou un KPI, vous configurez les styles de visualisations. À cette étape, vous pouvez ajouter une condition pour affiner les données affichées au public :
nl: Wanneer een grafiek of een KPI wordt bewerkt, configureert u de weergavestijlen. Bij deze stap kunt u een voorwaarde toevoegen om de data die getoond worden aan het publiek te verfijnen:

source: Click **Add a condition**.
de: Klicken Sie auf **Eine Bedingung hinzufügen**.
es: Haga clic en **Añadir una condición**.
fr: Cliquez sur **Ajouter une condition**.
nl: Klik op **Een voorwaarde toevoegen**.

source: Select the field from the input dataset.
de: Wählen Sie das Feld aus dem Eingabedatensatz aus.
es: Seleccione el campo del conjunto de datos de entrada.
fr: Sélectionnez le champ dans le jeu de données d'entrée.
nl: Selecteer het veld uit de input dataset.

source: Select an operator.
de: Wählen Sie einen Operator.
es: Seleccione un operador.
fr: Sélectionnez un opérateur.
nl: Selecteer een operator.

source: Add a value.
de: Fügen Sie einen Wert hinzu.
es: Añada un valor.
fr: Ajoutez une valeur.
nl: Voeg een waarde toe.

source: (optional) Click **+** to add another value. Values are combined using the "OR" operator.
de: (optional) Klicken Sie auf **+**, um einen weiteren Wert hinzuzufügen. Die Werte werden mit dem Operator "OR" kombiniert.
es: (Opcional) Haga clic en **+** para añadir otro valor. Los valores se combinan con el operador "OR".
fr: (facultatif) Cliquez sur **+** pour ajouter une autre valeur. Les valeurs sont associées avec l'opérateur "OR".
nl: (optioneel) Klik op **+** om een andere waarde toe te voegen. Waarden worden gecombineerd door gebruikt te maken van de operator "OR".

source: Click **Next** to continue with the configuration.
de: Klicken Sie auf **Weiter**, um mit der Konfiguration fortzufahren.
es: Haga clic en **Siguiente** para continuar con la configuración.
fr: Cliquez sur **Suivant** pour poursuivre la configuration.
nl: Klik op **Volgende** om verder te gaan met de configuratie.

source: Deleting a condition
de: Eine Bedingung löschen
es: Suprimir una condición
fr: Supprimer une condition
nl: Een voorwaarde verwijderen

source: Once validated, a condition can be deleted or duplicated to another subset, or combined with other conditions.
de: Nach der Bestätigung kann eine Bedingung gelöscht, in einen anderen Untersatz dupliziert oder mit anderen Bedingungen kombiniert werden.
es: Una vez validada, una condición se puede suprimir o duplicar en otro subconjunto o combinar con otras condiciones.
fr: Une fois validée, une condition peut être supprimée ou dupliquée vers un autre sous-ensemble ou être combinée à d'autres conditions.
nl: Eenmaal gevalideerd, kan een voorwaarde worden verwijderd of gekopieerd naar een andere subset, of gecombineerd worden met andere voorwaarden.

source: When deleting a condition, it only applies to the selected condition. If you duplicated this condition beforehand, the duplicated conditions are not deleted.
de: Wenn Sie eine Bedingung löschen, gilt dies nur für die ausgewählte Bedingung. Wenn Sie diese Bedingung zuvor dupliziert haben, werden die duplizierten Bedingungen nicht gelöscht.
es: Al suprimir una condición, esto solo se aplica a la condición seleccionada. Si previamente ha duplicado esta condición, las condiciones duplicadas no se suprimirán.
fr: Lorsque vous supprimez une condition, cette suppression ne concerne que la condition sélectionnée. Si vous avez dupliqué cette condition au préalable, le duplicat ne sera pas supprimé.
nl: Wanneer een voorwaarde wordt verwijderd, geldt dit enkel voor de geselecteerde voorwaarde. Indien u deze voorwaarde op voorhand kopieert, worden de gekopieerde voorwaarden niet verwijderd.

source: When editing a chart or a KPI, you configure the visualization styles. At this step, you can delete a condition that you previously added:
de: Bei der Bearbeitung eines Diagramms oder einer KPI können Sie die Visualisierungsstile konfigurieren. In diesem Schritt können Sie eine Bedingung löschen, die Sie zuvor hinzugefügt haben:
es: Al editar un gráfico o un KPI, se configuran los estilos de visualización. En este paso, puede suprimir una condición añadida previamente:
fr: Lorsque vous configurez un graphique ou un KPI, vous configurez les styles de visualisations. À cette étape, vous pouvez supprimer une condition que vous avez ajoutée précédemment :
nl: Wanneer een grafiek of een KPI wordt bewerkt, configureert u de weergavestijlen. Bij deze stap kunt u een voorwaarde verwijderen die u eerder hebt toegevoegd:

source: Hover over the condition to be deleted.
de: Bewegen Sie den Mauszeiger über die zu löschende Bedingung.
es: Pase por encima de la condición que se va a suprimir.
fr: Passez le curseur sur la condition à supprimer.
nl: De voorwaarden overlopen die moeten worden verwijderd.

source: Click the bin icon.
de: Klicken Sie auf das Papierkorbsymbol
es: Haga clic en el icono de papelera.
fr: Cliquez sur l'icône de corbeille.
nl: Klik op het vuilnisbakpictogram.

source: Duplicating a condition
de: Eine Bedingung duplizieren
es: Duplicar una condición
fr: Dupliquer une condition
nl: Een voorwaarde kopiÃ«ren

source: Once you have added a condition to a subset, you can reuse it on another subset. When duplicating a condition, the condition is applied to all the subsets in the block and added at the last position available in the subset.
de: Sobald Sie eine Bedingung zu einem Untersatz hinzugefügt haben, können Sie diese in einem anderen Untersatz weiterverwenden. Wenn Sie eine Bedingung duplizieren, wird die Bedingung auf alle Untersätze im Block angewendet und an der letzten verfügbaren Position im Untersatz hinzugefügt.
es: Una vez añadida una condición a un subconjunto, puede reutilizarla en otro subconjunto. Al duplicar una condición, la condición se aplica a todos los subconjuntos del bloque y se añade a la última posición disponible en el subconjunto.
fr: Une fois que vous avez ajouté une condition à un sous-ensemble, vous pouvez la réutiliser sur un autre sous-ensemble. Lorsque vous dupliquez une condition, celle-ci est appliquée à tous les sous-ensembles du bloc et ajoutée à la dernière position disponible dans le sous-ensemble.
nl: Eenmaal u een voorwaarde aan een subset hebt toegevoegd, kunt u deze gebruiken voor een andere subset. Wanneer de voorwaarde wordt gekopieerd, wordt de voorwaarde toegepast op alle subsets in dit blok en toegevoegd aan de laatste positie die beschikbaar is in de subset.

source: Reusing a condition creates a copy of the condition. If you later edit the condition, it will not impact the duplicated conditions.
de: Durch die Weiterverwendung einer Bedingung wird eine Kopie der Bedingung erstellt. Wenn Sie die Bedingung später bearbeiten, hat dies keine Auswirkungen auf die duplizierten Bedingungen.
es: Al reutilizar una condición se crea una copia de la condición. Si más adelante se edita la condición, no afectará a las condiciones duplicadas.
fr: Le fait de réutiliser une condition crée une copie de la condition. Si vous modifiez la condition ultérieurement, cela n'aura pas d'incidence sur les conditions dupliquées.
nl: Bij het hergebruiken van een voorwaarde wordt een kopie van de voorwaarde aangemaakt. Indien u de voorwaarde later bewerkt, zal dit geen impact hebben op de gekopieerde voorwaarden.
