Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/connectors/csv.po
Languages: it

source: CSV connector
it: Connettore CSV

source: A CSV file is a list of fields separated by a fixed separator (usually a ',' in English and a ';' in French).
it: Un file CSV è un elenco di campi separati da un delimitatore stabilito, solitamente ',' o ';'.

source: File extensions
it: Estensioni dei file

source: The following extensions are recognized: .csv, .tsv, .txt, .dat
it: Sono supportate le seguenti estensioni: .csv, .tsv, .txt, .dat.

source: Configuration
it: Configurazione

source: Name
it: Nome

source: Description
it: Descrizione

source: Values
it: Valori

source: Encoding
it: Codifica

source: The file encoding
it: Codifica del file.

source: OpenDataSoft uses an heuristic to guess the encoding and sometimes the try is incorrect.
it: L'euristica utilizzata da OpenDataSoft permette di individuare la codifica. Tuttavia a volte i risultati possono non essere corretti.

source: The encoding can be manually set, we provide a list of common value (csv generated on common software on different OS).
it: La codifica può essere impostata manualmente sulla base di un elenco di valori comuni (file CSV generato da software diffusi su diversi sistemi operativi).

source: Any alias from `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_ can be used.
it: È possibile utilizzare qualsiasi alias `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_.

source: Separator
it: Separatore

source: The fixed separator. Must be one character.
it: Delimitatore fisso. Deve essere costituito da un carattere.

source: Correct values are usually ``';'``, ``','``, ``' '``, ``'\t'``.
it: Valori corretti sono generalmente ``';'``, ``','``, ``' '``, ``'\t'``.

source: Escape character
it: Carattere di escape

source: If a separator is found right after an escape character, it will not be considered a separator.
it: Aggiungendo il carattere di escape subito prima di un separatore, questo non viene considerato come tale.

source: ``#`` or ``\``
it: ``#`` o ``\``

source: Double quote
it: Virgolette

source: Fields values are enclosed in double quotes.
it: I valori dei campi sono racchiusi tra virgolette doppie.

source: ``true`` or ``false``
it: ``true`` o ``false``

source: Headers
it: Header

source: Column titles will be used as field names.
it: I titoli delle colonne vengono utilizzati come nomi di campi.

source: First line number
it: Numero della prima riga

source: Skip a fix number of lines at the beginning of the file
it: Numero di righe prestabilito che viene omesso all'inizio del file.

source: number
it: numero
