Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/connectors/geojson.po
Languages: de, fr, it, nl

source: GeoJSON connector
de: GeoJSON-Konnektor
fr: Connecteur GeoJSON
it: Connettore GeoJSON

source: A GeoJSON file as defined by the ``RFC 7946``, one simple GeoJSON is:
de: Eine GeoJSON-Datei entsprechend der Definition ``RFC 7946``, eine einfache GeoJSON ist:
fr: Un fichier GeoJSON tel que défini par la norme ``RFC 7946``, un GeoJSON simple est :
it: Di seguito Ã¨ riportato un semplice file GeoJSON, secondo la definizione fornita nello standard ``RFC 7946``:
nl: Een GeoJSON-bestand zoals gedefinieerd door de ``RFC 7946``, één gewone GeoJSON is:

source: You can find more examples on `GeoJSON.org <http://geojson.org/geojson-spec.html#feature-collection-objects>`_
de: Weitere Beispiele finden Sie auf `GeoJSON.org <http://geojson.org/geojson-spec.html#feature-collection-objects>`_
fr: Vous trouverez davantage d'exemples sur `GeoJSON.org <http://geojson.org/geojson-spec.html#feature-collection-objects>`_
it: Per ulteriori esempi, puoi consultare il sito `GeoJSON.org <http://geojson.org/geojson-spec.html#feature-collection-objects>`_.
nl: U kan meer voorbeelden terugvinden op `GeoJSON.org <http://geojson.org/geojson-spec.html#feature-collection-objects>`_

source: File extensions
de: Dateierweiterungen
fr: Extensions de fichier
it: Estensioni dei file
nl: Bestandextensies

source: The following extensions are recognized: .geojson and .json.
de: Folgende Dateiendungen werden erkannt: .geojson und .json.
fr: Les extensions suivantes sont reconnues : .geojson and .json.
it: Sono supportate le estensioni .geojson e .json.
nl: De volgende extensies worden herkend: .geojson en .json.

source: Configuration
de: Konfiguration
it: Configurazione
nl: Configuratie

source: Name
fr: Nom
it: Nome
nl: Naam

source: Description
de: Beschreibung
it: Descrizione
nl: Omschrijving

source: Values
de: Werte
fr: Valeurs
it: Valori
nl: Waarden

source: Spatial reference (EPSG code)
de: RÃ¤umlicher Bezug (EPSG-Code)
fr: Référence spatiale (code EPSG)
it: Riferimento spaziale (codice EPSG)
nl: Ruimtelijke referentie (EPSG-code)

source: The EPSG code of the geographical data
de: Der EPSG-Code der geografischen Daten
fr: Code EPSG des données géographiques
it: Codice EPSG dei dati geografici
nl: De EPSG-code van de geografische data

source: One EPSG code
de: Ein EPSG-Code
fr: Un code EPSG
it: Un codice EPSG
nl: Eén EPSG-code
