Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/connectors/jcdecaux.po
Languages: de, fr, it

source: JCDecaux bikes connector
de: JCDecaux Cyclocity-Konnektor
fr: Connecteur de vélo JCDecaux
it: Connettore per biciclette JCDecaux

source: JCDecaux bikes stations states can be retrieved by this connector. It creates records for one or more contracts containing the name of the station, the capabilities, the number of bikes available, the number of slots available.
de: Mit diesem Konnektor können Sie den Status von JCDecaux Cyclocity-Stationen abfragen. Er erstellt Einträge für einen oder mehrere Verträge mit dem Namen der Station, dem Leistungspotenzial, der Anzahl verfügbarer Fahrräder sowie der Anzahl der verfügbaren Stellplätze.
fr: Les états des stations de vélo JCDecaux peuvent être récupérés par ce connecteur. Il crée des enregistrements pour un ou plusieurs contrats contenant le nom de la station, les capacités, le nombre de vélos disponibles, le nombre de points d'attache disponibles.
it: Questo connettore permette di recuperare lo stato delle stazioni di noleggio biciclette JCDecaux, creando record per uno o più contratti contenenti: il nome della stazione, la capacità, il numero di biciclette disponibili e il numero di postazioni disponibili.

source: Configuration
de: Konfiguration
it: Configurazione

source: Description
de: Beschreibung
it: Descrizione

source: Values
de: Werte
fr: Valeurs
it: Valori

source: contracts
de: Verträge

source: The list of contracts on which filter the data
de: Die Liste der nach Daten gefilterten Verträge
fr: Liste des contrats sur lesquels les données doivent être filtrées
it: Elenco dei contratti su cui filtrare i dati

source: Values can be found on the official `documentation <https://developer.jcdecaux.com/#/opendata/vls?page=dynamic>`_
de: Die Werte finden Sie in der offiziellen `Dokumentation <https://developer.jcdecaux.com/#/opendata/vls?page=dynamic>`_.
fr: Les valeurs sont disponibles dans la `documentation officielle <https://developer.jcdecaux.com/#/opendata/vls?page=dynamic>`_
it: I valori sono disponibili nella `documentazione <https://developer.jcdecaux.com/#/opendata/vls?page=dynamic>`_ ufficiale.

source: The API key of your account on the JCDecaux API
de: Der API-Schlüssel Ihres Kontos bei der JCDecaux API
fr: Clé d'API de votre compte sur l'API JCDecaux
it: Chiave API del tuo account sull'API JCDecaux

source: Creation
de: Erstellung
fr: Création
it: Creazione

source: Enter *jcdecaux://bicycles/data* in the URL box.
de: Geben Sie in die URL-Box *jcdecaux://bicycles/data* ein.
fr: Saisissez *jcdecaux://bicycles/data* dans le champ URL.
it: Inserisci *jcdecaux://bicycles/data* nella casella dell'URL.

source: The JCDecaux Bike Stations datasets is available on our `data portal <https://data.opendatasoft.com/explore/dataset/jcdecaux_bike_data@public/>`_. You can easily federate it to use the data.
de: Der Datensatz für die JCDecaux Cyclocity-Stationen ist auf Ihrem `Datenportal <https://data.opendatasoft.com/explore/dataset/jcdecaux_bike_data@public/>`_ verfügbar. Zur Nutzung der Daten können Sie ihn einfach vereinen.
fr: Les jeux de données des stations de vélo JCDecaux sont disponibles sur notre `portail des données <https://data.opendatasoft.com/explore/dataset/jcdecaux_bike_data@public/>`_. Vous pouvez le fédérer facilement pour en utiliser les données.
it: I dataset relativi alle stazioni di noleggio biciclette JCDecaux sono disponibili sul `portale dei dati OpenDataSoft <https://data.opendatasoft.com/explore/dataset/jcdecaux_bike_data@public/>`_, che puoi facilmente federare per utilizzarne i dati.

source: Name
fr: Nom
it: Nome
