Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/connectors/mapinfo.po
Languages: fr

source: MapInfo connector
fr: Connecteur MapInfo

source: A MapInfo ZIP archive, containing the following files:
fr: Archive ZIP MapInfo, contenant les fichiers suivants :

source: ``.mid`` Stores the attribute data
fr: ``.mid`` Stocke les données d'attribut

source: ``.mif`` Stores the structure and the geometries
fr: ``.mif`` Stocke la structure et les géométries

source: or
fr: ou

source: ``.map`` Stores the graphic and geographic information needed to display each vector feature on a map
fr: ``.map`` Stocke les informations graphiques et géométriques nécessaires à l'affichage de chaque caractéristique de vecteur sur une carte

source: ``.tab`` Store the link between all other files and holds information about the type of data set file
fr: ``.tab`` Stocke le lien entre tous les autres fichiers et contient les informations relatives au type de fichier du jeu de données

source: ``.id`` Stores information linking graphic data to the database information
fr: ``.id`` Stocke les informations reliant les données graphiques aux informations de la base de données

source: ``.dat`` Stores the attribute data
fr: ``.dat`` Stocke les données d'attribut

source: The ZIP archive must be flat, all files must be at the root path (not sub directory).
fr: L'archive ZIP doit être plate, tous les fichiers doivent se trouver dans le dossier racine (aucun sous-répertoire).
