Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/connectors/osm.po
Languages: de, fr, it, nl

source: OSM connector
de: OSM-Konnektor
fr: Connecteur OSM
it: Connettore OSM

source: The OpenStreetMap connector extracts data from OSM archives. The export can be compressed.
de: Der OpenStreetMap-Konnektor extrahiert Daten aus den OSM-Archiven. Der Export kann komprimiert werden.
fr: Le connecteur OpenStreeMap extrait les données des archives OSM. L'export peut être compressé.
it: Il connettore OpenStreetMap estrae i dati dagli archivi OSM, anche in formato compresso.
nl: De OpenStreetMap connector haalt data uit OSM-archieven. De export kan worden gecomprimeerd.

source: A reliable server to download extract is `Geofabrik <http://download.geofabrik.de>`_. It provides export for different parts of the world.
de: Ein zuverl채ssiger Server zum Download von Ausz체gen ist `Geofabrik <http://download.geofabrik.de>`_. Er stellt Exporte f체r verschiedene Teile der Welt zur Verf체gung.
fr: Le site `Geofabrik <http://download.geofabrik.de>`_ est un serveur de confiance à partir duquel vous pouvez télécharger un exemple. Il propose des exports de différentes parties du monde.
it: Un server sicuro per eseguire il download dell'estratto Ã¨ `Geofabrik <http://download.geofabrik.de>`_, che fornisce l'esportazione per diverse zone del mondo.
nl: Een betrouwbare server om te downloaden is `Geofabrik <http://download.geofabrik.de>`_. Deze voorziet export voor verschillende delen van de wereld.

source: File extensions
de: Dateierweiterungen
fr: Extensions de fichier
it: Estensioni dei file
nl: Bestandextensies

source: The following extensions are recognized: .osm and .xml.
de: Folgende Dateiendungen werden erkannt: .osm und .xml.
fr: Les extensions suivantes sont reconnues : .osm et .xml.
it: Sono supportate le estensioni .osm e .xml.
nl: De volgende extensies worden herkend: .osm en .xml.

source: Configuration
de: Konfiguration
it: Configurazione
nl: Configuratie

source: Name
fr: Nom
it: Nome
nl: Naam

source: Description
de: Beschreibung
it: Descrizione
nl: Omschrijving

source: Keep only amenities
de: Behalten Sie nur, was Sie brauchen
fr: Conserver uniquement les équipements
it: Conserva solo i servizi
nl: Behoud enkel overheidsdiensten

source: Filter the export to only keep node and way with the tag ``amenity``
de: Filtern Sie den Export, um nur 'node' und 'way mit dem Tag ``amenity`` zu behalten
fr: Filtre l'export pour conserver uniquement les nœuds et les chemins présentant le tag ``équipement``
it: Filtra l'esportazione in modo da conservare solo i nodi e le vie con il tag ``amenity`` (servizio).
nl: Filter de export om enkel "knoop" en "weg" te behouden bij de tag "overheidsdienst"

source: Tags
it: Tag

source: The tags to extract from the node or way
de: Die zu extrahierenden Tags aus Punkt oder Weg (node or way)
fr: Tags à extraire du nœud ou du chemin
it: Tag da estrarre dal nodo o dalla via.
nl: De tags om uit de "knoop" of "weg" te halen

source: Relation tags
de: Bezogene Tags
fr: Tags de relation
it: Tag di relazione
nl: Relatietags

source: The tags to extract from the attached relation
de: Die zu extrahierenden Tags aus dem entsprechenden Bezug
fr: Tags à extraire de la relation jointe
it: Tag da estrarre dalla relazione allegata.
nl: De tags om uit de verbonden relatie te halen
