Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/connectors/shapefile.po
Languages: de, it

source: ShapeFile connector
de: ShapeFile-Konnektor
it: Connettore ShapeFile

source: The Shapefile connector extracts data from a ZIP archive containing the following files:
de: Der ShapeFile-Konnektor extrahiert Daten von einem ZIP-Archiv, das folgende Dateien enthält:
it: Il connettore Shapefile estrae i dati da un archivio ZIP contenente i seguenti file:

source: ``.shp`` shape format; the feature geometry itself
de: ``.shp`` Formenformat; die Funktionsgeometrie an sich
it: formato di forma ``.shp``, con la geometria dell'entità;

source: ``.dbf`` attribute format; columnar attributes for each shape
de: ``.dbf`` Attributformat; Säulenattribute für jede Form
it: formato attributo ``.dbf``, con gli attributi delle colonne per ogni forma;

source: ``.prj`` projection format; the coordinate system and projection information, a plain text file describing the projection using well-known text format
de: ``.prj`` Projektionsformat; die Koordinatensystem- und Projektionsinformationen, eine mittels wohlbekannter Textformate die Projektion beschreibende Nur-Text-Datei
it: formato proiezione ``.prj``, con il sistema di coordinate, le informazioni di proiezione e un file di testo semplice che descrive la proiezione utilizzando un formato di testo molto diffuso;

source: ``.shx`` shape index format
de: ``.shx`` Formenindexformat
it: formato di indice della forma ``.shx``.

source: The ZIP archive must be flat, all files must be at the root path (not sub directory).
de: Das ZIP-Archiv muss flach sein, alle Dateien müssen unter dem Stammpfad liegen (kein Unterverzeichnis).
it: L'archivio ZIP deve essere flat, cioè tutti i file devono trovarsi a livello radice, senza sub-directory.

source: Configuration
de: Konfiguration
it: Configurazione

source: Name
it: Nome

source: Description
de: Beschreibung
it: Descrizione

source: Encoding
de: Codierung
it: Codifica

source: The encoding can be manually set, we provide a list of common value.
de: Die Codierung kann manuell festgelegt werden. Wir stellen eine Liste gängiger Werte bereit.
it: Il valore della codifica può essere impostato manualmente. È disponibile un elenco dei valori più comuni.

source: Any alias from `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_ can be used.
de: Verwendet werden kann ein beliebiger Alias von `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_.
it: È possibile utilizzare qualsiasi alias `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_.
