Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/connectors/xml.po
Languages: es

source: XML connector
es: Conector de XML

source: This connector can create a dataset from an XML document.
es: Este conector puede crear un conjunto de datos a partir de un documento XML.

source: The provided document can have tags with arbitrary names but there are some constraints on the structure :
es: El documento proporcionado puede tener etiquetas con nombres arbitrarios, pero hay algunas restricciones en la estructura:

source: it must contain an array of objects, each object being used to create a record in the dataset,
es: Debe contener una matriz de objetos, cada uno de los cuales se utiliza para crear un registro en el conjunto de datos.

source: the array can be anywhere in the XML document and can have any name,
es: La matriz puede estar en cualquier ubicación del documento XML y puede tener cualquier nombre.

source: the objects must be flat, which means all their attributes must be at the root of the object,
es: Los objetos deben ser planos, lo que significa que todos sus atributos deben estar en la raíz del objeto.

source: the first few objects must have all the attributes present in the file so the dataset's columns are correctly discovered.
es: Los primeros objetos deben tener todos los atributos presentes en el archivo a fin de descubrir correctamente las columnas del conjunto de datos.

source: Configuration
es: Configuración

source: Name
es: Nombre

source: Description
es: Descripción

source: Values
es: Valores

source: Object path
es: Ruta de objeto

source: Path to the first object in the XML document
es: Ruta del primer objeto en el documento XML

source: e.g. /{namespace}arrayTag/objectTag
es: P. ej. /{Espacio_nombres}Etiqueta_matriz/Etiqueta_objeto

source: Example file
es: Archivo de ejemplo

source: In this example:
es: En este ejemplo:

source: the root tag of the records is "shoppingList" (line 2), and the list of objects is in "basket" (line 5),
es: La etiqueta raíz de los registros es "shoppingList" (línea 2), y la lista de objetos está en "basket" (línea 5).

source: the tag of the objects is "item",
es: La etiqueta de los objetos es "item".

source: each object has a "name" and a "quantity" attribute.
es: Cada uno de los objetos tiene un atributo "name" y otro "quantity".

source: The object path is "/shoppingList/basket/item".
es: La ruta del objeto es "/shoppingList/basket/item".

source: Please note that tags **id**, **description**, **itemCount** and **totalQuantity** (tag names are arbitrary) will be ignored because they are not in any object.
es: Tenga en cuenta que las etiquetas **id**, **description**, **itemCount** y **totalQuantity** (los nombres de etiquetas son arbitrarios) se omitirán porque no están en ningún objeto.
