Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/manage_domain/monitoring/analyzing_domain_activity.po
Languages: fr

source: Analyzing domain activity
fr: Analyser l'activité d'un domaine

source: The activity log allows the domain administrator to monitor domain configuration activity.
fr: Le journal d'activité permet à l'administrateur du domaine de surveiller l'activité sur son domaine.

source: To access the activity log, simply go to the *Analytics > Backoffice* page.
fr: Pour accéder au journal d'activité, allez sur la page *Statistiques > Backoffice*.

source: As in the API monitoring page, you can access the full activity log dataset by hitting the upper right link **See more**.
fr: Comme sur la page de monitoring d'API, vous pouvez accéder à l'intégralité du journal d'activité en cliquant sur le lien **Voir plus** en haut à droite.

source: The activity log dataset contains the following fields.
fr: Le journal d'activité contient les champs suivants.

source: Field name
fr: Nom du champ

source: Action timestamp
fr: Date et heure de l'action

source: Id of the dataset if the action is relative to a specific dataset
fr: Identifiant du jeu de données si l'action est relative à un jeu de données spécifique

source: Identifier of the event owner
fr: Identifiant de l'utilisateur ayant fait l'action

source: Action name (one of **publish_dataset**, **add_dataset**, **edit_dataset**, **delete_dataset**)
fr: Nom de l'action (valeurs possibles: **publish_dataset**, **add_dataset**, **edit_dataset**, **delete_dataset**)
