Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_account/05_managing_saved_visualizations/managing_saved_visualizations.po
Languages: de, es, fr, nl

source: Managing saved visualizations
de: Gespeicherte Visualisierungen verwalten
es: Administrar las visualizaciones guardadas
fr: Gérer les visualisations sauvegardées
nl: Opgeslagen weergaven beheren

source: From the Visualizations tab, authenticated users have the possibility to see the list of visualizations created with either the Map Builder or the Chart Builder and that they have saved.
de: Über die Registerkarte Visualisierungen können authentifizierte Benutzer auf eine Liste mit Visualisierungen zugreifen, die mit dem Kartenersteller oder dem Diagrammersteller angelegt und gespeichert wurden.
es: Desde la ficha Visualizaciones, los usuarios autenticados tienen la posibilidad de ver la lista de visualizaciones creadas con Compilador de mapas o Compilador de gráficos y las que han guardado.
fr: Depuis l'onglet Visualisations, les utilisateurs authentifiés ont la possibilité de voir la liste des visualisations sauvegardées qu'ils ont créées avec l'Éditeur de cartes ou l'Éditeur de graphes.

source: All saved visualizations are listed in a table which contains 3 columns.
de: Alle gespeicherten Visualisierungen werden in einer Tabelle mit 3 Spalten aufgelistet.
es: Todas las visualizaciones guardadas se listan en una tabla que contiene tres columnas.
fr: Toutes les visualisations sauvegardées sont listées dans un tableau à 3 colonnes.

source: The Visualization column contains the name of the visualization. The name is preceded by an icon that indicates whether the visualization is a map (|icon-map|) or a chart (|icon-chart|).
de: Die Spalte "Visualisierung" enthält den Namen der Visualisierung. Dem Namen ist ein Symbol vorangestellt, das angibt, ob es sich bei der Visualisierung um eine Karte (|icon-map|) oder ein Diagramm (|icon-chart|) handelt.
es: La columna Visualización contiene el nombre de la visualización. El nombre va precedido de un icono que indica si la visualización es un mapa (|icon-map|) o un gráfico (|icon-chart|).
fr: La colonne Visualisation contient le nom des visualisations, précédé d'une icône indiquant s'il s'agit d'une carte (|icon-map|) ou d'un graphe (|icon-chart|).
nl: In de kolom Weergave staat de naam van de weergave. De naam wordt voorafgegaan door een pictogram dat aangeeft of de weergave een kaart (|icon-map|) of een grafiek (|icon-chart|) is.

source: The Last modification column contains the date of last modification of the visualization.
de: Die Spalte "Letzte Änderung" enthält das Datum der letzten Änderung der Visualisierung.
es: La columna Última modificación contiene la fecha de la última modificación de la visualización.
fr: La colonne Dernière modification contient la date de dernière modification de la visualisation.

source: The last column contains a |icon-delete| button to delete a saved visualization.
de: Die letzte Spalte enthält den Button |icon-delete| zum Löschen einer gespeicherten Visualisierung.
es: La última columna contiene un botón |icon-delete| para suprimir una visualización guardada.
fr: La dernière colonne contient un bouton |icon-delete| permettant de supprimer une visualisation sauvegardée.
nl: In de laatste kolom staat een knop |icon-delete| om een opgeslagen weergave te verwijderen.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Use the search bar above the table to search a specific visualization instead of scrolling down that table.
de: Verwenden Sie die Suchleiste über der Tabelle, um eine bestimmte Visualisierung zu suchen anstatt durch die Tabelle zu scrollen.
es: Utilice la barra de búsqueda situada encima de la tabla para buscar una visualización específica sin necesidad de desplazarse hacia abajo por la tabla.
fr: Utilisez la barre de recherche située au-dessus du tableau pour chercher une visualisation précise au lieu de faire défiler le tableau vers le bas.

source: Editing a saved visualization
de: Eine gespeicherte Visualisierung bearbeiten
es: Editar una visualización guardada
fr: Éditer une visualisation sauvegardée
nl: Een opgeslagen weergave bewerken

source: In the Visualization column of the saved visualizations table, click on the name of the visualization to edit.
de: Klicken Sie in der Spalte "Visualisierung" der Tabelle mit den gespeicherten Visualisierungen auf den Namen der zu bearbeitenden Visualisierung.
es: En la columna Visualización de la tabla de visualizaciones guardadas, haga clic en el nombre de la visualización para editarla.
fr: Dans la colonne Visualisation du tableau de visualisations sauvegardées, cliquez sur le nom de la visualisation choisie pour la modifier.
nl: Klik in de kolom Weergave van de tabel met opgeslagen weergaven op de naam van de weergave die u wilt bewerken.

source: Edit the visualization in the Map Builder or the Chart Builder.
de: Bearbeiten Sie die Visualisierung mit dem Kartenersteller oder Diagrammersteller.
es: Edite la visualización en Compilador de mapas o Compilador de gráficos.
fr: Éditez la visualisation dans l'Éditeur de cartes ou dans l'Éditeur de graphes.
nl: Bewerk de weergave in de Map Builder of de Chart Builder.

source: Save the visualization again. The last modification date in the saved visualizations table automatically updates.
de: Speichern Sie die Visualisierung erneut. Das letzte Änderungsdatum in der Tabelle mit den gespeicherten Visualisierungen wird automatisch aktualisiert.
es: Vuelva a guardar la visualización. Se actualiza automáticamente la fecha de la última modificación en la tabla de visualizaciones guardadas.
fr: Sauvegardez de nouveau la visualisation. La date de dernière modification apparaissant dans le tableau des visualisations sauvegardées se met automatiquement à jour.
nl: Sla de weergave opnieuw op. De datum van laatste wijziging in de tabel met opgeslagen weergaven wordt automatisch bijgewerkt.

source: Deleting a saved visualization
de: Eine gespeicherte Visualisierung löschen
es: Suprimir una visualización guardada
fr: Supprimer une visualisation sauvegardée
nl: Een opgeslagen weergave verwijderen

source: In the last column of the saved visualizations table, click on the |icon-delete| button of the visualization to delete. A confirmation window appears.
de: Klicken Sie in der letzten Spalte der Tabelle mit den gespeicherten Visualisierungen auf den Button |icon-delete|, um die entsprechende Visualisierung zu löschen. Es wird ein Bestätigungsfenster angezeigt.
es: En la última columna de la tabla de visualizaciones guardadas, haga clic en el botón |icon-delete| de la visualización que se deba suprimir. Aparecerá una ventana de confirmación.
fr: Dans la dernière colonne du tableau des visualisations sauvegardées, cliquez sur le bouton |icon-delete| pour supprimer la visualisation. Une fenêtre de confirmation apparaît alors.
nl: Klik in de laatste kolom van de tabel met opgeslagen weergaven op de knop |icon-delete| van de weergave die u wilt verwijderen. Er verschijnt een bevestigingsvenster.

source: Click on "Yes, delete chart/map!" to confirm the deletion.
de: Klcken Sie auf "Ja, Diagramm/Karte löschen", um das Löschen zu bestätigen.
es: Haga clic en "Sí, suprimir gráfico/mapa" para confirmar la supresión.
fr: Cliquez sur "Oui, supprimer le graphe/la carte !" pour confirmer la suppression.
nl: Klik op "Ja, grafiek/kaart verwijderen!" om het verwijderen te bevestigen.

source: From the Visualizations tab, authenticated users can see the list of visualizations created with either the Map Builder or the Chart Builder and that they have saved.
nl: Vanuit de tab Weergaven hebben geauthentificeerde gebruikers de mogelijkheid om de lijst van weergaven te zien die aangemaakt zijn met ofwel de Map Builder of de Chart Builder en die ze hebben opgeslagen.

source: All saved visualizations are listed in a three-column table:
nl: Alle opgeslagen weergaven worden opgelijst in een tabel die 3 kolommen telt:

source: The Last modification column contains the date of the last modification of the visualization.
nl: In de kolom Laatste wijziging staat de datum waarop de weergave de laatste keer is gewijzigd.

source: Use the search bar above the table to search for a specific visualization instead of scrolling down that table.
nl: Gebruik de zoekbalk bovenaan de tabel om een specifieke weergave te zoeken in plaats van door naar beneden te scrollen in die tabel.
