Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/configuring_source.po
Languages: de, es, fr, nl

source: Configuring a source
de: Konfigurieren einer Quelle
es: Configurar un origen
fr: Configurer une source
nl: Een bron configureren

source: Most of the time, datasets are based on at least one source, which contains data. When this source (no matter if it is a file, an API or any other supported source type) is uploaded, the platform will automatically use a connector to be able to read and understand that source. When creating a new dataset, it is important to make sure that the preview is completely readable: it means that the source of the dataset has been well understood and configured.
de: Meistens basieren Datensätze auf mindestens einer Quelle, die Daten enthält. Wenn diese Quelle (unabhängig davon, ob es sich um eine Datei, eine API oder einen anderen unterstützten Quelltyp handelt) hochgeladen wird, verwendet die Plattform automatisch einen Konnektor, um diese Quelle zu lesen und zu verstehen. Beim Erstellen eines neuen Datensatzes ist darauf zu achten, dass die Vorschau vollständig lesbar ist: Das bedeutet, dass die Quelle des Datensatzes ordnungsgemäß verstanden und konfiguriert wurde.
es: Mayoritariamente, los conjuntos de datos se basan en al menos un origen, que contiene datos. Cuando se cargue este origen (ya sea un archivo, ya sea una API, ya sea cualquier otro tipo de origen permitido), la plataforma automáticamente utilizará un conector para poder leer y entender ese origen. Al crear un conjunto de datos nuevo, es importante asegurarse de que la vista previa es totalmente legible: esto significará que el origen del conjunto de datos se ha entendido y configurado bien.
fr: Dans la plupart des cas, les jeux de données reposent sur au moins une source de données. Quand cette source est chargée (qu'il s'agisse d'un fichier, d'une API ou d'un autre type de source pris en charge), la plateforme fait automatiquement appel à un connecteur pour pouvoir la lire et la comprendre. Lors de la création d'un jeu de données, il est essentiel de vous assurer que la totalité de l'aperçu est lisible : cela signifie que la source du jeu de données a été comprise et configurée correctement.
nl: In de meeste gevallen zijn datasets gebaseerd op minstens één bron die gegevens bevat. Wanneer deze bron (of het nu een bestand, een API of een andere brontype is dat wordt ondersteund) wordt geüploaded, zal het platform automatisch een connector gebruiken om die bron te kunnen lezen en begrijpen. Wanneer een nieuwe dataset wordt aangemaakt, is het belangrijk om ervoor te zorgen dat de voorbeeldweergave volledig leesbaar is: dit betekent dat de bron van de dataset goed begrepen en geconfigureerd is.

source: In the Opendatasoft platform, the configuration of a dataset source is done in the Source tab of the edition interface of each dataset.
de: In der Opendatasoft-Plattform wird die Datensatz-Quelle in der Registerkarte "Quelle" der Bearbeitungsoberfläche eines Datensatzes konfiguriert.
es: En la plataforma Opendatasoft, la configuración de un origen de conjuntos de datos se lleva a cabo en la ficha Origen de la interfaz de edición de cada uno de los conjuntos de datos.
fr: Dans la plateforme Opendatasoft, la configuration de la source d'un jeu de données est effectuée dans l'onglet Source de l'interface d'édition de chaque jeu de données.
nl: In het Opendatasoft-platform gebeurt de configuratie van de bron van de dataset in het tabblad Bron van de bewerkingsinterface van elke dataset;

source: The configuration options of a source entirely depend on the source type, and both the way the source has been added to the dataset and the format of that source matter to determine that type. In the table below are listed the existing and available connectors, associated with their matching source types. Check both columns, then click the link on the connector name to find out about all related configuration options.
de: Die Konfigurationsoptionen einer Quelle hängen vollständig vom Quelltyp ab. Dabei wird der Typ von der Art und Weise, wie die Quelle dem Datensatz hinzugefügt wurde, als auch vom Format dieser Quelle bestimmt. In der folgenden Tabelle sind die vorhandenen und verfügbaren Konnektoren aufgelistet, die den entsprechenden Quelltypen zugeordnet sind. Überprüfen Sie beide Spalten und klicken Sie dann auf den Link des Konnektor-Namens, um mehr über alle zugehörigen Konfigurationsoptionen zu erfahren.
es: Las opciones de configuración de un origen dependen por completo del tipo de origen, y tanto el modo en que se ha añadido el origen al conjunto de datos como el formato de ese origen son relevantes para determinar ese tipo. En la tabla siguiente se indican los conectores existentes y disponibles, asociados a sus tipos de origen correspondientes. Examine ambas columnas y, a continuación, haga clic en el vínculo del nombre de conector para consultar todas las opciones de configuración relacionadas.
fr: Les options de configuration d'une source sont totalement liées au type de source, qui est déterminé par la façon dont la source a été ajoutée au jeu de données et le format de cette source. Dans le tableau ci-dessous, vous trouverez les connecteurs disponibles et existants, associés aux types de source correspondants. Parcourez les colonnes, puis cliquez sur le lien associé au nom du connecteur pour découvrir l'ensemble de ses options de configuration.
nl: De configuratieopties van een bron hangen volledig af van het type bron en zowel de manier waarop de bron werd toegevoegd aan de dataset als het formaat van die bron zijn belangrijk om dat type te bepalen. In onderstaande tabel worden de bestaande en beschikbare connectoren opgesomd,, samen met hun overeenkomstige brontypes. Controleer beide kolommen, klik vervolgens op de naam van de connector om meer te weten te komen over alle aanverwante configuratieopties.

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description & Supported formats
de: Beschreibung & unterstützte Formate
es: Descripción y formatos permitidos
fr: Description et formats pris en charge
nl: Beschrijving & ondersteunde formaten

source: Availability
de: Verfügbarkeit
es: Disponibilidad
fr: Disponibilité
nl: Beschikbaarheid

source: Used for data extracted from an Airtable base
es: Se utiliza para datos extraídos de una base de Airtable
fr: Utilisé pour les données extraites d'une base Airtable

source: Default
de: Standard
es: Valor predeterminado
fr: Par défaut
nl: Standaard

source: Used for data extracted from an ArcGIS server
de: Wird für Daten verwendet, die von einem ArcGIS-Server extrahiert wurden
es: Se utiliza para datos extraídos de un servidor ArcGIS
fr: Utilisé pour les données extraites d'un serveur ArcGIS
nl: Gebruikt voor data die geëxtraheerd is van een ArcGIS-server

source: Used for data extracted from the US Census Bureau's API
es: Se utiliza para datos extraídos de la API de la Oficina del Censo de Estados Unidos
fr: Utilisé pour les données extraites de l'API de l'US Census Bureau

source: On demand
de: Auf Abruf
es: Bajo demanda
fr: À la demande
nl: Op verzoek

source: Used for CSV (.csv), TSV (.tsv), Text (.txt) and DAT (.dat) files
de: Wird für die Dateitypen CSV (.csv), TSV (.tsv), Text (.txt) und DAT (.dat) verwendet
es: Se utiliza para los archivos CSV (.csv), TSV (.tsv), de texto (.txt) y DAT (.dat)
fr: Utilisé pour les fichiers CSV (.csv), TSV (.tsv), Text (.txt) et DAT (.dat)
nl: Gebruikt voor bestanden in de formaten CSV (.csv), TSV (.tsv), Text (.txt) en DAT (.dat)

source: :doc:`Dataset of datasets<connectors/dataset_of_datasets>`
de: :doc:`Datensatz der Datensätze<connectors/dataset_of_datasets>`
es: :doc:`Conjunto de datos de conjuntos de datos<connectors/dataset_of_datasets>`
fr: :doc:`Jeu de données de jeux de données<connectors/dataset_of_datasets>`

source: Used to create a dataset from the catalog of an Opendatasoft domain
de: Wird verwendet, um einen Datensatz aus dem Katalog einer Opendatasoft-Domain zu erstellen
es: Se utiliza para crear un conjunto de datos a partir del catálogo de un dominio Opendatasoft
fr: Utilisé pour créer un jeu de données à partir du catalogue d'un domaine Opendatasoft
nl: Gebruikt voor het aanmaken van een dataset uit de catalogus van een Opendatasoft-domein

source: Used for GeoJSON (.geojson) files
de: Wird für den Dateityp GeoJSON (.geojson) verwendet
es: Se utiliza para los archivos GeoJSON (.geojson)
fr: Utilisé pour les fichiers GeoJSON (.geojson)
nl: Gebruikt voor GeoJSON (.geojson)-bestanden

source: Used to retrieve the state of JCDecaux bike stations
de: Wird verwendet, um den Zustand der JCDecaux Fahrradstationen abzurufen
es: Se utiliza para recuperar el estado de las estaciones de bicicletas JCDecaux
fr: Utilisé pour récupérer l'état des stations de vélos JCDecaux
nl: Gebruikt om de staat van JCDecaux-fietsstations op te halen

source: Used for JSON (.json) files
de: Wird für den Dateityp JSON (.json) verwendet
es: Se utiliza para los archivos JSON (.json)
fr: Utilisé pour les fichiers JSON (.json)
nl: Gebruikt voor JSON (.json)-bestanden

source: Default, except for JSON Dict
de: Standard, außer für JSON Dict
es: Valor predeterminado, excepto para Dic JSON
fr: Par défaut, sauf pour JSON Dict
nl: Standaard, behalve voor JSON Dict

source: Used for KML (.kml) and KMZ (.kmz) files
de: Wird für die Dateitypen KML (.kml) und KMZ (.kmz) verwendet
es: Se utiliza para los archivos KML (.kml) y KMZ (.kmz)
fr: Utilisé pour les fichiers KML (.kml) et KMZ (.kmz)
nl: Gebruikt voor KML (.kml) en KMZ (.kmz) bestanden

source: Used for MapInfo ZIP archives
de: Wird für MapInfo ZIP-Archive verwendet
es: Se utiliza para los archivos ZIP MapInfo
fr: Utilisé pour les archives ZIP MapInfo
nl: Gebruikt voor MapInfo ZIP archieven

source: Used to retrieve data from the Netatmo API
de: Wird verwendet, um Daten von der Netatmo-API abzurufen
es: Se utiliza para recuperar datos de la API de Netatmo
fr: Utilisé pour récupérer des données de l'API Netatmo
nl: Gebruikt om gegevens van de Netatmo API op te halen

source: Used for OpenStreetMap archives (.osm)
de: Wird für OpenStreetMap-Archive (.osm) verwendet
es: Se utiliza para los archivos de OpenStreetMap (.osm)
fr: Utilisé pour les archives OpenStreetMap (.osm)
nl: Gebruikt voor OpenStreetMap archieven (.osm)

source: Used to retrieve data from the Salesforce API
de: Wird verwendet, um Daten von der Salesforce-API abzurufen
es: Se utiliza para recuperar datos de la API de Salesforce
fr: Utilisé pour récupérer des données de l'API Salesforce
nl: Gebruikt om gegevens van de Salesforce API op te halen

source: Used for Shapefiles
de: Wird für Shapefiles verwendet
es: Se utiliza para los archivos ShapeFile
fr: Utilisé pour les fichiers Shapefile
nl: Gebruikt voor Shapefiles

source: :doc:`Spreadsheet<connectors/spreadsheet>`
de: :doc:`Tabellenkalkulation<connectors/spreadsheet>`
es: :doc:`Hoja de cálculo<connectors/spreadsheet>`
fr: :doc:`Feuille de calcul<connectors/spreadsheet>`

source: Used for spreadsheet files (.xls, .xlsx, .ods)
de: Wird für Tabellenkalkulationsdateien (.xls, .xlsx, .ods) verwendet
es: Se utiliza para los archivos de hoja de cálculo (.xls, .xlsx y .ods)
fr: Utilisé pour les fichiers de feuille de calcul (.xls, .xlsx, .ods)
nl: Gebruikt voor spreadsheet-bestanden (.xls, .xlsx, .ods)

source: Used to retrieve data from a WFS service
de: Wird verwendet, um Daten aus einem WFS-Service abzurufen
es: Se utiliza para recuperar datos de un servicio WFS
fr: Utilisé pour récupérer des données d'un service WFS
nl: Gebruikt om gegevens van een WFS-service op te halen

source: Used for XML (.xml) files
de: Wird für den Dateityp XML (.xml) verwendet
es: Se utiliza para los archivos XML (.xml)
fr: Utilisé pour les fichiers XML (.xml)
nl: Gebruikt voor XML (.xml) bestanden
