Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/02_looking_up_a_dataset/checking_dataset_information.po
Languages: de, es, fr, nl

source: Checking dataset information
de: Überprüfung der Informationen zum Datensatz
es: Comprobar información de conjuntos de datos
fr: Consulter les informations du jeu de données
nl: Informatie over de dataset controleren

source: The Information tab gives access to all kind of information about the dataset. This tab is often the default landing tab when clicking on a dataset card from the catalog. It also precedes all other visualization, export & API tabs.
de: Die Registerkarte Informationen bietet Zugang zu allen Arten von Informationen über einen Datensatz. Diese Registerkarte wird häufig standardmäßig angezeigt, wenn Sie auf eine Datensatzkarte im Katalog klicken. Sie ist allen anderen Registerkarten (Visualisierung, Export und API) vorgestellt.
es: La ficha Información da acceso a todo tipo de información acerca del conjunto de datos. Esta ficha a menudo es la ficha de destino predeterminada al hacer clic en una tarjeta de conjunto de datos del catálogo. También precede a todas las demás fichas de visualización, exportación y API.
fr: Grâce à l'onglet Informations, vous pouvez accéder à tous les types d'informations associées au jeu de données. En règle générale, c'est cet onglet qui s'affiche par défaut lorsque vous cliquez sur une fiche de jeu de données du catalogue. En outre, il précède tous les autres onglets de visualisation, API et d'export.
nl: De tab Informatie geeft toegang tot alle soorten informatie over de dataset. Deze tab is vaak de standaard landingtab wanneer op een datasetkaart uit de catalogus wordt geklikt. Hij gaat ook alle andere weergave, export & API tabs vooraf.

source: The Information tab contains:
de: Die Registerkarte Informationen enthält:
es: La ficha Información contiene:
fr: L'onglet Informations comprend :
nl: De tab Informatie bevat:

source: the metadata of the dataset, that have been filled out by the portal administrators
de: die Metadaten des Datensatzes, die von den Portal-Administratoren ausgefüllt wurden
es: Metadatos del conjunto de datos, rellenados por los administradores del portal
fr: les métadonnées du jeu de données, qui ont été renseignées par les administrateurs du portail ;
nl: de metadata van de dataset die is ingevuld door de portaalbeheerders

source: a Follow button to subscribe to the dataset (see :doc:`Following dataset updates <../04_getting_involved/following_dataset_updates>` for more information)
de: ein Folgen-Button, um den Datensatz zu abonnieren (siehe :doc:`Verfolgen von Datensatzaktualisierungen <../04_getting_involved/following_dataset_updates>` für weitere Informationen)
es: Botón Seguir para suscribirse al conjunto de datos (consulte :doc:`Seguir actualizaciones de conjuntos de datos <../04_getting_involved/following_dataset_updates>` si desea obtener más información)
fr: un bouton Suivre les mises à jour pour s'abonner au jeu de données (voir :doc:`Suivre les mises à jour des jeux de données <../04_getting_involved/following_dataset_updates>` pour plus d'informations) ;
nl: een knop Volgen om in te schrijven op de dataset (zie :doc:`Updates dataset volgen <../04_getting_involved/following_dataset_updates>` voor meer informatie)

source: the dates of last processing for metadata and data
de: die Daten der letzten Verarbeitung von Metadaten und Daten
es: Fechas del último procesamiento de metadatos y datos
fr: les dates de dernier traitement des métadonnées et des données ;
nl: de datums van de laatste verwerking voor metadata en data

source: the dataset schema, which indicates for each field of the dataset:
de: das Datensatzschema, das für jedes Feld des Datensatzes Folgendes angibt:
es: Esquema de conjunto de datos, que indica para cada uno de los campos del conjunto de datos:
fr: le modèle de données, qui fournit les informations suivantes pour chaque champ du jeu de données :
nl: het datasetschema dat het volgende aangeeft voor elk veld van de dataset:

source: the label,
de: die Beschriftung,
es: Etiqueta
fr: le label,
nl: het label,

source: the description,
de: die Beschreibung,
es: Descripción
fr: la description,
nl: de beschrijving,

source: the technical identifier,
de: die technische Kennung,
es: Identificador técnico
fr: l'identifiant technique,
nl: de technische identifier,

source: the field type,
de: den Feldtyp,
es: Tipo de campo
fr: le type de champ,
nl: het veldtype,

source: an example of value from this field.
de: ein Beispiel für einen Wert aus diesem Feld.
es: Ejemplo de valor de este campo
fr: un exemple de valeur de ce champ.
nl: een voorbeeld van een waarde uit dit veld.

source: the reuses listing and reuse submit form (see :doc:`Discovering and submitting data reuses <../04_getting_involved/discovering_submitting_reuses>` for more information)
de: eine Auflistung der Weiterverwendungen und ein Formular für die Einreichung von Weiterverwendungen (siehe :doc:`Datenweiterverwendungen entdecken und einreichen<../04_getting_involved/discovering_submitting_reuses>` für weitere Informationen)
es: Lista de reutilizaciones y formulario de envío de reutilizaciones (consulte :doc:`Descubrir y enviar reutilizaciones de datos <../04_getting_involved/discovering_submitting_reuses>` para obtener más información)
fr: la liste des réutilisations et le formulaire d'envoi d'une réutilisation (voir :doc:`Découvrir et envoyer des réutilisations de données <../04_getting_involved/discovering_submitting_reuses>` pour plus d'informations).
nl: het formulier voor het oplijsten en indienen van hergebruiken (zie :doc:`datahergebruiken ontdekken en indienen <../04_getting_involved/discovering_submitting_reuses>` voor meer informatie)

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Depending on the portal and dataset configurations, more or less information and features can be displayed in the Information tab of the chosen dataset.
de: Je nach Konfiguration des Portals und des Datensatzes können mehr oder weniger Informationen und Funktionen in der Registerkarte Information des ausgewählten Datensatzes angezeigt werden.
es: En función de las configuraciones de los portales y conjuntos de datos, la ficha Información del conjunto de datos seleccionado puede mostrar más o menos información y funciones.
fr: En fonction des configurations du jeu de données et du portail, il est possible d'afficher plus ou moins d'informations et de fonctionnalités dans l'onglet Informations du jeu de données choisi.
nl: Afhankelijk van de portaal- en datasetconfiguratie kunnen meer of minder informatie en functies worden weergegeven in de tab Informatie van de gekozen dataset.
