Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/02_looking_up_a_dataset/filtering_dataset.po
Languages: de, es, fr, nl

source: Filtering a dataset
de: Einen Datensatz filtern
es: Filtrar un conjunto de datos
fr: Filtrer un jeu de données
nl: Een dataset filteren

source: When looking up a dataset, as a user on an open data portal, you may be looking for specific data from the dataset. To find that specific data more easily, instead of scrolling through dozens or hundreds of records, different filtering options are available. The filtering options are located on the left side of the interface.
de: Wenn Sie einen Datensatz in einem offenen Datenportal durchsuchen, sind Sie möglicherweise auf der Suche nach bestimmten Daten. Um diese Daten schneller zu finden, stehen verschiedene Filteroptionen zur Verfügung, um nicht durch Dutzende oder Hunderte von Datensätzen blättern zu müssen. Die Filteroptionen befinden sich auf der linken Seite der Benutzeroberfläche.
es: Al consultar un conjunto de datos, como usuario de un portal de datos abiertos, posiblemente busque unos datos concretos acerca del conjunto de datos. Para encontrar esos datos específicos más fácilmente, en lugar de desplazarse por decenas o centenares de registros, dispone de varias opciones de filtro. Las opciones de filtro se hallan a la izquierda de la interfaz.
fr: En tant qu'utilisateur d'un portail de données ouvertes, vous pouvez avoir besoin de rechercher des données spécifiques dans le jeu de données. Pour vous faciliter la tâche et vous éviter de parcourir des dizaines ou des centaines d'enregistrements, plusieurs options de filtres vous sont proposées. Celles-ci se trouvent dans la partie gauche de l'interface.
nl: Wanneer u een dataset opzoekt als gebruiker op een open dataportaal bent u mogelijk misschien op zoek naar specifieke data uit de dataset. Om die specifieke data gemakkelijker te vinden in plaats van door tientallen of honderden records te scrollen, zijn er verschillende filteropties beschikbaar. De filteropties staan aan de linkerkant van de interface.

source: It is possible to filter:
de: Es gibt folgende Filtermöglichkeiten:
es: Se puede filtrar:
fr: Vous avez la possibilité de filtrer par :
nl: Het is mogelijk om te filteren:

source: by textual research, using the search bar
de: Textsuche über die Suchleiste
es: Por búsqueda textual, mediante la barra de búsqueda
fr: recherche textuelle, à l'aide de la barre de recherche ;
nl: op basis van tekst door gebruik te maken van de zoekbalk

source: by existing value, using the available field-based filters
de: Suche nach einem vorhandenen Wert unter Verwendung der verfügbaren Feld-Filter
es: Por un valor existente, mediante los filtros basados en campos disponibles
fr: valeur existante, à l'aide des filtres basés sur des champs ;
nl: per bestaande waarde, door gebruik te maken van beschikbare op velden gebaseerde filters

source: Using the search bar
de: Verwendung der Suchleiste
es: Mediante la barra de búsqueda
fr: Utiliser la barre de recherche
nl: De zoekbalk gebruiken

source: The search bar should be used to make textual searches in the dataset. When doing a textual search, the platform will look for a match between the search and the records. The dataset will be filtered to only display those matching records.
de: Die Suchleiste kann für die Textsuche im Datensatz verwendet werden. Bei einer Textsuche sucht die Plattform nach einer Übereinstimmung zwischen dem Suchbegriff und den Einträgen. Der Datensatz wird so gefiltert, dass nur die passenden Einträge angezeigt werden.
es: La barra de búsqueda está destinada a hacer búsquedas textuales en el conjunto de datos. Al efectuar una búsqueda textual, la plataforma tratará de encontrar una coincidencia entre la búsqueda y los registros. El conjunto de datos se filtrará para visualizar tan solo los registros coincidentes.
fr: La barre de recherche doit être utilisée pour effectuer des recherches textuelles dans le jeu de données. Quand vous effectuez une recherche textuelle, la plateforme recherchera une correspondance entre la recherche formulée et les enregistrements. Le jeu de données sera filtré pour afficher uniquement les enregistrements correspondants.
nl: De zoekbalk dient te gebruikt te worden om tekstuele zoekopdrachten in de dataset uit te voeren. Wanneer u een tekstuele zoekopdracht uitvoert, zal het platform op zoek gaan naar een match tussen de zoekopdracht en de records. De dataset wordt gefilterd zodat enkel de records die matchen worden weergegeven.

source: To make a textual search:
de: Nach einem Text suchen:
es: Para hacer una búsqueda textual:
fr: Pour effectuer une recherche textuelle :
nl: Om een zoekopdracht op basis van tekst aan te maken:

source: Click on the search bar area.
de: Klicken Sie auf die Suchleiste.
es: Haga clic en el área de la barra de búsqueda.
fr: Cliquez sur la zone de barre de recherche.
nl: Klik op de zoekbalk.

source: Type the word to search in the dataset.
de: Geben Sie den Begriff ein, nach dem der Datensatz durchsucht werden soll.
es: Escriba la palabra que desea buscar en el conjunto de datos.
fr: Saisissez le mot à rechercher dans le jeu de données.
nl: Voer het woord in dat moet worden opgezocht in de dataset.

source: Press enter for the search to be taken into account, and the dataset filtered according to the typed word.
de: Drücken Sie die Eingabetaste, um die Suche zu starten und den Datensatz nach dem eingegebenen Wort zu filtern.
es: Pulse Entrar para que se tenga en cuenta la búsqueda y se filtre el conjunto de datos en función de la palabra escrita.
fr: Appuyez sur Entrée pour lancer la recherche et filtrer le jeu de données en fonction du mot saisi.
nl: Druk op Enter om de zoekopdracht te activeren en zodat de dataset wordt gefilterd in functie van het ingevoerde woord.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: It is possible to make more advanced searches with the search bar, using the Query language (more info in the :doc:`Searching the data documentation </exploring_catalog_and_datasets/03_searching_the_data/search>`).
de: Mithilfe der Abfragesprache kann eine erweiterte Suche über die Suchleiste durchgeführt werden (weitere Informationen finden Sie in der :doc:`Dokumentation zum Durchsuchen der Daten </exploring_catalog_and_datasets/03_searching_the_data/search>`).
es: Se pueden efectuar búsquedas más avanzadas con la barra de búsqueda, mediante el lenguaje de consulta (consulte más información en la documentación acerca de :doc:`Buscar en los datos </exploring_catalog_and_datasets/03_searching_the_data/search>`).
fr: L'option Langage de requêtes vous permet d'effectuer des recherches plus poussées (voir le document :doc:`Effectuer une recherche dans les données</exploring_catalog_and_datasets/03_searching_the_data/search>`).
nl: Het is mogelijk om meer geavanceerde zoekopdrachten uit te voeren met de zoekbalk met behulp van de Querry-taal (meer informatie is terug te vinden in :doc:`De documentatie over de data opzoeken</exploring_catalog_and_datasets/03_searching_the_data/search>`).

source: Using the selectable filters
de: Verwendung der auswählbaren Filter
es: Mediante los filtros seleccionables
fr: Utiliser les filtres sélectionnables
nl: De filters gebruiken die geselecteerd kunnen worden

source: Under the search bar is a list of selectable filters sorted by field name and based on the values related to these fields. The portal administrators choose which field should be a dataset filter. When searching with the selectable filters, the platform will only display the records containing the selected value from the chosen field.
de: Unter der Suchleiste befindet sich eine Liste mit auswählbaren Filtern, die nach Feldnamen sortiert sind und auf den Werten für diese Felder basieren. Die Administratoren des Portals bestimmen, welches Feld ein Datensatzfilter sein soll. Bei der Suche mit den auswählbaren Filtern zeigt die Plattform nur die Einträge an, die den ausgewählten Wert aus dem ausgewählten Feld enthalten.
es: Bajo la barra de búsqueda se encuentra una lista de filtros seleccionables ordenados por nombre de campo en función de los valores relacionados con estos campos. Los administradores del portal eligen qué campo debe ser un filtro de conjunto de datos. Al buscar con los filtros seleccionables, la plataforma solo mostrará los registros que contienen el valor seleccionado en el campo seleccionado.
fr: Sous la barre de recherche, vous trouverez une liste de filtres sélectionnables, triés par nom de champ et basés sur les valeurs associées à ces champs. Les administrateurs du portail décident quels sont les champs pouvant être utilisés en tant que filtres du jeu de données. Lorsque vous effectuez une recherche avec ces filtres sélectionnables, la plateforme affiche uniquement les enregistrements contenant la valeur sélectionnée issue du champ choisi.
nl: Onder de zoekbalk staat een lijst met filters die geselecteerd kunnen worden. Deze zijn gesorteerd op veldnaam en zijn gebaseerd op de waarden die verbonden zijn aan deze velden. De portaalbeheerders kiezen welk veld een datasetfilter zou moeten zijn. Wanneer gezocht wordt met de filters die kunnen worden geselecteerd, zal het platform enkel die records weergeven die de geselecteerde waarde uit het gekozen veld bevatten.

source: To use the selectable filters:
de: Zur Suche mit auswählbaren Filtern:
es: Para utilizar los filtros seleccionables:
fr: Pour utiliser les filtres sélectionnables :
nl: Om de filters te gebruiken die geselecteerd kunnen worden:

source: Choose a field.
de: Wählen Sie ein Feld aus.
es: Elija un campo.
fr: Choisissez un champ.
nl: Kies een veld.

source: Under the name of the field are listed existing related values. Click one of the values. The other values disappear and the dataset directly updates to only display the records containing the chosen value.
de: Unter dem Namen des Feldes werden vorhandene Werte aufgelistet. Klicken Sie auf einen der Werte. Die anderen Werte werden ausgeblendet und der Datensatz wird sofort aktualisiert, um nur die Einträge anzuzeigen, die dem neu angewandten Wert entsprechen.
es: Bajo el nombre del campo figuran los valores relacionados existentes. Haga clic en uno de los valores. Los demás valores desaparecen, y el conjunto de datos directamente se actualiza para mostrar tan solo los registros que contienen el valor elegido.
fr: Sous le nom du champ se trouvent les valeurs associées existantes. Lorsque vous cliquez sur l'une d'entre elles, les autres valeurs sont effacées et le catalogue se met instantanément à jour pour n'afficher que les enregistrements contenant la valeur choisie.
nl: Onder de naam van het veld staan de bestaande eraan verbonden waarden opgelijst. Klik op één van de waarden. De andere waarden verdwijnen en de dataset wordt meteen geüpdatet zodat enkel de records worden weergegeven die de gekozen waarde bevatten.

source: For some filters, it can be possible to select more than one value. In this case, after clicking on a value, the others do not disappear. Click on any other value to filter even more.
de: Für einige Filter kann mehr als nur ein Wert ausgewählt werden. In diesem Fall werden die anderen Werte nicht ausgeblendet, nachdem Sie auf einen Wert geklickt haben. Klicken Sie auf einen beliebigen anderen Wert, um eine weitere Filterung vorzunehmen.
es: Algunos filtros permiten seleccionar varios valores. En ese caso, después de hacer clic en un valor, los demás no desaparecen. Haga clic en cualquier otro valor para seguir filtrando.
fr: Pour certains filtres, vous pouvez sélectionner plusieurs valeurs. Dans ce cas, après avoir cliqué sur une valeur, les autres resteront affichées. Cliquez sur une autre valeur pour appliquer un filtre supplémentaire.
nl: Voor sommige filters is het mogelijk om meer dan één waarde te selecteren. In dit geval en nadat u op een waarde heeft geklikt, verdwijnen de andere waarden niet. Klik op elke andere waarde om nog meer te filteren.

source: For other filters, the values are sorted in a hierarchical way. For instance, for date fields, the year must be selected first, then the months are displayed. Once the month is selected, the days are displayed in order to be selected as well.
de: Für andere Filter werden die Werte hierarchisch sortiert. Beispielsweise muss bei Datumsfeldern zuerst das Jahr ausgewählt werden, dann werden die Monate angezeigt. Sobald der Monat ausgewählt wurde, werden die auswählbaren Tage angezeigt.
es: En el caso de otros filtros, los valores se ordenan de forma jerárquica. Por ejemplo, para los campos de fecha, primero se debe seleccionar el año y después se muestran los meses. Una vez seleccionado el mes, también se muestran los días para poder seleccionarlos.
fr: Pour d'autres filtres, les valeurs sont triées de façon hiérarchique. Par exemple, pour les champs de date, l'année doit d'abord être sélectionnée pour que les mois s'affichent. Une fois le mois sélectionné, les jours s'affichent pour être à leur tour sélectionnés.
nl: Voor andere filters zijn de waarden gesorteerd in hiërarchische volgorde. Bijvoorbeeld, voor datumvelden moet eerst het jaar worden geselecteerd. Daarna worden de maanden weergegeven. Eenmaal de maand is geselecteerd worden de dagen weergegeven zodat deze ook kunnen worden geselecteerd.
