Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/02_looking_up_a_dataset/looking_up_dataset.po
Languages: de, es, fr, nl

source: Looking up a dataset
de: Einen Datensatz durchsuchen
es: Consultar un conjunto de datos
fr: Effectuer une recherche dans un jeu de données
nl: Een dataset opzoeken

source: Once the right dataset has been found in the catalog, through the searching and filtering options or by scrolling down, it should be time to look it up. The visualization interface of a dataset is the same, no matter the portal.
de: Nachdem Sie den richtigen Datensatz im Katalog gefunden haben (über die Such- und Filteroptionen oder durch Scrollen nach unten), ist es an der Zeit, diesen Datensatz zu durchsuchen. Die Visualisierungsoberfläche eines Datensatzes ist unabhängig vom Portal immer gleich.
es: Una vez encontrado el conjunto de datos adecuado en el catálogo, o bien mediante las opciones de búsqueda y filtro o bien mediante el desplazamiento, correspondería consultarlo. La interfaz de visualización de un conjunto de datos es la misma con independencia del portal.
fr: Une fois que vous avez trouvé le jeu de données souhaité dans le catalogue, grâce aux options de filtres et de recherche ou en faisant défiler, il est temps d'effectuer une recherche dans celui-ci. L'interface de visualisation d'un jeu de données est toujours la même, quel que soit le portail.
nl: Eenmaal de juiste dataset is teruggevonden in de catalogus via de zoek- en filteropties of door naar beneden te scrollen, is het tijd om deze op te zoeken. De weergave-interface van een dataset is dezelfde, ongeacht het portaal.

source: On the left side are displayed:
de: Auf der linken Seite wird Folgendes angezeigt:
es: A la izquierda se visualiza:
fr: À gauche, les éléments suivants sont affichés :
nl: Aan de linkerkant wordt het volgende weergegeven:

source: the number of records in the dataset (1),
de: Die Anzahl der Einträge im Datensatz (1),
es: Número de registros del conjunto de datos( 1)
fr: le nombre d'enregistrements dans le jeu de données (1) ;
nl: het aantal records in een dataset (1),

source: a variety of dataset filters to find specific records and values (2).
de: Unterschiedliche Datensatz-Filter, um nach bestimmten Einträgen und Werten zu suchen (2).
es: Varios filtros de conjuntos de datos para encontrar registros y valores concretos (2)
fr: une variété de filtres de jeu de données pour rechercher des valeurs et enregistrements spécifiques (2).
nl: een aantal datasetfilters om specifieke records en waarden terug te vinden (2).

source: On the right side are displayed:
de: Auf der rechten Seite wird Folgendes angezeigt:
es: A la derecha se visualiza:
fr: À droite, les éléments suivants sont affichés :
nl: Op de rechterkant staat het volgende weergegeven:

source: the available tabs for the dataset (3), which can be:
de: die verfügbaren Registerkarten für den Datensatz (3), beispielsweise:
es: Fichas disponibles para el conjunto de datos (3), que pueden ser:
fr: les onglets disponibles pour le jeu de données (3), qui peuvent être :
nl: de beschikbare tabs voor de dataset (3). Dit kunnen zijn:

source: the Information tab, to know more about the metadata,
de: Die Registerkarte Informationen, um mehr über die Metadaten zu erfahren,
es: Ficha Información, para ampliar detalles sobre los metadatos
fr: l'onglet Informations, pour en apprendre davantage sur les métadonnées,
nl: de tab Informatie voor meer informatie over de metadata,

source: the Table, Map, Analyze, Images and Calendar tabs, to visualize the data in different ways,
de: die Registerkarten Tabelle, Karte, Analyse, Bilder und Kalender, um die Daten auf verschiedene Weise zu visualisieren,
es: Fichas Tabla, Mapa, Analizar, Imágenes y Calendario, para visualizar los datos de varias formas
fr: les onglets Tableau, Carte, Analyse, Images et Calendrier, pour différentes visualisations des données,
nl: de tabs Tabel, Kaart, Analyseer, Afbeeldingen en Kalender om de data op verschillende manieren weer te geven,

source: the :doc:`Export tab, to download the dataset <../04_getting_involved/exporting_data>`,
de: die :doc:`Registerkarte Export, um den Datensatz herunterzuladen <../04_getting_involved/exporting_data>`,
es: :doc:`Ficha Exportar, para descargar el conjunto de datos <../04_getting_involved/exporting_data>`
fr: l':doc:`onglet Exporter pour télécharger le jeu de données <../04_getting_involved/exporting_data>`,
nl: het :doc:`tab Exporteer om de dataset te downloaden <../04_getting_involved/exporting_data>`,

source: the API tab, to use the dataset with the OpenDataSoft API (see :doc:`Using the API <../04_getting_involved/using_api>`),
de: die API-Registerkarte, um den Datensatz mit der OpenDataSoft-API zu verwenden (siehe :doc:`Die API verwenden <../04_getting_involved/using_api>`),

source: the :doc:`Comments tab, to discuss the dataset with other users <../04_getting_involved/commenting_via_disqus>`.
de: die :doc:`Registerkarte Kommentare, um den Datensatz mit anderen Benutzern zu diskutieren <../04_getting_involved/commenting_via_disqus>`.
es: :doc:`Ficha Comentarios, para discutir acerca del conjunto de datos con otros usuarios <../04_getting_involved/commenting_via_disqus>`
fr: l':doc:`onglet Commentaires pour discuter du jeu de données avec d'autres utilisateurs <../04_getting_involved/commenting_via_disqus>`.
nl: het :doc:`Tab commentaren om de dataset met andere gebruikers te bespreken <../04_getting_involved/commenting_via_disqus>`.

source: and the content of each tab (4).
de: sowie den Inhalt jeder Registerkarte (4).
es: Contenido de cada una de las fichas (4)
fr: et le contenu de chaque onglet )
nl: en de content van elke tab (4).

source: This section of the documentation will focus on the exploration of a chosen dataset, through the Information tab to know more about the metadata, and through all available data visualizations.
de: Dieser Bereich der Dokumentation erläutert die Möglichkeit, einen bestimmten Datensatz mithilfe der Registerkarte Informationen und aller verfügbaren Datenvisualisierungen zu durchsuchen.
es: Esta sección de la documentación se centra en la exploración de un conjunto de datos seleccionado, mediante la ficha Información para ampliar detalles sobre los metadatos y mediante todas las visualizaciones de datos disponibles.
fr: Cette partie de la documentation s'intéresse à l'exploration d'un jeu de données choisi. Pour ce faire, nous allons passer en revue l'onglet Informations pour en apprendre davantage sur les métadonnées, ainsi que toutes les visualisations de données disponibles.
nl: Dit onderdeel van de documentatie zal zich toespitsen op het exploreren van een gekozen dataset via de tab Informatie om meer te weten te komen over de metadata en via alle beschikbare dataweergaves.

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: The Edit button next to the dataset title, as well as the Back office button in the navigation bar, are only displayed for authenticated users who have the permission to administrate the OpenDataSoft domain.
de: Der Button "Bearbeiten" neben dem Datensatz-Titel sowie der Button "Back Office" in der Navigationsleiste werden nur für authentifizierte Benutzer angezeigt, die zur Verwaltung der OpenDataSoft-Domain berechtigt sind.

source: the API tab, to use the dataset with the Opendatasoft API (see :doc:`Using the API <../04_getting_involved/using_api>`),
es: Ficha API, para utilizar el conjunto de datos con la API de Opendatasoft (consulte :doc:`Utilizar la API <../04_getting_involved/using_api>`)
fr: l'onglet API pour utiliser le jeu de données avec l'API Opendatasoft (voir :doc:`Utiliser l'API <../04_getting_involved/using_api>`),
nl: de tab API om de dataset te gebruiken met de Opendatasoft API (zie :doc:`De API gebruiken <../04_getting_involved/using_api>`),

source: The Edit button next to the dataset title, as well as the Back office button in the navigation bar, are only displayed for authenticated users who have the permission to administrate the Opendatasoft domain.
es: Tanto el botón Editar situado junto al título del conjunto de datos como el botón Back office de la barra de navegación solo se visualizan para los usuarios autenticados con permiso para administrar el dominio Opendatasoft.
fr: Le bouton Éditer en regard du titre du jeu de données, à l'instar du bouton Interface d'administration de la barre de navigation, sont uniquement affichés pour les utilisateurs authentifiés qui ont la permission d'administrer le domaine Opendatasoft.
nl: De knop Bewerken naast de titel van de dataset, alsook de knop Back Office in de navigatiebalk worden enkel weergegeven voor ge√Ødentificeerde gebruikers die de toelating hebben om het Opendatasoft-domein te beheren.
