Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/02_looking_up_a_dataset/visualizing_data.po
Languages: de, es, fr, nl

source: Visualizing data
de: Visualisieren von Daten
es: Visualizar datos
fr: Visualiser des données
nl: Data weergeven

source: Published datasets on an Opendatasoft portal can be represented by up to 6 different visualizations. The number of available visualizations for a dataset completely depends on what kind of data the dataset contains. Among these 6 visualizations, there are 5 standard visualizations:
de: Die auf einem Opendatasoft-Portal veröffentlichten Datensätze können mit bis zu 6 verschiedenen Visualisierungen dargestellt werden. Die Anzahl der verfügbaren Visualisierungen für einen Datensatz hängt von der Art der Daten ab, die der Datensatz enthält. Zu den 6 Visualisierungen gehören 5 Standard-Visualisierungen:
es: Los conjuntos de datos publicados en un portal Opendatasoft se pueden representar por medio de hasta 6 visualizaciones. El número de visualizaciones disponibles para un conjunto de datos depende por completo del tipo de datos que contiene el conjunto de datos. Entre estas 6 visualizaciones, hay 5 visualizaciones estándar:
fr: Les jeux de données publiés sur un portail Opendatasoft peuvent être représentés par 6 visualisations différentes maximum. Le nombre de visualisations disponibles pour un jeu de données dépend du type de données contenues dans celui-ci. Parmi ces 6 visualisations, 5 sont standards :

source: the Table visualization, to visualize data in a table
de: Die Tabellenvisualisierung, um Daten in einer Tabelle zu visualisieren
es: Visualización Tabla, para visualizar los datos en una tabla
fr: la visualisation Tableau, qui permet de visualiser les données dans un tableau ;
nl: De Tabel-weergave om data weer te geven in een tabel

source: the Map visualization, to visualize data on a map
de: Die Kartenvisualisierung, um Daten in einer Karte zu visualisieren
es: Visualización Mapa, para visualizar los datos en un mapa
fr: la visualisation Carte, qui permet de visualiser les données sur une carte ;
nl: De Kaart-weergave om de data weer te geven op een kaart

source: the Analyze visualization, to visualize and analyze data through a chart
de: Die Analysevisualisierung, um Daten in einem Diagramm zu visualisieren und zu analysieren
es: Visualización Analizar, para visualizar y analizar los datos en un gráfico
fr: la visualisation Analyse, qui permet de visualiser et d'analyser les données via un graphe ;
nl: De Analyseer-weergave om data via een grafiek weer te geven en te analyseren

source: the Images visualization, to visualize data through images
de: Die Bildvisualisierung, um Daten in einem Bild zu visualisieren
es: Visualización Imágenes, para visualizar los datos en imágenes
fr: la visualisation Images, qui permet de visualiser les données via des images ;
nl: De Afbeeldingen-weergave om data weer te geven door middel van afbeeldingen

source: the Calendar visualization, to visualize data in a calendar
de: Die Kalendervisualisierung, um Daten in einem Kalender zu visualisieren
es: Visualización Calendario, para visualizar los datos en un calendario
fr: la visualisation Calendrier, qui permet de visualiser les données dans un calendrier.
nl: De Kalender-weergave om data weer te geven in een kalender

source: The 6th visualization is called the "Custom view". It is completely optional and entirely custom. It means that even the label of the tab is chosen by the portal administrators, and they can differ from one dataset to another, even if they are on the same portal.
de: Die 6. Visualisierung wird als "Benutzerdefinierte Ansicht" bezeichnet. Sie ist optional und komplett benutzerdefiniert. Das bedeutet, dass sogar die Beschriftung der Registerkarte von den Administratoren des Portals bestimmt wird. Sie können von Datensatz zu Datensatz unterschiedlich sein, selbst wenn sie sich auf demselben Portal befinden.
es: La sexta visualización se llama "Vista personalizada". Es absolutamente opcional y personalizada. Esto significa que hasta la etiqueta de la ficha es a discreción de los administradores del portal y puede variar de un conjunto de datos a otro, pese a estar en el mismo portal.
fr: La 6e visualisation est appelée "Vue personnalisée". Cette dernière est totalement optionnelle et personnalisée : le label de l'onglet est choisi par les administrateurs du portail et peut donc être différent d'un jeu de données à l'autre, y compris au sein d'un même portail.
nl: De 6de weergeva wordt de "Custom view" genoemd. Deze is volledig optioneel en kan volledig worden gepersonaliseerd. Dit betekent dat zelfs het label van de tab gekozen wordt door de portaalbeheerders en dat deze van de ene dataset tot de andere kunnen verschillen, zelfs wanneer ze op hetzelfde portaal staan.

source: Visualizing data in a table
de: Visualisieren von Daten in einer Tabelle
es: Visualizar datos en una tabla
fr: Visualiser des données dans un tableau
nl: Data weergeven in een tabel

source: The Table visualization is accessible from the Table tab.
de: Auf die Tabellenvisualisierung kann über die Registerkarte Tabelle zugegriffen werden.
es: La visualización Tabla está accesible en la ficha Tabla.
fr: Dans l'onglet Tableau, vous pouvez accéder à la visualisation Tableau.
nl: De Tabel-weergave is toegankelijk vanaf het tabblad Tabel.

source: It displays a table containing all available fields from the dataset.
de: Sie zeigt eine Tabelle mit allen verfügbaren Feldern aus dem Datensatz an.
es: Visualiza una tabla que contiene todos los campos disponibles del conjunto de datos.
fr: Un tableau contenant tous les champs disponibles dans le jeu de données s'affiche.
nl: Er wordt een tabel weergegeven die alle beschikbare velden van de dataset bevat.

source: In the header, the bold labels are the field names.
de: Die fettgedruckten Beschriftungen in der Kopfzeile sind die Feldnamen.
es: En el encabezado, las etiquetas en negrita son los nombres de campo.
fr: Dans l'en-tête, les labels en gras correspondent aux noms de champs.
nl: In de header zijn de labels in het vetjes de namen van de velden.

source: In the table, each row represents a record. Each record contains several values.
de: Jede Zeile in der Tabelle stellt einen Eintrag dar. Jeder Eintrag enthält mehrere Werte.
es: En la tabla, cada una de las filas representa un registro. Cada uno de los registros contiene varios valores.
fr: Dans le tableau, chaque ligne représente un enregistrement, qui contient plusieurs valeurs.
nl: In de tabel vertegenwoordigt elke rij een record. Elk record bevat verschillende waarden.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Hover over the field names to display the description of the field.
de: Fahren Sie mit der Maus über einen Feldnamen, um die Beschreibung des Feldes anzuzeigen.
es: Pase por encima de los nombres de campo para visualizar la descripción del campo.
fr: Passez le curseur sur les noms des champs avec la souris pour afficher leur description.
nl: Ga met uw muis over de namen van de velden om de beschrijving van het veld weer te geven.

source: The Table visualization can be available for any dataset, no matter what kind of data it contains.
de: Die Tabellenvisualisierung kann für jeden Datensatz verfügbar sein, unabhängig von der Art der Daten, die er enthält.
es: La visualización Tabla puede estar disponibles para cualquier conjunto de datos, con independencia del tipo de datos que contenga.
fr: La visualisation Tableau peut être disponible pour tous les jeux de données, quel que soit le type de données qu'ils contiennent.
nl: De Tabel-weergave kan beschikbaar zijn voor elke dataset, ongeacht het type data die deze bevat.

source: Visualizing data on a map
de: Visualisieren von Daten in einer Karte
es: Visualizar datos en un mapa
fr: Visualiser des données sur une carte
nl: Data weergeven op een kaart

source: The Map visualization is accessible from the Map tab.
de: Auf die Kartenvisualisierung kann über die Registerkarte Karte zugegriffen werden.
es: La visualización Mapa está accesible en la ficha Mapa.
fr: Dans l'onglet Carte, vous pouvez accéder à la visualisation Carte.
nl: De Kaart-weergave is toegankelijk vanuit het tabblad Kaart.

source: It displays a map, on which there are map markers indicating the geographical location of a record from the dataset. When clicking on a map marker, its related tooltip is displayed. It contains more information about the record.
de: Angezeigt wird eine Karte mit Kartenmarkierungen, welche die geografische Lage eines Eintrags aus dem Datensatz anzeigen. Mit einem Klick auf eine Kartenmarkierung wird die entsprechende QuickInfo angezeigt. Diese enthält weitere Informationen über den Eintrag.
es: Visualiza un mapa, en que hay marcadores de mapa para indicar la ubicación geográfica de un registro del conjunto de datos. Al hacer clic en un marcador de mapa, se muestra su ayuda de herramienta relacionada. Contiene más información sobre el registro.
fr: Elle permet d'afficher une carte sur laquelle des marqueurs indiquent l'emplacement géographique d'un enregistrement du jeu de données. Quand vous cliquez sur un marqueur de carte, l'infobulle associée s'affiche pour vous proposer davantage d'informations sur l'enregistrement.
nl: Ze geeft een kaart weer waarop kaartmarkeringen staan die de geografische ligging van een record uit de dataset aangeeft. Wanneer op een kaartmarkering wordt geklikt, wordt de eraan verbonden tooltip weergegeven. Deze bevat meer informatie over het record.

source: Since the tooltips can be completely customized, their content can differ a lot from one dataset to another. They can also be disabled.
de: QuickInfos können vollständig angepasst werden, weshalb ihr Inhalt von Datensatz zu Datensatz sehr unterschiedlich sein kann. Sie können auch deaktiviert werden.
es: Como las ayudas de herramientas son totalmente personalizables, su contenido puede variar mucho de un conjunto de datos a otro. También se pueden desactivar.
fr: Les infobulles pouvant être totalement personnalisées, leur contenu est susceptible de varier considérablement d'un jeu de données à l'autre. Elles peuvent également être désactivées.
nl: Aangezien de tooltips volledig kunnen worden gepersonaliseerd, kan de content ervan sterk verschillen van de ene dataset tot een andere. Ze kunnen ook worden gedeactiveerd.

source: Sometimes, the map markers can be replaced by circles containing a number. Those are called "clusters": they appear on a map when there are too many map markers in the same spot for them all to be displayed individually. The number indicated on the cluster indicates how many map markers are "hidden" behind. Zoom in to see the map markers.
de: Manchmal können die Kartenmarkierungen durch Kreise mit einer Zahl ersetzt werden. Hierbei handelt es sich um sogenannte "Cluster": sie werden auf der Karte angezeigt, wenn an einer Stelle zu viele Kartenmarkierungen vorhanden sind, die nicht alle gleichzeitig dargestellt werden können. Die im Cluster angezeigte Zahl gibt an, wie viele Kartenmarkierungen dahinter "verborgen" sind. Durch Heranzoomen können Sie die Kartenmarkierungen sehen.
es: En ocasiones, los marcadores de mapa se pueden sustituir por círculos con un número. Estos se denominan "clústeres": aparecen en un mapa cuando hay demasiados marcadores de mapa en el mismo punto para mostrarlos todos de forma individual. El número indicado en el clúster indica cuántos marcadores de mapa están "ocultos" detrás. Acérquese para ver los marcadores de mapa.
fr: Il peut arriver que les marqueurs de carte soient remplacés par des cercles contenant un nombre. Ces derniers sont appelés "clusters" : ils sont affichés sur la carte quand de trop nombreux indicateurs se trouvent au même emplacement. Le nombre présent dans le cluster indique combien de marqueurs sont "masqués". Effectuez un zoom pour voir les marqueurs de carte.
nl: Soms is het mogelijk dat de kaartmarkeringen worden vervangen door cirkels waarin een cijfer staat. Deze worden "clusters" genoemd: ze verschijnen op een kaart wanneer er teveel kaartmarkeringen op dezelfde plaats staan om deze allemaal individueel weer te geven. Het cijfer in de cirkel geeft aan hoeveel kaartmarkeringen er achter "verborgen" staan. Zoom in om de kaartmarkeringen te zien.

source: The map contains the a variety of buttons that allow to navigate and interact with the map:
de: Die Karte enthält eine Vielzahl von Buttons, mit denen Sie navigieren und mit der Karte interagieren können:
es: El mapa contiene diversos botones que permiten la navegación y la interacción en el mapa:
fr: Plusieurs boutons sont présents sur la carte pour naviguer sur celle-ci et interagir :
nl: De kaart bevat een aantal knoppen die u toelaten te browsen en de interageren met de kaart:

source: polygon |icon-polygon|, circle |icon-circle| and square |icon-square| buttons to draw on the map and filter on certain areas, along with the edit shape |icon-edit| and delete shape |icon-trash-map| buttons to go with them
de: Polygon |icon-polygon|, Kreis |icon-circle| und Rechteck |icon-square| Buttons, um auf die Karte zu zeichnen und einige Bereiche zu filtern, gemeinsam mit den dazu gehörigen Buttons Form bearbeiten |icon-edit| und Form löschen |icon-trash-map|
es: Los botones de polígono |icon-polygon|,‭ ‬círculo |icon-circle| ‬y cuadrado |icon-square| ‬para dibujar en el mapa y aplicar filtros en determinadas áreas,‭ ‬y los botones de editar forma |icon-edit| ‬y suprimir forma |icon-trash-map| ‬correspondientes
fr: les boutons polygone |icon-polygon|, cercle |icon-circle| et carré |icon-square| permettent de dessiner sur la carte afin de filtrer par zone, ainsi que les boutons *Modifier le filtre par zone* |icon-edit| et le bouton *Effacer le filtre par zone* |icon-trash-map|
nl: veelhoek |icon-polygon|, cirkel |icon-circle| en vierkant |icon-square| , knoppen om te tekenen op de kaart en te filteren op bepaalde gebieden, samen met de knoppen bewerk vorm |icon-edit| en verwijder vorm |icon-trash-map| die er mee samen gaan

source: |icon-fullscreen| to view your map in fullscreen mode
de: |icon-fullscreen|, um die Karte im Vollbildmodus anzusehen
es: icon-fullscreen‭| ‬para ver el mapa en modo de pantalla completa
fr: |icon-fullscreen| pour afficher la carte en mode plein écran
nl: |icon-fullscreen| om uw kaart in volledige schermmodus te bekijken

source: zoom in |icon-zoom-in| and zoom out |icon-zoom-out| buttons
de: Buttons zum Einzommen |icon-zoom-in| und Auszoomen |icon-zoom-out|
es: Los botones de acercar |icon-zoom-in| ‬y alejar |icon-zoom-out|
fr: les boutons *zoomer* |icon-zoom-in| et *dézoomer* |icon-zoom-out|
nl: knoppen zoom in |icon-zoom-in| en zoom uit |icon-zoom-out|

source: localize |icon-localize| button to focus the map on your current location
de: Lokalisierungs |icon-localize| Button, um die Karte auf Ihren aktuellen Aufenthaltsort zu fokussieren
es: El botón de localizar |icon-localize| para centrar el mapa en la ubicación actual
fr: le bouton *Détecter ma localisation* |icon-localize| pour centrer la carte sur votre localisation actuelle
nl: knop lokaliseer |icon-localize| om de kaart te focussen om hun huidige locatie

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: Maps displayed in the Map tab cannot be customized, except from choosing another basemap when possible. To be able to customize a map, or cross data from different datasets, as well as to save a created map, use the :doc:`Map Builder <../../creating_maps_charts/01_creating_advanced_maps/overview-of-map-builder>`.
de: Die in der Registerkarte Karte angezeigten Karten können nicht angepasst werden, es sei denn, Sie wählen eine andere Grundkarte (falls möglich). Um eine Karte anpassen zu können, Daten aus verschiedenen Datensätzen zu überlagern und eine erstellte Karte zu speichern, nutzen Sie den :doc:`Kartenersteller <../../creating_maps_charts/01_creating_advanced_maps/overview-of-map-builder>`.
es: Los mapas visualizados en la ficha Mapa no se pueden personalizar, salvo la posibilidad de elegir otro mapa de base cuando corresponda. Para poder personalizar un mapa o cruzar datos de varios conjuntos de datos, además de guardar un mapa creado, utilice el :doc:`Compilador de mapas <../../creating_maps_charts/01_creating_advanced_maps/overview-of-map-builder>`.
fr: Les cartes affichées dans l'onglet Carte ne peuvent pas être personnalisées. Néanmoins, dans certains cas, vous pourrez choisir un fond de carte. Pour personnaliser une carte, croiser des données de différents jeux de données ou enregistrer une carte créée, utilisez l':doc:`Éditeur de cartes <../../creating_maps_charts/01_creating_advanced_maps/overview-of-map-builder>`.
nl: Kaarten die staan weergegeven in het tabblad Kaart kunnen niet worden gepersonaliseerd, behalve wanneer een andere basiskaart wordt gekozen wanneer dit mogelijk is. Om een kaart te kunnen personaliseren of data uit verschillende datasets weer te geven, of ook om een aangemaakte kaart te bewaren, kunt u gebruik maken van de :doc:`Map Builder <../../creating_maps_charts/01_creating_advanced_maps/overview-of-map-builder>`.

source: Visualizing data through a chart
de: Visualisieren von Daten in einem Diagramm
es: Visualizar datos en un gráfico
fr: Visualiser des données via un graphe
nl: Data weergeven door middel van een grafiek

source: The chart visualization is accessible from the Analyze tab.
de: Auf die Diagrammvisualisierung kann über die Registerkarte Analyse zugegriffen werden.
es: La visualización de gráfico está accesible en la ficha Analizar.
fr: Dans l'onglet Analyse, vous pouvez accéder à la visualisation Graphe.
nl: De Grafiek-weergave is toegankelijk vanaf het tabblad Analyseer.

source: It displays a default chart, set by the portal administrators. It is however possible, and encouraged, to configure other charts to make other analysis than the default one.
de: Hier wird ein Standard-Diagramm angezeigt, das von den Administratoren des Portals eingerichtet wurde. Es ist jedoch möglich - und wird empfohlen - andere Diagramme so zu konfigurieren, dass sie eine andere Analyse als die Standardanalyse durchführen.
es: Visualiza un gráfico predeterminado, establecido por los administradores del portal. Sin embargo, es posible y recomendable configurar otros gráficos para hacer otros análisis además del predeterminado.
fr: Un graphe par défaut, défini par les administrateurs du portail, est affiché. Il est toutefois possible, et recommandé, de configurer d'autres graphes pour effectuer d'autres analyses que celle par défaut.
nl: Ze geeft een standaard kaart weer die is ingesteld door de portaalbeheerders. Het is echter mogelijk, en wordt zelfs aangemoedigd, om andere grafieken te configureren om andere analyses uit te voeren dan de standaard analyses.

source: Above the chart are displayed a variety of buttons and options to configure the chart:
de: Über dem Diagramm sind unterschiedliche Buttons und Optionen zu sehen, mit denen das Diagramm konfiguriert werden kann.
es: Encima del gráfico se visualizan diversos botones y opciones para configurar el gráfico:
fr: Différents boutons et options de configuration du graphe figurent au-dessus de celui-ci :
nl: Bovenaan de grafiek staan een aantal knoppen en opties om de grafiek te configureren:

source: The first line is to configure the base of the chart.
de: In der ersten Zeile kann die Basis des Diagramms konfiguriert werden.
es: La primera línea sirve para configurar la base del gráfico.
fr: La première ligne permet de configurer la base du graphe.
nl: De eerste lijn is om de basis van de grafiek te configureren.

source: X axis: to choose which field to use as X axis (horizontal line)
de: X-Achse: um das Feld auszuwählen, das als X-Achse (horizontale Linie) verwendet werden soll.
es: Eje X: para elegir qué campo se usará como eje X (línea horizontal)
fr: Axe X : pour choisir le champ à utiliser en tant qu'axe X (ligne horizontale)
nl: X-as: om te kiezen welk veld moet worden gebruikt als X-as (horizontale lijn)

source: Max. number of points: to choose how many points should be represented on the chart
de: Max. Anzahl der Punkte: zur Auswahl, wie viele Punkte auf dem Diagramm dargestellt werden sollen.
es: Núm. máximo de puntos: para elegir cuántos puntos se deben representar en el gráfico
fr: Nombre de points max. : pour choisir le nombre de points représentés sur le graphe
nl: Maximaal aantal punten: om te kiezen hoeveel punten er moeten worden weergegeven op de grafiek

source: Default ordering: for points to be displayed in a decreasing order in the chart
de: Standard-Reihenfolge: zur Anzeige der Punkte in absteigender Reihenfolge im Diagramm.
es: Ordenación predeterminada: para visualizar los puntos en orden decreciente en el gráfico
fr: Tri par défaut : pour les points devant être affichés dans l'ordre décroissant dans le graphe
nl: Standaard volgorde: zodat punten in dalende volgorde in de grafiek worden weergegeven

source: The second line is to define how the different series are represented.
de: In der zweiten Zeile wird definiert, wie die verschiedenen Verbindungslinien dargestellt werden.
es: La segunda línea sirve para definir cómo se representan las diferentes series.
fr: La deuxième ligne permet de définir le type de représentation des différentes séries.
nl: De tweede lijn is om te definiÃ«ren hoe de verschillende reeksen worden vertegenwoordigd.

source: Break down series: to separate the series into several groups
de: Verbindungslinien aufteilen: um die Verbindungslinien in mehrere Gruppen zu unterteilen.
es: Desglosar series: para separar las series en varios grupos
fr: Ventiler les séries : pour séparer les séries en plusieurs groupes
nl: Onderverdelingsreeks: om de reeksen onder te verdelen in verschillende groepen

source: Stack: for series to be stacked one on top of the other
de: Stapel: um Verbindungslinien übereinander zu stapeln.
es: Apilar: para apilar las series una sobre la otra
fr: Empilerment : pour empiler les séries les unes sur les autres
nl: Stapel: zodat reeksen boven op elkaar kunnen worden gestapeld

source: Add a serie: to display other series on the chart
de: Eine Verbindungslinie hinzufügen: um andere Verbindungslinien im Diagramm anzuzeigen.
es: Añadir una serie: para visualizar otras series en el gráfico
fr: Ajouter une série : pour afficher d'autres séries sur le graphe
nl: Een reeks toevoegen: om andere reeksen op de grafiek weer te geven

source: The third and last line is to configure series separately.
de: In der dritten und letzten Zeile können Verbindungslinien separat konfiguriert werden.
es: La tercera y última línea sirve para configurar las series por separado.
fr: La troisième et dernière ligne permet de configurer les séries de façon distincte.
nl: De derde en laatste lijn is om reeksen afzonderlijk te configureren.

source: a scroll-down menu: to choose a chart type for the series
de: ein Scroll-Down-Menü: zur Auswahl einer Diagrammart für die Verbindungslinien.
es: Menú desplegable: para elegir un tipo de gráfico para las series
fr: Un menu déroulant : pour choisir un type de graphe pour les séries.
nl: Een afrolmenu: om het grafiektype voor de reeks te kiezen

source: a color or color palette: to choose the color of the series
de: eine Farbe oder Farbpalette: zur Auswahl der Farbe der Verbindungslinien.
es: Color o paleta de color: para elegir el color de las series
fr: Une couleur ou palette de couleurs : pour choisir la couleur des séries
nl: een kleur of kleurenpalet: om de kleur voor de reeks te kiezen
