Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/02_looking_up_a_dataset/visualizing_data.po
Languages: de, es, fr, nl

source: Y axis: to choose which field to use as Y axis (vertical line)
de: Y-Achse: um das Feld auszuwählen, das als Y-Achse (vertikale Linie) verwendet werden soll.
es: Eje Y: para elegir qué campo se usará como eje Y (línea vertical)
fr: Axe Y : pour choisir le champ à utiliser en tant qu'axe Y (ligne verticale)
nl: Y-as: om te kiezen welk veld gebruikt moet worden als Y-as (verticale lijn)

source: Use for ordering: for points to be displayed in a decreasing order in the chart, based on the chosen series
de: Verwendung für die Reihenfolge: damit die Punkte auf Grundlage der gewählten Verbindungslinien in absteigender Reihenfolge im Diagramm angezeigt werden.
es: Utilizar para ordenar: para visualizar los puntos en orden decreciente en el gráfico, en función de las series elegidas
fr: Utilisé pour le tri : pour que les points soient affichés dans l'ordre décroissant dans le graphe, en fonction des séries choisies
nl: Gebruik voor rangschikking: zodat punten in dalende volgorde in de grafiek worden weergegeven op basis van de gekozen reeks

source: Charts displayed in the Analyze tab can be modified. However, these modifications cannot be saved. To be able to save a created chart, as well as to cross data from different datasets, use the :doc:`Chart Builder <../../creating_maps_charts/02_creating_advanced_charts/analyze>`.
de: Die in der Registerkarte Analyse angezeigten Diagramme können geändert werden. Diese Änderungen können jedoch nicht gespeichert werden. Um ein erstelltes Diagramm speichern zu können und Daten aus verschiedenen Datensätzen zu überlagern, nutzen Sie den :doc:`Diagrammersteller <../../creating_maps_charts/02_creating_advanced_charts/analyze>`.
es: Los gráficos mostrados en la ficha Analizar se pueden modificar. Con todo, estas modificaciones no se pueden guardar. Para poder guardar un gráfico creado, y cruzar datos de varios conjuntos de datos, utilice el :doc:`Compilador de gráficos <../../creating_maps_charts/02_creating_advanced_charts/analyze>`.
fr: Les graphes affichés dans l'onglet Analyse peuvent être modifiés. Néanmoins, ces modifications ne peuvent pas être enregistrées. Pour pouvoir enregistrer un graphique créé, ainsi que croiser des données de différents jeux de données, utilisez l':doc:`Éditeur de graphes <../../creating_maps_charts/02_creating_advanced_charts/analyze>`.
nl: Grafieken die staan weergegeven in het tabblad Analyseer kunnen worden gewijzigd. Deze wijzigingen kunnen evenwel niet worden bewaard. Om een aangemaakte grafiek te bewaren of om data uit verschillende datasets te gebruiken, kunt u gebruik maken van de :doc:`Chart Builder <../../creating_maps_charts/02_creating_advanced_charts/analyze>`.

source: Visualizing data through images
de: Visualisieren von Daten in Bildern
es: Visualizar datos en imágenes
fr: Visualiser des données via des images
nl: Data weergeven door middel van afbeeldingen

source: The images visualization is accessible from the Images tab.
de: Auf die Bildvisualisierung kann über die Registerkarte Bilder zugegriffen werden.
es: La visualización de imágenes está accesible en la ficha Imágenes.
fr: Dans l'onglet Images, vous pouvez accéder à la visualisation Images.
nl: De Afbeeldingen-weergave is toegankelijk vanaf het tabblad Afbeeldingen.

source: It displays the thumbnails of the images of the dataset. When clicking on a thumbnail, the metadata of the image are displayed. Below the metadata is also displayed a Download image button, to download the selected image.
de: Hier werden Miniaturansichten der Bilder des Datensatzes angezeigt. Wenn Sie auf eine Miniaturansicht klicken, werden die Metadaten des Bildes dargestellt. Unter den Metadaten wird der Button "Bild herunterladen" angezeigt, um das ausgewählte Bild herunterzuladen.
es: Visualiza las miniaturas de las imágenes del conjunto de datos. Al hacer clic en una miniatura, se muestran los metadatos de la imagen. Bajo los metadatos también se visualiza un botón Descargar imagen para descargar la imagen seleccionada.
fr: Les aperçus des images du jeu de données sont affichés. Lorsque vous cliquez sur un aperçu, les métadonnées de l'image s'affichent. Un bouton Télécharger l'image se trouve également sous les métadonnées, pour vous permettre de télécharger l'image sélectionnée.
nl: Deze geeft de thumbnails van de afbeeldingen van de dataset weer. Wanneer op een thumbnail wordt geklikt, worden de metadata van de afbeelding weergegeven. Onderaan de metadata staat ook een knop "Download afbeelding" om de geselecteerde afbeelding te downloaden.

source: Visualizing data in a calendar
de: Visualisieren von Daten in einem Kalender
es: Visualizar datos en un calendario
fr: Visualiser des données dans un calendrier
nl: Data weergeven in een kalender

source: The calendar visualization is accessible from the Calendar tab.
de: Auf die Kalendervisualisierung kann über die Registerkarte Kalender zugegriffen werden.
es: La visualización de calendario está accesible en la ficha Calendario.
fr: Dans l'onglet Calendrier, vous pouvez accéder à la visualisation Calendrier.
nl: De Kalender-weergave is toegankelijk vanaf het tabblad Kalender.

source: It displays a calendar on which events of the dataset are displayed. When clicking on an event, its related tooltip is displayed. It contains more information about the event.
de: Angezeigt wird ein Kalender, in dem die Ereignisse des Datensatzes dargestellt werden. Mit einem Klick auf ein Ereignis wird die entsprechende QuickInfo angezeigt. Diese enthält weitere Informationen über das Ereignis.
es: Visualiza un calendario en que se muestran eventos del conjunto de datos. Al hacer clic en un evento, se visualiza su ayuda de herramienta relacionada. Contiene más información sobre el evento.
fr: Un calendrier présentant les événements en lien avec le jeu de données s'affiche. Lorsque vous cliquez sur un événement, l'infobulle associée, qui contient plus d'informations sur l'événement, s'affiche.
nl: Deze geeft een kalender weer waarop gebeurtenissen van de dataset worden weergegeven. Wanneer op een gebeurtenis wordt geklikt, wordt de eraan verbonden tooltip weergegeven. Deze bevat meer informatie over de gebeurtenis.

source: Above the calendar are displayed a variety of buttons to navigate the calendar:
de: Über dem Kalender sind unterschiedliche Buttons zur Navigation durch den Kalender zu sehen:
es: Encima del calendario se visualizan diversos botones para navegar por el calendario:
fr: Divers boutons sont affichés au-dessus du calendrier pour parcourir ce dernier :
nl: Bovenaan de kalender staan een aantal knoppen om door de kalender te browsen:

source: |icon-leftleft| and |icon-rightright| to see the dates of the current calendar page a year earlier or later
de: |icon-leftleft| und |icon-rightright| um die Daten der aktuellen Kalenderseite ein Jahr früher oder später anzuzeigen.
es: |icon-leftleft|/|icon-rightright|: para consultar las fechas de la página del calendario actual un año antes o después
fr: Des icônes |icon-leftleft| et |icon-rightright| pour voir les dates de la page du calendrier actuelle un an plus tôt ou un an plus tard
nl: |icon-leftleft| en |icon-rightright| om de datums van de huidige kalenderpagina een jaar eerder of later te zien

source: |icon-left| and |icon-right| to see the month/week/day earlier or later the current calendar page
de: |icon-left| und |icon-right| um den Monat/die Woche/den Tag vor oder nach der aktuellen Kalenderseite zu sehen.
es: icon-left|/|icon-right|: para consultar el mes/semana/día antes o después de la página del calendario actual
fr: Des icônes |icon-left| et |icon-right| pour voir le mois/la semaine/le jour précédent(e) ou suivant(e) par rapport à la page du calendrier actuelle
nl: |icon-left| en |icon-right| om de maand/week/dag eerder of later op de huidige kalenderpagina te zien

source: Today to display today's calendar page
de: Heute zur Anzeige der heutigen Kalenderseite.
es: Hoy: para visualizar la página del calendario de hoy
fr: Un bouton "Aujourd'hui" pour afficher la page du calendrier du jour
nl: Vandaag om de kalenderpagina van vandaag weer te geven

source: month, week, day for the calendar page to display a whole month, week or just a day
de: Monat, Woche, Tag, damit die Kalenderseite einen ganzen Monat, eine ganze Woche oder nur einen Tag anzeigt.
es: Mes, semana o día de la página del calendario: para visualizar un mes entero, una semana o solo un día
fr: Des boutons "mois", "semaine" et "jour" pour que la page du calendrier affiche le mois entier, la semaine ou juste une journée
nl: maand, week, dag voor de kalenderpagina om een volledige maand, week of enkel een dag weer te geven

source: Published datasets on an OpenDataSoft portal can be represented by up to 6 different visualizations. The number of available visualizations for a dataset completely depends on what kind of data the dataset contains. Among these 6 visualizations, there are 5 standard visualizations:
nl: Datasets die gepubliceerd worden op een OpenDataSoft-portaal kunnen vertegenwoordigd worden door maximaal 6 verschillende weergaves. Het aantal beschikbare weergaves voor een dataset hangt volledig af van het type data de dataset bevat. Van deze 6 weergaves zijn er 5 standaard weergaves:
