Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/authentication.po
Languages: de, es, fr, it, nl

source: Authenticating yourself
de: Sich authentifizieren
es: Autenticarse
fr: Authentification
it: Come eseguire l'autenticazione
nl: Uzelf identificeren

source: It is very important that you tell the platform who you are when you are making requests to the API or you will be treated as an anonymous user, thus loosing special access privileges you may have obtained on either portals or datasets.
de: Es ist äußerst wichtig, dass Sie der Plattform mitteilen, wer Sie sind, wenn Sie Anforderungen an die API senden. Ansonsten werden Sie als anonymer Benutzer behandelt und verlieren somit besondere Zugriffsrechte, die Sie für Portale oder Datensätze erhalten haben.
es: Es muy importante que indique su identidad a la plataforma cuando efectúe solicitudes en la API; de lo contrario, le considerará un usuario anónimo y perderá los privilegios de acceso especiales que haya obtenido en portales o conjuntos de datos.
fr: Il est très important d'indiquer à la plateforme qui vous êtes lorsque vous envoyez des demandes à l'API. Dans le cas contraire, vous serez considéré comme un utilisateur non authentifié, et vous perdrez donc les privilèges d'accès spéciaux dont vous bénéficiez sur les portails ou sur les jeux de données.
it: Quando si inviano richieste all'API, l'autenticazione è molto importante, per evitare di essere considerati utenti anonimi e perdere così i privilegi di accesso speciali ottenuti sui portali o sui dataset.
nl: Het is zeer belangrijk dat u het platform vertelt wie u bent en wanneer u aanvragen doet aan de API of anders wordt u behandeld als een anonieme gebruiker en verliest u speciale toegangsprivileges die u heeft bekomen voor portalen of datasets.

source: In order for the platform to know who you are, you need to either:
de: Damit die Plattform weiß, wer Sie sind, müssen Sie:
es: Para que la plataforma conozca su identidad, tiene que:
fr: Afin que la plateforme sache qui vous êtes, vous devez soit :
it: Per autenticarsi correttamente sulla piattaforma è necessario effettuare una delle seguenti operazioni:
nl: Opdat het platform weet wie u bent, moet u ofwel:

source: be logged in a portal and make queries from the portal on the portal (using the console for example), or
de: entweder bei einem Portal eingeloggt sein und Anfragen vom Portal aus über das Portal machen (z. B. mithilfe der Konsole)
es: haber iniciado la sesión en un portal y efectuar consultas desde el portal en el portal (por ejemplo, mediante la consola); o bien
fr: être connecté à un portail et effectuer des demandes depuis le portail sur le portail (à l'aide de la console par exemple), soit
it: avere eseguito l'accesso a un portale e da qui eseguire query sul portale stesso, ad esempio utilizzando la console;
nl: ingelogd zijn op een portaal en zoekopdrachten uitvoeren vanuit het portaal op het portaal (bijvoorbeeld door de console te gebruiken), of

source: provide an **API key** along with your requests that will uniquely identify you.
de: oder einen **API-Schlüssel** mit Ihren Anforderungen bereitstellen, der Sie eindeutig identifiziert.
es: facilitar una **clave de API** junto con las solicitudes para identificarse de manera exclusiva.
fr: fournir une **clé d'API** avec vos demandes afin de permettre à la plateforme de vous authentifier.
it: fornire insieme alle richieste anche una **chiave API** che identifichi in modo univoco l'utente.
nl: een **API-sleutel** opgeven samen met uw aanvragen waarmee u op unieke wijze kan worden ge√Ødentificeerd.d

source: Finding and generating API keys
de: Finden und Generieren von API-Schlüsseln
es: Encontrar y generar claves de API
fr: Obtenir et générer des clés d'API
it: Come trovare e generare le chiavi API
nl: API-sleutels genereren en terugvinden

source: In order to see the list of your API keys, head to your profile page on ``http://<youropendatasoftportal>.com/account/`` (or by clicking on your name in the header).
de: Um die Liste Ihrer API-Schlüssel zu sehen, wechseln Sie zur Profilseite auf ``http://<youropendatasoftportal>.com/account/`` (oder durch Klicken auf Ihren Namen in der Überschrift).
es: Para ver la lista de las claves de API, vaya a la página de su perfil en ``http://<youropendatasoftportal>.com/account/`` (o haga clic en su nombre en el encabezado).
fr: Afin d'afficher la liste de vos clés d'API, accédez à la page de votre profil à l'adresse ``http://<youropendatasoftportal>.com/account/`` (ou en cliquant sur votre nom dans l'en-tête).
it: Per visualizzare l'elenco delle chiavi API di cui disponi, vai alla pagina del tuo profilo all'indirizzo ``http://<tuoportaleopendatasoft>.com/account/`` o clicca sul tuo nome nell'header.
nl: Om de lijst met API-sleutels te zien, ga naar uw profielpagina op ``http://<youropendatasoftportal>.com/account/`` (of klik op uw naam in de header).

source: Once there, go to the tab entitled *My API keys* to see the list of your active keys, revoke them and create new ones.
de: Wechseln Sie auf der Profilseite zum Register namens *Meine API-Schlüssel*, um die Liste Ihrer aktiven Schlüssel anzuzeigen, sie zu sperren oder neue zu erstellen.
es: Una vez ahí, vaya a la ficha *Mis claves de API* para ver la lista de las claves activas, revocarlas y crear otras nuevas.
fr: Une fois sur la page, accédez à l'onglet intitulé *Mes clés d'API* pour afficher la liste de vos clés actives, révoquer des clés ou en créer.
it: Apri quindi la scheda *Le mie chiavi API* per visualizzare l'elenco delle chiavi attive, revocarle e crearne di nuove.
nl: Eenmaal u daar bent aangekomen, ga naar het tabblad met als titel *Mijn API-sleutels* om de lijst met uw actieve sleutels te zien, herroep deze en maak nieuwe aan.

source: While you may have as many keys as you want, they all identify you identically. Which means that they all grant the same rights (yours) to any person using them. Therefore you shouldn't share your keys.
de: Sie können so viele Schlüssel haben, wie Sie möchten, sie identifizieren Sie alle auf die gleiche Weise. Das heißt, dass sie allen Personen, die sie verwenden, die gleichen Berechtigungen einräumen (nämlich Ihre). Deswegen sollten Sie Ihre Schlüssel nicht teilen.
es: Aunque puede tener tantas claves como desee, todas lo identifican de manera idéntica. Es decir, todas conceden los mismos derechos (los suyos) a cualquier persona que las utilice. Por consiguiente, no debería compartir las claves.
fr: Bien que vous puissiez disposer d'autant de clés que vous le souhaitez, elles vous identifient toutes de la même manière. Ce qui signifie qu'elles octroient toutes les mêmes droits (les vôtres) à toute personne qui les utilise. Vous ne devez donc pas partager vos clés.
it: Le chiavi possono essere illimitate, ma tutte identificano l'utente nello stesso modo e concedono gli stessi diritti alla persona che le utilizza. Per questa ragione, è importante che non siano condivise con nessuno.
nl: Hoewel u zoveel sleutels kan hebben als u wil, zullen ze u allemaal op identieke wijze identificeren. Dit betekent dat ze allemaal dezelfde rechten (die van u) verlenen aan elke persoon die ze gebruikt. Daarom mag u uw sleutels niet delen.

source: Providing API keys within your requests
de: Bereitstellen von API-Schlüsseln in Anforderungen
es: Proporcionar claves de API en las solicitudes
fr: Fournir des clés d'API à l'intérieur de vos demandes
it: Inclusione delle chiavi API nelle richieste
nl: API-sleutels verschaffen in uw aanvragen

source: Now that you have an API key, you can pass it along your request through the query parameter ``apikey``.
de: Jetzt, wo Sie einen API-Schlüssel haben, können Sie ihn zusammen mit Ihren Anforderungen durch den Anfrageparameter ``apikey`` übermitteln.
es: Ahora que tiene una clave de API, puede pasarla con la solicitud por medio del parámetro de consulta ``apikey``.
fr: Maintenant que vous disposez d'une clé d'API, vous pouvez la joindre à vos demandes à l'aide du paramètre de requête ``apikey``.
it: Una volta ottenuta una chiave API, puoi inviarla insieme alla tua richiesta mediante il parametro di query ``apikey``.
nl: Nu u een API-sleutel heeft, kan u deze samen met uw aanvraag doorgeven via de zoekparameters ``apikey``.

source: To illustrate this, let's say that you have set up a private portal and would like to retrieve the list of datasets from an external application you are building.
de: Zur Veranschaulichung dessen nehmen wir einmal an, dass Sie ein privates Portal eingerichtet haben und die Liste der Datensätze von einer externen Anwendung, die Sie erstellen, abrufen möchten.
es: Para ilustrarlo, supongamos que ha configurado un portal privado y desea recuperar la lista de conjuntos de datos desde una aplicación externa que está creando.
fr: Pour illustrer cela, imaginons que vous avez configuré un portail privé et que vous souhaitez récupérer la liste des jeux de données depuis une application que vous êtes en train de créer.
it: Ipotizziamo, ad esempio, che tu abbia creato un portale privato e che desideri recuperare l'elenco dei dataset da un'applicazione esterna che stai sviluppando.
nl: Om dit te illustreren, laten we zeggen dat u een privaat portaal hebt opgemaakt en dat u de lijst met datasets uit een externe bron die u aan het bouwen bent, wil ophalen.

source: If your application calls::
de: Wenn Ihre Anwendung folgenden Aufruf startet:
es: Si la aplicación realiza esta llamada:
fr: Si votre application appelle :
it: Se la tua applicazione esegue la seguente chiamata:
nl: Indien uw applicatie belt:

source: You'll receive a ``403 Forbidden`` error.
de: Sie werden die Fehlermeldung ``403 Verboten`` erhalten.
es: Recibirá un error ``403 Forbidden``.
fr: Vous recevrez une erreur ``403 Interdit``.
it: Riceverai un errore ``403 Non consentito``.
nl: U krijgt een ``403 Forbidden`` fout.

source: Whereas if you call::
de: Starten Sie hingegen folgenden Aufruf:
es: Mientras que si efectúa esta llamada:
fr: Alors que si vous appelez :
it: Mentre se la chiamata avviene come segue:
nl: Terwijl wanneer u belt:

source: You'll get a JSON with the full list of datasets available on the portal.
de: Sie werden eine JSON (JavaScript Object Notation) mit der vollständigen Liste der auf dem Portal verfügbaren Datensätze erhalten.
es: Obtendrá un objeto JSON con la lista completa de los conjuntos de datos disponibles en el portal.
fr: Vous obtiendrez un tableau JSON contenant la liste complète des jeux de données disponibles sur le portail.
it: Otterrai un risultato in formato JSON con l'elenco completo dei dataset disponibili sul portale.
nl: U een JSON krijgt met de volledige lijst met datasets die beschikbaar zijn op het portaal.
