Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/introduction.po
Languages: de, es, fr, it

source: OpenDataSoft implements this norm for the simple operations (searching for datasets and records) but the more complex ones (such as analysis, aggregations, geographic computations...) are only available through our V1 and V2 APIs.
de: OpenDataSoft implementiert diese Norm für einfache Vorgänge (Suche nach Datensätzen und Einträgen), komplexere Vorgänge (wie Analysen, Aggregationen, geografische Berechnungen...) sind nur mit V1- und V2-APIs verfügbar.
es: OpenDataSoft implementa esta norma para las operaciones simples (buscar conjuntos de datos y registros), pero las más complejas (como análisis, agregaciones, cálculos geográficos...) solo están disponibles a través de las API V1 y V2.
fr: OpenDataSoft met en œuvre cette norme pour les opérations simples (la recherche de jeux de données et d'enregistrements), les opérations plus complexes (par ex. l'analyse, les agrégations, les calculs géographiques...) sont uniquement disponibles via les API v1 et v2.
it: OpenDataSoft implementa questa norma per le operazioni semplici, come la ricerca di dataset e di record, mentre quelle più complesse, come analisi, aggregazioni, calcoli geografici e così via, sono disponibili solo con le API V1 e V2.

source: WFS and CSW
de: WFS und CSW
es: WFS y CSW
fr: WFS et CSW
it: WFS e CSW

source: These are both standards focusing on geographic data and as such are especially relevant if you're looking to interface the platform with other GIS software.
de: Beide sind Standards, die sich auf geografische Daten konzentrieren. Sie sind daher besonders wichtig, falls Sie die Plattform mit weiterer GIS-Software koppeln möchten.
es: Ambos son estándares que se centran en los datos geográficos y como tal son especialmente relevantes si la plataforma debe interactuar con otro software GIS.
fr: Il s'agit de normes portant sur les données géographiques, elles sont donc utiles si vous souhaitez créer une interface entre la plateforme et d'autres logiciels GIS.
it: Si tratta di due standard utilizzati per i dati geografici e sono quindi particolarmente importanti se desideri interfacciare la piattaforma con altro software GIS.
