Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/introduction.po
Languages: de, es, fr, it

source: Introduction
de: Einführung
es: Introducción
it: Introduzione

source: In this section we'll explore what the OpenDataSoft API does, why it has two versions and how to retrieve data from it.
de: In diesem Abschnitt lernen wir, was die OpenDataSoft-API kann, warum sie in zwei Versionen vorhanden ist und wie Sie daraus Daten abrufen können.
es: En esta sección exploraremos qué hace la API de OpenDataSoft, por qué existen 2 versiones y cómo recuperar datos de ella.
fr: Dans cette section, nous allons découvrir à quoi sert l'API OpenDataSoft, pourquoi il en existe deux versions et comment l'utiliser pour récupérer des données.
it: Questa sezione descrive il funzionamento dell'API OpenDataSoft, le differenze tra le sue due versioni e come recuperare i dati ottenuti tramite essa.

source: Unsure about what an API is and what it can be used for? We published a short, illustrated guide to APIs that you probably should go through before reading this part of the documentation.
de: Sie wissen nicht genau, was eine API ist und wozu sie dient? Wir haben einen kurzen, illustrierten Leitfaden zu APIs veröffentlicht, den Sie am besten durchlesen, bevor Sie diesen Teil der Dokumentation lesen.
es: ¿No está seguro de qué es una API y para qué sirve? Hemos publicado una breve guía ilustrada sobre las interfaces API que probablemente le interese examinar antes de leer esta parte de la documentación.
fr: Vous n'êtes pas sûr de savoir ce qu'est une API et à quoi elle peut servir ? Nous avons mis en ligne un petit guide illustré sur les API. Nous vous recommandons de le lire avant d'aborder cette partie de la documentation.
it: Non sei sicuro di sapere cosa sia un’API e a cosa serva? Prima di leggere questa parte della documentazione, consulta la nostra breve guida illustrata dedicata alle API.

source: Check out `The 10 critical insights to leverage the value of your data with APIs <http://hello.opendatasoft.com/free-api-guide-ten-critical-insights-to-leverage-the-value-of-your-data-with-apis/>`_
de: Lesen Sie `10 wichtige Erkenntnisse, um Ihre Daten mit APIs effizient zu nutzen <http://hello.opendatasoft.com/free-api-guide-ten-critical-insights-to-leverage-the-value-of-your-data-with-apis/>`_
es: Consulte la guía `The 10 critical insights to leverage the value of your data with APIs <http://hello.opendatasoft.com/free-api-guide-ten-critical-insights-to-leverage-the-value-of-your-data-with-apis/>`_.
fr: Consultez le document en anglais `10 informations critiques pour maximiser la valeur de vos données grâce aux API <http://hello.opendatasoft.com/free-api-guide-ten-critical-insights-to-leverage-the-value-of-your-data-with-apis/>`_
it: Scopri i `10 punti fondamentali per valorizzare al meglio i tuoi dati con le API <http://hello.opendatasoft.com/free-api-guide-ten-critical-insights-to-leverage-the-value-of-your-data-with-apis/>`_.

source: An *Application Programming Interface*, or API for short, is an interface designed to let programs exchange data. OpenDataSoft's API provide an unified way of accessing any data that were pushed to the platform, regardless of their source or format, while still enforcing security rules defined by the data owner.
de: Eine Progammierschnittstelle, *Application Programming Interface*, kurz API, ist eine Schnittstelle für den Datenaustausch von Programmen. Die OpenDataSoft-API bietet eine vereinheitlichte Methode, um auf alle beliebigen Daten zuzugreifen, die auf die Plattform gepusht wurden, unabhängig von Ihrer Quelle oder ihrem Format. Dabei werden die vom Datenbesitzer festgelegten Sicherheitsregeln berücksichtigt.
es: Una *interfaz de programación de aplicaciones* (API) es una interfaz diseñada para permitir a los programas intercambiar datos. La API de OpenDataSoft proporciona una manera unificada de acceder a los datos insertados en la plataforma, independientemente de su origen o formato, al tiempo que se aplican las reglas de seguridad definidas por el propietario de los datos.
fr: Une *interface de programmation applicative*, abrégée en API (Application Programming Interface), est une interface conçue pour permettre l'échange de données entre différents programmes. L'API OpenDataSoft offre une méthode d'accès unifiée à toutes les données téléchargées sur la plateforme, quels que soient leur source et leur format, tout en appliquant les règles de sécurité définies par le propriétaire des données.
it: Un'API (*Application Programming Interface*, interfaccia di programmazione di un'applicazione) è un'interfaccia che permette lo scambio di dati tra i programmi. L'API OpenDataSoft consente l’accesso unificato a qualsiasi dato inviato alla piattaforma, a prescindere dall'origine e dal formato, nel rispetto delle regole di sicurezza definite dal proprietario dei dati.

source: The whole OpenDataSoft platform relies exclusively on these very APIs to access the data. They are heavily used by our `widgets library <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ which are only a presentation layer for the data provided by the APIs.
de: Die gesamte OpenDataSoft-Plattform beruht ausschließlich auf diesen bestimmten APIs für den Datenzugriff. Sie werden von unserer Widget-Bibliothek <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ umfassend genutzt. Dabei handelt es sich lediglich um eine Präsentationsschicht für die Daten, die von den APIs zur Verfügung gestellt werden.
es: Toda la plataforma OpenDataSoft se basa exclusivamente en estas mismas interfaces API para acceder a los datos. Estas son usadas intensamente por la `biblioteca de widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_, que son tan solo una capa de presentación de los datos facilitados por las API.
fr: L'ensemble de la plateforme OpenDataSoft repose exclusivement sur ces API pour accéder aux données. Elles sont en particulier utilisées par notre `bibliothèque de widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_. Il s'agit uniquement d'une couche de présentation pour les données fournies par les API.
it: L'intera piattaforma OpenDataSoft basa l'accesso ai dati esclusivamente sulle API. Queste ultime vengono particolarmente utilizzate dalla nostra `libreria di widget <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_, che sono solo un layer di presentazione per i dati forniti dalle API.

source: These APIs allow you to search for datasets, search for data, compute analysis, perform geographic aggregation and much more.
de: Diese APIs ermöglichen Ihnen die Suche nach Datensätzen und Daten sowie die Erstellung von Analysen, die Durchführung von geografischen Aggregationen uvm.
es: Estas API permiten buscar conjuntos de datos, buscar datos, calcular análisis, realizar agregaciones geográficas y otras muchas tareas.
fr: Ces API vous permettent de rechercher des jeux de données, d'effectuer des recherches parmi les données, de calculer des analyses, de réaliser des agrégations géographiques et bien plus encore.
it: Le API permettono di ricercare dataset o dati, elaborare analisi, eseguire aggregazioni geografiche e molto altro.

source: Key concepts
de: Schlüsselkonzepte
es: Conceptos clave
fr: Concepts clés
it: Concetti chiave

source: All APIs will provide you access to the same data, only in different ways. It is very important to be familiar with the nature of this data before diving the full specification of each API.
de: Sämtliche APIs bieten Ihnen Zugang zu den selben Daten, jedoch auf verschiedene Weise. Es ist sehr wichtig, mit den Eigenschaften dieser Daten vertraut zu sein, bevor Sie die gesamte Spezifikation jeder API näher betrachten.
es: Todas las API dan acceso a los mismos datos, pero de formas distintas. Es muy importante conocer la naturaleza de estos datos antes de explorar toda la especificación de cada una de las API.
fr: Toutes les API vous donnent accès aux mêmes données, mais de différentes manières. Il est particulièrement important de s'être familiarisé avec la nature de ces données avant de se plonger dans les spécifications complètes de chaque API.
it: Tutte le API permettono di accedere agli stessi dati, ma con modalità diverse. È quindi molto importante conoscere la natura dei dati prima di esaminare in modo dettagliato le specifiche di ogni API.

source: Everything within the platform is related through a tree structure. Which means that you can think of OpenDataSoft as such:
de: Alle Plattformelemente sind in einer Baumstruktur miteinander verbunden. Sie können OpenDataSoft also folgendermaßen verstehen:
es: Todo lo que incluye la plataforma está relacionado a través de una estructura de árbol. Esto significa que OpenDataSoft puede considerarse como tal:
fr: Tous les composants de la plateforme sont organisés dans une arborescence. Cela signifie que vous pouvez envisager OpenDataSoft de la manière suivante :
it: Tutto il contenuto della piattaforma è organizzato secondo una struttura gerarchica ad albero, che si può riassumere nel seguente modo:

source: The **OpenDataSoft platform** is a network of OpenDataSoft portals.
de: Die **OpenDataSoft-Plattform** ist ein Netzwerk aus mehreren OpenDataSoft-Portalen.
es: La **plataforma OpenDataSoft** es una red de portales OpenDataSoft.
fr: La **plateforme OpenDataSoft** est un réseau de portails OpenDataSoft.
it: La **piattaforma OpenDataSoft** è una rete di portali OpenDataSoft.

source: A **portal** provides a **catalog** of all of its **datasets**.
de: Ein **Portal** bietet einen **Katalog** bestehend aus all seinen **Datensätzen**.
es: Un **portal** proporciona un **catálogo** de todos sus **conjuntos de datos**.
fr: Un **portail** fournit un **catalogue** de tous ses **jeux de données**.
it: Un **portale** contiene un **catalogo** di tutti i **dataset**.

source: Each **dataset** is defined by a dictionary of **metadata**, a **data schema** (specifying fields names and types) and a collection of **records**.
de: Jeder **Datensatz** wird durch ein **Metadaten**-Wörterbuch, ein **Datenschema** (das Feldnamen und -typen angibt) und eine Sammlung an **Einträgen** definiert.
es: Cada uno de los **conjuntos de datos** está definido por un diccionario de **metadatos**, un **esquema de datos** (que especifica los nombres y tipos de campos) y una colección de **registros**.
fr: Chaque **jeu de données** est défini par un dictionnaire de **métadonnées**, un **schéma de données** (qui spécifie les noms et les types de champs) et une collection d'**enregistrements**.
it: Ogni **dataset** è definito da un dizionario di **metadati**, uno **schema di dati** (che specifica i nomi e i tipi dei campi) e una serie di **record**.

source: Each **record** provides values for each of the dataset's fields.
de: Jeder **Eintrag** bietet Werte für jedes einzelne Datensatzfeld.
es: Cada uno de los **registros** suministra valores para cada uno de los campos del conjunto de datos.
fr: Chaque **enregistrement** fournit des valeurs pour chacun des champs du **jeu de données**.
it: Ogni **record** fornisce dei valori per ogni campo del dataset.

source: There are of course many more types of data within the platform, but they are only relevant in very specific contexts.
de: Natürlich enthält die Plattform noch weit mehr Datentypen, doch diese sind nur in spezifischem Kontext relevant.
es: Obviamente hay muchos más tipos de datos en la plataforma, pero solo son relevantes en contextos muy específicos.
fr: Il existe bien entendu de nombreux autres types de données au sein la plateforme, mais ces dernières ne sont pertinentes que dans certains contextes très spécifiques.
it: Naturalmente la piattaforma include anche molti altri tipi di dati, che tuttavia entrano in gioco in contesti molto specifici.

source: The OpenDataSoft platform provides its own API (ODS API v1 and v2) and some standard API's implementations such as ODATA , WFS or CSW.
de: Die OpenDataSoft-Plattform bietet ihre eigene API (ODS API v1 und v2) sowie einige Standard-API-Implementierungen wie ODATA , WFS oder CSW.
es: La plataforma OpenDataSoft proporciona su propia API (la API V1 y la API V2 de ODS) y algunas implementaciones de la API estándar como ODATA, WFS o CSW.
fr: La plateforme OpenDataSoft propose sa propre API (API ODS v1 et v2) et intègre certaines API standard telles qu'ODATA, que WFS ou que CSW.
it: La piattaforma OpenDataSoft offre una propria API (ODS API v1 e v2) e alcune implementazioni di API standard come ODATA, WFS o CSW.

source: ODS API
es: API de ODS
fr: API ODS
it: API ODS

source: This API is the one used internally by the OpenDataSoft platform and widgets. If you want to develop your own application, this is also the best way to go.
de: Die OpenDataSoft-Plattform und die Widgets nutzen intern diese Plattform. Wenn Sie Ihre eigene Anwendung entwickeln möchten, können Sie dies natürlich auch tun.
es: Esta API es la empleada internamente por la plataforma y los widgets OpenDataSoft. Si desea desarrollar su propia aplicación, también es la mejor elección.
fr: Cette API est celle utilisée en interne par la plateforme et les widgets OpenDataSoft. Si vous souhaitez développer votre propre application, cette API est la plus adaptée.
it: Questa è l'API utilizzata internamente dalla piattaforma e dai widget OpenDataSoft, ed è la soluzione migliore se desideri sviluppare una tua applicazione.

source: Differences between ODS APIv1 and APIv2
de: Unterschiede zwischen ODS APIv1 und APIv2
es: Diferencias entre la API V1 y la API V2 de ODS
fr: Différences entre les APIv1 et APIv2 ODS
it: Differenze tra ODS APIv1 e APIv2

source: This API is currently under development and will be officially available soon, but don't hesitate to give it a try : :doc:`V2 </using_api/v2/index>`.
de: Diese API ist momentan in der Entwicklungsphase und wird bald offiziell zur Verfügung stehen, Sie können sie jedoch bereits jetzt testen: :doc:`V2 </using_api/v2/index>`.
es: Esta API actualmente está en desarrollo y pronto estará disponible, pero no dude en probarla: :doc:`V2 </using_api/v2/index>`.
fr: Cette API est actuellement en développement et sera prochainement disponible officiellement. N'hésitez pas cependant à l'essayer : :doc:`V2 </using_api/v2/index>`.
it: La versione 2 dell'API è attualmente in fase di sviluppo e sarà disponibile ufficialmente a breve, ma è già possibile provarla: :doc:`V2 </using_api/v2/index>`.

source: Here is the main differences and key changes between APIv1 and APIv2.
de: Dies sind die wichtigsten Unterschiede und Änderungen von APIv1 im Vergleich zu APIv2.
es: A continuación se muestran las principales diferencias y los cambios clave entre la API V1 y la API V2.
fr: Voici une liste des principales différences et modifications clés qui distinguent l'APIv1 de l'APIv2.
it: Di seguito sono riportati i cambiamenti più rilevanti e le differenze principali tra APIv1 e APIv2.

source: APIv2 introduces a better implementation of REST principles. Each API entry-point provides links to easily navigate between linked resources (HATEOAS).
de: APIv2 bietet eine bessere Implementierung für REST-Prinzipien. Jeder API-Einstiegspunkt bietet Links zum einfachen Navigieren zwischen verlinkten Ressourcen (HATEOAS).
es: La API V2 introduce una mejor implementación de los principios REST. Cada uno de los puntos de entrada de la API suministra vínculos para navegar fácilmente entre los recursos vinculados (HATEOAS).
fr: L'APIv2 signe l'arrivée d'une meilleure implémentation des principes REST. Chaque point d'entrée de l'API présente des liens permettant de naviguer facilement entre les différentes ressources liées (HATEOAS).
it: APIv2 migliora l'implementazione dei principi REST. Ogni entrypoint dell'API include link che permettono di spostarsi più agevolmente tra le risorse collegate (HATEOAS).

source: This API proposes a more complete query language with new functions and arithmetic expressions.
de: Diese API bietet eine umfassendere Anfragesprache mit neuen Funktionen und arithmetischen Ausdrücken.
es: Esta API propone un lenguaje de consulta más completo, con nuevas funciones y expresiones aritméticas.
fr: Cette API dispose d'un langage de requêtes plus complet comportant de nouvelles fonctions et expressions arithmétiques.
it: Questa API utilizza un linguaggio di query più completo, con nuove funzioni ed espressioni aritmetiche.

source: Special filters (geofilter or facet filters) are moved to the query language instead. For instance ``geofilter.distance='42,1,100'`` is replaced by ``q=distance(geo_field,geom'Point(42 1)',100)``
de: Stattdessen werden spezielle Filter (Geofilter oder Facet-Filter) in die Anfragesprache verschoben. Beispielsweise wird ``geofilter.distance='42,1,100'`` durch ``q=distance(geo_field,geom'Point(42 1)',100)`` ersetzt
es: En cambio, los filtros especiales (filtros geográficos o de facetas) se han trasladado al lenguaje de consulta. Por ejemplo, ``geofilter.distance='42,1,100'`` se ha sustituido por ``q=distance(geo_field,geom'Point(42 1)',100)``.
fr: Les filtres spéciaux (filtres de facettes ou filtre géographique) sont désormais intégrés au langage de requêtes. Par exemple, ``geofilter.distance='42,1,100'`` est remplacé par ``q=distance(geo_field,geom'Point(42 1)',100)``
it: I filtri speciali (filtro geografico o dei facet) sono stati spostati nel linguaggio di query. ``geofilter.distance='42,1,100'``, ad esempio, è stato sostituito da ``q=distance(geo_field,geom'Point(42 1)',100)``.

source: Aggregation API (former analyze API) comes with a new ``SQL`` like language and is available on catalog in addition to dataset records.
de: Die Aggregations-API (früher Analyse-API) besitzt eine neue "SQL"-ähnliche Sprache und ist im Katalog zusätzlich zu den Datensatzeinträgen erhältlich.
es: La API de agregación (antes, API de análisis) incorpora un nuevo lenguaje tipo ``SQL`` y está disponible en el catálogo además de los registros de conjuntos de datos.
fr: L'API d'agrégation (anciennement API d'analyse) dispose d'un nouveau langage similaire à ``SQL`` et est disponible dans le catalogue et plus seulement dans les enregistrements des jeux de données.
it: L'API di aggregazione (ex-API di analisi) dispone di un nuovo linguaggio di tipo ``SQL`` e può essere utilizzata anche per il catalogo, oltre che per i record dei dataset.

source: Exporters have their own entry-point under ``/api/catalog/exports`` and ``/api/catalog/datasets/<dataset_id>/exports``
de: Die Exporter haben ihren eigenen Einstiegspunkt unter `/api/catalog/exports`` und ``/api/catalog/datasets/<dataset_id>/exports``
es: Los exportadores tienen su propio punto de entrada bajo ``/api/catalog/exports`` y ``/api/catalog/datasets/<dataset_id>/exports``
fr: Les exportateurs disposent de leur propre point d'entrée sous ``/api/catalog/exports`` et ``/api/catalog/datasets/<dataset_id>/exports``
it: Gli esportatori dispongono di un proprio entrypoint in ``/api/catalog/exports`` e ``/api/catalog/datasets/<dataset_id>/exports``.

source: Navigation search (former facet search) and standard search are completely splitted.
de: Die Navigationssuche (früher Facet-Suche) und die Standardsuche sind vollständig getrennt.
es: La búsqueda de navegación (antes, búsqueda de facetas) y la búsqueda estándar se han separado totalmente.
fr: La recherche dans la navigation (anciennement la recherche de facettes) et la recherche standard sont complètement séparées.
it: La ricerca di navigazione (ex-ricerca di facet) e la ricerca standard sono completamente separate.

source: Common aspects
de: Gemeinsamkeiten
es: Aspectos comunes
fr: Aspects communs
it: Aspetti comuni

source: Both version of the API share one essential mechanism: the :doc:`authentification method </using_api/authentication>` which enables you to use the same credentials for both versions.
de: Beide API-Versionen haben einen wichtigen Mechanismus gemeinsam: die :doc:`authentification method </using_api/authentication>`, mit der Sie dieselben Anmeldeinformationen für beide Versionen nutzen können.
es: Ambas versiones de la API comparten un mecanismo esencial: el :doc:`método de autenticación </using_api/authentication>` que permite utilizar las mismas credenciales para ambas versiones.
fr: Les deux versions de l'API partagent un même mécanisme essentiel : la :doc:`méthode d'authentification </using_api/authentication>`, qui vous permet d'utiliser les mêmes identifiants sur les deux versions.
it: Entrambe le versioni delle API si basano sullo stesso meccanismo essenziale: il :doc:`metodo di autenticazione </using_api/authentication>`, che permette di utilizzare le stesse credenziali sia per l'una che per l'altra.

source: What about ODATA, WFS and CSW?
de: Was ist mit OData, WFS und CSW?
es: ODATA, WFS y CSW
fr: À propos d'ODATA, de WFS et de CSW
it: ODATA, WFS e CSW

source: These 3 acronyms refer to other standards that the platform implements. If you are not familiar with these standards, then you should stick with the ODS API since it provides the most comprehensive access to the data.
de: Diese 3 Akronyme beziehen sich auf weitere Standards, die die Plattform implementiert. Falls Sie mit diesen Standards nicht vertraut sind, sollten Sie bei der ODS-API bleiben, da Sie den umfassendsten Zugang zu den Daten bietet.
es: Estas 3 siglas hacen referencia a otros estándares que implementa la plataforma. Si no está familiarizado con estos estándares, quédese con la API de ODS dado que proporciona el acceso más amplio a los datos.
fr: Ces 3 acronymes désignent les autres normes mises en œuvre par la plateforme. Si vous ne connaissez pas ces normes, contentez-vous alors d'utiliser l'API ODS, car elle offre l'accès aux données le plus complet.
it: Queste 3 sigle indicano altri standard implementati dalla piattaforma. Se non li conosci, ti consigliamo di utilizzare l'API ODS, che assicura l'accesso più completo ai dati.

source: ODATA is a standard for REST APIs that provide a common language to be used across APIs to perform requests. The trade-off for this norm's generic approach is its higher complexity compared to traditional custom REST APIs.
de: OData ist ein Standard für REST-APIs, die eine gemeinsame, API-übergreifende Sprache zur Durchführung von Anfragen bieten. Der Vorteil des generischen Ansatzes dieser Norm ist seine höhere Komplexität im Vergleich zu herkömmlichen REST-APIs.
es: ODATA es un estándar de interfaces API REST que proporciona un lenguaje común para realizar solicitudes en las API. El inconveniente del paradigma genérico de esta norma es su mayor complejidad en comparación con las API REST personalizadas tradicionales.
fr: ODATA est une norme pour les API REST qui offre un langage commun pouvant être utilisé avec les différentes API, afin d'effectuer des demandes. L'approche générique de cette norme présente l'inconvénient d'être plus complexe que les API REST personnalisées classiques.
it: ODATA è uno standard per API REST che offre un linguaggio comune per eseguire le richieste con le varie API. Si tratta però di un approccio generico, basato su norme più complesse rispetto alle normali API REST personalizzate.
