Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/oauth2.po
Languages: de, es, fr, it, nl

source: **state**: The random string you provided, that you can now check.
de: **state**: Die von Ihnen angegebene Zufallszeichenfolge, die Sie nun prüfen können.
es: **state**: La cadena aleatoria facilitada, que ahora puede comprobar.
fr: **state** : la chaîne au hasard que vous aviez fournie, que vous pouvez maintenant vérifier.
it: **state**: stringa casuale fornita da te, che puoi utilizzare come verifica.
nl: **state**: de willekeurige string die u hebt opgegeven en die u nu kan controleren.

source: Example:
de: Beispiel:
es: Ejemplo:
fr: Exemple :
it: Esempio:
nl: Voorbeeld:

source: Now that you have an authorization grant, it is time to convert it into a bearer token. Please note that your authorization grant is only valid for an hour.
de: Sie haben nun Ihre Autorisierungsermächtigung erhalten und können sie in einen Bearer Token umwandeln. Bitte beachten Sie, dass Ihre Autorisierungsermächtigung nur eine Stunde lang gültig ist.
es: Ahora que ya tiene una concesión de autorización, es el momento de convertirla en un token de portador. Tenga presente que la concesión de autorización solo es válida durante una hora.
fr: Maintenant que vous avez une autorisation, il est temps de la convertir en "bearer token". Votre autorisation ne sera valide que pour une heure.
it: Una volta ottenuta l'autorizzazione, puoi convertirla in un token di connessione. L'autorizzazione concessa è valida solo per un'ora.
nl: Nu u een autorisatiecode hebt, is het tijd om deze te converteren naar een Bearer Token. Gelieve te noteren dat uw autorisatiecode slechts een uur geldig is.

source: Converting an authorization grant to a bearer token
de: Umwandeln einer Autorisierungsermächtigung in einen Bearer Token
es: Convertir una concesión de autorización en un token de portador
fr: Convertir une autorisation en "bearer token"
it: Conversione dell'autorizzazione ricevuta in un token di connessione
nl: Een autorisatiecode converteren naar een Bearer Token

source: To receive your bearer token, you will need to convert your previously obtained authorization grant. To do so, you will need to send a POST request to `/oauth2/token/` with the following parameters:
de: Um einen Bearer Token zu erhalten, müssen Sie Ihre zuvor erhaltene Autorisierungsermächtigung umwandeln. Dazu müssen Sie eine POST Anfrage an `/oauth2/token/` mit folgenden Parametern senden:
es: Para recibir el token de portador, deberá convertir la concesión de autorización obtenida anteriormente. Para ello, tendrá que enviar una solicitud POST a `/oauth2/token/` con los parámetros siguientes:
fr: Pour recevoir votre "bearer token" vous aurez besoin de convertir l'autorisation reçue précédemment. Pour cela, vous aurez besoin d'envoyer une requête POST à `/oauth2/token/` avec les paramètres suivants :
it: Per ricevere il token di connessione, è necessario convertire l'autorizzazione ottenuta in precedenza. A questo scopo, invia una richiesta POST a `/oauth2/token/` con i seguenti parametri:
nl: Om uw Bearer Token te ontvangen, moet u de eerder bekomen autorisatiecode converteren. Om dit te doen, moet u een POST-aanvraag sturen naar `/oauth2/token/` met de volgende parameters:

source: **client_secret**: The client secret you were given when you registered your application.
de: **client_secret**: Der Client Secret, den Sie beim Registrieren Ihrer Anwendung erhalten haben.
es: **client_secret**: El secreto de cliente recibido al registrar la aplicación.
fr: **client_secret** : le mot de passe qui vous a été donné lors de l'enregistrement de votre application.
it: **client_secret**: segreto client ricevuto quando hai registrato l'applicazione.
nl: **client_secret**: het klantgeheim dat u ontving op het ogenblik van registratie van uw applicatie.

source: **grant_type**: The type of the authorization grant you were awarded. This should be set to "authorization_code".
de: **grant_type**: Der Typ Autorisierungsermächtigung, den Sie erhalten haben. Dieser Parameter muss auf "authorization_code" eingestellt werden.
es: **grant_type**: El tipo de la concesión de autorización asignada. Debe establecerse como "authorization_code".
fr: **grant_type** : le type d'autorisation qui vous a été donné. Ceci devrait être défini à "authorization_code".
it: **grant_type**: tipo di autorizzazione ricevuta. Deve essere impostato su "authorization_code".
nl: **grant_type**: het type autorisatiecode dat u werd toegekend. Dit zou moeten zijn ingesteld op "authorization_code".

source: **code**: The 30-characters-long authorization code that was part of your authorization grant.
de: **code**: Der Autorisierungscode mit 30 Zeichen Länge, der Teil Ihrer Autorisierungsermächtigung war.
es: **code**: El código de autorización de 30 caracteres de longitud incluido en la concesión de autorización.
fr: **code**: le code d'autorisation de 30 caractères donné lors de votre autorisation.
it: **code**: codice di 30 caratteri dell'autorizzazione che ti è stata concessa.
nl: **code**: de toelatingscode van 30 karakters lang die onderdeel was van uw autorisatiecode.

source: **scopes**: The list of scopes you require access to. Please note that the scopes should all be within the scopes that your authorization grant gives you access to.
de: **scopes**: Die Liste der Geltungsbereiche, auf die Sie Zugriff erfordern. Bitte beachten Sie, dass sich all diese Geltungsbereiche innerhalb der Geltungsbereiche befinden müssen, auf die Ihnen Ihre Autorisierungsermächtigung Zugriff ermöglicht.
es: **scopes**: La lista de ámbitos a los cuales requiere acceso. Tenga presente que todos los ámbitos deben formar parte de los ámbitos a los cuales le da acceso su concesión de autorización.
fr: **scopes**: la liste des scopes auxquels vous voulez accéder. Les scopes doivent être contenus dans le périmètre des scopes permis par votre autorisation.
it: **scopes**: elenco degli ambiti per cui richiedi l'accesso. Devono essere tutti compresi tra quelli per cui ti è stata fornita l'autorizzazione.
nl: **scopes**: de lijst met toepassingsgebieden waar u toegang moet toe hebben. Gelieve te noteren dat alle toepassingsgebieden binnen de toepassingsgebieden moeten liggen waar uw autorisatiecode u toegang toe geeft.

source: **redirect_uri**: The redirect URI you provided when registering your application.
de: **redirect_uri**: Die redirect URI, die Sie beim Registrieren Ihrer Anwendung angegeben haben.
es: **redirect_uri**: El URI de redirección especificado al registrar la aplicación.
fr: **redirect_uri** : l'URI de redirection fournie lorsque vous avez enregistré votre application.
it: **redirect_uri**: URI di reindirizzamento che hai fornito durante la registrazione della tua applicazione.
nl: **redirect_uri**: de doorstuur-URL die u hebt opgegeven op het ogenblik van registratie van uw applicatie.

source: Alternatively, you can pass your client ID and client secret through the Authorization header
de: Ansonsten können Sie Ihre Client ID und Client Secret durch die Überschrift laufen lassen
es: Si lo desea, puede pasar el ID de cliente y el secreto de cliente en el encabezado de autorización.
fr: Vous pouvez également décider de passer votre ID client et votre clé secrète via l'en-tête de requête "Authorization".
it: In alternativa, puoi includere l'ID client e il segreto client nell'header dell'autorizzazione.
nl: Ook kan u uw klant-ID en klantgeheim doorgeven via de Autorisatieheader

source: example:
de: Beispiel:
es: Ejemplo:
fr: exemple :
it: Esempio:
nl: voorbeeld:

source: The response to this request will be the JSON representation of your bearer token, which contains the following values:
de: Die Antwort auf diese Anfrage ist die JSON-Darstellung Ihres Bearer Tokens mit folgenden Werten:
es: La respuesta a esta solicitud será la representación JSON del token de portador, que contiene los valores siguientes:
fr: La réponse à cette requête sera une représentation JSON de votre "bearer token" qui contient les valeurs suivantes :
it: La risposta a questa richiesta sarà la rappresentazione JSON del tuo token di connessione, contenente i seguenti valori:
nl: De respons op deze aanvraag zal de JSON-weergave van uw Bearer Token zijn, dat de volgende waarden bevat:

source: **access_token**: the token that will authorize you to access the user's data.
de: **access_token**: der Token, der Sie zum Zugriff auf die Benutzerdaten ermächtigt.
es: **access_token**: El token que le autorizará a acceder a los datos del usuario.
fr: **access_token** : le jeton qui vous permettra d'accéder aux données des utilistateurs.
it: **access_token**: token che autorizza il tuo accesso ai dati dell'utente.
nl: **access_token**: het token dat u zal machtigen om toegang te hebben tot de data van de gebruiker.

source: **expires_in**: the amount of time in seconds after which the bearer token will be made invalid.
de: **expires_in**: der Zeitraum in Sekunden, nach dessen Ablauf der Bearer Token seine Gültigkeit verliert.
es: **expires_in**: El periodo de tiempo en segundos tras el cual el token de portador se establecerá como no válido.
fr: **expires_in**: le temps en secondes après lequel le "bearer token" sera invalide.
it: **expires_in**: durata in secondi al termine della quale il token di connessione non sarà più valido.
nl: **expires_in**: de hoeveelheid tijd in seconden waarna het Bearer Token ongeldig wordt.

source: **token_type**: the type of the token. It will always be "Bearer"
de: **token_type**: der Token-Typ. Er bleibt konstant "Bearer"
es: **token_type**: El tipo de token. Siempre será "Bearer".
fr: **token_type** : le type du token. Ce paramètre sera toujours "Bearer"
it: **token_type**: tipo di token. Deve sempre essere "Bearer".
nl: **token_type**: het type token. Dit zal altijd "Bearer" zijn

source: **scope**: the list of scopes this authorization code allows you to claim
de: **scope**: die Liste der Geltungsbereiche, die Sie mit diesem Autorisierungscode fordern dürfen
es: **scope**: La lista de ámbitos que este código de autorización le permite reclamar.
fr: **scope** : la liste des scopes qu'il est possible de récupérer avec cette autorisation
it: **scope**: elenco degli ambiti a cui l'autorizzazione ti consente di accedere.
nl: **scope**: de lijst met toepassingsgebieden die u met deze toelatingscode kan claimen

source: **refresh_token**: the token that will allow you to obtain a new bearer token once this one expires
de: **refresh_token**: der Token, mit dem Sie einen neuen Bearer Token erhalten können, sobald der aktuelle abgelaufen ist
es: **refresh_token**: El token que le permitirá obtener un token de portador nuevo cuando este caduque.
fr: **refresh_token** : le jeton qui vous permettra d'obtenir un nouveau "bearer token" lorsque celui-ci expire
it: **refresh_token**: token che ti permetterà di ottenere un nuovo token di connessione una volta scaduto quello in corso.
nl: **refresh_token**: het token dat u zal toelaten om een nieuw Bearer Token te bekomen eenmaal dit is vervallen

source: Even though there is an expiration time on the bearer token, the refresh token contained in it stays valid until it is used once, which means that you can request a new bearer token at any time after the expiry of your current token.
de: Der Bearer Token ist zwar mit einer Ablaufzeit versehen, der in ihm enthaltene Refresh Token bleibt jedoch bis zu seiner ersten Nutzung gültig, d. h. Sie können nach Ablauf der Gültigkeit Ihres aktuellen Tokens jederzeit einen neuen Bearer Token anfragen.
es: Aunque hay un tiempo de caducidad en el token de portador, el token de renovación incluido en el mismo será válido hasta que se utilice una vez, lo que significa que puede solicitar un token de portador nuevo en cualquier momento tras caducar el token actual.
fr: Même s'il y a un temps d'expiration sur le "bearer token", le "refresh token" reste valide jusqu'à sa première utilisation, ce qui signifie que vous pouvez demander un nouveau "bearer token" à n'importe quel moment après l'expiration du jeton actuel.
it: Anche se il token di connessione prevede una scadenza, il token di aggiornamento che vi è contenuto è valido fino al primo utilizzo, perciò anche dopo la scadenza del token di connessione corrente è sempre possibile richiederne uno nuovo.
nl: Hoewel er een vervaltijd bestaat voor het Bearer Token, blijft het hernieuwtoken dat hierin staat geldig tot het één keer is gebruikt. Dit betekent dat u op elk moment na het vervallen van uw huidige token een nieuw Bearer Token kan aanvragen.

source: You are now all set to use your newly awarded bearer token!
de: Sie sind nun startklar und können Ihren neu erhaltenen Bearer Token einsetzen!
es: ¡Todo listo para usar el token de portador recién asignado!
fr: Vous êtes maintenant prêt à utiliser votre "bearer token" !
it: La configurazione necessaria per utilizzare il nuovo token di connessione è completata.
nl: U bent nu klaar om uw nieuw toegekende Bearer Token te gebruiken!

source: Using the bearer token
de: Verwenden des Bearer Tokens
es: Utilizar el token de portador
fr: Utiliser le "bearer token"
it: Uso del token di connessione
nl: Het bearer token gebruiken

source: Once you have your bearer token, you can start using it to request data from our APIs. You can display your token in one of three ways:
de: Sobald Sie Ihren Bearer Token haben, können Sie ihn nutzen, um Daten von Ihren APIs anzufragen. Sie können Ihren Token auf drei verschiedene Arten anzeigen:
es: Una vez que tiene el token de portador, puede empezar a usarlo para solicitar datos de las API. Puede visualizar el token de una de estas 3 formas:
fr: Maintenant que vous avez votre "bearer token", vous pouvez commencer à l'utiliser pour faire des requêtes d'API. Vous pouvez afficher votre jeton de trois manières :
it: Una volta ottenuto il token di connessione, puoi iniziare a utilizzarlo per richiedere i dati con le tue API. Puoi visualizzare il tuo token in tre modi:
nl: Eenmaal u uw Bearer Token hebt, kan u het beginnen te gebruiken om data van uw API's aan te vragen. U kan uw token op één van de drie volgende manieren weergeven:

source: In the API endpoint URL of your request, as a REST parameter
de: In der API Endpunkt-URL Ihrer Anfrage, als REST Parameter
es: En la dirección URL de extremo de la API de la solicitud, como un parámetro REST
fr: Dans l'URL du point d'accès de votre API, comme paramètre REST
it: nell'URL dell'endpoint API della tua richiesta, come parametro REST;
nl: In het API eindpunt-URL van uw aanvraag als een REST-parameter

source: In the Authorization header of your request
de: In der Autorisierungsüberschrift Ihrer Anfrage
es: En el encabezado de autorización de la solicitud
fr: Dans l'entête d'autorisation de votre requête
it: nell'header dell'autorizzazione della tua richiesta;
nl: In de Autorisatieheader van uw aanvraag

source: In the body of your request
de: Im Anforderungskörper
es: En el cuerpo de la solicitud
fr: Dans le corps de votre requête
it: nel corpo della tua richiesta.
nl: In de body van uw aanvraag

source: or
de: oder
es: o
fr: ou
it: o
nl: of

source: After using your token for a bit, it will expire, and to continue accessing the data that you need, you will have to refresh it.
de: Nachdem Sie Ihren Token eine Weile genutzt haben, wird er ablaufen. Sie müssen ihn erneuern, um weiter auf die gewünschten Daten zugreifen zu können.
es: Después de usar el token durante un breve período, caducará y tendrá que renovarlo para poder seguir accediendo a los datos que necesite.
fr: Après avoir utilisé votre jeton pendant un moment, il va expirer, et pour continuer à avoir accès aux données, vous aurez besoin de le rafraîchir.
it: Dopo essere stato utilizzato per un determinato periodo di tempo, il token scade e per continuare ad accedere ai dati è necessario aggiornarlo.
nl: Nadat u uw token enige tijd hebt gebruikt, zal dit vervallen en om toegang te blijven hebben tot de data die u nodig hebt, zal u het moeten hernieuwen.

source: Refreshing a bearer token
de: Erneuern eines Bearer Tokens
es: Renovar un token de portador
fr: Rafraîchir un "bearer token"
it: Aggiornamento di un token di connessione
nl: Een Bearer Token hernieuwen

source: To refresh the bearer token, you must send a request to the ``/oauth2/token/`` endpoint, with the following REST parameters:
de: Zum Erneuern des Bearer Tokens müssen Sie eine Anfrage an den Endpunkt ``/oauth2/token/`` mit folgenden REST Parametern stellen:
es: Para renovar el token de portador, debe enviar una solicitud al extremo ``/oauth2/token/``, con los parámetros REST siguientes:
fr: Pour rafraîchir votre "bearer token", vous devez envoyer une requête au point d'entrée ``/oauth2/token/``, avec les paramètres REST suivants :
it: Per aggiornare un token di connessione, è necessario inviare una richiesta all'endpoint ``/oauth2/token/`` con i seguenti parametri REST:
nl: Om het Bearer Token te hernieuwen, moet u een aanvraag sturen naar het ``/oauth2/token/`` eindpunt met de volgende REST-parameters:

source: **grant_type**: The type of the authorization grant you were awarded. This should be set to "refresh_token".
de: **grant_type**: Der Typ Autorisierungsermächtigung, den Sie erhalten haben. Dieser Parameter muss auf "refresh_token" eingestellt werden.
es: **grant_type**: El tipo de la concesión de autorización asignada. Debe establecerse como "refresh_token".
fr: **grant_type** : le type d'autorisation qui vous été donnée. La valeur devrait être "refresh_token".
it: **grant_type**: tipo di autorizzazione ottenuta. Deve essere impostato su "refresh_token".
nl: **grant_type**: het type autorisatiecode dat u werd toegekend. Dit zou moeten zijn ingesteld op "refresh_token".

source: **scopes**: The list of scopes you require access to. Please note that this list must match the one you provided when you converted your grant request to a bearer token.
de: **scopes**: Die Liste der Geltungsbereiche, auf die Sie Zugriff erfordern. Bitte beachten Sie, dass diese Liste der Liste entsprechen muss, die Sie angegeben haben, als Sie Ihre Ermächtigungsanfrage in einen Bearer Token umgewandelt haben.
es: **scopes**: La lista de ámbitos a los cuales requiere acceso. Tenga presente que esta lista debe coincidir con la facilitada al convertir la solicitud de concesión en un token de portador.
fr: **scopes**: la liste des scopes auxquels vous voulez accéder. Les scopes doivent correspondre à ceux fournis lorsque vous avez converti votre demande en "bearer token" .
it: **scopes**: elenco degli ambiti a cui richiedi di poter accedere. Questo elenco deve corrispondere a quello che avevi fornito durante la conversione dell'autorizzazione in un token di connessione.
nl: **scopes**: de lijst met toepassingsgebieden waar u toegang moet toe hebben. Gelieve te noteren dat deze lijst moet overeenstemmen met de lijst die u hebt opgegeven wanneer u uw codeaanvraag hebt geconverteerd naar een Bearer Token.

source: **refresh_token**: The refresh token included in your last bearer token.
de: **refresh_token**: Der in Ihrem letzten Bearer Token enthaltene Refresh Token.
es: **refresh_token**: El token de renovación incluido en el último token de portador.
fr: **refresh_token** : le "refresh token" contenu dans votre dernier "bearer token"
it: **refresh_token**: token di aggiornamento incluso nell'ultimo token di connessione.
nl: **refresh_token**: het hernieuwtoken dat opgenomen is in uw laatste Bearer Token.

source: The response to this request will provide you with a new bearer token in the same way as when you obtained your first token from converting your authorization grant.
de: Die Antwort auf diese Anfrage liefert Ihnen auf dieselbe Art einen neuen Bearer Token, als wenn Sie Ihren ersten Token durch Umwandeln Ihrer Autorisierungsermächtigung erhalten hätten.
es: La respuesta a esta solicitud le proporcionará un token de portador nuevo del mismo modo que cuando obtuvo el primer token como consecuencia de convertir la concesión de autorización.
fr: La réponse à cette requête vous fournira un nouveau "bearer token" de la même manière que lorsque vous avez obtenu votre premier jeton à partir de votre demande d'autorisation.
it: In seguito a questa richiesta, proprio come accaduto al momento di convertire l'autorizzazione, riceverai un nuovo token di connessione.
nl: De respons op deze aanvraag zal u een nieuw Bearer Token opleveren op dezelfde manier waarop u uw eerste token hebt bekomen door het converteren van uw autorisatiecode.

source: Please note that while the state parameter is not mandatory, we encourage you to provide one for security reasons and check that it was given back to you when you receive your authorization grant.
it: Il parametro "state" non è obbligatorio. Tuttavia, per motivi di sicurezza ti consigliamo di fornirlo e di verificare che venga restituito quando ricevi l'autorizzazione.
