Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/oauth2.po
Languages: de, es, fr, it, nl

source: Using OAuth2 authorization
de: Verwendung der OAuth2 Autorisierung
es: Utilizar la autorización OAuth2
fr: Utiliser l'autorisation OAuth2
it: Uso dell'autorizzazione OAuth2
nl: Gebruiken van OAuth2-autorisatie

source: Overview
de: Übersicht
es: Visión general
fr: Vue d'ensemble
it: Panoramica
nl: Overzicht

source: OpenDataSoft implements the OAuth2 authorization flow, allowing third party application makers to access the data hosted on a OpenDataSoft platform on behalf of a user while never having to deal with a password, thus avoiding any user credential to be compromised.
de: OpenDataSoft implementiert den OAuth2 Authorization Flow und ermöglicht es Third Party-Anwendungsentwicklern, auf Daten zuzugreifen, die im Namen eines Benutzers auf einer OpenDataSoft-Plattform gehostet werden. Sie benötigen dafür kein Passwort, so dass Anmeldeinformationen der Benutzer nicht gefährdet werden können.
es: OpenDataSoft implementa el flujo de autorización OAuth2, lo que permite a creadores de aplicaciones de terceros acceder a los datos alojados en una plataforma OpenDataSoft en nombre de un usuario sin tener que manejar una contraseña en ningún momento, lo que evita poner en riesgo una credencial de usuario.
fr: OpenDataSoft implément le flux d'autorisation OAuth2, ce qui permet à des applications tierces d'accéder aux données hébergées sur une plateforme OpenDataSoft. L'utilisateur n'aura jamais à utiliser un mot de passe ce qui éviter les risques de compromission d'identité.
it: OpenDataSoft implementa il flusso di autorizzazioni OAuth2, che permette ai creatori di applicazioni di terze parti di accedere ai dati ospitati sulla piattaforma OpenDataSoft per conto di un utente, senza dover utilizzare password e quindi metterne a rischio le credenziali.
nl: OpenDataSoft implementeert de OAuth2-autorisatiestroom, waardoor makers van derde applicaties toegang krijgen tot de data die gehost worden op een OpenDataSoft-portaal namens een gebruiker, terwijl ze nooit te maken krijgen met een wachtwoord, waardoor vermeden wordt dat de geloofsbrieven van enige gebruiker in gevaar wordt gebracht.

source: The OpenDataSoft OAuth2 authorization flow is compliant with `RFC 6749 <http://tools.ietf.org/html/rfc6749>`_ and makes use of Bearer Tokens in compliance with `RFC 6750 <http://tools.ietf.org/html/rfc6750>`_.
de: Der OpenDataSoft OAuth2 Authorization Flow entspricht dem Standard `RFC 6749 <http://tools.ietf.org/html/rfc6749>`_ und nutzt Bearer Tokens, die dem Standard `RFC 6750 <http://tools.ietf.org/html/rfc6750>`_ entsprechen.
es: El flujo de autorización OAuth2 de OpenDataSoft es compatible con `RFC 6749 <http://tools.ietf.org/html/rfc6749>`_ y utiliza los tokens de portador de conformidad con `RFC 6750 <http://tools.ietf.org/html/rfc6750>`_.
fr: Le flux d'autorisation OAuth2 d'OpenDataSoft est compatible `RFC 6749 <http://tools.ietf.org/html/rfc6749>`_ et utiliser les ``Bearer Tokens`` compatibles avec `RFC 6750 <http://tools.ietf.org/html/rfc6750>`_.
it: Il flusso di autorizzazioni OpenDataSoft OAuth2 è conforme alla norma `RFC 6749 <http://tools.ietf.org/html/rfc6749>`_ e utilizza token di connessione conformi alla norma `RFC 6750 <http://tools.ietf.org/html/rfc6750>`_.
nl: De OAuth2-autorisatiestroom van OpenDataSoft is in overeenstemming met `RFC 6749 <http://tools.ietf.org/html/rfc6749>`_ en maakt gebruik van Bearer Tokens in overeenstemming met `RFC 6750 <http://tools.ietf.org/html/rfc6750>`_.

source: Application developers who want to use the OpenDataSoft APIs with OAuth2 must go through the following steps, which will be explained in this article. They must first register their application with the OpenDataSoft platform. Secondly, they must request approval from users. With that approval, they can request a Bearer Token. This token allows them to query the OpenDataSoft platform APIs for a limited amount of time, after which they must refresh their Bearer Token.
de: Anwendungsentwickler, die die OpenDataSoft-APIs mit OAuth2 nutzen möchten, müssen die folgenden, in diesem Artikel beschriebenen Schritte durchlaufen. Sie müssen ihre Anwendung zunächst auf der OpenDataSoft-Plattform registrieren. Danach müssen Sie die Zustimmung der Benutzer anfragen. Mit dieser Zustimmung können Sie einen Bearer Token anfragen. Dieser Token wiederum ermöglicht Ihnen die Anfrage der OpenDataSoft-Plattform-APIs für einen begrenzten Zeitraum, nach dessen Ablauf sie ihre Bearer Token erneuern müssen.
es: Los desarrolladores de aplicaciones que deseen usar las API de OpenDataSoft con OAuth2 deben llevar a cabo los pasos siguientes, descritos en este artículo. Primero deben registrar su aplicación con la plataforma OpenDataSoft. En segundo lugar, deben solicitar la aprobación de los usuarios. Con esa aprobación, pueden solicitar un token de portador. Este token les permite consultar las API de la plataforma OpenDataSoft durante un periodo de tiempo limitado, tras el cual deben renovar su token de portador.
fr: Les développeurs d'application qui veulent utiliser les APIs OpenDataSoft avec OAuth2 doivent suivrent les étapes suivantes. Ils doivent d'abord enregistrer leur application sur la plateforme OpenDataSoft. Ensuite, ils doivent demander l'autorisation des utilisateurs. Avec cette autorisation, ils peuvent demander un ``Bearer Token``. Ce ``Bearer Token`` leur permet de requêter les APIs d'OpenDataSoft pour un temps limité, quand ce temps est fini, ils doivent rafraîchir leur ``Bearer Token``.
it: Gli sviluppatori di applicazioni che desiderano utilizzare le API OpenDataSoft con OAuth2 devono procedere come descritto di seguito. Innanzitutto, è necessario registrare la propria applicazione sulla piattaforma OpenDataSoft e in seguito richiedere l'approvazione della richiesta agli utenti interessati. Una volta ottenuta tale autorizzazione, è possibile richiedere un token di connessione, che permetterà di eseguire le query sulle API OpenDataSoft per un periodo di tempo limitato, al termine del quale il token dovrà essere aggiornato.
nl: Ontwikkelaars van applicaties die de API's van OpenDataSoft met OAuth2 willen gebruiken, moet de volgende stappen doorlopen die uitgelegd zullen worden in dit artikel. Ze moeten eerst hun applicatie registreren op het OpenDataSoft-platform. Ten tweede moeten ze de goedkeuring vragen vanwege gebruikers. Met die goedkeuring kunnen ze een Bearer Token aanvragen. Met dit token kunnen ze zoekopdrachten uitvoeren op de API's op het OpenDataSoft-platform, en dit gedurende een beperkte tijdsperiode. Na deze periode moeten ze hun Bearer Token hernieuwen.

source: Currently, applications are registered on a specific domain and can only access data on this domain.
de: Momentan werden die Anwendungen auf einer bestimmten Domain registriert und können nur auf dieser Domain auf Daten zugreifen.
es: Actualmente, las aplicaciones se registran en un dominio específico y solo pueden acceder a los datos de ese dominio.
fr: Actuellement, les applications sont enregistrées sur un domaine spécifique et peuvent uniquement accéder aux données sur ce domaine.
it: Attualmente, le applicazioni vengono registrate su un dominio specifico e possono accedere solo ai dati in esso presenti.
nl: Momenteel worden applicaties geregistreerd op een specifiek domein en hebben ze enkel toegang tot de data op dit domein.

source: Getting started
de: Erste Schritte
es: Iniciación
fr: Démarrer
it: Operazioni preliminari
nl: Om te starten

source: The first step to use the OAuth2 authorization flow is to register your application. To do so, go to your account page on the domain you want to register the application on. There, you will find a form prompting you for the following:
de: Der erste Schritt zur Nutzung des OAuth2 Authorization Flow ist das Registrieren Ihrer Anwendung. Gehen Sie hierfür auf Ihre Kontoseite auf der Domain, auf der Sie die Anwendung registrieren möchten. Hier finden Sie ein Formular vor, das Sie zu folgenden Schritten auffordert:
es: El primer paso para usar el flujo de autorización de OAuth2 es registrar la aplicación. Para ello, vaya a la página de su cuenta en el dominio donde desea registrar la aplicación. Allí encontrará un formulario en que se le solicitará lo siguiente:
fr: La première etape pour utiliser le flux d'autorisation OAuth2 est d'enregister votre application. Pour ce faire, allez sur votre page de compte du domaine sur lequel vous voulez enregistrer l'application. Vous y trouverez un formulaire vous demandant les éléments suivants :
it: Il primo passo per utilizzare il flusso di autorizzazioni OAuth2 consiste nel registrare la tua applicazione. Per fare ciò, apri la pagina del tuo account sul dominio in cui intendi registrare l'applicazione. Qui troverai un modulo in cui inserire le seguenti informazioni:
nl: De eerste stap om de OAuth2-autorisatiestroom te gebruiken bestaat erin om uw applicatie te registreren. Om dit te doen, gaat u naar uw accountpagina op het domein waarop u de applicatie wil registreren. Daar zal u een formulier terugvinden waarbij u het volgende wordt gevraagd:

source: Application name: the name of the application
de: Anwendungsname: Name der Anwendung
es: Nombre de aplicación: El nombre de la aplicación.
fr: Nom de l'application : le nom de l'application
it: Nome applicazione: il nome dell'applicazione.
nl: Applicatienaam: de naam van de applicatie

source: Type: can be either confidential or public. An application is confidential if it can keep information from a user, other applications are public. Typically, a web application running on its own server is confidential. Conversely a smartphone application is public, because the user has control over the running environment of the application.
de: Typ: kann vertraulich oder öffentlich sein. Eine Anwendung kann vertraulich sein, wenn sie einem Benutzer Informationen vorenthält, andere Anwendungen sind öffentlich. Eine Web-Anwendung etwa, die auf ihrem eigenen Server läuft, ist vertraulich. Eine Smartphone-Anwendung hingegen ist öffentlich, da der Benutzer die Kontrolle über die Ablaufumgebung der Anwendung hat.
es: Tipo: Puede ser confidencial o pública. Una aplicación es confidencial si puede mantener información de un usuario; las demás aplicaciones son públicas. Normalmente, una aplicación web que se ejecuta en su propio servidor es confidencial. En cambio, una aplicación de Smartphone es pública, porque el usuario tiene control sobre el entorno de ejecución de la aplicación.
fr: Type : confidentiel ou public. Une application est confidentielle si elle peut conserveur des information utilisateur, les autres applications sont publiques. Typiquement, une application Web qui fonctionne sur son propre serveur est confidentielle. Inversement, une application smartphone est publique car l'utilisateur a le contrôle de l'environnement de l'application.
it: Tipo: può essere Riservato o Pubblico. Un'applicazione è riservata se può non mostrare le informazioni all'utente, altrimenti è pubblica. Solitamente, un'applicazione Web in esecuzione sul proprio server è riservata, mentre una per smartphone è pubblica, poiché l'utente non ha il controllo sull'ambiente in cui viene eseguita.
nl: Type: kan ofwel vertrouwelijk ofwel publiek zijn. Een applicatie is vertrouwelijk wanneer deze informatie van een gebruiker kan tegenhouden, andere applicaties zijn publiek. Een internetapplicatie die op zijn eigen server werkt, is meestal vertrouwelijk. Daarentegen is een smartphone-applicatie publiek aangezien de gebruiker controle heeft over de omgeving waarin de applicatie werkt.

source: Redirection URL: The URL users will be redirected to after they have granted you permission to access their data.
de: Weiterleitung URL: Die URL-Benutzer werden hierhin weitergeleitet, nachdem sie Ihnen die Berechtigung zum Zugriff auf ihre Daten erteilt haben.
es: Dirección URL de redirección: La dirección URL a la cual se redirigirá a los usuarios una vez que le hayan concedido permiso para acceder a sus datos.
fr: URL de redirection : l'URL vers laquelle les utilisateurs seront redirigés après avoir autorisé l'accès à leur données.
it: URL di reindirizzamento: l'URL al quale gli utenti vengono reindirizzati dopo aver concesso l'autorizzazione all'accesso ai propri dati.
nl: Doorstuur-URL: de URL waarnaar gebruikers worden doorgestuurd nadat ze u toestemming hebben verleend om toegang te hebben tot hun data.

source: You will then be awarded a client ID and a client secret.
de: Sie erhalten daraufhin eine Client-ID und einen Client Secret.
es: A continuación, se le asignará un ID de cliente y un secreto de cliente.
fr: Vous obtiendrez alors une ID client et un mot de passe client.
it: In seguito, ti verrà assegnato un ID client e un segreto client.
nl: Vervolgens wordt u een klant-ID en een klantgeheim toegekend.

source: Now that your application is registered, it is time to request an authorization grant from a user.
de: Ihre Anwendung ist nun registriert, Sie können ab jetzt eine Autorisierungsermächtigung von einem Benutzer erbitten.
es: Tras registrar la aplicación, llega el momento de solicitar una concesión de autorización de un usuario.
fr: Maintenant que votre application est enregistrée, il est temps de demander une autorisation à un utilisateur.
it: Una volta registrata l'applicazione, dovrai richiedere l'autorizzazione dell'utente.
nl: Nu uw applicatie is geregistreerd, is het tijd om een toelatingscode vanwege een gebruiker aan te vragen.

source: Getting an authorization grant
de: Erhalten einer Autorisierungsermächtigung
es: Obtener una concesión de autorización
fr: Obtenir une autorisation
it: Come ottenere un'autorizzazione
nl: Een autorisatiecode bekomen

source: To get an authorization grant from a user, you will need to redirect them to `/oauth2/authorize/` with a few REST parameters. The user will then be authenticated in the platform, and redirected to a page identifying your application with the info you provided when you registered it, the list of scopes your application would like to access and prompting them to grant your application to access their data. Once the user has accepted those terms, they will be redirected to your application's redirection URL, with REST parameters describing your authorization grant.
de: Um eine Autorisierungsermächtigung von einem Benutzer zu erhalten, müssen Sie die Benutzer mit ein paar REST Parametern zu `/oauth2/authorize/` weiterleiten. Der Benutzer wird dann auf der Plattform authentifiziert und auf eine Seite weitergeleitet, die Ihre Anwendung mit den Informationen, die Sie bei der Registrierung angegeben haben, identifiziert, die Liste mit dem Geltungsbereich, auf den Sie mit Ihrer Anwendung zugreifen wollen. Er fordert diese an, um Ihrer Anwendung die Ermächtigung zum Zugriff auf Ihre Daten zu erteilen. Sobald der Benutzer diese Bedingungen akzeptiert hat, werden sie mit REST Parametern, die Ihre Autorisierungsermächtigung beschreiben, zur Weiterleitungs-URL Ihrer Anwendung weitergeleitet.
es: Para obtener una concesión de autorización de un usuario, usted deberá redirigirle a `/oauth2/authorize/` con una serie de parámetros REST. A continuación, se autenticará al usuario en la plataforma y se le redirigirá a una página donde se identifica la aplicación con la información facilitada con su registro, la lista de ámbitos a los cuales desea acceder la aplicación y una solicitud para conceder a la aplicación el acceso a sus datos. Después de que el usuario haya aceptado estos términos, se le redirigirá a la dirección URL de redirección de la aplicación, con los parámetros REST que describen la concesión de autorización.
fr: Pour obtenir une autorisation utilisateur, vous aurez besoin de les rediriger vers `/oauth2/authorize/` avec quelques paramètres REST. L'utilisateur sera alors authentifié sur la plateforme et redirigé vers une page identifiant votre application avec les informations fournies lors de l'enregistrement, le périmètre d'accès demandé et leur demandant d'autoriser l'accès aux données pour l'application. Dès que l'utilisateur a accepté, il sera redirigé vers l'adresse de votre application avec les paramètres REST indiquant l'autorisation.
it: Per ottenere l'autorizzazione da un utente, devi inoltrare quest’ultimo all'indirizzo `/oauth2/authorize/` mediante alcuni parametri REST. L'utente verrà autenticato sulla piattaforma e reindirizzato a una pagina che identificherà la tua applicazione in base alle informazioni fornite in fase di registrazione, visualizzando inoltre l'elenco degli ambiti a cui si richiede l’accesso. A questo punto, l'utente dovrà autorizzare l’accesso ai propri dati: dopo aver accettato i termini proposti, verrà infine collegato all'URL di reindirizzamento dell'applicazione stessa, con i parametri REST che descrivono l'autorizzazione fornita.
nl: Om een autorisatiecode van een gebruiker te bekomen, zal u deze moeten doorsturen naar `/oauth2/authorize/` met een aantal REST-parameters. De gebruiker zal vervolgens worden geïdentificeerd op het platform en doorgestuurd worden naar een pagina waarop uw applicatie wordt geïdentificeerd met de informatie die u hebt verschaft op het ogenblik van de registratie, de lijst van toepassingsgebieden waar uw applicatie graag toegang toe zou hebben en waarop gevraagd wordt om uw applicatie toelating te verlenen om toegang te hebben tot hun data. Eenmaal de gebruiker deze voorwaarden heeft aanvaard, zullen ze doorgestuurd worden naar de doorstuur-URL van uw applicatie, en dit met REST-parameters die uw toelatingscode omschrijven.

source: The REST parameters you will need to supply when redirecting the user are the following:
de: Folgende REST-Parameter benötigen Sie zum Weiterleiten der Benutzer:
es: Los parámetros REST que tendrá que suministrar al redirigir al usuario son los siguientes:
fr: Les paramètres REST à fournir lors de la redirection de l'utilisateur sont les suivants :
it: Di seguito sono riportati i parametri REST da fornire durante il reindirizzamento dell'utente:
nl: De REST-parameters die u zal moeten opgeven wanneer de gebruiker wordt doorgestuurd, zijn de volgende:

source: **client_id**: The client ID you were given when you registered your application.
de: **client_id**: Die Client ID, die Sie beim Registrieren Ihrer Anwendung erhalten haben.
es: **client_id**: El ID de cliente recibido al registrar la aplicación.
fr: **client_id** : l'ID client fournie lors de l'enregistrement de votre application.
it: **client_id**: ID client che hai ricevuto quando hai registrato la tua applicazione.
nl: **client_id**: het klant-ID dat u ontving op het ogenblik van registratie van uw applicatie.

source: **redirect_uri**: The redirect URI you provided when you registered your application.
de: **redirect_uri**: Der Parameter redirect URI, den Sie beim Registrieren Ihrer Anwendung angegeben haben.
es: **redirect_uri**: El URI de redirección especificado al registrar la aplicación.
fr: **redirect_uri** : l'URI de redirection fournie lorsque vous avez enregistré votre application.
it: **redirect_uri**: URI di reindirizzamento che hai fornito quando hai registrato la tua applicazione.
nl: **redirect_uri**: de doorstuur-URL die u hebt opgegeven op het ogenblik van registratie van uw applicatie.

source: **response_type**: The response type you provided when you registered your application. This should be set to "code"
de: **response_type**: Der Antworttyp, den Sie beim Registrieren Ihrer Anwendung erhalten haben. Dieser Parameter muss auf "Code" eingestellt werden
es: **response_type**: El tipo de respuesta especificado al registrar la aplicación. Debe establecerse en "code".
fr: **response_type**: le type de réponse que vous avez fourni lors de l'enregistrement de votre application. Ce paramètre devrait être à "code"
it: **response_type**: tipo di risposta che hai fornito quando hai registrato la tua applicazione. Deve essere impostato su "code".
nl: **response_type**: het responstype dat u hebt opgegeven op het ogenblik van registratie van uw applicatie. Dit zou moeten zijn ingesteld op "code"

source: **scopes** *(optional)*: A list of requested scopes, space-separated (currently only "all" is supported)
de: **scopes** *(optional)*: Eine Liste mit den angefragten Geltungsbereichen, durch Leerzeichen getrennt (aktuell wird nur "alle" unterstützt)
es: **scopes** *(opcional)*: Una lista de ámbitos solicitados separados por espacios (actualmente solo se permite "all").
fr: **scopes** *(optionnel)* : une liste des scopes demandés, séparés par des espaces. (Actuellement seul "all" est supporté)
it: **scopes** *(facoltativo)*: elenco degli ambiti richiesti, separati da uno spazio; attualmente è supportato solo il valore "all".
nl: **scopes** *(optioneel)*: een lijst met aangevraagde toepassingsgebieden, gescheiden door spaties (momenteel wordt enkel "alle" ondersteund)

source: **state** *(optional)*: A random string.
de: **state** *(optional)*: Eine Zufallsreihenfolge.
es: **state** *(opcional)*: Una cadena aleatoria.
fr: **state** *(optionnel)* : une chaîne de caractères aléatoires, utilisée pour vérification de la provenance des requêtes.
it: **state** *(facoltativo)*: stringa casuale.
nl: **state** *(optioneel)*: een willekeurige string.

source: Example (line breaks added for legibility):
de: Beispiel (mit Zeilenumbrüchen für bessere Lesbarkeit):
es: Ejemplo (se han añadido saltos de línea para facilitar la legibilidad):
fr: Exemple (sauts à la ligne ajoutés pour faciliter la lecture)
it: Esempio (le interruzioni di riga sono state inserite per migliorare la leggibilità):
nl: Voorbeeld (regelovergangen worden toegevoegd om de leesbaarheid te verhogen):

source: Please note that while the state parameter is not mandatory, we encourage you to provide one and check that it was given back you you when you receive your authorization grant, for security reasons.
de: Bitte beachten Sie, dass der Statusparameter kein Pflichtfeld ist, wir empfehlen Ihnen jedoch, ihn trotzdem anzugeben und aus Sicherheitsgründen darauf zu achten, dass er Ihnen zurückgegeben wird, sobald Sie Ihre Autorisierungsermächtigung erhalten.
es: Tenga en cuenta que, pese a que el parámetro state no es obligatorio, por motivos de seguridad le recomendamos que especifique uno y compruebe que se le devuelve al recibir la concesión de autorización.
fr: Même si le paramètre "state" n'est pas obligatoire, nous vous recommandons d'en ajouter un et de vérifier qu'il vous a été rendu lors de la réception de l'autorisation, ceci pour des raisons de sécurité
nl: Gelieve te noteren dat, hoewel de parameter "state" niet verplicht is, we u aanraden om er een op te geven en te controleren of deze u werd teruggegeven toen u uw autorisatiecode ontving, en dit omwille van veiligheidsredenen.

source: Your authorization grant will have these values:
de: Ihre Autorisierungsermächtigung bekommt folgende Werte:
es: La concesión de autorización tendrá estos valores:
fr: Votre autorisation aura les valeurs suivantes :
it: L'autorizzazione concessa avrà i seguenti valori:
nl: Uw autorisatiecode zal deze waarden hebben:

source: **code**: the 30-characters-long authorization code
de: **code**: der Autorisierungscode mit 30 Zeichen Länge
es: **code**: El código de autorización de 30 caracteres de longitud.
fr: **code** : le code d'autorisation de 30 caractères
it: **code**: codice di autorizzazione di 30 caratteri.
nl: **code**: de toelatingscode van 30 karakters lang
