Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/editing_pages/create.po
Languages: de

source: Creating a simple content page
de: Erstellen einer einfachen Inhaltsseite

source: Writing the page
de: Schreiben der Seite

source: We want to create a very simple page, containing information about our portal, and a side bar to talk a bit about our city.
de: Wir möchten eine ganz einfache Seite erstellen, die Informationen über unser Portal enthält, und eine Randleiste, um ein bisschen über unsere Stadt zu erzählen.

source: Let's start by going into the Back office, and clicking on the *Page > New page* link in the menu.
de: Wechseln wir zunächst ins Back-Office und klicken auf den Link *Seite > Neue Seite*.

source: This brings you into the interface to edit your new blank page.
de: So gelangen Sie zur Schnittstelle, in der Sie Ihre neue leere Seite bearbeiten können.

source: For now the page isn't really created yet; you need to save it first. Before doing this you need to configure the page **slug** (*page1* in the example above), which is both the page's unique identifier, and the last part of the page's URL (address in the browser).
de: Die Seite ist vorerst noch nicht wirklich erstellt; Sie müssen sie erst speichern. Zuvor müssen Sie die Seite **Informationen** (*Seite1* im obigen Beispiel) konfigurieren, die sowohl der eindeutige Bezeichner der Seite als auch der letzte Teil der Seiten-URL (Adresse im Browser) ist.

source: If the domain is configured for multiple user interface languages, you need to configure the page's content (title, description and page text itself) for all the configured languages.
de: Ist die Domain für mehrere Benutzeroberflächensprachen konfiguriert, müssen Sie den Seiteninhalt (Titel, Beschreibung und eigentlicher Seitentext) für alle konfigurierten Sprachen konfigurieren.

source: The template selector shows predefined templates that you can directly use. These templates range from very simple layout, with text zones that you can edit directly, to portal homepages presenting the content of the catalog.
de: Der Vorlagenselektor zeigt vordefinierte Vorlagen, die Sie direkt verwenden können. Diese Vorlagen reichen von einem sehr einfachen Layout mit direkt bearbeitbaren Textbereichen bis hin zu Portal-Homepages, die den Inhalt des Katalogs vorstellen.

source: You can also choose to edit the page in **expert mode**, which gives you a direct access to the page's HTML and CSS, allowing you to :doc:`further customize the style of your page </editing_pages/style>`, or to :doc:`build very advanced pages using our OpenDataSoft widgets </editing_pages/dashboard/dashboard>`. You can switch to expert mode from any template, meaning you can use these templates as starting points for dashboards or advanced pages. But once you've switched to expert mode, you cannot go back.
de: Sie können die Seite auch im **Expertenmodus** bearbeiten, der Ihnen einen direkten Zugriff auf die HTML- und CSS-Codierungen der Seite und somit die Möglichkeit verschafft, :doc:`den Stil Ihrer Seite weiter anzupassen </editing_pages/style>` oder :doc:`höchst erweiterte Seiten unter Verwendung unserer OpenDataSoft-Widgets</editing_pages/dashboard/dashboard>` zu erstellen. Sie können von jeder Vorlage aus in den Expertenmodus wechseln. Das heißt, Sie können diese Vorlagen als Ausgangspunkte für Dashboards oder erweiterte Seiten nutzen. Einmal im Expertenmodus gibt es allerdings kein Zurück mehr.

source: Since the stated goal is to create a simple content page with a side bar, the "Main block + right column" template seems like a perfect fit.
de: Da das erklärte Ziel die Erstellung einer einfachen Inhaltsseite mit einer Randleiste ist, scheint die Vorlage "Hauptblock + rechte Spalte" perfekt zu passen.

source: Once the template is chosen, you can see the two blocks of texts, and you can edit and format the text inside them using a text editor. For example you can type a few paragraphs about your portal in the center block, including headers and parts in bold using the editor. Then a few lines about your city in the right side bar.
de: Nach der Auswahl der Vorlage können Sie die beiden Textblöcke sehen und den Text darin mit einem Texteditor bearbeiten und formatieren. Zum Beispiel können Sie im Mittelblock über den Texteditor einige Absätze über Ihr Portal tippen, Überschriften und Teile in Fettdruck eingeschlossen. Danach ein paar Zeilen über Ihre Stadt in der Randleiste.

source: On the right part of the interface, you can see a little *Preview* button, which toggle a preview of the page as your users would see it on the portal, without having to save the page first.
de: Auf der rechten Seite der Schnittstelle sehen Sie eine kleine Schaltfläche für die *Vorschau*, mit der Sie eine Vorschau der Seite, wie Sie Ihre Benutzer auf dem Portal sehen würden, ein- und ausschalten können, ohne die Seite zuvor speichern zu müssen.

source: After editing the page, having a look at the preview, maybe editing and previewing again a few times, you'll reach a point where you are happy with your page, and you'll be able to save it.
de: Nach dem Bearbeiten der Seite und einem Blick auf die Vorschau, eventuell auch mehreren Durchläufen dieser Vorgänge, gelangen Sie an einen Punkt, an dem Sie mit Ihrer Seite zufrieden sind und sie speichern können.

source: Making the page accessible to your users
de: Verfügbar machen der Seite für Ihre Benutzer

source: Once the page is created and saved, it is accessible using its page URL; you can share the URL to anyone you want, but you may want to make the page accessible through your portal's menu, or even make it your new portal homepage. This is all done through the *Look & feel > Navigation* page.
de: Nachdem Sie die Seite erstellt und gespeichert haben, kann über ihre Seiten-URL darauf zugegriffen werden. Sie können die URL ganz nach Belieben mit jedem teilen, möchten die Seite aber vielleicht über das Menü Ihres Portals zugänglich oder sogar zu Ihrer neuen Portal-Homepage machen. All dies bewerkstelligen Sie über die Seite *Aussehen + Eindruck > Navigation*.

source: From here, you can add your page in the header menu, or set it as the homepage.
de: Dort können Sie Ihre Seite zum Kopfmenü hinzufügen oder sie als Homepage einrichten.
