Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/editing_pages/integrate_content.po
Languages: it

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPlumeAirQuality>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPlumeAirQuality>`__.

source: More information about `Plume air <https://www.plumelabs.com/en/>`_
it: Maggiori informazioni su `Plume Air <https://www.plumelabs.com/en/>`_.

source: Displays an image from a record.
it: Visualizza un'immagine a partire da un record.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRecordImage>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRecordImage>`__

source: This widget forces a redirect to the login page of the domain if the user is not logged in.
it: Se l'utente non ha effettuato l'accesso, questo widget reindirizza forzatamente l'utente alla pagina di login del dominio.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRedirectIfNotLoggedIn>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRedirectIfNotLoggedIn>`__.

source: This widget enumerates the results of a search (records for a Dataset Context, datasets for a Catalog Context) and repeats the template (the content of the directive element) for each of them.
it: Questo widget enumera i risultati di una ricerca (i record di un contesto di dataset, i dataset di un contesto di catalogo) e ripete il modello, cioè il contenuto dell'elemento direttiva, su ciascuno di essi.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResultEnumerator>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResultEnumerator>`__.

source: This widget exposes the results of a search (as an array) in a variable available in the scope. It can be used with AngularJS's ngRepeat to simply build a list of results.
it: Questo widget espone sotto forma di array i risultati di una ricerca in una variabile disponibile nel relativo ambito. Può essere anche utilizzato in abbinamento alla direttiva ngRepeat di AngularJS per creare in modo semplice un elenco di risultati.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResults>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResults>`__.

source: This widget displays all reuses published on a domain, in a infinite list of large boxes that presents them in a clear display. The lists show the more recent reuses first.
it: Questo widget visualizza tutti i riutilizzi pubblicati su un dominio in un elenco illimitato di riquadri ampi e ben visualizzati. I riutilizzi vengono presentati a partire dai più recenti.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsReuses>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsReuses>`__.

source: This widget displays a wide searchbox that redirects the search on the Explore homepage of the domain.
it: Questo widget visualizza un'ampia casella di ricerca che ridirige la ricerca sulla homepage di esplorazione del dominio.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSearchbox>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSearchbox>`__.

source: This widget displays a share button that on hover will reveal social media sharing buttons.
it: Questo widget visualizza un pulsante di condivisione che al passaggio del mouse rivela i pulsanti di condivisione dei social network.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSocialButtons>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSocialButtons>`__

source: This widget displays the custom OpenDataSoft spinner. Its size and color match the current font's.
it: Questo widget visualizza la casella di selezione personalizzata OpenDataSoft. Le dimensioni e il colore si adattano al tipo di carattere impostato.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSpinner>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSpinner>`__.

source: This widget displays a table view of a dataset, with infinite scroll and an ability to sort columns (depending on the types of the column).
it: Questo widget presenta una visualizzazione su tabella di un dataset, dotandola di uno scorrimento illimitato e della possibilità di ordinare le colonne in base alla loro tipologia.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTable>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTable>`__.

source: This widget displays a "tag cloud" of the values available in a facet (either the facet of a dataset, or a facet from the dataset catalog).
it: Questo widget visualizza un "tag cloud" dei valori disponibili nel facet di un dataset o di un catalogo.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTagCloud>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTagCloud>`__.

source: This widget displays a search box that can be used to do a full-text search on a context.
it: Questo widget visualizza una casella di ricerca utilizzabile per effettuare una ricerca full-text su un contesto.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`__

source: This widget enumerates the themes available on the domain, by showing their pictos and the number of datasets they contain.
it: Questo widget enumera i temi disponibili in un dominio, presentando i loro pittogrammi e il numero di dataset che contengono.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemeBoxes>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemeBoxes>`__

source: This widget displays the "picto" of a theme.
it: Questo widget visualizza i pittogrammi di un tema.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemePicto>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemePicto>`__.

source: This widget displays two fields to select the two bounds of a date and time range.
it: Questo widget visualizza due campi che consentono di selezionare i due limiti di intervallo della data e dell'ora.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimerange>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimerange>`__.

source: Displays a control to select either: last day, last week, last month or last year
it: Visualizza un controllo che permette di scegliere: l'ultimo giorno, l'ultima settimana, l'ultimo mese o l'ultimo anno.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimescale>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimescale>`__.

source: This widget displays the 5 top publishers
it: Questo widget visualizza le prime 5 entità di pubblicazione.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTopPublishers>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTopPublishers>`__.

source: Integrates a Twitter "widget" using the widget ID provided by Twitter.
it: Integra un "widget" Twitter utilizzando l'apposito ID fornito da Twitter.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTwitterTimeline>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTwitterTimeline>`__.

source: Filters
it: Filtri

source: In addition to AngularJS filters, OpenDataSoft widgets library includes some additional that can be used in custom pages :
it: In aggiunta ai filtri AngularJS, la libreria di widget OpenDataSoft ne include altri da inserire nelle pagine personalizzate:

source: Creating dashboards
it: Creazione dei dashboard

source: A step by step tutorial to create a simple dashboard with data visualization, filters, and counters.
it: Un tutorial che ti guiderà passo passo nella creazione di un semplice dashboard con visualizzazioni dei dati, filtri e contatori.

source: Going further with advanced widgets
it: Per un approccio più avanzato nell'utilizzo dei widget
