Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/editing_pages/integrate_content.po
Languages: it

source: Integrating content
it: Integrazione dei contenuti

source: When editing your page in **expert mode**, you are able to integrate other content directly in your page.
it: Quando modifichi le tue pagine nella **modalità Esperto**, hai la possibilità di integrarvi direttamente altri contenuti.

source: Embedding an OpenDataSoft visualization
it: Integrazione di una visualizzazione OpenDataSoft

source: When you are browsing a visualization on an OpenDataSoft portal (including your own), you can see below a few options to share the content, including "Embed", which will provide you with a little HTML code that you can paste in your page. By doing so, you will embed the visualization inside your page.
it: Sotto ogni visualizzazione dei portali OpenDataSoft (compreso il tuo) sono presenti alcune opzioni per condividere i contenuti pubblicati. Tra queste trovi il pannello "Embed", che grazie a un breve codice HTML da copiare e incollare, ti consente di integrare la visualizzazione corrispondente all'interno di una tua pagina.

source: Embedding a Twitter timeline
it: Integrazione di una timeline di Twitter

source: If you have an account on Twitter, you can create Twitter "widgets" from your Twitter account page, which are designed to be integrated in other websites (like a blog). When you create a widget, Twitter provides you with a little "code" to paste in your HTML code. Due to security concerns, JavaScript is blocked in OpenDataSoft pages editor, so you can't directly use the code provided by Twitter. However, we provide an OpenDataSoft widget to achieve this instead.
it: A partire dalla pagina del tuo account Twitter, puoi creare un "widget" da integrare in altri siti Web, come ad esempio un blog. Al termine della sua creazione, Twitter fornisce un breve "codice" da incollare nel tuo codice HTML. Per ragioni di sicurezza, JavaScript è bloccato nell'editor delle pagine OpenDataSoft, quindi non è possibile utilizzare direttamente il codice fornito da Twitter. OpenDataSoft mette però a disposizione un apposito widget, che consente di effettuare comunque l'integrazione.

source: First, you need to capture the "Widget ID", which is present in the first line of the code, in the ``data-widget-id`` attribute:
it: Per prima cosa, recupera l'ID del widget, che è presente nella prima riga del codice, nell'attributo ``data-widget-id``:

source: In this example, the Widget ID is "12341234123412341234".
it: In questo esempio, l'ID del widget è "12341234123412341234".

source: Then, add this widget in your page, using your Widget ID in the ``widget-id`` attribute:
it: Aggiungi poi il widget nella tua pagina, inserendo l'ID nell'attributo ``widget-id``:

source: Embedding other third-party content
it: Integrazione del contenuto di terze parti

source: Services like YouTube often provides ways to embed their content into other websites, under the form of a pastable code. Due to security concerns, we don't allow users to write JavaScript into pages, and some of these embed codes may be done in JavaScript, which would therefore not work on our pages; but most services provide a code based on "iframes" which is fine. Working embeds include YouTube, Vimeo, or Dailymotion.
it: Alcune piattaforme di servizi, come YouTube, offrono spesso la possibilità di integrare i loro contenuti in altri siti Web tramite un codice da incollare. Per ragioni di sicurezza, non consentiamo l'uso di JavaScript nella scrittura delle pagine e poiché alcuni dei codici in questione sono proprio in formato JavaScript, essi non potranno essere integrati. Molti di questi servizi forniscono però un codice "iframe", che al contrario è totalmente compatibile sulla nostra piattaforma. Tra gli embed funzionanti figurano quelli di YouTube, Vimeo e Dailymotion.

source: Using widgets
it: Utilizzo dei widget

source: When editing your page content in expert mode, you may want to use the ODS-Widgets library, which is a set of components, available as HTML elements, allowing you to natively integrate data visualizations in your page code, and building interactive pages by combining widgets together.
it: Quando modifichi le tue pagine nella modalità Esperto, puoi usufruire della libreria di widget ODS. Si tratta di un set di componenti disponibili sotto forma di elementi HTML che ti consentono di integrare le visualizzazioni di dati nel codice della tua pagina, creando così pagine interattive che combinano più widget.

source: The ODS-Widgets library is an open source, AngularJS-based framework developed and maintained by OpenDataSoft on `GitHub <https://github.com/opendatasoft/ods-widgets>`_. It comes with a complete and comprehenseive `online documentation <https://opendatasoft.github.io/ods-widgets/docs/>`_.
it: La libreria di widget ODS è un framework open source basato su AngularJS, sviluppato e gestito da OpenDataSoft su `GitHub <https://github.com/opendatasoft/ods-widgets>`_. Dispone inoltre di un’esauriente `documentazione online <https://opendatasoft.github.io/ods-widgets/docs/>`_.

source: It can be used directly in your domain's content pages, or in third party Web sites as a standalone toolkit.
it: La libreria può essere utilizzata direttamente nelle pagine di contenuto del tuo dominio oppure come un toolkit autonomo in siti Web di terze parti.

source: Despite being based on AngularJS, the ODS-Widgets is designed to be used as a set of HTML elements, and are therefore entirely used in HTML code, with no JavaScript to write. It is therefore usable by anyone with a few notions of HTML, and doesn't require development skills. Moreover, many visualizations from OpenDataSoft provide the equivalent widgets code in real time when you use them from the portal, so you can learn by starting from the result of a visualization and iterate from there.
it: Benché basata su AngularJS, la libreria di widget ODS è concepita come un set di elementi HTML ed è quindi totalmente integrabile nel tuo codice, senza necessità di ricorrere a JavaScript. È inoltre utilizzabile da chiunque possieda qualche nozione di HTML e non richiede ulteriori conoscenze di sviluppo informatico. In aggiunta, molte visualizzazioni della piattaforma OpenDataSoft forniscono in tempo reale lo stesso codice widget quando vengono utilizzate sul portale, e rappresentano quindi un ottimo punto di partenza da cui prendere spunto.

source: On top of all the widgets offered by the `ods-widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ library, a few additional directives are available for use within the content pages on the platform. Contrary to the widgets, these cannot be used on third-party websites for they are tightly coupled with the platform.
it: Accanto ai widget offerti dalla libreria `ods-widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_, sono disponibili anche alcune direttive dedicate alle pagine di contenuto della piattaforma. A differenza dei widget, esse non possono essere utilizzate su siti Web di terze parti, poiché sono strettamente collegate alla piattaforma stessa.

source: Widgets list
it: Elenco dei widget

source: This widget exposes the results of an aggregation function on a dataset field. Can be used for example to expose the average temperature of a weather dataset. The result is exposed into a new variable that you can use in other widgets or directly in your HTML.
it: Questo widget espone i risultati di una funzione di aggregazione nel campo di un dataset. Ad esempio, può essere impiegato per esporre la temperatura media di un dataset sul meteo. Il risultato è contenuto in una nuova variabile, che può essere utilizzata in altri widget o direttamente nel codice HTML.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAggregation>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAggregation>`__

source: This widget exposes the results of multiple aggregation based on an axis. Like for a chart, for each value of the X axis, it computes aggregation functions. It can be used with AngularJS's ngRepeat to simply build a table of analysis results.
it: Questo widget espone i risultati di aggregazioni multiple basate su un asse. Ad esempio, in un grafico, consente di calcolare le funzioni di aggregazione per ogni valore dell'asse X. Può essere utilizzato in abbinamento con la direttiva ngRepeat di AngularJS per creare in modo semplice una tabella dei risultati di analisi.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`__.

source: Linked to `odsAnalysisSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysisSerie>`_
it: Collegato a `odsAnalysisSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysisSerie>`_.

source: Integrates a Breezometer "widget" using the widget key provided by Breezometer
it: Integra un "widget" Breezometer basato sulla chiave widget fornita da Breezometer.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsBreezometer>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsBreezometer>`__.

source: This widget can take any dataset containing at least two datetime fields and a text field and use it to display a calendar. It can load at most 1000 events (records) at once.
it: Questo widget è in grado di creare un calendario di eventi a partire da qualsiasi dataset contenente almeno due campi data/ora e un campo di testo. Può caricare simultaneamente fino a 1.000 eventi (record).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCalendar>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCalendar>`__.

source: A "catalog context" represents the entire catalog (list) of datasets from a given domain, and a set of parameters used to query this catalog.
it: Il "contesto di un catalogo" è composto dal catalogo (elenco) completo dei dataset presenti in un determinato dominio e da un set di parametri utilizzati per eseguirvi le query.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCatalogContext>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCatalogContext>`__.

source: This widget is the base widget allowing to display charts from OpenDataSoft datasets. A Chart is defined by one or more series that get there data from form one or more dataset represented by an Dataset Context, a type of chart and multiple parameters to fine tune the appearance of chart.
it: Questo è il widget che sta alla base della visualizzazione dei grafici tratti dai dataset OpenDataSoft. Un grafico è caratterizzato dai seguenti elementi: una o più serie di dati ricavate da uno o più dataset all'interno di un contesto di dataset, una tipologia di grafico e diversi parametri per modificarne l'aspetto.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChart>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChart>`__.

source: Linked to `odsChartQuery <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartQuery>`_ and `odsChartSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartSerie>`_
it: Collegato a `odsChartQuery <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartQuery>`_ e `odsChartSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartSerie>`_.

source: This widget displays a button which will clear all active filters in the given context.
it: Questo widget visualizza un pulsante per azzerare tutti i filtri attivi in un determinato contesto.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsClearAllFilters>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsClearAllFilters>`__.

source: If you wrap this directive around an element or a set of element, it will display an expandable card above it to show the title and description of the dataset, along with a link to the portal that shows the dataset, and the license attached to the data.
it: Se all’interno di questa direttiva inglobi un elemento o una serie di elementi, sopra di essi verrà visualizzata una scheda espandibile con il titolo e la descrizione del dataset, il link del relativo portale e la licenza associata ai dati.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetCard>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetCard>`__.

source: A "dataset context" represents a dataset, and a set of parameters used to query its data. A context can be used by one or more directives, so that they can share information (generally the query parameters).
it: Il "contesto di un dataset" è composto da un dataset e da un set di parametri utilizzati per eseguirvi le query. Lo stesso contesto può essere utilizzato da una o più direttive, in modo da condividere le informazioni in esse contenute (solitamente i parametri di query).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`__.

source: Get the ISO local datetime and store it into a variable (into the scope).
it: Recupera la data e l'ora ISO locale e la archivia in una variabile all'interno del suo ambito.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatetime>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatetime>`__.

source: This widget shows a Disqus panel where users can comment the page.
it: Questo widget mostra un pannello Disqus, all’interno del quale gli utenti possono aggiungere i loro commenti sulla pagina.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDisqus>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDisqus>`__.

source: More information about `Configuring disqus` /!\ to be written
it: A breve verranno pubblicate maggiori informazioni sulla `Configurazione di Disqus` /!\.

source: This widget enumerates statistic values for a given catalog and injects them as variables in the context.
it: Questo widget enumera i valori statistici di un determinato catalogo e li inserisce come variabili in un contesto.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDomainStatistics>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDomainStatistics>`__.

source: This widget fetches the results of enumerating the values ("categories") of a facet, and exposes it in a variable available in the scope. It can be used with AngularJS's ngRepeat to simply build a list of results.
it: Questo widget recupera i risultati dell'enumerazione dei valori ("categorie") di un facet e li espone in una variabile disponibile nel relativo ambito. Può essere utilizzata insieme alla direttiva ngRepeat di AngularJS per creare in modo semplice un elenco di risultati.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacetResults>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacetResults>`__.

source: This widget displays filters (facets) for a dataset or a domain's catalog of datasets, allowing the users to dynamically "refine" on one or more categories for the context.
it: Questo widget visualizza i filtri (facet) di un dataset o di un catalogo di dataset di un dominio, permettendo agli utenti di "affinare" dinamicamente una o più categorie del contesto.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`__.

source: This widget displays a summary of all the active filters on a context: text search, refinements...
it: Questo widget visualizza un riepilogo di tutti i filtri attivi nel contesto: ricerca testuale, affinamenti, ecc.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFilterSummary>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFilterSummary>`__.

source: This widget displays a gauge in one of the two following modes: circle or horizontal bar. The widget relies on CSS3 and SVG and as a result is entirely customizable in CSS.
it: Questo widget visualizza un indicatore in uno dei seguenti formati: cerchio o barra orizzontale. Il widget si basa sui linguaggi CSS3 e SVG ed è quindi completamente personalizzabile tramite CSS.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGauge>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGauge>`__

source: This widget displays a mini map with a draw-rectangle tool that can be used to search through a catalog.
it: Questo widget visualizza una mini mappa, che consente di effettuare ricerche nel catalogo in base all'area rettangolare disegnata.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeoSearch>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeoSearch>`__.

source: This directive, when used to surround a text, displays a tooltip showing a point and/or a shape in a map.
it: Se utilizzata per inglobare un testo, questa direttiva visualizza un tooltip con un punto e/o una forma sulla mappa.

source: Integrates a Hubspot form given a portal ID and the form ID.
it: Integra un modulo Hubspot in presenza dell'ID del portale e del modulo.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsHubspotForm>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsHubspotForm>`__.

source: More information about `Hubspot <http://www.hubspot.com/>`_
it: Maggiori informazioni su `Hubspot <http://www.hubspot.com/>`_.

source: This widget displays the results of a query inside an infinite scroll list. It uses the HTML template inside the widget tag, and repeats it for each result.
it: Questo widget visualizza i risultati di una query in un elenco a scorrimento illimitato. Utilizza il modello HTML nel tag del widget e lo ripete per ogni risultato.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsInfiniteScrollResults>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsInfiniteScrollResults>`__.

source: This widget displays the last datasets of a catalog (default is last 5), based on the modified metadata.
it: Questo widget visualizza gli ultimi dataset di un catalogo (il valore predefinito è 5) in base alle modifiche apportate nei metadati.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastDatasetsFeed>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastDatasetsFeed>`__.

source: This widget displays last reuses published on a domain (5 by default).
it: Questo widget visualizza gli ultimi riutilizzi pubblicati su un dominio (il valore predefinito è 5).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastReusesFeed>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastReusesFeed>`__.

source: This widget allows you to build a map visualization and show data using various modes of display using layers. Each layer is based on a Dataset Context, a mode of display (clusters...), and various properties to define the display itself, such as colors.
it: Questo widget consente di creare una visualizzazione su mappa e di utilizzare i layer per presentare i dati in maniere diverse. Ogni layer si basa su un contesto di dataset, una modalità di visualizzazione (cluster, ecc.) e varie proprietà di visualizzazione da definire, come ad esempio i colori.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMap>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMap>`__

source: This widget displays an image gallery of a dataset containing media with thumbnails (images, pdf files...) with infinite scroll.
it: Questo widget visualizza una galleria di immagini a scorrimento illimitato nel caso in cui il dataset disponga di contenuti con anteprima (immagini, file PDF, ecc.).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMediaGallery>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMediaGallery>`__.

source: This widget displays the top datasets of a catalog (default is the 5 top datasets), based on the number of downloads.
it: Questo widget visualizza i primi dataset di un catalogo (per default, i primi 5) in base al numero di download.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostPopularDatasets>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostPopularDatasets>`__.

source: This widget displays the 5 most used themes.
it: Questo widget visualizza i primi 5 temi più utilizzati.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostUsedThemes>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostUsedThemes>`__.

source: This widget displays a "picto" specified by a url and force a fill color on it. This element can be styled (height, width...), especially if the picto is vectorial (SVG).
it: Questo widget visualizza un pittogramma specificato da un URL e gli impone un colore. L'elemento può essere modificato nell'aspetto (altezza, larghezza, ecc.), soprattutto se il pittogramma è vettoriale (SVG).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPicto>`__
it: `Documentazione completa <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPicto>`__.

source: Integrates a Plume Air Embed using a city name.
it: Inserisce un embed Plume Air utilizzando un nome di città.
