Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/editing_pages/style.po
Languages: it

source: Customize a content page with HTML and CSS
it: Personalizzazione di una pagina di contenuto con i codici HTML e CSS

source: Once you have created a simple page using one of the predefined templates, you may want to go further. Maybe you want to add a new block below, or add a large centered header at the top?
it: Dopo aver creato una pagina semplice utilizzando uno dei modelli predefiniti, è possibile personalizzarla, aggiungendo ad esempio un nuovo blocco in basso o un ampio header centrato in alto.

source: Switching to the **expert mode** lets you edit directly the underlying language behind the page, which is the HTML and CSS code.
it: Passando alla **modalità Esperto**, avrai modo di modificare direttamente il linguaggio della pagina, che è scritta in codice HTML e CSS.

source: HTML and CSS are the languages behind every web page; you can do very advanced things with it, but at their core, they are designed to be expressive and easy to learn. After playing with it a bit, you usually can do simple things like changing the layout of your page, changing the size of your text...
it: Ogni pagina Web è creata in HTML e CSS. Puoi servirti di questi linguaggi per creare soluzioni anche molto complesse, ma alla base sono pensati per essere espressivi e facili da imparare. Dopo averli sperimentati un po', in genere si è subito in grado di effettuare semplici operazioni, come modificare il layout della pagina, cambiare le dimensioni del testo, ecc.

source: In this article, we'll walk you through a few basic changes to a standard page template. We do not aim to teach HTML and CSS, as other resources will do this much better than us; however, these are examples that you can start from and expand upon.
it: Questo articolo offre alcune soluzioni di base utili a modificare il modello di una pagina standard. Lo scopo non è certo quello di insegnarti i linguaggi HTML e CSS – altre risorse sapranno farlo certamente in modo appropriato – ma gli esempi che seguono ti daranno senz'altro qualche spunto da cui partire per ulteriori approfondimenti.

source: First, let's create a new page based on the "Main block + right column" template, as seen in the :doc:`Creating a simple content page </editing_pages/create>` article. Then, switch to **expert mode** using the link in the top right of the interface. You now have two "CSS" and "HTML" tabs, containing the code behing the page.
it: Per iniziare, crea una nuova pagina basata sul modello "Blocco principale + colonna a destra", come visto nell'articolo :doc:`Creazione di una semplice pagina di contenuto </editing_pages/create>`. In seguito, passa alla **modalità Esperto** tramite il collegamento presente nell'angolo in alto a destra dell'interfaccia. Vedrai così comparire le schede "CSS" e "HTML", che contengono il codice della pagina.

source: The CSS tab is empty for now, as there is no specific CSS code. However, the HTML of the page is here:
it: Al momento la scheda CSS è vuota, mentre il codice HTML è il seguente:

source: Adding a new row
it: Aggiunta di una riga

source: Each ``<div>`` tag represents a block in the page; the class attached to each block defines its appearance, like its width.
it: Ogni tag ``<div>`` racchiude un blocco all'interno della pagina, mentre le classi incluse in ogni blocco ne definiscono l'aspetto, come ad esempio la sua larghezza.

source: More precisely:
it: In termini più precisi:

source: ``<div class="container-fluid">`` is the block around the entire page, making sure it takes all the available width in the browser
it: ``<div class="container-fluid">`` è il blocco che circoscrive la pagina intera, occupando l'intera larghezza disponibile nel browser.

source: ``<div class="row">`` represents a row, which in turns contains other blocks. By reasoning using "rows", we make sure our blocks don't mix up if one is larger than the others.
it: ``<div class="row">`` rappresenta una riga che contiene altri blocchi. Ragionare in termini di "righe", consente di evitare che i blocchi si sovrappongano nel caso in cui uno sia più grande degli altri.

source: ``<div class="col-md-8">`` and ``<div class="col-md-4">`` are two blocks containing the "real" content (text for example). The idea with the classes ``col-md-8`` and ``col-md-4`` is to think of the available space in each row as a grid of 12 "cells"; your blocks inside this row can take a total amount of 12 cells, and each blocks uses ``col-md-X`` where X is the amount of cells it will take. So, here we wanted one blocks taking two thirds of the space, and another block taking one third, so we used 8 and 4 to divide the available 12 cells. All this logic (named "grid" logic) is detailed in the :doc:`Designing a responsive portal </customizing_look_and_feel/responsive>` article.
it: ``<div class="col-md-8">`` e ``<div class="col-md-4">`` sono i due blocchi che racchiudono il contenuto "reale", ad esempio un testo. L'idea alla base delle classi ``col-md-8`` e ``col-md-4`` è quella di suddividere lo spazio di ogni riga in una griglia di 12 "celle". Visto che i blocchi di questa riga possono occupare al massimo 12 celle, ognuno di essi deve specificare la propria ampiezza utilizzando la classe ``col-md-X``, dove X sta per il numero di celle coperte. In questo caso, delle 12 disponibili, un blocco ne richiederà 8 e l'altro 4 (rispettivamente, due terzi e un terzo dello spazio). Questo modello logico, chiamato "a griglia", è illustrato in dettaglio nell'articolo :doc:`Progettazione di un portale responsivo </customizing_look_and_feel/responsive>`.

source: ``<div class="ods-box">`` just creates a visual block with a border and a background, more suitable to contain text.
it: ``<div class="ods-box">`` crea semplicemente un blocco visivo con un bordo e uno sfondo, ideale per accogliere i contenuti testuali.

source: Now we want to add a new line of three blocks, each taking a third of the space. Following our previous logic, we add a new row, and three blocks taking each 4 cells.
it: Se ora decidiamo di aggiungere una riga di tre blocchi, ciascuno equivalente a un terzo dello spazio, in base al nostro modello logico creeremo una riga con tre blocchi da 4 celle:

source: Our preview now looks like this:
it: Ecco l'anteprima della pagina:

source: Setting a basic style
it: Configurazione di uno stile di base

source: CSS code can be used to change the way your content is displayed: you can change the size of the text, add a colored background, borders, change the color...
it: Il codice CSS serve a modificare l'aspetto del contenuto da visualizzare: puoi cambiare la dimensione del testo, aggiungere uno sfondo colorato, inserire dei bordi, modificare il colore, ecc.

source: There are multiple ways to apply CSS "rules" to an element of your page, but a good practice to keep in mind is to always use "classes": by adding `class="myclass"` to an element in your page, you attach a "class" to your element, and then you can write rules for that class in your CSS style. This way, you can apply the same class to various elements, and if you change your page, the rules will still apply to your element.
it: Esistono diversi modi per applicare le "regole" CSS a un elemento della pagina, ma è buona norma ricorrere sempre all'uso delle "classi". Aggiungendo `class="lamiaclasse"` a un elemento della tua pagina, associ quest'ultimo alla classe creata: a questo punto, non ti resterà che scrivere le regole CSS che vuoi assegnare. In questo modo, potrai applicare la stessa classe a elementi diversi e, in caso di modifiche alla pagina, le regole resteranno sempre valide.

source: Let's assume we want to make some text larger than usual. First, you need to add a class to the element containing the text, here, "Hello world!":
it: Immaginiamo di voler ingrandire le dimensioni del testo "Hello world!". Innanzitutto, devi aggiungere una classe all'elemento che contiene la frase:

source: Then, we just need to add a rules in the CSS code, stating that the class "larger-text" should have a bigger text size:
it: In seguito, aggiungerai una regola in codice CSS specificando che la classe "larger-text" deve possedere un testo dalle dimensioni più grandi:

source: There are many CSS rules you can add, to any of your elements.
it: Per personalizzare la tua pagina, hai a disposizione una vasta gamma di regole CSS, che puoi associare a qualunque elemento.
