Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v2/introduction.po
Languages: fr, it

source: A new version of APIv2 will be available before the end of May. Major breaking changes will occur, which means that action will be needed on your side if you use it. Please contact us if you need additional information.
fr: Une nouvelle version de l'API v2 sera disponible d'ici fin mai. Cette version apporte des changements majeurs qui entrainent une incompatibilité avec le fonctionnement actuel. Si vous l'utilisez, une action de votre part est certainement nécessaire. Merci de nous contacter pour toute information complémentaire.

source: If you are already familiar with the structure of the data within the platform and are a seasoned developer or data scientist, you may want to dive right in and checkout the `API console <https://data.opendatasoft.com/api/v2/console>`_ and/or the `API Swagger definition <https://data.opendatasoft.com/api/v2/swagger.json>`_.
fr: Si vous êtes déjà habitué à la structure de données interne de la plateforme et si vous êtes un développeur expérimenté, vous pouvez directement vous diriger vers la `console API <https://data.opendatasoft.com/api/v2/console>`_ ou la `définition d'API Swagger <https://data.opendatasoft.com/api/v2/swagger.json>`_.
it: Se ha già familiarità con la struttura dei dati della piattaforma e sei uno sviluppatore esperto o un esperto di dati, puoi utilizzarla direttamente, provando la `console API <https://data.opendatasoft.com/api/v2/console>`_ e/o la `definizione Swagger API <https://data.opendatasoft.com/api/v2/swagger.json>`_.

source: Both these links point to OpenDataSoft's central repository of open data but if you have a portal, you can access the same page at ``http://<youropendatasoftportal>/api/``.
fr: Ces deux liens pointent vers le réseau de données ouvertes OpenDataSoft, mais si vous avez un portail, vous pouvez accéder à la même page à l'adresse ``http://<votre_portail_opendatasoft>/api/``.
it: Entrambi i link ti indirizzeranno al repository centrale degli open data OpenDataSoft, ma se disponi di un portale puoi accedere alla stessa pagina all'indirizzo ``http://<iltuoportaleopendatasoft>/api/``.

source: In the following section, we'll assume that you know what HTTP verbs (``GET``, ``POST``, ``PUT``...) are and that you are familiar with HTTP-related vocabulary such as *call*, *request*, *response* *body payload*, *query parameters* etc. If you are not then please refer to the :doc:`glossary </platform_glossary>` whenever you find a term you do not understand.
fr: Dans la section suivante, vous devez être familier avec le concept de verbes HTTP (``GET``, ``POST``, ``PUT``...) et le vocabulaire lié au protocole HTTP tel que *appel*, *requête*, *corps de requête*, *paramètres de requête*, etc. Si ce n'est pas le cas, vous trouverez un certain nombre de définitions dans le :doc:`glossaire </platform_glossary>`.
it: Quanto descritto nella sezione seguente si basa sul presupposto che tu conosca il significato dei comandi HTTP (``GET``, ``POST``, ``PUT``, ecc.) e della relativa terminologia, come *call* (chiamata), *request* (richiesta), *response*(risposta), *body payload*, *query parameters* (parametri di query) e così via. In caso contrario, se incontri un termine che non conosci, ti preghiamo di consultare il :doc:`glossario </platform_glossary>`.

source: OpenDataSoft's API V2 is a full-REST, HATEOAS-enabled, JSON-first API designed to provide access in a coherent, hierarchical way to all the data available through the platform.
fr: L'API v2 OpenDataSoft est une API REST JSON conforme au principe HATEOAS, conçue pour fournir un accès cohérent et hiérarchisé à l'ensemble des données disponibles dans la plateforme.
it: L'API OpenDataSoft V2 è un'API full-REST, HATEOAS, JSON-first studiata per accedere in modo coerente e gerarchico a tutti i dati disponibili sulla piattaforma.

source: This means that:
fr: Ce qui signifie :

source: all API endpoints will return JSON data unless required otherwise,
fr: tous les points d'entrée retournent un document JSON, sauf indication contraire,

source: endpoints are organized in a hierarchical way describing the relative relationship between objects,
fr: les points d'entrée sont organisés d'une façon hiérarchique qui décrit les relations entre objets,

source: all responses will contain a list of links allowing easy and relevant navigation through the API endpoints.
fr: toutes les réponses contiennent une liste de liens permettant une navigation simple et pertinente à travers les points d'entrée de l'API.

source: **Example 1:**
fr: **Exemple 1 :**

source: Request:
fr: Requête :

source: Response:
fr: Réponse :

source: A collection of datasets (below, the ``...`` stand for ellipsis).
fr: Une collection de jeux de données (ci-dessous, ``...`` étant une ellipse).

source: **Example 2:**
fr: **Exemple 2 :**

source: ``GET /api/v2/catalog/datasets/las-vegas-crime-data@codeforvegas`` (the link provided as "self" in the first dataset returned in the collection of the previous call)
fr: ``GET /api/v2/catalog/datasets/las-vegas-crime-data@codeforvegas`` (le lien "self" du premier jeu de données de la collection retourné par l'appel précédent)

source: Introduction
it: Introduzione

source: This API is currently in BETA and important changes can be made until finale release.
it: Attualmente, questa API è disponibile in versione BETA ed è possibile che prima della versione finale vengano apportate modifiche rilevanti.

source: Don't hesitate to report any problem you encounter when using it.
it: Nel caso riscontrassi qualsiasi problema durante il suo utilizzo, ti preghiamo di segnalarcelo.

source: This means that all API endpoints will return JSON data unless required otherwise, that endpoints are organized in a hierarchical way describing the relative relationship between objects and that all responses will contain a list of links allowing for easy and relevant navigation through the API endpoints.
it: Tutti gli endpoint dell'API restituiscono infatti dati JSON (a meno che non venga richiesto diversamente) e la loro struttura gerarchica rispecchia le relazioni tra gli oggetti. Inoltre, ogni risposta contiene un elenco di link, che consentono di navigare facilmente e in modo pertinente tra gli endpoint API.

source: For example, a ``GET /api/v2/catalog/datasets`` will return a collection of datasets as such (the ``...`` stand for ellipsis):
it: Ad esempio, ``GET /api/v2/catalog/datasets`` restituirà una raccolta di dataset di questo tipo (``...`` valgono come puntini di sospensione):

source: While a ``GET /api/v2/catalog/datasets/las-vegas-crime-data@codeforvegas`` (the link provided as "self" in the first dataset returned in the collection of the previous call) will return:
it: Invece ``GET /api/v2/catalog/datasets/las-vegas-crime-data@codeforvegas`` (il link fornito come "self" nel primo dataset restituito dalla chiamata precedente) darà il seguente risultato:
