Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v2/query_language.po
Languages: fr

source: Returns the current date. This function may be called as a query value for a field. When called without an argument, it will evaluate to the current datetime: ``birthdate >= NOW()`` returns all Records containing a birth date greater or equal to the current datetime. This function can also accept parameters, see below for the ``NOW()`` function available parameters.
fr: Renvoie la date actuelle. Cette fonction peut être appelée en tant que valeur de requête pour un champ. Lorsqu'elle est appelée sans argument, elle effectue une évaluation jusqu'à la date actuelle : ``birthdate >= NOW()`` renvoie tous les enregistrements contenant une date de naissance supérieure ou égale à la date et à l'heure actuelles. Cette fonction peut également accepter des paramètres, reportez-vous aux paramètres disponibles pour la fonction ``NOW()`` ci-dessous.

source: Available parameters for the ``NOW()`` function:
fr: **Paramètres disponibles pour la fonction ``NOW()``** :

source: years, months, weeks, days, hours, minutes, seconds, microseconds: These parameters add time to the current date.
fr: years, months, weeks, days, hours, minutes, seconds, microseconds : Ces paramètres ajoutent du temps à la date actuelle.

source: For example: ``NOW(years=-1, hours=-1)`` returns the current date minus a year and an hour
fr: Par exemple : ``NOW(years=-1, hours=-1)`` renvoie la date actuelle moins une année et une heure

source: year, month, day, hour, minute, second, microsecond: can also be used to specify an absolute date.
fr: year, month, day, hour, minute, second, microsecond : ces paramètres peuvent également être utilisés pour spécifier une date absolue.

source: For example: ``NOW(year=2001)`` returns the current time, day and month for year 2001
fr: Par exemple : ``NOW(year=2001)`` renvoie l'heure, le jour et le mois actuels pour l'année 2001

source: weekday: Specifies a day of the week. This parameter accepts either an integer between 0 and 6 (where 0 is Monday and 6 is Sunday) or the first two letters of the day (in English) followed by the cardinal of the first week on which to start the query.
fr: weekday : spécifie un jour de la semaine. Ce paramètre accepte soit un entier entre 0 et 6 (0 étant lundi et 6 dimanche) ou les deux premières lettres du jour (en anglais) suivies du cardinal de la première semaine sur laquelle porte la requête.

source: ``NOW(weeks=-2, weekday=1)`` returns the Tuesday before last.
fr: ``NOW(weeks=-2, weekday=1)`` renvoie le mardi précédant le dernier.

source: ``NOW(weekday=MO(2))`` returns Monday after next.
fr: ``NOW(weekday=MO(2))`` renvoie le lundi suivant le prochain.
