Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v2/query_language.po
Languages: fr

source: Query Language
fr: Language de requête

source: Filtering features are built in the core of OpenDataSoft API engine.
fr: Les fonctions de filtrage sont au coeur du moteur d'API OpenDataSoft.

source: The OpenDataSoft Query Language (ODSQL) makes it possible to express complex queries as a filtering context for datasets or records, but also to build aggregations or computed fields.
fr: Le langage de requêtes OpenDataSoft (ODSQL pour OpenDataSoft Query Language) rend possible l'usage de requêtes complexes pour filtrer les jeux de données ou leurs enregistrements, mais aussi pour construire des agrégations ou des champs calculés.

source: Note that a given filtering context can simply be copied from one API to another. For example, you can easily build a user interface which first allows the user to visually select the records they are are interested in, using full text search, facets and geo filtering ; and then allowing them to download these records with the same filtering context.
fr: Notez qu'une requête ODSQL est réutilisable d'une API à l'autre. Par exemple, vous pouvez aisément proposer une interface dans laquelle l'utilisateur commence par sélectionner les enregistrements de son choix à l'aide de la recherche full text, de facettes et d'un filtrage géographique ; puis lui permettre télécharger ces enregistrements avec la même requête ODSQL.

source: The ODSQL is split into five different kinds of clauses:
fr: ODSQL est divisé en cinq types de clauses :

source: the **select** clause allows you to choose the returned fields, give them an alias, or manipulate them with functions like count, sum, min, max, etc.
fr: la clause **select** permet de sélectionner les champs retournés, leur donner un alias, ou les traiter via des fonctions telles que count (compte), sum (somme), min, max, etc.

source: the **where** clause acts as a filter for the returned datasets or records, thanks to boolean operations, filter functions, arithmetic expressions, and more.
fr: la clause **where** agit comme filtre pour les jeux de données ou enregistrements récupérés, grâce à des opérations booléennes, des fonctions de filtrage, expressions arithmétiques, et plus.

source: the **group by** clause lets you aggregate rows together based on fields, numeric ranges, or dates,
fr: la clause **group by** permet d'agréger plusieurs enregistrements à partir de leurs champs, de plages numériques, ou de dates,

source: the **order by** and **limit** clauses let you choose the order and quantity of rows you will receive as a response.
fr: les clauses **order by** et **limit** permettent de choisir l'ordre et la quantité d'enregistrements récupérés.

source: These clauses are used as parameters in the Search API v2 for searching, aggregating and exporting datasets and records. Depending on the endpoint you use, some features of the query language will be available or not in the request.
fr: Ces clauses sont utilisées comme paramètres dans l'API v2 pour rechercher, agréger et exporter les jeux de données et leurs enregistrements. En fonction du point d'entrée, certaines fonctionnalités du langage de requête ODSQL seront disponibles ou non dans la requête HTTP.

source: The whole query language is case insensitive but we will use upper case in the documentation for language keywords for clarity. Spaces are optional.
fr: Le langage de requête ODSQL est entièrement insensible à la casse, mais nous utiliserons des lettres capitales dans la documentation pour les mots clés du langage. Les espaces sont optionnels.

source: Language elements
fr: Eléments du langage

source: Literals
fr: Expressions littérales

source: Literals are used in comparison, assignments or functions. Literal types are **fields**, **strings**, **numbers**, **date**, **boolean** and **geometry**.
fr: Les expressions littérales sont utilisées dans les comparaisons, affectations, et fonctions. Une expression littérale peut être de type **champ**, **chaîne de caractères**, **numérique**, **date**, **booléen** et **géométrie**.

source: Here the format for each literal:
fr: Une expression littérale est exprimée de la façon suivante :

source: Field
fr: Champ

source: Field literals are literals that are not enclosed in quotes. They contain only alphanumeric characters or underscore.
fr: Les expressions littérales ne sont pas placés entre guillemets. Elles contiennent uniquement des caractères alphanumériques et des tirets bas.

source: **WARNING**: If a field name contains only digits or is a keyword, it must be enclosed in back-quotes
fr: **ATTENTION** : si un nom de champ contient uniquement des chiffres, ou si c'est un mot-clé réservé, il doit être placé entre apostrophes inversées ' ` '.

source: String
fr: Chaîne de caractères

source: String literals are enclosed in either single or double quotes.
fr: Les chaînes de caractères sont placées entre guillemets simples ou doubles.

source: Number
fr: Numérique

source: Date literals are defined with a ``date`` keyword followed by a valid date format enclosed in single quotes.
fr: Les dates sont définies avec le mot clé ``date`` suivi par un format de date valide placé entre guillemets simples.

source: Boolean
fr: Booléen

source: Boolean literals should be used in boolean filters and can be either TRUE or FALSE keywords (non case sensitive)
fr: Les booléens peuvent être utilisés dans les filtres booléens, et peuvent être soit TRUE (vrai), soit FALSE (faux) (insensible à la casse).

source: Geometry
fr: Géométrie

source: Geometry literals are defined with a ``geom`` keyword followed by a valid geometry expression enclosed in single quotes. Supported geometry expression are :
fr: Les géométries sont définies par le mot-clé ``geom`` suivi par une expression géométrique valide placée entre guillemets simples. Les formats de géométries supportés sont :

source: WKT/WKB : https://en.wikipedia.org/wiki/Well-known_text
fr: WKT/WKB : https://fr.wikipedia.org/wiki/Well-known_text

source: Reserved words
fr: Mots-clés réservés

source: All these words must be back-quoted if used as field name.
fr: Ces mots doivent être placés entre apostrophes inversées si utilisés en tant que noms de champs.

source: Select clause
fr: Clause select

source: The **select** clause can be used in the whole search API as the parameter ``select``. Its goal is to allow you to choose the fields that will be returned for each row, transform them using arithmetic, rename them, add computed virtual fields, include or exclude fields based on a pattern.
fr: La clause **select** peut être utilisée dans toute l'API de recherche en tant que paramètre ``select``. Elle permet de choisir les champs qui seront retournés pour chaque enregistrement, les transformer avec de l'arithmétique, les renommer, ajouter des champs virtuels calculés, inclure ou exclure des champs à partir d'un motif.

source: A **select** clause can be:
fr: Une clause **select** peut être :

source: a single expression
fr: une expression simple

source: a list of comma-separated expressions
fr: une liste d'expressions séparées par des virgules

source: Select expression
fr: Expression select

source: These expressions are classic expressions showing multiple selection, field renaming and arithmetic select. The '*' (wildcard) means all the fields (if not in an arithmetic select where it is treated as the multiply sign). It is the default behavior when no select is specified in the search endpoint. In the aggregates endpoint, the default is to only display fields used for the aggregation.
fr: Ces expressions montrent la sélection multiple, le renommage de champ, et les opérations arithmétiques. Le '*' (méta-caractère), signifie "tous les champs" (sauf dans une opération arithmétique, où c'est le signe de multiplication). C'est le comportement par défaut si aucun select n'est précisé au point d'entrée de recherche. Au point d'entrée d'agrégation, le comportement par défaut est de ne sélectionner que les champs utilisés pour l'agrégation.

source: Include and exclude
fr: Include et exclude

source: Where clause
fr: Clause where

source: The **where** clause can be used in the whole search API as the parameter ``where``. Its goal is to filter rows with a combination of boolean expressions, functions, expressions or search queries.
fr: La clause **where** peut être utilisée dans toute l'API de recherche en tant que paramètre ``where``. Elle permet de filtrer les enregistrements avec une combinaison d'expressions, de fonctions ou de requêtes plein texte.

source: A **where** clause can be:
fr: Une clause **where** peut être :

source: a list of comma-separated expressions that must all be satisfied at the same time
fr: une liste d'expressions séparées par des virgules qui doivent toutes être satisfaites en même temps

source: empty
fr: vide

source: Filter functions
fr: Fonctions de filtrage

source: Filter functions are built-in functions that can be used as a where expression:
fr: Les fonctions de filtrage sont des fonctions intégrées qui peuvent être utilisées comme expressions where :

source: The **type** function returns rows where the field named *field_name* has some type in ``INT``, ``DOUBLE``, ``TEXT``, ``FILE``, ``DATE``, ``DATETIME``, ``IMAGE``.
fr: La fonction **type** retourne les enregistrements où le champ *field_name* a pour type : ``INT`` (entier), ``DOUBLE`` (nombre à virgule), ``TEXT`` (texte), ``FILE`` (fichier), ``DATE``, ``DATETIME`` (date et heure), ``IMAGE``.

source: The **distance** function limits the result set to a geographical area defined by a circle defined by its center and a distance. The coordinates of the center of the circle are expressed in the `WKT format <https://en.wikipedia.org/wiki/Well-known_text>`_). The distance is numeric and can have a unit in ``mi``, ``yd``, ``ft``, ``m``, ``cm``, ``km``, ``mm``.
fr: La fonction **distance** limite le résultat à une zone géographique définie par un cercle calculé à partir de son centre et d'une distance. Les coordonnées du centre du cercle sont exprimées au `format WKT <https://fr.wikipedia.org/wiki/Well-known_text>`_). La distance est numérique et peut avoir une unité telle que ``mi``, ``yd``, ``ft``, ``m``, ``cm``, ``km``, ``mm``.

source: The **geometry** function limits the result set to a geographical area defined by a polygon with coordinates expressed in the WKT format, and a mode in ``INTERSECT``, ``DISJOINT``, ``WITHIN``.
fr: La fonction **geometry** limite le résultat à une zone géographique définie par un polygone dont les coordonnées sont exprimées au format WKT et un mode tel que ``INTERSECT`` (intersection), ``DISJOINT`` (exclusion), ``WITHIN`` (inclusion).

source: The **bbox** function limits the result set to a rectangular box defined by its top left and its bottom right coordinates expressed in the WKT format.
fr: La fonction **bbox** limite le résultat à une boite rectangulaire définie par les coordonnées de son coin supérieur gauche et de son coin inférieur droit exprimées au format WKT.

source: Filter expressions
fr: Expression de filtrage

source: Filter expressions allow you to use arithmetic and comparisons to limit the result set to matching rows.
fr: Les expressions de filtrage permettent d'utiliser de l'arithmétique et des comparaisons pour limiter le résultat aux enregistrements correspondants.

source: Filter expressions also work with dates and ranges of dates, as the following examples show.
fr: Les expressions de filtrage fonctionnent aussi avec des dates, des plages de dates, comme le montrent les exemples suivants.

source: As you can see in these examples, the syntax is flexible and you can combine several statements thanks to boolean expressions (``AND``, ``OR``, ``NOT``).
fr: Comme vous pouvez le voir dans ces exemples, la syntaxe est flexible, et plusieurs propositions peuvent être combinées à l'aide d'expression booléennes (``AND``, ``OR``, ``NOT``).

source: For text searches, the matched string must be single or double quoted. The keyword "LIKE" is used to perform approximate searches, or prefixed searches.
fr: Pour la recherche de textes, les chaînes de caractères doivent être mises entre guillemets simples ou doubles. Le mot clé "LIKE" permet d'effectuer des recherches approximatives ou préfixées.

source: Text field
fr: Champ texte

source: Operators
fr: Opérateurs

source: Perform a normalized query on provided token. Example: ``film_name like "star"`` will match ``star wars`` and ``Star Trek`` To match multi tokens, it is possible to use quotes. ``film_name like "star wars"`` will match fields containing ``star`` and ``wars``
fr: Effectuer une recherche normalisée sur le lexème fourni. Exemple : ``film_name like "star"`` correspond à ``star wars`` et ``Star Trek``. Pour fournir plusieurs lexèmes, il est possible d'utiliser des guillemets. ``film_name:"star wars"`` correspondent à des champs contenant ``star`` et ``wars``.

source: Perform an exact query (not tokenized and not normalized) on the specified field. Example: ``film_name="Star"`` will not match ``Star Wars``. To match ``Star Wars`` it is necessary to query the exact string. ``film_name="Star Wars"``
fr: Effectuer une recherche exacte (sans normalisation ni tokenisation) sur le champs spécifié. Exemple : ``film_name="Star"`` ne correspond pas à ``Star Wars``. Pour chercher ``Star Wars``, il est nécessaire d'entrer la chaîne exacte. ``film_name="Star Wars"``

source: Numeric field
fr: Champ numérique

source: Match a numeric value. For instance: ``age:18`` will filter rows with field ``age`` is equal to ``18``
fr: Recherche par valeur numérique. Par exemple : ``age:18`` filtre les enregistrements où le champ ``age``est égal à ``18``.

source: Return results whose field values are larger, smaller, larger or equal, smaller or equal to the given value.
fr: Retourne les résultats pour lesquels la valeur du champ est supérieure, inférieure, supérieure ou égale, inférieure ou égale à la valeur donnée.

source: Queries Records whose numeric value is between ``lower_numeric`` and ``higher_numeric``. An inclusive or exclusive bound can be used. Example: ``]lower_numeric (TO|..) higher_numeric[`` will exclude ``lower_numeric`` and ``higher_numeric``.
fr: Recherche les enregistrements dont la valeur numérique est comprise entre ``lower_numeric`` et ``higher_numeric``. Les bornes inférieure et supérieure peuvent être inclusives ou exclusives. Exemple: `]lower_numeric (TO|..) higher_numeric[`` exclut ``lower_numeric`` et ``higher_numeric``.

source: Date field
fr: Champ date

source: Match a date value. For instance: ``film_date:1977`` will return films released in 1977.
fr: Recherche par date. Par exemple : ``film_date:1977`` correspond aux films sortis en 1977.

source: Queries Records whose numeric value is between ``lower_date`` and ``higher_date``. An inclusive or exclusive bound can be used. Example: ``]lower_date (TO|..) higher_date[`` will exclude ``lower_date`` and ``higher_date``.
fr: Recherche les enregistrements dont la date est comprise entre ``lower_date`` et ``higher_date``. Les bornes inférieure et supérieure peuvent être inclusives ou exclusives. Exemple: ``]lower_date (TO|..) higher_date[`` exclut ``lower_date`` et ``higher_date``.

source: Date formats can be specified in different formats: simple (YYYY[[/mm]/dd]) or ISO 8601 (YYYY-mm-DDTHH:MM:SS)
fr: Il est possible de spécifier différents formats de date : simple (AAAA[[/mm]/jj]) ou ISO 8601 (AAAA-mm-JJTHH:MM:SS)

source: **Examples:**
fr: **Exemples :**

source: Filter search query
fr: Recherche plein texte

source: Filter search queries are queries that don't refer to fields, only containing quoted strings and boolean operators. They perform full-text searches on all visible fields of each record and return matching rows.
fr: Les requêtes de recherche plein texte sont des requêtes qui ne se réfèrent pas à un champ, et ne contiennent qu'une chaîne de caractères entre guillemets ou des opérateurs booléens. Ils permettent d'effectuer une recherche plein texte sur tous les champs visibles de chaque enregistrement, et de ne retourner que ceux qui correspondent à la requête.

source: If the string contains more than one word, the query will be an ``AND`` query on each tokenized word.
fr: Si la chaîne contient plus d'un mot, chaque lexème doit être présent dans l'enregistrement, comme si les mots étaient séparés par des ``AND``.

source: It is possible to perform a greedy query by adding a wildcard `*` at the end of a word.
fr: Il est possible d'effectuer une recherche gloutonne en ajoutant le méta-caractère `*` à la fin d'un mot.

source: Field queries
fr: Requêtes sur des champs

source: One of the major features of the query language is to allow per field filtering. You can use field names as a prefix to your queries to filter the results based on a specific field's value.
fr: L'une des fonctionnalités majeures du langage de requêtes ODSQL est qu'il permet un filtrage par champ. Vous pouvez utiliser des noms de champs comme préfixe pour vos requêtes afin de filtrer le résultat en fonction de la valeur d'un champ en particulier.

source: **For the dataset search API**, the list of available fields corresponds exactly to available metadata. By default:
fr: **Pour l'API de recherche de jeux de données**, la liste de champs disponibles correspond exactement aux métadonnées disponibles. Par défaut :

source: Field Name
fr: Nom du champ

source: The dataset publisher
fr: L'éditeur du jeu de données

source: The dataset title
fr: Le titre du jeu de données

source: The dataset description
fr: Description du jeu de données

source: The dataset license
fr: Licence du jeu de données

source: The number of records in the dataset
fr: Nombre d'enregistrements dans le jeu de données

source: The last modification date of the dataset
fr: Date de la dernière modification du jeu de données

source: The language of the dataset (iso code)
fr: Langue du jeu de données (code ISO)

source: The theme of the dataset
fr: Thème du jeu de données

source: The references for the dataset
fr: Références pour le jeu de données

source: The domain administrator might define a richer metadata template, thus giving access to a richer set of filtering fields.
fr: L'administrateur du domaine peut définir un modèle de métadonnées plus riche, ce qui donne accès à un ensemble de champs à filtrer plus riche.

source: For example, one can search on public.opendatasoft.com datasets which have ``Paris`` in their title or description and which contain at least 50 000 records:
fr: Par exemple, il est possible de rechercher les jeux de données sur public.opendatasoft.com dont le titre ou la description contient ``Paris`` et contenant au moins 50 000 enregistrements :

source: **For the record search APIs**, the list of available fields depends on the schema of the dataset. To fetch the list of available fields for a given dataset, you may use the search dataset or lookup dataset APIs.
fr: **Pour l'API de recherche d'enregistrements**, la liste de champs disponibles dépend du schéma du jeu de données. Pour récupérer la liste de champs disponibles pour un jeu de données en particulier, vous pouvez utiliser les API de recherche ou de consultation de jeux de données.

source: For example one can search in the dataset containing the history of the SuperBowl, the ones that happened in a stadium called "Bowl".
fr: Par exemple, il est possible de chercher dans le jeu de données contenant l'historique des SuperBowl, ceux qui ont eu lieu dans un stade appelé "Bowl".

source: Multiple operator fields can be used between the field name and the query depending of the type.
fr: Plusieurs opérateurs peuvent être utilisés entre le nom du champ et la valeur, en fonction du type du champ (c.f ci-dessus).

source: Group by clause
fr: Clause group by

source: The **group by** clause can be used in the whole search API as the parameter ``group_by``. It enables you to group a set of rows together by field value, or by numeric or date range.
fr: La clause **group by** peut être utilisée dans toute l'API de recherche en tant que paramètre ``group_by``. Elle permet de grouper un ensemble d'enregistrements par valeur d'un champ, ou par plage numérique ou temporelle.

source: A **group by** clause can be:
fr: Une clause **group_by** peut être :

source: a list of comma-separated expressions. Like selects, group by expressions can have an ``AS`` statement to give them a label
fr: une liste d'expressions séparées par des virgules. Comme les select, les expressions group by peuvent contenir une déclaration ``AS`` afin de leur donner un label

source: Static range
fr: Plage statique

source: The static range function takes two parameters: a field name and an array of steps inside brackets. The side of brackets determines if values lower than the lower bound and higher than the higher bound should be grouped together or ignored.
fr: La fonction de plage statique prend deux paramètres : un nom de champ et une liste de pas entre crochets. Le sens des crochets détermine si les valeurs inférieures (resp. supérieures) à la borne inférieure (resp. supérieure) doivent être groupées ensemble ou ignorées.

source: This statement will create 4 buckets: ``*-10``, ``10-50``, ``50-100`` and ``100-*``.
fr: Cette déclaration crée 4 segments : ``*-10``, ``10-50``, ``50-100`` and ``100-*``.

source: This statement will create one bucket: ``20.5-*``.
fr: Cette déclaration crée un segment : ``20.5-*``.

source: This statement will create two buckets: ``1-2`` and ``2-3``.
fr: Cette déclaration crée deux segments : ``1-2`` et ``2-3``.

source: Equi range
fr: Plage équivalente

source: The equi range function takes four parameters: a field name, a step value, a lower bound and an higher bound.
fr: La fonction de plage équitable prend quatre paramètres : un nom de champ, une valeur de pas, une borne inférieure et une borne supérieure.

source: This statement will create the following buckets:
fr: Cette déclaration crée les segments suivants

source: Order by clause
fr: Clause order by

source: The order by (``order_by`` parameter) lets you choose how the results of your query will be sorted. It takes a list of field names, each of which have an optional ``ASC`` or ``DESC`` option to choose between ascending and descending order (default is ascending).
fr: La clause order by (paramètre ``order_by``) permet de choisir comment le résultat de votre requête sera trié. Elle comprend une liste de noms de champs, chacun ayant une option facultative ``ASC`` ou ``DESC`` pour choisir entre un ordre croissant (ASC) ou décroissant (DESC) (croissant par défaut).

source: This statement will order the results by population (ascending), and results with the same population by descending GDP.
fr: Cette déclaration ordonne les résultats par population (croissante), et les résultats à population égale par GDP décroissant.

source: Limit clause
fr: Clause limit

source: The limit clause (``limit`` parameter) is very straightforward. It is maximum number of rows you want to receive in the result of your query. The default limit is 10 records, and most of the requests except exports have a maximum limit of 10 000 records.
fr: La clause limit (paramètre ``limit``) est très simple. Elle définit le nombre maximum d'enregistrements retournées par l'API. La limite par défaut est de 10 enregistrements, et la plupart des requêtes à l'exception des exports ont une limite maximale de 10 000 d'enregistrements.

source: Query language functions
fr: Fonctions du langage de requêtes

source: Advanced functions can be used in the query language.
fr: Des fonctions avancées peuvent être utilisées dans le langage de requêtes ODSQL.

source: Function name
fr: Nom de la fonction
