Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/editing_pages/dashboard/contact_form.po
Languages: it

source: Contact form
it: Modulo di contatto

source: This widget inserts a form that users can use to contact the domain's administrators. It uses reCaptcha to make sure anonymous users cannot spam the administrators.
it: Questo widget inserisce un modulo per consentire agli utenti di contattare gli amministratori del dominio. Integra un test reCaptcha per evitare lo spam da parte di utenti anonimi.

source: Parameter
it: Parametro

source: Type
it: Tipo

source: Description
it: Descrizione

source: ``page-id`` **required**
it: ``page-id`` **obbligatorio**

source: string
it: stringa

source: The slug of the current page so that administrators know where the request came from.
it: Lo slug della pagina, che permette agli amministratori di conoscere la provenienza della richiesta.

source: boolean (default: false)
it: booleano (valore predefinito: false)

source: Specify whether to disable (that is prevent data input and submission) the contact form or not.
it: Consente di disattivare o meno il modulo di contatto per evitare l'inserimento e l'invio di dati.

source: boolean (default: autodetected)
it: booleano (valore predefinito: autodetected)

source: Specify whether the current user is logged in or not. If true, the recaptcha is not displayed.
it: Specifica se l'utente ha effettuato o meno l'accesso. In caso affermativo, il test reCaptcha non viene visualizzato.

source: string (default: `Your name`)
it: stringa (valore predefinito: `Il tuo nome`)

source: Specify the label displayed in front of the name field.
it: Definisce il testo dell'etichetta da visualizzare accanto al campo del nome.

source: string (default: `Email`)
it: stringa (valore predefinito: `E-mail`)

source: Specify the label displayed in front of the email field.
it: Definisce il testo dell'etichetta da visualizzare accanto al campo dell'e-mail.

source: string (default: `Message`)
it: stringa (valore predefinito: `Messaggio`)

source: Specify the label displayed in front of the message field.
it: Definisce il testo dell'etichetta da visualizzare accanto al campo del messaggio.
