Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/catalog.po
Languages: de, es, fr, nl

source: Looking up the catalog
de: Nachschlagen im Katalog
es: Consultar el catálogo
fr: Effectuer une recherche dans le catalogue
nl: De catalogus opzoeken

source: OpenDataSoft lets you find datasets with a rich search based experience. The catalog is often accessible via the **Explore** or **Datasets** link on the header menu. It allows to filter through all the portal's datasets by keyword, publisher, date or theme, among others.
de: OpenDataSoft ermöglicht Ihnen, Datensätze dank der aussagekräftigen Suche zu finden. Häufig ist der Katalog über die Links **Untersuchen** oder **Datensätze** im Kopfmenü zugänglich. Sie können alle Datensätze eines Portals unter anderem nach Schlüsselwörtern, Veröffentlichern, Daten oder Themen filtern.
es: OpenDataSoft permite encontrar conjuntos de datos con una completa experiencia de búsqueda. El catálogo, al cual normalmente se puede acceder a través del vínculo **Explorar** o **Conjuntos de datos** del menú de encabezado, permite filtrar todos los conjuntos de datos del portal por palabra clave, fecha o tema, entre otros.
fr: OpenDataSoft vous permet de trouver des jeux de données grâce à une expérience de recherche riche. Le catalogue est souvent accessible via le lien **Explorer** ou **Jeux de données** dans le menu de l'en-tête. Il vous est aussi possible de filtrer tous les jeux de données du portail par mot-clé, producteur, date, thème, etc.
nl: Met OpenDataSoft kan u datasets terugvinden met een rijke zoekopdracht die gebaseerd is op ervaring. Deze catalogus is vaak toegankelijk via de koppeling **Explore** of **Datasets** op het headermenu. Hij laat u toe door alle datasets van het portaal te filteren via een trefwoord, uitgever, datum of thema, om er maar enkele te noemen.

source: Navigating in the catalog
de: Navigieren im Katalog
es: Navegar por el catálogo
fr: Navigation dans le catalogue
nl: In de catalogus navigeren

source: The main part of the catalog shows a series of cards representing each dataset available on the platform. On each card, the dataset's metadata are displayed, along with quick links to visualize the data.
de: Der Hauptteil des Katalogs enthält eine Reihe von Karten, die alle auf der Plattform verfügbaren Datensätze darstellen. Auf jeder Karte werden die Metadaten des jeweiligen Datensatzes zusammen mit Direktlinks zur Visualisierung der Daten angezeigt.
es: La parte principal del catálogo muestra una serie de tarjetas que representan los conjuntos de datos disponibles en la plataforma. En cada una de las tarjetas, se muestran los metadatos del conjunto de datos así como unos vínculos rápidos para visualizar los datos.
fr: Dans la section principale du catalogue, chaque jeu de données disponible sur la plateforme est représenté par une fiche. Sur chaque fiche, les métadonnées du jeu de données sont affichées, accompagnées de liens rapides permettant de visualiser les données.
nl: Het belangrijkste deel van de catalogus toont een reeks kaarten die elke dataset vertegenwoordigen die beschikbaar is op het platform. Op elke kaart worden de metadata van de dataset weergegeven, samen met snelkoppelingen om de data te bekijken.

source: On this example, the card is split in two parts. On the left part, there is a theme pictogram, the title, a description, the language and license, keywords and the original publisher. On the right part, there are links to access the data table, a map and analysis tools, and to export or access the API of the dataset.
de: In unserem Beispiel ist die Karte zweigeteilt. Im linken Teil sind ein Themenpiktogramm, der Titel, eine Beschreibung, die Sprache sowie die Lizenz angegeben. Im rechten Teil werden Links für den Zugriff auf die Datentabelle, eine Karte und Analysetools sowie für den Export der API des Datensatzes bzw. den Zugriff darauf bereitgestellt.
es: Esta tarjeta de ejemplo está dividida en 2 partes. En la parte izquierda, hay un pictograma de tema, el título, una descripción, el idioma, la licencia, las palabras claves y el publicador original. En la parte derecha, pueden verse varios vínculos de acceso a la tabla de datos, mapa, herramientas de análisis, exportación y acceso a la API del conjunto de datos.
fr: Dans cet exemple, la fiche est divisée en deux parties. À gauche sont regroupées différentes informations sur le jeu de données : un pictogramme représentant le thème, le titre, une description, la langue et la licence, des mots-clés et le producteur initial. À droite, vous trouverez des liens pour accéder au tableau de données, à une carte et aux outils d'analyse. Certains liens vous permettent également d'exporter l'API du jeu de données ou d'y accéder.
nl: In dit voorbeeld is de kaart in twee delen opgesplitst. Links staat het pictogram van het thema, de titel, een beschrijving, de taal en licentie, trefwoorden en de oorspronkelijke uitgever. Rechts staan er koppelingen naar de datatabel, een kaart en analysetools en om de API van de dataset te exporteren of ernaar toe te gaan.

source: Like most of the catalog's elements, this card is fully customizable.
de: Wie die meisten Katalogelemente ist auch diese Karte vollständig durch den Benutzer definierbar.
es: Como la mayoría de los elementos del catálogo, esta tarjeta es totalmente personalizable.
fr: Tout comme la plupart des éléments du catalogue, cette fiche est entièrement personnalisable.
nl: Net zoals de meeste elementen van de catalogus, is deze kaart volledig aanpasbaar.

source: Filtering the catalog
de: Filtern des Katalogs
es: Filtrar el catálogo
fr: Filtrer le catalogue
nl: De catalogus filteren

source: On the left hand side of the catalog sits the filtering menu. It allows the user to sort the dataset list by date or title, and to filter it with precision.
de: Links vom Katalog befindet sich das Filtermenü, über das der Benutzer einen Datensatz nach Datum oder Titel auflisten und präzise filtern kann.
es: En la parte izquierda del catálogo se encuentra el menú de filtro. Este permite al usuario ordenar la lista de conjuntos de datos por fecha o título, y filtrar la lista con precisión.
fr: Le menu de filtrage se trouve dans la partie gauche du catalogue. Il permet à l'utilisateur de trier les jeux de données par date ou titre et de les filtrer de façon précise.
nl: Aan de linkerzijde van de catalogus staat het filtermenu. Hiermee kan de gebruiker de datasetlijst sorteren per datum of titel en deze nauwkeurig filteren.

source: Full text search
de: Volltextsuche
es: Búsqueda de texto completo
fr: Recherche en texte intégral
nl: Volledige tekstzoekopdracht

source: The text box filters the list thanks to a full text search across all the datasets. It means it will show any dataset that contains the searched text in any of its metadata.
de: Die Textbox filtert die Liste dank einer Volltextsuche über alle Datensätze hinweg. Das heißt, sie zeigt jeden Datensatz an, der den Suchtext irgendwo in seinen Metadaten enthält.
es: El cuadro de texto filtra la lista mediante una búsqueda de texto completo en todos los conjuntos de datos. Esto significa que mostrará los conjuntos de datos que contengan el texto buscado en alguno de sus metadatos.
fr: Le champ de texte filtre la liste au moyen d'une recherche en texte intégral appliquée sur tous les jeux de données. Cela signifie que tous les jeux de données contenant le texte recherché dans leurs métadonnées seront affichés.
nl: Het tekstvak filtert de lijst dankzij een volledige tekstzoekopdracht in alle datasets. Dit betekent dat alle datasets zullen worden getoond die de gezochte tekst bevatten in één van zijn metadata.

source: Type the searched text in the box and click on the magnifying glass pictogram to filter the list via a full text search.
de: Geben Sie zum Filtern der Liste per Volltextsuche den gesuchten Text in die Box ein und klicken Sie auf das Lupenpiktogramm.
es: Escriba el texto buscado en el cuadro y haga clic en el pictograma de lupa para filtrar la lista por medio de una búsqueda de texto completo.
fr: Saisissez le texte recherché dans le champ et cliquez sur le pictogramme représentant une loupe pour filtrer la liste via une recherche en texte intégral.
nl: Typ de gezochte tekst in het vak en klik op het vergrootglas om de lijst via een volledige tekstzoekopdracht te filteren.

source: Geographic search
de: Geografische Suche
es: Búsqueda geográfica
fr: Recherche géographique
nl: Geografische zoekopdracht

source: Datasets are often closely related to a geographic area, be it a country, a city, a district, etc.
de: Datensätze haben oft einen engen Bezug zu geografischen Gebieten, wie z. B. Länder, Städte, Bezirke usw.
es: Los conjuntos de datos suelen guardar una estrecha relación con una área geográfica (un país, una ciudad, un barrio, etc.).
fr: Les jeux de données sont fréquemment liés à un territoire, qu'il s'agisse d'un pays, d'une ville, d'un quartier, etc.
nl: Datasets zijn vaak nauw verbonden aan een geografisch gebied. Dit kan een land, een stad, een district, enz. zijn.

source: The map filters the list by location. It will only show datasets that contain geographic data (geopoints or geoshapes mainly) inside the selected rectangle on the map.
de: Die Karte filtert die Liste nach Orten. Im Auswahlrechteck auf der Karte werden nur Datensätze angezeigt, die geografische Daten enthalten (hauptsächlich Geopunkte oder Geoformen).
es: El mapa filtra la lista por ubicación. Solo mostrará los conjuntos de datos que contengan datos geográficos (principalmente puntos geográficos o formas geográficas) dentro del rectángulo seleccionado en el mapa.
fr: La carte filtre la liste par lieu. Seuls les jeux de données contenant des données géographiques (points géo ou formes géo principalement) dans le rectangle sélectionné sur la carte sont affichés.
nl: De kaart filtert de lijst per locatie. Enkel datasets zullen worden getoond die geografische data bevatten (vooral geopoints of geoshapes) in de geselecteerde rechthoek op de kaart.

source: The mini-map used for filtering on the catalog page.
de: Die zum Filtern auf der Katalogseite verwendete Mini-Karte.
es: El minimapa utilizado para el filtro en la página de catálogo.
fr: La mini-carte permettant le filtrage sur la page catalogue.
nl: De minikaart die gebruikt wordt om te filteren op de cataloguspagina.

source: Click on the little rectangle button on the top left of the map to select the drawing tool, and draw a rectangle on the area you want on the map to activate the filter. To cancel a selection, just click on the rectangle button again.
de: Klicken Sie oben links auf der Karte auf die kleine rechteckige Schaltfläche, um das Zeichentool auszuwählen. Ziehen Sie dann ein Rechteck über das gewünschte Gebiet auf der Karte, um den Filter zu aktivieren. Zum Aufheben einer Auswahl brauchen Sie nur erneut auf die rechteckige Schaltfläche zu klicken.
es: Haga clic en el pequeño botón de rectángulo situado en la parte superior izquierda del mapa para seleccionar la herramienta de dibujo y dibuje un rectángulo en el área del mapa donde desea activar el filtro. Para cancelar la selección, basta con volver a hacer clic en el botón de rectángulo.
fr: Cliquez sur le bouton représentant un petit rectangle en haut à gauche de la carte pour sélectionner l'outil de dessin, puis dessinez un rectangle sur la zone de la carte sur laquelle vous souhaitez activer le filtre. Pour annuler une sélection, il vous suffit de cliquer une seconde fois sur le bouton représentant un rectangle.
nl: Klik op het kleine rechthoekje links bovenaan de kaart om de tekentool te selecteren en teken een rechthoek op het gebied dat u wil op de kaart om de filter te activeren. Om een selectie te annuleren hoeft u enkel opnieuw op het kleine rechthoekje te klikken.

source: This feature can be enabled in the back office, in the ``Configuring`` section, under the ``Configure catalog & dataset pages`` link. See :doc:`Configure catalog & dataset pages </configuring_portal/tabs>` for more details.
de: Aktivieren können Sie diese Funktion im Back-Office, im Bereich ``Konfigurieren`` unter dem Link ``Katalog- und Datensatzseiten konfigurieren``. Weitere Details siehe :doc:`Katalog- und Datensatzseiten konfigurieren</configuring_portal/tabs>`.
es: Esta función se puede activar en el back office, dentro de la sección ``Configuración``, bajo el vínculo ``Configurar páginas de catálogo y conjunto de datos``. Consulte :doc:`Configurar páginas de catálogo y conjunto de datos </configuring_portal/tabs>` para obtener más detalles.
fr: Cette fonctionnalité peut être activée dans le back office en vous rendant dans la section ``Configuration`` sous le lien ``Configuration des pages de jeux de données et du catalogue``. Voir :doc:`Configuration des pages de jeux de données et du catalogue </configuring_portal/tabs>` pour plus de détails.
nl: Deze functie kan geactiveerd worden in de back-office, in de sectie "Configuratie", onder de koppeling ``Configureer catalogus & datasetpagina's``. Zie :doc:`Configure catalog & dataset pages </configuring_portal/tabs>` voor meer details.

source: Filters
de: Filter
es: Filtros
fr: Filtres

source: Under the geographic search map, there is a list of selectable filters sorted by category. They are constructed from the datasets metadata and enable the user to filter all the datasets that have the same attributes like language, theme, keywords, publisher, date, among others.
de: Unter der Karte für die geografische Suche befindet sich eine nach Kategorien sortierte Filterauswahlliste. Die Filter wurden aus den Metadaten der Datensätze konstruiert und ermöglichen dem Benutzer, alle Datensätze mit gleichen Attributen zu filtern, unter anderem Sprache, Thema, Schlüsselwörter, Veröffentlicher oder Datum.
es: Bajo el mapa de búsqueda geográfica, aparece una lista de filtros seleccionables ordenados por categoría. Estos se crean a partir de los metadatos de los conjuntos de datos y permiten al usuario filtrar todos los conjuntos de datos que tienen los mismos atributos (como idioma, tema, palabras claves, publicador o fecha, entre otros).
fr: Une liste de filtres pouvant être sélectionnés, triés par catégorie, est disponible sous la carte de recherche géographique. Ils sont établis à partir des métadonnées des jeux de données et permettent à l'utilisateur de filtrer tous les jeux de données possédant les mêmes attributs tels que la langue, le thème, les mots-clés, le producteur, la date, etc.
nl: Onder de geografische zoekkaart staat een lijst met selecteerbare filters, gesorteerd per categorie. Deze kunnen opgebouwd worden vanuit de metadata van de datasets en stellen de gebruiker in staat om alle datasets te filteren die dezelfde attributen hebben, zoals taal, thema, trefwoorden, uitgever, datum, om er maar enkele te noemen.

source: Click on the values you want to use to filter the dataset list. For some categories like keywords and themes, it is possible to select multiple values, and for some others like modification date, the selection is hierarchical. For example, selecting a year will let you to choose the month.
de: Klicken Sie auf die Werte, die Sie zum Filtern der Datensatzliste verwenden möchten. Bei einigen Kategorien, wie z. B. Schlüsselwörtern und Themen, können Sie mehrere Werte auswählen. Bei anderen, wie z. B. Änderungsdatum, ist die Auswahl wiederum hierarchisch. So können Sie beispielsweise bei der Auswahl eines Jahres auch den Monat wählen.
es: Haga clic en los valores que desea usar para filtrar la lista de conjuntos de datos. En algunas categorías (como palabras claves y temas) se pueden seleccionar varios valores; en otras (como fecha de modificación) la selección es jerárquica. Por ejemplo, después de seleccionar un año, podrá seleccionar el mes.
fr: Cliquez sur les valeurs que vous souhaitez utiliser pour filtrer la liste des jeux de données. Vous avez la possibilité de sélectionner plusieurs valeurs pour certaines catégories telles que les mots-clés et les thèmes, tandis que pour d'autres (par ex. date de modification), la sélection est de type hiérarchique. Par exemple, sélectionner une année vous permettra de choisir le mois.
nl: Klik op de waarden die u wil gebruiken om de datasetlijst te filteren. Voor sommige categorieën, zoals trefwoorden en thema's, is het mogelijk om meerdere waarden te selecteren en voor sommige andere, zoals wijzigingsdatum, is de selectie hiërarchisch. Wanneer u bijvoorbeeld een jaar selecteert, kan u ook de maand kiezen.

source: In the case of keywords, you can also click on them directly on a dataset card to filter the catalog on that keyword.
de: Im Falle der Schlüsselwörter können Sie sie auch direkt auf einer Datensatzkarte anklicken, um den Katalog nach diesen Schlüsselwörtern zu filtern.
es: En el caso de las palabras claves, también puede hacer clic en ellas directamente en una tarjeta de conjunto de datos para filtrar el catálogo a partir de esa palabra clave.
fr: En ce qui concerne les mots-clés, vous pouvez également cliquer directement sur ceux-ci depuis la fiche du jeu de données pour filtrer le catalogue en fonction de ces mots-clés.
nl: In het geval van trefwoorden, kan u ook rechtstreeks klikken op een datasetkaart om de catalogus op dat trefwoord te filteren.

source: The catalog filters of a portal can be customized, including which filters are proposed, the order of the filters, and how to order the suggested values. Please contact us for more information.
de: Die Katalogfilter eines Portals können vom Benutzer definiert werden. Dazu zählt auch, welche Filter angeboten werden, die Reihenfolge der Filter und wie die vorgeschlagenen Werte geordnet werden. Möchten Sie mehr darüber erfahren, wenden Sie sich an uns.
es: Los filtros del catálogo de un portal se pueden personalizar (por ejemplo, los filtros disponibles, el orden de los filtros y el orden de los valores sugeridos). Póngase en contacto con nosotros para obtener más información.
fr: Les filtres de catalogue d'un portail peuvent être personnalisés : vous pouvez choisir les filtres proposés, l'ordre des filtres et la façon de trier les valeurs suggérées. Veuillez nous contacter pour obtenir davantage d'informations.
nl: De catalogusfilters van een portaal kunnen worden aangepast, waaronder welke filters worden voorgesteld, de volgorde van de filters en hoe de gesuggereerde waarden in volgorde moeten worden geplaatst. Gelieve contact met ons op te nemen voor meer informatie.

source: Exploring a dataset
de: Untersuchen eines Datensatzes
es: Explorar un conjunto de datos
fr: Explorer un jeu de données
nl: Een dataset exploreren

source: Once you find your dataset, it is time to explore the data by clicking on the card title or description to switch to the `dataset page`__.
de: Haben Sie Ihren Datensatz gefunden, ist es an der Zeit, die Daten zu untersuchen, indem Sie auf den Titel oder die Beschreibung der Karte klicken, um zur `Datensatzseite`__ zu wechseln.
es: Una vez encontrado el conjunto de datos, llega el momento de explorar los datos haciendo clic en el título o la descripción de la tarjeta para cambiar a la `página de conjunto de datos`__.
fr: Une fois votre jeu de données trouvé, commencez à explorer les données en cliquant sur la description ou le titre de la fiche pour basculer sur la `page du jeu de données`__.
nl: Eenmaal u uw dataset terugvindt, is het tijd om de data te exploreren door te klikken op de kaarttitel of beschrijven om over te schakelen naar de `datasetpagina`__.
