Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/search.po
Languages: es, fr, nl

source: Searching in the data
es: Buscar en los datos
fr: Effectuer une recherche dans les données
nl: Zoeken in de data

source: Search for records
es: Búsqueda de registros
fr: Rechercher des enregistrements
nl: Zoeken naar records

source: Query
es: Consulta
fr: Requête
nl: Zoekopdracht

source: Example (based on ods-api-monitoring dataset)
es: Ejemplo (basado en el conjunto de datos ods-api-monitoring)
fr: Exemple (basé sur le jeu de données ods-api-monitoring)
nl: Voorbeeld (gebaseerd op ods-api-monitoring dataset)

source: containing a value
es: que contengan un valor
fr: contenant une valeur
nl: die een waarde bevatten

source: value
es: valor
fr: valeur
nl: waarde

source: returns every record containing the string explore
es: Devuelve todos los registros que contienen la cadena explore.
fr: renvoie tous les enregistrements contenant la chaîne de caractères "explore"
nl: levert elk record op dat de string "explore" bevat

source: containing a value in a specific field
es: que contengan un valor en un campo específico
fr: contenant une valeur dans un champ spécifique
nl: die een waarde in een specifiek veld bevatten

source: id_field:value
es: id_campo:valor

source: returns every record containing the string explore in the column named action
es: Devuelve todos los registros que contienen la cadena explore en la columna denominada action.
fr: renvoie tous les enregistrements contenant la chaîne de caractères "explore" dans la colonne nommée action
nl: levert elk record op dat de string "explore" bevat in de kolom met de naam "actie"

source: containing several values
es: que contengan varios valores
fr: contenant plusieurs valeurs
nl: die verschillende waarden bevat

source: value1 AND value2
es: valor1 AND valor2
nl: value1 EN value2

source: returns every record containing both explore and search
es: Devuelve todos los registros que contienen tanto explore como search.
fr: renvoie tous les enregistrements contenant les chaînes de caractères "explore" et "search"
nl: levert elk record op dat zowel "explore" als "zoeken" bevat

source: containing at least one of the values
es: que contengan como mínimo uno de los valores
fr: contenant au moins une des valeurs
nl: die minstens één van de waarden bevat

source: value1 OR value2
es: valor1 OR valor2
nl: value1 OF value2

source: ``action OR explore``
es: ``explore OR search``

source: returns every record containing either explore or search
es: Devuelve todos los registros que contienen o bien explore o bien search.
fr: renvoie tous les enregistrements contenant les chaînes de caractères "explore" ou "search"
nl: levert elk record op dat ofwel "explore" ofwel "zoeken" bevat

source: not containing a value
es: que no contengan un valor
fr: ne contenant pas de valeur
nl: die geen waarde bevat

source: NOT value
es: NOT valor
nl: NOT-waarde

source: returns every record which does not contain the string anonymous
es: Devuelve todos los registros que no contienen la cadena anonymous.
fr: renvoie tous les enregistrements ne contenant pas la chaîne de caractères "anonymous"
nl: levert elk record op dat de string "anoniem" niet bevat

source: containing an exact value in a field
es: que contengan un valor exacto en un campo
fr: contenant une valeur exacte dans un champ
nl: die een exacte waarde in een veld bevat

source: #exact(id_field,"value")
es: #exact(id_campo,"valor")

source: returns every record containing the exact string anonymous in the column named user_id
es: Devuelve todos los registros que contienen la cadena exacta anonymous en la columna denominada user_id.
fr: renvoie tous les enregistrements contenant la chaîne de caractères exacte "anonymous" dans la colonne nommée user_id
nl: levert elk record op dat de exacte string "anoniem" bevat in de kolom met de naam "user_id"

source: if a field is empty
es: si un campo está vacío
fr: si un champ est vide
nl: wanneer een veld leeg is

source: #null(id_field)
es: #null(id_campo)

source: returns every record which has no value in the column named referer
es: Devuelve todos los registros que no tienen ningún valor en la columna denominada referer.
fr: renvoie tous les enregistrements pour lesquels aucune valeur n'existe dans la colonne nommée referer
nl: levert elk record op dat geen waarde heeft in de kolom met de naam "referer"

source: where a date's field is anterior to a value
es: cuando un campo de fecha es anterior a un valor
fr: où la date du champ est antérieure à une valeur
nl: waarbij de datum in een veld vroeger valt dan een waarde

source: id_date_field<=YYYY/MM/DD
es: id_campo_fecha<=AAAA/MM/DD
fr: id_date_field<=AAAA/MM/JJ

source: returns every record with a timestamp prior and equal to September 2016
es: Devuelve todos los registros con una marca de tiempo anterior o igual a septiembre de 2016.
fr: renvoie tous les enregistrements avec un timestamp antérieur et égal à septembre 2016
nl: levert elk record op met een tijdstempel die vóór of gelijk valt met september 2016

source: where a date's field is the current date minus a period
es: cuando un campo de fecha es la fecha actual menos un período
fr: où la date du champ est la date actuelle moins une période
nl: wanneer de datum in een veld gelijk is aan de huidige datum min een periode

source: id_date_field>#now(days=-value)
es: id_campo_fecha>#now(days=-valor)

source: returns every record with a timestamp equal to current day minus 7 days
es: Devuelve todos los registros con una marca de tiempo igual al día actual menos 7 días.
fr: renvoie tous les enregistrements avec un timestamp égal au jour actuel moins 7 jours
nl: levert elk record op met een tijdstempel die gelijk is aan de huidige dag min 7 dagen

source: containing a geo field located in a specific area
es: que contengan un campo geográfico situado en una área específica
fr: contenant un champ géographique dans une zone spécifique
nl: die een geo-veld bevat dat gelegen is in een welbepaald gebied

source: #distance("latitude,longitude",distance)
es: #distance("latitud,longitud",distancia)

source: returns every record located at 1 km from the center of Paris
es: Devuelve todos los registros situados a 1 km del centro de París.
fr: renvoie tous les enregistrements situés à 1 km du centre de Paris
nl: levert elk record op dat gelegen is op 1 km van het centrum van Parijs

source: For more details about the requests you can make, check out the :doc:`query language reference </using_api/v1/query_language_and_geo_filtering>`.
es: Para obtener más detalles sobre las solicitudes que puede llevar a cabo, consulte la :doc:`referencia del lenguaje de consulta </using_api/v1/query_language_and_geo_filtering>`.
fr: Pour plus de détails sur les requêtes que vous pouvez faire, consultez la :doc:`référence sur le langage de requêtes </using_api/v1/query_language_and_geo_filtering>`.
nl: Voor meer details over de aanvragen die u kan doen, raadpleeg het document :doc:`query language reference </using_api/v1/query_language_and_geo_filtering>`.
