Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/05_managing_pages/managing_pages_from_list.po
Languages: de, es, fr, nl

source: Managing pages from the list of pages
de: Seitenverwaltung über die Liste der Seiten
es: Gestionar páginas desde la lista de páginas
fr: Gérer des pages depuis la liste des pages
nl: Pagina's uit de lijst met pagina's beheren

source: Accessing the list of pages
de: Auf die Liste der Seiten zugreifen
es: Acceder a la lista de páginas
fr: Accéder à la liste des pages
nl: Naar de lijst met pagina's gaan

source: From the back office, click **Pages** to access the list of pages.
de: Klicken Sie im Back-Office auf **Seiten**, um die Liste der Seiten aufzurufen.
es: En el back office, haga clic en **Páginas** para acceder a la lista de páginas.
fr: Dans l'interface d'administration, cliquez sur **Pages** pour accéder à la liste des pages.
nl: Klik vanuit de back office op **Pagina's** om naar de lijst met pagina's te gaan.

source: Overview of the list of pages
de: Übersicht über die Liste der Seiten
es: Visión general de la lista de páginas
fr: Vue d'ensemble de la liste des pages
nl: Overzicht van de lijst met pagina's

source: The list of pages shows all pages on your domain. The list is divided into two sections:
de: Die Liste der Seiten umfasst alle Seiten Ihrer Domain. Sie ist in zwei Bereiche unterteilt:
es: La lista de páginas muestra todas las páginas del dominio. La lista se divide en 2 secciones:
fr: La liste des pages affiche toutes les pages de votre domaine. La liste est divisée en deux sections :
nl: De lijst met pagina's toont alle pagina's op uw domein. De lijst is onderverdeeld in twee secties:

source: The first section lists the pages you created with the Studio.
de: Der erste Bereich listet die Seiten auf, die Sie mit dem Studio erstellt haben.
es: La primera sección enumera las páginas que usted ha creado con Studio.
fr: La première section répertorie les pages que vous avez créées avec le studio.
nl: De eerste sectie geeft de lijst met pagina's die u hebt aangemaakt met de Studio.

source: The second section lists the classic pages you created from the old interface.
de: Der zweite Bereich listet die klassischen Seiten auf, die Sie über die alte Benutzeroberfläche erstellt haben.
es: La segunda sección enumera las páginas clásicas que usted ha creado en la interfaz antigua.
fr: La seconde section répertorie les pages classiques que vous avez créées à partir l'ancienne interface.
nl: De tweede lijst geeft de lijst met klassieke pagina's die u hebt aangemaakt vanuit de oude interface.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: When using the search bar, the search by tag feature is only available for classic pages.
de: Wenn Sie die Suchleiste verwenden, ist die Suche nach Tags nur für die klassischen Seiten möglich.
es: Al usar la barra de búsqueda, la función de búsqueda por etiqueta solo está disponible para las páginas clásicas.
fr: Lorsque vous utilisez la barre de recherche, la fonctionnalité de recherche par tag est uniquement disponible pour les pages classiques.
nl: Wanneer de zoekbalk wordt gebruikt, is de zoekopdracht per tagfunctie enkel beschikbaar voor klassieke pagina's.

source: For each page, the list includes an overview of the page properties:
de: Für jede Seite enthält die Liste eine Übersicht über die Seiteneigenschaften:
es: Para cada una de las páginas, la lista incluye una visión general de las propiedades de la página:
fr: Pour chaque page, la liste inclut une vue d'ensemble des propriétés de la page :
nl: Voor elke pagina omvat de lijst een overzicht van de paginaeigenschappen:

source: Page URL
de: URL der Seite
es: Dirección URL de página
fr: URL de la page
nl: URL van de pagina

source: Page title
de: Titel der Seite
es: Título de página
fr: Titre de la page
nl: Titel van de pagina

source: Security information (public or private)
de: Sicherheitsinformationen (öffentlich oder privat)
es: Información de seguridad (pública o privada)
fr: Informations de sécurité (page publique ou privée)
nl: Veiligheidsinformatie (publiek of privaat)

source: Page status (published or not published)
de: Status der Seite (veröffentlicht oder nicht veröffentlicht)
es: Estado de la página (publicada o no publicada)
fr: État de la page (publiée ou non publiée)
nl: Status van de pagina (gepubliceerd of niet gepubliceerd)

source: Last modification information
de: Informationen zur letzten Änderung
es: Información de la última modificación
fr: Informations sur les dernières modifications
nl: Informatie over de laatste wijziging

source: Taking actions on pages
de: Aktionen für Seiten durchführen
es: Llevar a cabo acciones en las páginas
fr: Effectuer des actions sur des pages
nl: Acties uitvoeren op pagina's

source: From the list of pages, you can publish, unpublish, edit, or delete a page. The actions that you can take depend on the status of the page.
de: Über die Liste der Seiten können Sie eine Seite veröffentlichen, die Veröffentlichung aufheben, sie bearbeiten oder löschen. Die möglichen Aktionen hängen vom Status der Seite ab.
es: En la lista de páginas, puede publicar (o cancelar la publicación), editar o suprimir una página. Las acciones que puede realizar dependen del estado de la página.
fr: Dans la liste des pages, vous pouvez publier, annuler la publication, modifier ou supprimer une page. Les actions que vous effectuez dépendent de l'état de la page.
nl: Vanuit de lijst met pagina's kunt u een pagina publiceren, de publicatie ervan ongedaan maken, deze bewerken of verwijderen. De acties die u kunt ondernemen hangen af van de status van de pagina.

source: Publishing a page
de: Eine Seite veröffentlichen
es: Publicar una página
fr: Publier une page
nl: Een pagina publiceren

source: From the list of pages, you can publish a page in draft status.
de: Über die Liste der Seiten können Sie eine Seite veröffentlichen, die den Status "Entwurf" hat.
es: En la lista de páginas, puede publicar una página en estado de borrador.
fr: Depuis la liste des pages, vous pouvez publier une page à l'état Brouillon.
nl: Vanuit de lijst met pagina's kunt u een pagina publiceren in ontwerpstatus.

source: From the list of pages, hover over the desired page.
de: Bewegen Sie den Mauszeiger in der Liste der Seiten auf die gewünschte Seite.
es: En la lista de páginas, pase por encima de la página deseada.
fr: Passez le curseur sur la page souhaitée de la liste des pages.
nl: Ga vanuit de lijst met pagina's, met uw muis over de gewenste pagina.

source: Click the |eye| icon to publish the page.
de: Klicken Sie auf das Symbol |eye|, um die Seite zu veröffentlichen.
es: Haga clic en el icono |eye| para publicar la página.
fr: Cliquez sur l'icône |eye| pour publier la page.
nl: Klik op het pictogram |eye| om de pagina te publiceren.

source: Unpublishing a page
de: Eine Veröffentlichung aufheben
es: Cancelar la publicación de una página
fr: Annuler la publication d'une page
nl: De publicatie van een pagina ongedaan maken

source: From the list of pages, you can unpublish a page and hide from the public.
de: Über die Liste der Seiten können Sie eine Seiten-Veröffentlichung aufheben, sodass sie für die Öffentlichkeit nicht mehr sichtbar ist.
es: En la lista de páginas, puede cancelar la publicación de una página y ocultarla del público.
fr: Depuis la liste des pages, vous pouvez annuler la publication d'une page et la masquer au public.
nl: Vanuit de lijst met pagina's kunt u de publicatie van een pagina ongedaan maken en deze verbergen voor het publiek.

source: Click the |eye-slash| icon to unpublish the page.
es: Haga clic en el icono |eye-slash| para cancelar la publicación de la página.
fr: Cliquez sur l'icône |eye-slash| pour dépublier la page.

source: Editing a page
de: Eine Seite bearbeiten
es: Editar una página
fr: Modifier une page
nl: Een pagina bewerken

source: From the list of pages, you can open the Studio to edit a specific page.
de: Über die Liste der Seiten können Sie das Studio öffnen, um eine bestimmte Seite zu bearbeiten.
es: En la lista de páginas, puede abrir Studio para editar una página concreta.
fr: Dans la liste des pages, vous pouvez ouvrir le studio pour modifier une page spécifique.
nl: Vanuit de lijst met pagina's kunt u de Studio openen om een specifieke pagina te bewerken.

source: Click the |pencil| icon to open the Studio and edit the page.
de: Klicken Sie auf das Symbol |pencil|, um das Studio zu öffnen und die Seite zu bearbeiten.
es: Haga clic en el icono |pencil| para abrir Studio y editar la página.
fr: Cliquez sur l'icône |pencil| pour ouvrir le studio et modifier la page.
nl: Klik op het pictogram |pencil| om de Studio te openen en de pagina te bewerken.

source: Deleting a page
de: Eine Seite löschen
es: Suprimir una página
fr: Supprimer une page
nl: Een pagina verwijderen

source: From the list of pages, you can delete a page.
de: Über die Liste der Seiten können Sie eine Seite löschen.
es: En la lista de páginas, puede suprimir una página.
fr: Depuis la liste des pages, vous pouvez supprimer une page.
nl: Vanuit de lijst met pagina's kunt u een pagina verwijderen.

source: You cannot retrieve a deleted page.
de: Eine gelöschte Seite kann nicht wiederhergestellt werden.
es: No puede recuperar una página suprimida.
fr: Vous ne pouvez pas récupérer une page supprimée.
nl: U kunt een verwijderde pagina niet terughalen.

source: Click the |trash| icon to delete the page.
de: Klicken Sie auf das Symbol |trash|, um die Seite zu löschen.
es: Haga clic en el icono |trash| para suprimir la página.
fr: Cliquez sur l'icône |trash| pour supprimer la page.
nl: Klik op het pictogram |trash| om de pagina te verwijderen.

source: Confirm the action when prompted.
de: Bestätigen Sie den Vorgang, wenn Sie dazu aufgefordert werden.
es: Confirme la acción cuando se le solicite.
fr: Confirmez l'action lorsque vous y êtes invité.
nl: Bevestig de actie wanneer hierom gevraagd wordt.

source: Bulk edit pages
de: Seiten massenhaft bearbeiten
es: Realizar la edición masiva de páginas
fr: Modifier plusieurs pages à la fois
nl: Meerdere pagina's bewerken

source: Through the **Pages** section of the back office, you can edit more than one pages at a time.
de: Über den Bereich **Seiten** im Back-Office können Sie mehrere Seiten gleichzeitig bearbeiten.
es: En la sección **Páginas** del back office, puede editar varias páginas al mismo tiempo.
fr: Via la section **Pages** de l'interface d'administration, vous pouvez modifier plusieurs pages à la fois.
nl: Via de rubriek **Pagina's** van de back office kunt u meer dan één pagina tezelfdertijd bewerken.

source: Select the check box at the beginning of the **Studio pages** or **Classic pages** section of the list of pages.
de: Aktivieren Sie das Kontrollkästchen am Anfang des Bereichs **Studio-Seiten** oder **Klassische Seiten** in der Liste der Seiten.
es: Seleccione la casilla al principio de la sección **Páginas de Studio** o **Páginas clásicas** de la lista de páginas.
fr: Cochez la case au début de la section **Pages du studio** ou **Pages classiques**.
nl: Selecteer het vakje aan het begin van de rubriek **Studiopagina's** of "Klassieke pagina's** van de lijst met pagina's.

source: Click one of the following icons to bulk edit pages:
de: Klicken Sie auf eines der folgenden Symbole, um Seiten massenhaft zu bearbeiten:
es: Haga clic en uno de los iconos siguientes para efectuar la edición masiva de páginas:
fr: Cliquez sur l'une des icônes suivantes pour modifier plusieurs pages à la fois :
nl: Klik op één van de volgende pictogrammen om meerdere pagina's te bewerken:

source: |eye| lets you publish the selected pages (only available for Studio pages).
de: Mit |eye| können Sie die ausgewählten Seiten veröffentlichen (nur für Studio-Seiten möglich).
es: |eye| permite publicar las páginas seleccionadas (disponible solo para páginas de Studio).
fr: |eye| vous permet de publier les pages sélectionnées (uniquement disponible pour les pages du studio).
nl: |eye| laat u toe de geselecteerde pagina's te bewerken (enkel beschikbaar voor Studiopagina's).

source: |eye-slash| lets you unpublish the selected pages (only available for Studio pages).
de: Mit |eye-slash| können Sie die Veröffentlichung der ausgewählten Seiten aufheben (nur für Studio-Seiten möglich).
es: |eye-slash| permite cancelar la publicación de las páginas seleccionadas (disponible solo para páginas de Studio).
fr: |eye-slash| vous permet d'annuler la publication des pages sélectionnées (uniquement disponible pour les pages du studio).
nl: |eye-slash| laat u toe de publicatie van de geselecteerde pagina's ongedaan te maken (enkel beschikbaar voor Studiopagina's).

source: |trash| lets you delete the selected pages.
de: Mit |trash| können Sie die ausgewählten Seiten löschen.
es: |trash| permite suprimir las páginas seleccionadas.
fr: |trash| vous permet de supprimer les pages sélectionnées.
nl: |trash| laat u toe de geselecteerde pagina's te verwijderen.

source: If prompted, confirm the action in the dialog box that opens.
de: Wenn Sie dazu aufgefordert werden, bestätigen Sie den Vorgang in dem sich öffnenden Dialogfeld.
es: Si se le solicita, confirme la acción en el cuadro de diálogo que se abre.
fr: Si vous y êtes invité, confirmez l'action dans la boîte de dialogue qui s'ouvre.
nl: Wanneer dit gevraagd wordt, bevestig de actie in het dialoogvenster dat wordt geopend.
