Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/managing_saved_connections/managing_saved_connections.po
Languages: de, es, fr, nl

source: Managing saved connections
de: Gespeicherte Verbindungen verwalten
es: Gestionar conexiones guardadas
fr: Gérer des connexions enregistrées
nl: Opgeslagen verbindingen beheren

source: The Opendatasoft platform allows you to save FTP, HTTP, Google Drive, and SharePoint connections to easily reconnect to the service using the same connection information.
de: Mit der Opendatasoft-Plattform können Sie FTP-, HTTP-, Google Drive- und SharePoint-Verbindungen speichern, um sich mit denselben Verbindungsinformationen einfach wieder mit dem Dienst zu verbinden.
fr: La plateforme Opendatasoft vous permet d'enregistrer des connexions FTP, HTTP, Google Drive et SharePoint pour vous reconnecter facilement au service avec les mêmes informations de connexion.
nl: Het Opendatasoft-platform stelt u in staat FTP-, HTTP-, Google Drive- en SharePoint-verbindingen op te slaan om op eenvoudige manier opnieuw verbinding te maken met de service met dezelfde verbindngsinformatie.

source: Saving a connection
de: Eine Verbindung speichern
es: Guardar una conexión
fr: Enregistrer une connexion
nl: Een verbinding opslaan

source: You can save your connection information when creating a dataset or adding an FTP, HTTP, Google Drive, or SharePoint source to an existing dataset:
de: Sie können Ihre Verbindungsinformationen speichern, wenn Sie einen Datensatz erstellen oder eine FTP-, HTTP-, Google Drive- oder SharePoint-Quelle zu einem bestehenden Datensatz hinzufügen:
fr: Vous pouvez enregistrer vos informations de connexion lors de la création d'un jeu de données ou de l'ajout d'une source FTP, HTTP, Google Drive ou SharePoint à un jeu de données existant :
nl: U kunt uw verbindingsinformatie opslaan wanneer u een dataset aanmaakt of wanneer u een FTP-, HTTP-, Google Drive- of SharePoint-bron aan een bestaande dataset toevoegt:

source: Create a dataset or add a source to a dataset.
de: Erstellen Sie einen Datensatz oder fügen Sie eine Quelle zu einem Datensatz hinzu.
es: Cree un conjunto de datos o añada un origen a un conjunto de datos.
fr: Créez un jeu de données ou ajoutez une source à un jeu de données.
nl: Een dataset aanmaken of een bron aan een dataset toevoegen.

source: When configuring the connection, select the **Save connection information** check box.
de: Markieren Sie beim Konfigurieren der Verbindung das Kontrollkästchen **Verbindungsinformationen speichern**.
es: Al configurar la conexión, seleccione la casilla **Guardar información de conexión**.
fr: Lorsque vous configurez la connexion, cochez la case **Sauvegarder les informations de connexion**.
nl: Bij het configureren van de verbinding, selecteer het vak **Verbindingsinformatie opslaan**.

source: Configure the source and dataset information.
de: Konfigurieren Sie die Informationen zu Quelle und Datensatz.
es: Configure el origen y la información del conjunto de datos.
fr: Configurez les informations relatives à la source et au jeu de données.
nl: De bron- en datasetinformatie configureren.

source: You can now reuse the saved connection and connect again to the service using the same connection information.
de: Sie können nun die gespeicherte Verbindung wiederverwenden und sich mit denselben Verbindungsinformationen erneut mit dem Dienst verbinden.
es: Ahora puede reutilizar la conexión guardada y volver a conectar con el servicio utilizando la misma información de conexión.
fr: Vous pouvez maintenant réutiliser la connexion enregistrée et vous connecter à nouveau au service avec les mêmes informations de conenxion.
nl: Nu kunt u de opgeslagen verbinding hergebruiken en opnieuw verbinding maken met de service met dezelfde verbindingsinformatie.

source: Accessing saved connections
de: Zugriff auf gespeicherte Verbindungen
es: Acceder a conexiones guardadas
fr: Accéder aux connexions enregistrées
nl: Opgeslagen verbindingen raadplegen

source: Once saved, you can access your own connections from the Connections page in the back office:
de: Nach dem Speichern können Sie über die Seite Verbindungen im Back-Office auf Ihre eigenen Verbindungen zugreifen:
es: Tras la operación de guardado, puede acceder a sus propias conexiones desde la página Conexiones del back office:
fr: Une fois enregistrées, vous pouvez accéder à vos connexions depuis page Connexion de l'interface d'administration :
nl: Eenmaal opgeslagen kunt u uw eigen verbindingen raadplegen via de pagina Verbindingen in de back office:

source: From the back office, select **Catalog** > **Connections**.
de: Wählen Sie im Back-Office **Katalog** > **Verbindungen**.
es: En el back office, seleccione **Catálogo** > **Conexiones**.
fr: Dans l'Interface d'administration, sélectionnez **Catalogue** > **Connexions**.
nl: Selecteer vanuit de back office **Catalogus** > **Verbindingen**.

source: If you want to filter connections, click **Connection type** at the top of the list, then select the desired connection type.
de: Wenn Sie die Verbindungen filtern möchten, klicken Sie oben in der Liste auf **Verbindungstyp** und wählen Sie dann den gewünschten Verbindungstyp aus.
es: Si desea filtrar las conexiones, haga clic en **Tipo de conexión** en la parte superior de la lista y seleccione el tipo de conexión deseado.
fr: Si vous souhaitez filtrer les connexions, cliquez sur **Type de connexion** en haut de la liste, puis sélectionnez le type de connexion souhaité.
nl: Indien u verbindingen wilt filteren, klik op **Type verbinding** bovenaan de lijst en selecteer de gewenste verbindingstypes.

source: Editing a saved connection
de: Eine gespeicherte Verbindung bearbeiten
es: Editar una conexión guardada
fr: Modifier une connexion enregistrée
nl: Een opgeslagen verbinding bewerken

source: After saving a connection, you can update your connection information.
de: Nachdem Sie eine Verbindung gespeichert haben, können Sie Ihre Verbindungsinformationen aktualisieren.
es: Tras guardar una conexión, puede actualizar la información de la conexión.
fr: Après avoir enregistré une connexion, vous pouvez mettre à jour vos informations de connexion.
nl: Nadat u een verbinding hebt opgeslagen, kunt u uw verbindingsinformatie up-to-date brengen.

source: Click |icon-action-menu| on the desired connection.
de: Klicken Sie bei der gewünschten Verbindung auf |icon-action-menu|.
es: Haga clic en |icon-action-menu| en la conexión deseada.
fr: Cliquez sur |icon-action-menu| et la connexion souhaitée.
nl: Klik op |icon-action-menu| op de gewenste verbinding.

source: Click **Edit connection**.
de: Klicken Sie auf **Verbindung bearbeiten**.
es: Haga clic en **Editar conexión**.
fr: Cliquez sur **Modifier une connexion**.
nl: Klik op **Verbinding bewerken**.

source: From the wizard that opens, update your connection information.
de: Aktualisieren Sie Ihre Verbindungsinformationen in dem sich öffnenden Assistenten.
es: En el asistente que aparece, actualice la información de la conexión.
fr: Mettez à jour les informations de votre connexion dans l'assistant qui s'affiche.
nl: Breng vanuit de wizard die wordt geopend uw verbindingsinformatie up-to-date.

source: Deleting a saved connection
de: Eine gespeicherte Verbindung löschen
es: Suprimir una conexión guardada
fr: Supprimer une connexion enregistrée
nl: Een opgeslagen verbinding verwijderen

source: You can permanently delete saved connections that are not used in any datasets. In other words, you cannot delete connections used in datasets. If you want to delete a connection used in datasets, you'll need to first delete the related datasets.
de: Sie können gespeicherte Verbindungen, die in keinem Datensatz verwendet werden, dauerhaft löschen. Mit anderen Worten: Sie können keine Verbindungen löschen, die in Datensätzen verwendet werden. Wenn Sie eine in Datensätzen verwendete Verbindung löschen möchten, müssen Sie zunächst die zugehörigen Datensätze löschen.
es: Puede suprimir permanentemente las conexiones guardadas que no se utilicen en ningún conjunto de datos. Dicho de otro modo, no puede suprimir las conexiones utilizadas en los conjuntos de datos. Si desea suprimir una conexión utilizada en los conjuntos de datos, primero deberá suprimir los conjuntos de datos correspondientes.
fr: Vous pouvez supprimer de façon définitive les connexions enregistrées qui ne sont pas utilisées dans des jeux de données. En d'autres termes, vous ne pouvez pas supprimer des connexions utilisées dans des jeux de données. Si vous souhaitez le faire, vous devrez commencer par supprimer les jeux de données associés.
nl: U kunt opgeslagen verbindingen die niet in om het even welke datasets worden gebruikt, permanent verwijderen. met andere woorden, u kunt geen verbindingen verwijderen die worden gebruikt in datasets. Indien u een verbinding wenst te verwijderen die gebruikt wordt in datasets, moet u eerst de eraan verbonden datasets verwijderen.

source: Click **Delete connection**.
de: Klicken Sie auf **Verbindung löschen**.
es: Haga clic en **Suprimir conexión**.
fr: Cliquez sur **Supprimer une connexion**.
nl: Klik op **Verbinding verwijderen**.

source: When prompted, confirm that you want to delete this connection.
de: Wenn Sie dazu aufgefordert werden, bestätigen Sie, dass Sie diese Verbindung löschen möchten.
es: Cuando se le solicite, confirme que desea suprimir esta conexión.
fr: Lorsque vous y êtes invité, confirmez la suppression de cette connexion.
nl: Wanneer dit gevraagd wordt, bevestig dat u deze verbinding wilt verwijderen.

source: The connection is permanently deleted and removed from the Connections page.
de: Die Verbindung wird dauerhaft gelöscht und von der Seite Verbindungen entfernt.
es: La conexión se suprime permanentemente y se elimina de la página Conexiones.
fr: La connexion est supprimée de façon définitive et n'apparaît plus sur la page Connexions.
nl: De verbinding is permanent gewist en verwijderd van de pagina Verbindingen.

source: The Opendatasoft platform allows you to save FTP, HTTP, Google Drive, SharePoint, Amazon S3, and Azure Blob storage connections to easily reconnect to the service using the same connection information.
es: La plataforma Opendatasoft permite guardar conexiones FTP, HTTP, Google Drive, SharePoint, Amazon S3 y Azure Blob Storage para volver a conectar fácilmente con el servicio utilizando la misma información de conexión.

source: You can save your connection information when creating a dataset or adding an FTP, HTTP, Google Drive, SharePoint, Amazon S3, or Azure Blob storage source to an existing dataset:
es: Puede guardar la información de la conexión al crear un conjunto de datos o añadir un origen FTP, HTTP, Google Drive, SharePoint, Amazon S3 o Azure Blob Storage a un conjunto de datos existente:
