Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/wfs/get_capabilities.po
Languages: fr

source: The ``GetCapabilities`` operation allows clients to retrieve service metadata. The response is a XML document containing the information.
fr: L'opération ``GetCapabilities`` permet aux clients de récupérer les métadonnées du service CSW. La réponse est un document XML contenant les informations.

source: Parameters
fr: Paramètres

source: This is the list of the supported parameters specific to the ``GetCapabilities`` operation. You should also take into consideration the common parameters. `See more <intro.html#parameters>`_.
fr: Voici la liste des paramètres supportés, spécifiques à l'opération ``GetCapabilities``. Il faut également prendre en compte les paramètres communs à chaque opération WFS. `En savoir plus <intro.html#parameters>`_.

source: The existing parameters in the WFS standard which are not listed in this table are currently not supported.
fr: Les paramètres qui ne sont pas listés dans ce tableau mais qui existent dans le standard WFS ne sont pas supportés pour le moment.

source: Supported parameters for the GetCapabilities operation
fr: Paramètres supportés pour l'opération GetCapabilities

source: Parameter
fr: Paramètre

source: Optionality and use
fr: Fréquence d'utilisation et caractère optionnel

source: Unordered list of zero or more names of sections of service metadata document to be returned in service metadata document.
fr: Liste non ordonnée de zéro ou plusieurs noms de sections de métadonnées devant être retournées.

source: Optional. When omitted, return complete service metadata document.
fr: Optionnel. Lorsque le paramètre est omis, l'opération retourne le document de métadonnées complet.

source: Prioritized sequence of one or more specification versions accepted by client, with preferred versions listed first.
fr: Séquence d'une ou plusieurs versions acceptées par le client, ordonnée par ordre de priorité.

source: Optional. When omitted, return latest supported version.
fr: Optionnel. Lorsque le paramètre est omis, l'opération utilise la version supportée la plus récente.

source: This is the list of the existing section in the service metadata. The section name can be used as a value for the ``Sections`` parameter.
fr: Voici la liste des sections existantes pour le document de métadonnées du service. Les noms de sections peuvent être utilisées comme valeur pour le paramètre ``Sections``.

source: Section name and contents
fr: Nom de section et contenu

source: Section name
fr: Nom de section

source: Contents
fr: Contenu

source: Metadata about the the WFS implementation.
fr: Métadonnées concernant l'implémentation WFS.

source: Metadata about the organization offering the WFS service.
fr: Métadonnées à propos du l'organisation exposant le service WFS.

source: Metadata about the WFS operations offered by a the WFS implementation.
fr: Métadonnées à propos des opérations CSW supportées par l'implémentation du WFS.

source: This section defines the list of features types that are available from the service.
fr: Cette section définie la liste des types de features disponibles grâce au service.

source: Examples
fr: Exemples

source: Here is an example of a ``GetCapabilities`` operation with the optional ``Sections`` parameter, using a ``GET`` HTTP method :
fr: Voici un exemple d'opération``GetCapabilities`` utilisant le paramètre optionnel ``Sections`` et la méthode HTTP ``GET`` :

source: And the same request using a ``POST`` HTTP method :
fr: Et voici la même requête en utilisant la méthode HTTP ``POST`` :

source: The request body :
fr: Le corps de la requête :
