Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/wfs/get_feature.po
Languages: de, es, fr, it, nl

source: The ``GetFeature`` operation allows retrieval of features from the WFS, and output them using the GML 3.1.1 representation.
de: Mit dem Vorgang ``GetFeature`` können Funktionen vom WFS abgerufen und mithilfe der GML 3.1.1-Darstellung ausgegeben werden.
es: La operación ``GetFeature`` permite recuperar funciones del servicio WFS y enviarlas a la salida utilizando la representación GML 3.1.1.
fr: L'opération ``GetFeature`` permet de récupérer des features géographiques depuis le WFS, et de les afficher en utilisant la réprésentation GML 3.1.1.
it: L'operazione ``GetFeature`` permette di recuperare le entità dal servizio WFS e di ottenerne un output mediante la rappresentazione GML 3.1.1.
nl: De operatie``GetFeature`` laat toe kenmerken uit de WFS op te halen en deze te outputten door gebruik te maken van de GML 3.1.1 representatie.

source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres
it: Parametri

source: This is the list of the supported parameters specific to the ``GetFeature`` operation. You should also take into consideration the common parameters. `See more <intro.html#parameters>`_.
de: Das ist die für den Vorgang ``GetFeature`` spezifische Liste der unterstützten Parameter. Sie sollten auch die allgemeinen Parameter berücksichtigen. `Weitere Details siehe <intro.html#parameters>`_.
es: Esta es la lista de los parámetros permitidos específicos de la operación ``GetFeature``. Asimismo, debe tener en cuenta los parámetros comunes. `Consulte más información <intro.html#parameters>`_.
fr: Voici la liste des paramètres supportés, spécifiques à l'opération ``GetFeature``. Il faut également prendre en compte les paramètres communs à chaque opération WFS. `En savoir plus <intro.html#parameters>`_.
it: Di seguito è riportato l'elenco dei parametri supportati, validi per l'operazione ``GetFeature``. Ricorda inoltre di prendere in considerazione i parametri comuni. `Maggiori informazioni qui <intro.html#parameters>`_.
nl: Dit is de lijst met de ondersteunde parameters die specifiek zijn voor de operatie ``GetFeature``. U dient ook rekening te houden met de gewone parameters. `Zie meer <intro.html#parameters>`_.

source: The existing parameters in the WFS standard which are not listed in this table are currently not supported.
de: Im WFS-Standard bestehende, aber in dieser Tabelle nicht aufgelistete Parameter werden gegenwärtig nicht unterstützt.
es: Los parámetros existentes en el estándar WFS que no figuran en esta tabla actualmente no están permitidos.
fr: Les paramètres qui ne sont pas listés dans ce tableau mais qui existent dans le standard WFS ne sont pas supportés pour le moment.
it: I parametri dello standard WFS assenti nella tabella non sono attualmente supportati.
nl: De bestaande parameters in de WFS-standaard die niet opgenomen zijn in deze tabel worden momenteel niet ondersteund.

source: Supported parameters for the GetFeature operation
de: Unterstützte Parameter für den Vorgang GetFeature
es: Parámetros permitidos para la operación GetFeature
fr: Paramètres supportés pour l'opération GetFeature
it: Parametri supportati nell'operazione GetFeature
nl: Ondersteunde parameters voor de operatie GetFeature

source: Parameter
es: Parámetro
fr: Paramètre
it: Parametro

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Optionality and use
de: Optionalität und Verwendung
es: Carácter opcional y uso
fr: Fréquence d'utilisation et caractère optionnel
it: Carattere facoltativo e utilizzo
nl: Keuzevrijheid en gebruik

source: Used to indicate whether a WFS should generate a complete response document of whether it should generate an empty response document indicating only the number of features that the query would return.
de: Dient zur Festlegung, ob ein WFS ein komplettes Antwortdokument oder ein leeres Antwortdokument generieren soll, in dem nur die Anzahl der Funktionen angegeben ist, die die Anfrage zurückgeben würde.
es: Se utiliza para indicar si un servicio WFS debería generar un documento de servicio completo o debería generar un documento de respuesta vacío indicando solo el número de funciones que devolvería la consulta.
fr: Utilisé pour indiquer si le WFS doit générer une réponse complète contenant chaque feature, ou simplement indiquer le nombre de features que la requête retourne.
it: Utilizzato per indicare se un WFS deve generare un documento di risposta completo, oppure un documento di risposta vuoto che indichi solo il numero di entità restituite dalla query.
nl: Wordt gebruikt om aan te geven of een WFS een volledig responsdocument zou moeten genereren dan wel of het een leeg responsdocument zou moeten genereren, waarbij enkel het aantal kenmerken wordt aangegeven dat de zoekopdracht zou opleveren.

source: Optional. Values can be ``hits`` or ``results``. Default value is ``results``.
de: Optional. Mögliche Werte sind ``Treffer`` oder ``Ergebnisse``. Der Standardwert ist ``Ergebnisse``.
es: Opcional. Los valores pueden ser ``hits`` y ``results``. El valor predeterminado es ``results``.
fr: Optionnel. Les valeurs peuvent être ``hits`` ou ``results``. La valeur par défaut est ``results``.
it: Facoltativo. I valori possono essere ``hits`` o ``results``. Il valore predefinito è ``results``.
nl: Optioneel. Waarden kunnen "hits" of "resultaten" zijn. Standaardwaarde is "resultaten".

source: Used to define the maximum number of records that should be returned from the result set of a query.
de: Dient zur Festlegung der maximalen Anzahl von Einträgen, die vom Ergebnissatz einer Anfrage zurückgegeben werden sollte.
es: Se utiliza para definir el número máximo de registros que debería devolverse del conjunto de resultados de una consulta.
fr: Utilisé pour définir le maximum d'enregistrements qui doivent être retournées dans le jeu de résultats.
it: Utilizzato per definire il numero massimo di record che dovrebbero essere restituiti dal set di risultati di una query.
nl: Wordt gebruikt om het maximaal aantal records te definiëren waaruit de resultatenreeks van een verzoek bestaat.

source: Optional. Value must be a positive integer.
de: Optional. Wert muss eine positive Ganzzahl sein.
es: Opcional. El valor debe ser un entero positivo.
fr: Optionnel. La valeur doit être un nombre entier positif.
it: Facoltativo. Il valore deve essere un numero intero positivo.
nl: Optioneel. Waarde moet een positief geheel getal zijn.

source: A list of feature type names to query.
de: Eine Liste anzufragender Funktionstypennamen.
es: Una lista de los nombres de tipo de función para consultar.
fr: Une liste de type de features à récupérer.
it: Elenco dei nomi dei tipi di entità su cui eseguire la query.
nl: Een lijst met kenmerktypenamen om op te zoeken.

source: Mandatory.
de: Erforderlich.
es: Obligatorio.
fr: Obligatoire.
it: Obbligatorio.
nl: Verplicht.

source: A list of properties that should be returned.
de: Eine Liste von Eigenschaften, die zurückgegeben werden sollten.
es: Una lista de las propiedades que deberían devolverse.
fr: Une liste des propriétés qui devraient être retournées.
it: Elenco di proprietà che verranno restituite.
nl: Een lijst met eigenschappen die zou moeten worden bezorgd.

source: Optional. The absence of a value also indicates that all properties should be fetched.
de: Optional. Das Fehlen eines Wertes gibt auch an, dass alle Eigenschaften abgerufen werden sollten.
es: Opcional. La ausencia de un valor también indica que deben capturarse todas las propiedades.
fr: Optionnel. Lorsque ce paramètre est omis, la requête renverra toutes les propriétés.
it: Facoltativo. L'assenza di un valore indica inoltre che devono essere recuperate tutte le proprietà.
nl: Optioneel. Het feit dat een waarde niet aanwezig is, geeft ook aan dat alle eigenschappen gecontroleerd zouden moeten worden.

source: An enumerated list of feature instances to fetch identified by their feature identifiers.
de: Eine nummerierte Liste abzurufender Funktionsinstanzen, die durch ihre Funktionsbezeichner identifiziert sind.
es: Una lista enumerada de las instancias de función para capturar, identificadas por sus identificadores de función.
fr: Une liste d'identifiants de features à récupérer.
it: Elenco numerato di istanze di entità da recuperare, con i relativi identificatori.
nl: Een genummerde lijst met kenmerkinstanties die opgehaald moeten worden en geïdentificeerd worden door middel van hun kenmerkidentifiers.

source: Optional.
es: Opcional.
fr: Optionnel.
it: Facoltativo.
nl: Optioneel.

source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples
it: Esempi
nl: Voorbeelden

source: Here is an example of a ``GetFeature`` operation with the optional ``PropertyName`` parameter, using a ``GET`` HTTP method :
de: Hier ist ein Beispiel eines ``GetFeature``-Vorgangs mit optionalem ``PropertyName``-Parameter unter Verwendung einer ``GET`` HTTP-Methode:
es: A continuación se muestra un ejemplo de una operación ``GetFeature`` con el parámetro ``PropertyName`` opcional, utilizando un método HTTP ``GET``:
fr: Voici un exemple d'opération``GetFeature`` utilisant le paramètre optionnel ``PropertyName`` et la méthode HTTP ``GET`` :
it: Di seguito è riportato un esempio di operazione ``GetFeature`` con il parametro facoltativo ``PropertyName``, mediante il metodo HTTP ``GET``:
nl: Hieronder vindt u een voorbeeld van een operatie ``GetFeature`` met de optionele parameter ``PropertyName``, waarbij een ``GET`` HTTP methode wordt gebruikt:

source: And the same request using a ``POST`` HTTP method :
de: Und die gleiche Anforderung unter Verwendung einer ``POST`` HTTP-Methode:
es: Y la misma solicitud utilizando un método HTTP ``POST``:
fr: Et voici la même requête en utilisant la méthode HTTP ``POST`` :
it: E la stessa richiesta utilizzando il metodo HTTP ``POST``:
nl: En hetzelfde verzoek waarbij een ``POST`` HTTP methode wordt gebruikt:

source: The request body :
de: Der Anforderungskörper:
es: Cuerpo de la solicitud:
fr: Le corps de la requête :
it: Corpo della richiesta:
nl: De tekst van het verzoek:
