Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/airtable.po
Languages: de, es, fr, nl

source: Airtable connector
de: Airtable-Konnektor
es: Conector de Airtable
fr: Connecteur Airtable

source: The Airtable REST API connector is used for data extracted from an Airtable base, using their REST API.
de: Der Airtable REST API-Konnektor wird für Daten verwendet, die von einer Airtable-Datenbank unter Verwendung ihrer REST API extrahiert werden.
es: El conector de la API REST Airtable se utiliza para los datos extraídos de una base Airtable, utilizando su API REST.
nl: De Airtable REST API connector wordt gebruikt voor gegevens die zijn geëxtraheerd uit de Airtable-basis door gebruik te maken van hun REST API.

source: Creation
de: Erstellung
es: Creación
fr: Création
nl: Aanmaak

source: Caution
de: Vorsicht
es: Precaución
nl: Opgelet

source: It is mandatory to be the owner of the Airtable table to be able to connect it to Opendatasoft.
de: Sie müssen Eigentümer der Airtable-Tabelle sind, um diese mit Opendatasoft verbinden zu können.
es: Es obligatorio ser el propietario de la tabla Airtable para poder conectarla a Opendatasoft.
nl: Het is verplicht om de eigenaar te zijn van de Airtable-tabel om te kunnen inloggen op Opendatasoft.

source: Find your Airtable API URL from:
de: Ihre Airtable API URL finden Sie unter:
es: Encuentre su dirección URL de API Airtable en:
nl: Vind uw Airtable API URL terug uit:

source: your workspace: Help > API documentation > [your base] > Authentication
de: Ihr Arbeitsplatz: Help > API documentation > [Ihre Datenbank] > Authentication
es: su área de trabajo: Ayuda > Documentación de la API > [su base] > Autenticación
nl: uw werkruimte: Help > API documentation > [uw basis] > Authentication

source: your base: Choose your table, then go to Help > API documentation > Authentication
de: Ihre Datenbank: Wählen Sie Ihre Tabelle und wechseln Sie dann zu Help > API documentation > Authentication
es: su base: Elija su tabla y luego diríjase a Ayuda > Documentación de la API > Autenticación
nl: uw basis: Kies uw tabel en ga vervolgens naar Help > API documentation > Authentication

source: Check the ``show API key`` checkbox and copy the ``EXAMPLE USING QUERY PARAMETER`` without the curl. This is your API URL. (for example, `https://api.airtable.com/v0/base_id/table_name?api_key=api_key`)
de: Markieren Sie das Kontrollkästchen "show API key" und kopieren Sie das "EXAMPLE USING QUERY PARAMETER" ohne den Curl. Das ist Ihre API URL (z.B.: `https://api.airtable.com/v0/base_id/table_name?api_key=api_key`)
es: Seleccione la casilla ``Mostrar clave de API`` y copie el ``EJEMPLO CON EL PARÁMETRO DE CONSULTA`` sin curl. Esta es su dirección URL de API (por ejemplo, `https://api.airtable.com/v0/base_id/table_name?api_key=api_key`).
nl: Vink het vakje ``show API key`` aan en kopieer de ``EXAMPLE USING QUERY PARAMETER`` zonder de krul. Dit is uw API URL (bijvoorbeeld, `https://api.airtable.com/v0/base_id/table_name?api_key=api_key`)

source: Enter the URL to the layer in the Enter a URL area when creating a new dataset.
de: Geben Sie die URL zur Ebene in den Bereich zur Eingabe der URL ein, wenn Sie einen neuen Datensatz erstellen.
es: Introduzca la dirección URL de la capa en el área Especificar una dirección URL cuando cree un conjunto de datos nuevo.
nl: Voer de URL in voor de laag in het veld "Voer een URL in" wanneer u een nieuwe dataset aanmaakt.

source: Press Enter or click the + button.
de: Drücken Sie die Eingabetaste oder klicken Sie auf die Schaltfläche +.
es: Pulse Intro o haga clic en el botón +.
nl: Druk op Enter of klik op de knop "+".

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: In the example `https://api.airtable.com/v0/base_id/table_name?api_key=api_key`, the ``base_id`` field stands for the ID of your Airtable database. The ``table_name`` field stands for the name of the table to import from the database in Unicode.
de: In dem Beispiel `https://api.airtable.com/v0/base_id/table_name?api_key=api_key` steht das Feld ``base_id`` für die ID Ihrer Airtable-Datenbank. Das Feld ``table_name`` steht für den Namen der Tabelle, die aus der Datenbank in Unicode importiert werden soll.
es: En el ejemplo `https://api.airtable.com/v0/base_id/table_name?api_key=api_key` el campo ``base_id`` hace referencia al ID de su base de datos Airtable. El campo ``table_name`` hace referencia al nombre de la tabla para importar de la base de datos en Unicode.
nl: In het voorbeeld https://api.airtable.com/v0/base_id/table_name?api_key=api_key staat het veld ``base_id`` voor het ID van uw Airtable database. Het veld ``table_name`` staat voor de naam van de tabel die in unicode moet geïmporteerd worden uit de database.

source: Configuration
de: Konfiguration
es: Configuración
nl: Configuratie

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Default Value
de: Standardwert
es: Valor predeterminado
fr: Valeur par défaut
nl: Standaard waarde

source: Base ID
de: Datenbank-ID
es: Dirección ID base
fr: ID de la base
nl: Basis-ID

source: ID of your Airtable database
de: ID Ihrer Airtable-Datenbank
es: ID de la base de datos Airtable
fr: ID de votre base de données Airtable
nl: ID van uw Airtable database

source: By default, the textbox is extracted from the ``base_id`` field of the URL.
de: Standardmäßig wird das Textfeld aus dem Feld ``base_id`` der URL extrahiert.
es: De forma predeterminada, se extrae el cuadro de texto del campo ``base_id`` de la dirección URL.
fr: Par défaut, la zone de texte est extraite du champ "base_id" de l'URL.
nl: Standaard wordt het tekstvak geëxtraheerd uit het veld ``base_id`` van de URL.

source: Table Name
de: Name der Tabelle
es: Nombre de tabla
fr: Nom de la table
nl: Naam van de tabel

source: Name of the table to import from the database
de: Name der Tabelle, die aus der Datenbank importiert werden soll
es: Nombre de la tabla para importar de la base de datos
fr: Nom de la table à importer depuis la base de données.
nl: Naam van de tabel die geïmporteerd moet worden uit de database

source: By default, the textbox is extracted from the ``table_name`` field of the URL.
de: Standardmäßig wird das Textfeld aus dem Feld ``table_name`` der URL extrahiert.
es: De forma predeterminada, se extrae el cuadro de texto del campo ``table_name`` de la dirección URL.
fr: Par défaut, la zone de texte est extraite du champ "table_name" de l'URL.
nl: Standaard wordt het tekstvak geëxtraheerd uit het veld ``table_name`` van de URL.

source: API key
de: API-Schlüssel
es: Clave de API
fr: Clé d'API
nl: API-sleutel

source: Airtable account API key
de: API-Schlüssel des Airtable-Kontos
es: Clave de API de la cuenta de Airtable
fr: Clé d'API du compte Airtable
nl: API-sleutel van het Airtable account

source: By default, the textbox is extracted from the ``api_key`` field of the URL.
de: Standardmäßig wird das Textfeld aus dem Feld ``api_key`` der URL extrahiert.
es: De forma predeterminada, se extrae el cuadro de texto del campo ``api_key`` de la dirección URL.
fr: Par défaut, la zone de texte est extraite du champ "api_key" de l'URL.
nl: Standaard wordt het tekstvak geëxtraheerd uit het veld ``api_key`` van de URL.

source: The Airtable REST API is limited to 5 requests per second per base. Try not to schedule updates of tables from the same base all at once.
de: Die Airtable-Rest-API ist auf 5 Anfragen pro Sekunde pro Datenbank beschränkt. Vermeiden Sie es, gleichzeitige Tabellen-Updates derselben Datenbank zu planen.
es: La API REST Airtable se limita a 5 solicitudes por segundo por base. Intente no programar las actualizaciones de las tablas de la misma base de una sola vez.
nl: De Airtable Rest API is beperkt tot 5 verzoeken per seconde per basis. Probeer geen updates van alle tabellen uit dezelfde basis in één keer te plannen.

source: The Airtable REST API connector is used for data extracted from an Airtable base, using their REST API. This connector is not available by default. Please contact Opendatasoft for the activation of this connector on a given Opendatasoft domain.
fr: Le connecteur d'API REST Airtable est utilisé pour les données extraites d'une base Airtable à l'aide de l'API REST.

source: Find your Airtable API URL from :
fr: Recherchez votre URL d'API Airtable dans :

source: your workspace : Help > API documentation > [your base] > Authentification
fr: votre espace de travail : Help > API documentation > [votre base] > Authentication ;

source: your base : Choose your table then go in Help > API documentation > Authentification
fr: votre base : choisissez votre table, puis rendez-vous dans Help > API documentation > Authentication.

source: Check the ``show API key`` checkbox and copy the ``EXAMPLE USING QUERY PARAMETER`` without the curl, this is your API URL. (e.g. https://api.airtable.com/v0/base_id/table_name?api_key=api_key)
fr: Cochez la case "show API key" et copiez ce qui s'affiche sous "EXAMPLE USING QUERY PARAMETER" sans la commande curl : il s'agit de votre URL d'API. (Par ex. https://api.airtable.com/v0/base_id/table_name?api_key=api_key).

source: Enter the URL to the layer in the Enter a URL area, when creating a new dataset.
fr: Lors de la création d'un jeu de données, entrez l'URL vers la couche dans le champ Saisir une URL.

source: Press Enter, or click the + button.
fr: Appuyez sur Entrée ou cliquez sur le bouton +.

source: In the example `https://api.airtable.com/v0/base_id/table_name?api_key=api_key` the ``base_id`` field stands for the ID of your Airtable database. The ``table_name`` field stands for the name of the table to import from the database in unicode.
fr: Dans l'exemple "https://api.airtable.com/v0/base_id/table_name?api_key=api_key", le champ "base_id" correspond à l'ID de votre base de données Airtable. Le champ "table_name" correspond au nom de la table à importer depuis la base de données en Unicode.

source: The Airtable Rest API is limited to 5 requests per second per base. Try not to schedule updates of tables from the same base all at once.
fr: L'API REST Airtable est limitée à 5 requêtes par seconde et par base. Veillez à ne pas planifier de mises à jour de tables issues d'une base identique au même moment.
