Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/census.po
Languages: de, es, fr, nl

source: US Census connector
de: US Census-Konnektor
es: Conector de Censo de los Estados Unidos
fr: Connecteur US Census

source: The US Census connector is used for data extracted from the US Census Bureau's REST API.
de: Der US Census-Konnektor wird für Daten verwendet, die aus der API des US Census Bureau extrahiert werden.
es: El conector del Censo de los Estados Unidos se utiliza para los datos extraídos de la API REST de la Oficina del Censo de los Estados Unidos.
fr: Le connecteur US Census est utilisé pour les données extraites de l'API REST de l'US Census Bureau.
nl: De US Census connector wordt gebruikt voor gegevens die geëxtraheerd worden uit de REST API van het US Census Bureau.

source: Creation
de: Erstellung
es: Creación
fr: Création
nl: Aanmaak

source: Find the API Base URL of the census dataset (https://api.census.gov/data.html). If you want to, you can use an API URL with a valid query (see https://www.census.gov/data/developers/guidance/api-user-guide.Overview.html for documentation)
de: Suchen Sie die API-Basis-URL des Census-Datensatzes (https://api.census.gov/data.html). Wenn Sie möchten, können Sie eine API-URL mit einer gültigen Anfrage verwenden (siehe https://www.census.gov/data/developers/guidance/api-user-guide.Overview.html für weitere Informationen)
es: Encuentre la dirección URL base de la API del conjunto de datos del Censo (https://api.census.gov/data.html). Si lo desea, puede utilizar una dirección URL de API con una consulta válida (consulte la documentación en https://www.census.gov/data/developers/guidance/api-user-guide.Overview.html).
fr: Recherchez l'URL de base d'API qui correspond au jeu de données du Census (https://api.census.gov/data.html). Si vous le souhaitez, vous pouvez utiliser une URL d'API avec une requête valide (voir https://www.census.gov/data/developers/guidance/api-user-guide.Overview.html pour obtenir de la documentation).
nl: Vind de API Base URL van de census dataset (https://api.census.gov/data.html). Indien u wilt, kunt u een API URL gebruiken met een geldige zoekopdracht (zie https://www.census.gov/data/developers/guidance/api-user-guide.Overview.html voor documentatie)

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Example 1:
de: 1. Beispiel:
es: Ejemplo 1:
nl: Voorbeeld 1:

source: For the dataset *Vintage 2014 Population Estimates: US, State, and PR Total Population and Components of Change*, the API Base URL is ``https://api.census.gov/data/2014/pep/natstprc`` .
de: Für den Datensatz *Vintage 2014 Population Estimates: US, State, and PR Total Population and Components of Change* lautet die API-Basis-URL``https://api.census.gov/data/2014/pep/natstprc`` .
es: Para el conjunto de datos *Vintage 2014 Population Estimates: US, State, and PR Total Population and Components of Change*, la dirección URL base de la API es ``https://api.census.gov/data/2014/pep/natstprc`` .
fr: L'URL de base d'API du jeu de données *Vintage 2014 Population Estimates: US, State, and PR Total Population and Components of Change* est "https://api.census.gov/data/2014/pep/natstprc".
nl: Voor de dataset *Vintage 2014 Population Estimates: US, State, and PR Total Population and Components of Change* is de API Base URL ``https://api.census.gov/data/2014/pep/natstprc`` .

source: Example 2:
de: 2. Beispiel:
es: Ejemplo 2:
nl: Voorbeeld 2:

source: For the dataset *International Trade: Monthly U.S. Exports by End-Use Code*, an API URL is ``https://api.census.gov/data/timeseries/intltrade/exports/enduse?get=ALL_VAL_YR&time=2013-01&E_ENDUSE=00100`` .
de: Für den Datensatz *International Trade: Monthly U.S. Exports by End-Use Code* lautet eine API-URL ``https://api.census.gov/data/timeseries/intltrade/exports/enduse?get=ALL_VAL_YR&time=2013-01&E_ENDUSE=00100`` .
es: Para el conjunto de datos *International Trade: Monthly U.S. Exports by End-Use Code*, una dirección URL de la API es ``https://api.census.gov/data/timeseries/intltrade/exports/enduse?get=ALL_VAL_YR&time=2013-01&E_ENDUSE=00100`` .
fr: Une URL d'API pour le jeu de données *International Trade: Monthly U.S. Exports by End-Use Code* est "https://api.census.gov/data/timeseries/intltrade/exports/enduse?get=ALL_VAL_YR&time=2013-01&E_ENDUSE=00100".
nl: Voor de dataset *International Trade: Monthly U.S. Exports by End-Use Code* is een API URL ``https://api.census.gov/data/timeseries/intltrade/exports/enduse?get=ALL_VAL_YR&time=2013-01&E_ENDUSE=00100`` .

source: Enter the URL in the Enter a URL area when creating a new dataset.
de: Geben Sie die URL in den Bereich zur Eingabe der URL ein, wenn Sie einen neuen Datensatz erstellen.
es: Introduzca la dirección URL en el área Especificar una dirección URL cuando cree un conjunto de datos nuevo.
nl: Voer de URL in de ruimte "Voer een URL in" wanneer een nieuwe dataset wordt aangemaakt.

source: Press Enter or click the + button.
de: Drücken Sie die Eingabetaste oder klicken Sie auf die Schaltfläche +.
es: Pulse Intro o haga clic en el botón +.
nl: Druk op Enter of klik op de knop "+".

source: Configuration
de: Konfiguration
es: Configuración
nl: Configuratie

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Example 1
de: 1. Beispiel
es: Ejemplo 1
fr: Exemple 1
nl: Voorbeeld 1

source: Example 2
de: 2. Beispiel
es: Ejemplo 2
fr: Exemple 2
nl: Voorbeeld 2

source: Dataset path
de: Datensatz-Pfad
es: Ruta del conjunto de datos
fr: Chemin d'accès au jeu de données
nl: Datasetpad

source: The path is extracted from the URL area
de: Der Pfad wird aus dem URL-Bereich extrahiert
es: Se extrae la ruta del área de la dirección URL
fr: Le chemin d'accès est extrait du champ d'URL.
nl: Het pad wordt geëxtraheerd uit het URL-veld

source: Variables
de: Variablen
nl: Variabelen

source: The list of variables to extract. If the URL contains a query, the variables are extracted from it. If the area is left empty, the number of variables in the dataset is less than 50, and the required predicates filled, the connector will extract the whole dataset. Else, the area should at least be filled with required fields (see the dataset documentation).
de: Die Liste der zu extrahierenden Variablen. Wenn die URL eine Anfrage enthält, werden die Variablen daraus extrahiert. Wenn der Bereich leer gelassen wird, die Anzahl der Variablen im Datensatz weniger als 50 beträgt und die erforderlichen Prädikate ausgefüllt sind, extrahiert der Konnektor den gesamten Datensatz. Ansonsten sollte der Bereich zumindest mit Pflichtfeldern ausgefüllt sein (siehe Dokumentation des Datensatzes).
es: La lista de variables para extraer. Si la dirección URL contiene una consulta, las variables se extraen de ella. Si se deja vacía el área, el número de variables en el conjunto de datos es inferior a 50 y se rellenan los predicados requeridos, el conector extraerá todo el conjunto de datos. De lo contrario, el área deberá rellenarse por lo menos con los campos requeridos (consulte la documentación del conjunto de datos).
nl: De lijst met variabelen om te extraheren. Wanneer de URL een zoekopdracht bevat worden de variabelen eruit geëxtraheerd. Wanneer het veld leeg wordt gelaten, is het aantal variabelen in de dataset minder dan 50 en zijn de vereiste predicaten gevuld, dan zal de connector de volledige dataset extraheren. Zo niet zou het veld minstens gevuld moeten zijn met vereiste velden (zie de datasetdocumentatie).

source: Can be left empty
de: Kann leer gelassen werden
es: Se puede dejar vacío
fr: Peut rester vide.
nl: Kan leeg worden gelaten

source: Can be: ``ALL_VAL_YR`` is extracted from the URL
de: Kann sein: ``ALL_VAL_YR`` wird aus der URL extrahiert
es: Puede ser: ``ALL_VAL_YR`` si se extrae de la dirección URL
nl: Kan zijn: ``ALL_VAL_YR`` wordt geëxtraheerd uit de URL

source: Predicates
de: Prädikate
es: Predicados
fr: Attributs
nl: Predicaten

source: The list of predicates to filter the dataset. If the URL contains a query the predicates are extracted from it. If the area is left empty, the number of variables in the dataset is less than 50, and the required predicates filled, the connector will extract the whole dataset. The area should at least be filled with required predicates (see the dataset documentation).
de: Die Liste der Prädikate zum Filtern des Datensatzes. Wenn die URL eine Anfrage enthält, werden die Prädikate daraus extrahiert. Wenn der Bereich leer gelassen wird, die Anzahl der Variablen im Datensatz weniger als 50 beträgt und die erforderlichen Prädikate gefüllt sind, extrahiert der Konnektor den gesamten Datensatz. Der Bereich sollte zumindest mit den erforderlichen Prädikaten ausgefüllt sein (siehe Dokumentation des Datensatzes).
es: La lista de predicados para filtrar el conjunto de datos. Si la dirección URL contiene una consulta, los predicados se extraen de ella. Si se deja vacía el área y el número de variables en el conjunto de datos es inferior a 50, el conector extraerá todo el conjunto de datos. El área deberá rellenarse por lo menos con los predicados requeridos (consulte la documentación del conjunto de datos).
nl: De lijst met predicaten om de dataset te filteren. Wanneer de URL een zoekopdracht bevat, worden de predicaten eruit geëxtraheerd. Wanneer het veld leeg wordt gelaten en het aantal variabelen minder bedraagt dan 50, zal de connector de volledige dataset extraheren. Het veld zou minstens gevuld moeten zijn met vereiste predicaten (zie de datasetdocumentatie).

source: ``for=state:*`` (a ``for`` predicates is required)
de: ``for=state:*`` (ein ``for``-Prädikat ist erforderlich)
es: ``for=state:*`` (se requiere un predicado ``for``)
fr: ``for=state:*`` (un attribut ``for`` est obligatoire).
nl: ``for=state:*`` (een ``for`` predicaten is vereist)

source: ``time=2013-01`` and ``E_ENDUSE=00100`` are extracted from the URL
de: ``time=2013-01`` und ``E_ENDUSE=00100`` werden aus der URL extrahiert
es: ``time=2013-01`` y ``E_ENDUSE=00100`` se extraen de la dirección URL
fr: "time=2013-01" et "E_ENDUSE=00100" sont extraits de l'URL.
nl: ``time=2013-01`` en ``E_ENDUSE=00100`` worden geëxtraheerd uit de URL

source: API Key
de: API-Schlüssel
es: Clave de API
fr: Clé API
nl: API-sleutel

source: Use an API key to override the Census API limit (500 queries per day). If the URL contains an API key, the key is extracted from it.
de: Verwenden Sie einen API-Schlüssel, um das API-Limit von Census (500 Anfragen pro Tag) zu überschreiten. Wenn die URL einen API-Schlüssel enthält, wird der Schlüssel daraus extrahiert.
es: Utilice una clave de API para superar el límite de la API del Censo (500 consultas por día). Si la dirección URL contiene una clave de API, la clave se extrae de ella.
nl: Gebruik een API-sleutel om de Census API-limiet te overschrijden (500 zoekopdrachten per dag). Wanneer de URL een API-sleutel bevat, wordt de sleutel eruit geëxtraheerd.

source: No API key is filled
de: Kein API-Schlüssel ausgefüllt
es: Ninguna clave de API rellenada
fr: Aucune clé d'API n'est renseignée.
nl: Er is geen API-sleutel gevuld

source: If too many fields are called during the extraction, it can result in a connection Timeout to the US Census servers. Reducing the number of variables or the use of the ``group()`` function should prevent this issue.
de: Wenn während der Extraktion zu viele Felder aufgerufen werden, kann dies zu einer Verbindungsunterbrechung zu den US Census-Servern führen. Durch die Reduzierung der Anzahl der Variablen oder die Verwendung der Funktion ``group()`` kann dieses Problem vermieden werden.
es: Si se llaman a demasiados campos durante la extracción, puede resultar en un tiempo de espera de conexión en los servidores del Censo de Estados Unidos. Reducir el número de variables o usar la función de ``group()`` debería evitar este problema.
fr: Si de trop nombreux champs sont appelés pendant l'extraction, la connexion des serveurs US Census peut expirer. Vous pouvez prévenir ce problème en réduisant le nombre de variables ou en utilisant la fonction "group()".
nl: Wanneer een te groot aantal velden worden gecalld tijdens de extractie, kan dit resulteren in een time-out van de verbinding naar de US Census servers. Het verminderen van het aantal variabelen of het gebruik van de functie ``group()`` zou dit probleem moeten voorkomen.

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Example 1 :
fr: Exemple 1 :

source: Example 2 :
fr: Exemple 2 :

source: Enter the URL in the Enter a URL area, when creating a new dataset.
fr: Lors de la création d'un jeu de données, entrez l'URL dans le champ Saisir une URL.

source: Press Enter, or click the + button.
fr: Appuyez sur Entrée ou cliquez sur le bouton +.

source: The list of variables to extract. If the URL contains a query the variables are extracted from it. If the area is left empty, the number of variables in the dataset is less than 50 and the required predicates filled, the connector will extract all the dataset. Else, the area should at least be filled with required fields (see the dataset documentation).
fr: La liste des variables à extraire. Si l'URL contient une requête, les variables sont extraites de celle-ci. Si le champ est vide, si le nombre de variables dans le jeu de données est inférieur à 50 et si les attributs obligatoires sont renseignés, le connecteur extrait l'intégralité du jeu de données. Autrement, le champ doit être renseigné avec au moins les champs obligatoires (voir la documentation du jeu de données).

source: Can be : ``ALL_VAL_YR`` is extracted from the URL
fr: Peut être : ``ALL_VAL_YR`` est extrait de l'URL.

source: The list of predicates to filter the dataset. If the URL contains a query the predicates are extracted from it. If the area is left empty and the number of variables in the dataset is less than 50, the connector will extract all the dataset. The area should at least be filled with required predicates (see the dataset documentation).
fr: La liste des attributs pour filtrer le jeu de données. Si l'URL contient une requête, les attributs sont extraits de celle-ci. Si le champ est vide et si le nombre de variables dans le jeu de données est inférieur à 50, le connecteur extrait l'intégralité du jeu de données. Le champ doit être renseigné avec au moins les attributs obligatoires (voir la documentation du jeu de données).

source: Use an API key to overide the Census API limit (500 queries per day). If the URL contains an API key, the key is extracted from it.
fr: Utilisez une clé d'API pour remplacer la limite d'API Census (500 requêtes par jour). Si l'URL contient une clé d'API, la clé est extraite de celle-ci.
