Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/dataset_of_datasets.po
Languages: nl

source: Dataset of datasets (domain) connector
nl: Dataset van datasets (domein) connector

source: Warning
nl: Waarschuwing

source: This connector should be use with much caution because it can give visibility to private data.
nl: Deze connector moet met de nodige omzichtigheid worden gebruikt omdat hij toegang kan geven tot privégegevens.

source: The Dataset of datasets connector allows to create an index of the datasets of an OpenDataSoft domain, optionally with all their related metadata and analytics, in the form of a dataset.
nl: De Dataset van datasets connector laat u toe een index van datasets aan te maken van een OpenDataSoft-domein, optioneel met alle eraan verbonden metadata en analytische gegevens, onder de vorm van een dataset.

source: Creation
nl: Aanmaak

source: Note
nl: Opmerking

source: The Edit dataset permission is required to use this connector.
nl: De toelating Bewerken dataset is vereist om deze connector te kunnen gebruiken.

source: Enter ``domaindatasets://`` in the Enter a URL area, when creating a new dataset.
nl: Voer ``domaindatasets://`` in het een URL-veld wanneer een nieuwe dataset wordt aangemaakt.

source: Press Enter, or click the + button.
nl: Druk op Enter of klik op de knop "+".

source: Configuration
nl: Configuratie

source: Name
nl: Naam

source: Description
nl: Omschrijving

source: Interoperability Metadata
nl: Interoperabiliteit metadata

source: If checked, interoperability metadata are retrieved and added to the dataset.
nl: Wanneer het is aangevinkt wordt de interoperabiliteit metadata opgehaald en toegevoegd aan de dataset;

source: Custom Metadata
nl: Gepersonaliseerde metadata

source: If checked, custom metadata are retrieved and added to the dataset.
nl: Wanneer het is aangevinkt, wordt gepersonaliseerde metadata opgehaald en aan de dataset toegevoegd.

source: Statistics
nl: Statistieken

source: If checked, statistics of the dataset are retrieved and added to the dataset:
nl: Wanneer het is aangevinkt, worden statistieken van de dataset opgehaald en aan de dataset toegevoegd:

source: number of datasets,
nl: aantal datasets,

source: size of the records in the dataset (in bytes),
nl: grootte van de records in de dataset (in bytes),

source: number of reuses,
nl: aantal hergebruiken,

source: number of API calls,
nl: aantal API-oproepen,

source: number of downloads,
nl: aantal downloads,

source: number of downloads of the datasets attachments,
nl: aantal downloads van de bijvoegsels bij datasets,

source: number of downloads of the file fields,
nl: aantal downloads van de bestandvelden,

source: popularity score.
nl: populariteitsscore,

source: If checked, private datasets are added to the dataset. Also adds a "Visibility" field which indicates whether the datasets are public ("domain") or private ("restricted").
nl: Wanneer dit is aangevinkt, worden private datasets aan de dataset toegevoegd. Ook wordt een veld "Visibiliteit" toegevoegd wat aangeeft of de datasets publiek ("domein") of privé ("beperkt") zijn.

source: If checked, staged datasets (meaning datasets that are created but not published) are added to the dataset. Also adds a "Published" field which indicates whether the datasets are published ("true") or not ("false").
nl: Wanneer dit is aangevinkt, worden staged datasets (die zijn datasets die aangemaakt maar niet gepubliceerd zijn) aan de dataset toegevoegd. Ook wordt een veld "Gepubliceerd" toegevoegd wat aangeeft of de datasets gepubliceerd ("waar") of niet ("onwaar") zijn.

source: If checked, admin metadata are retrieved and added to the dataset.
nl: Wanneer dit is aangevinkt, worden admin metadata opgehaald en aan de dataset toegevoegd.
