Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/json.po
Languages: de, es, fr, nl

source: It expects a JSON object where each key contains a record, and create records with one column to hold the key, and one column for each attribute of the corresponding object (or a single column named "value" if the value is a string instead of an object).
de: Es wird ein JSON-Objekt erwartet, in dem jeder Schlüssel einen Eintrag enthält, und es werden Einträge erstellt, mit einer Spalte, die den Schlüssel enthält, und einer Spalte für jedes Attribut des entsprechenden Objekts (oder einer einzelnen Spalte mit dem Namen "Wert", wenn der Wert eine Zeichenfolge ist).
es: Espera un objeto JSON donde cada clave contiene un registro, y crea registros con una columna para contener la clave, y una columna para cada atributo del objeto correspondiente (o una sola columna denominada "value" si el valor es una cadena en lugar de un objeto).
fr: Ce connecteur attend un objet JSON dans lequel chaque clé contient un enregistrement. Il crée des enregistrements comportant une colonne pour la clé, et une colonne pour chaque attribut de l'objet correspondant (ou une seule colonne nommée "value" si la valeur est une chaîne de caractères et non un objet).
nl: Het verwacht een JSON-voorwerp waar elke sleutel een record omvat en records met één kolom aanmaken om de sleutel te houden en één kolom voor elk attribuut van het overeenkomstige voorwerp (of één enkele kolom met de naam "waarde" wanneer de waarde een karakterreeks is in plaats van een voorwerp).

source: Path to the JSON object that contains the records.
de: Pfad zum JSON-Objekt, das die Einträge enthält.
es: Ruta del objeto JSON que contiene los registros.
fr: Chemin d'accès à l'objet JSON qui contient les enregistrements.
nl: Pad naar het JSON-voorwerp dat de records bevat.

source: If the JSON object is directly at the root, leave the textbox empty. Otherwise, write the ijson path to the object in the textbox.
de: Wenn sich das JSON-Objekt direkt am Stamm befindet, lassen Sie das Textfeld leer. Geben Sie sondt den ijson-Pfad zum Objekt in das Textfeld ein.
es: Si el objeto JSON está directamente en la raíz, deje el cuadro de texto vacío. De lo contrario, escriba la ruta iJSON del objeto en el cuadro de texto.
fr: Si l'objet JSON se trouve à la racine, laissez la zone de texte vide. Dans le cas contraire, indiquez le chemin d'accès ijson à l'objet dans la zone de texte.
nl: Wanneer het JSON-voorwerp rechtstreeks aan de root ligt, laat het tekstvak dan leeg. Zo niet, noteer het ijson-pad naar het voorwerp in het tekstvak.

source: Key field name
de: Schlüssel-Feldname
es: Nombre de campo clave
fr: Nom du champ de la clé
nl: Naam sleutelveld

source: Label of the "key" column.
de: Beschriftung der Spalte "Schlüssel"
es: Etiqueta de la columna "key".
fr: Label de la colonne "key".
nl: Label van de kolom "sleutel".

source: By default, "key". Write the new label of the "key" column in the textbox. It will modify both the label and the technical identifier of the column.
de: Standardmäßig "Schlüssel". Schreiben Sie die neue Bezeichnung der Spalte "Schlüssel" in das Textfeld. Es wird sowohl die Bezeichnung als auch die technische Kennung der Spalte geändert.
es: De forma predeterminada, "key". Escriba la nueva etiqueta de la columna "key" en el cuadro de texto. Así se modificará tanto la etiqueta como el identificador técnico de la columna.
fr: Par défaut, "key". Indiquez le nouveau label de la colonne "key" dans la zone de texte. Le label et l’identifiant technique de la colonne sont modifiés.
nl: Standaard "sleutel". Noteer het nieuwe label van de kolom "sleutel" in het tekstvak. Hierdoor zal zowel het label als de technische identifier van de kolom worden gewijzigd.

source: **Example 1:**
de: **1. Beispiel:**
es: **Ejemplo 1:**
fr: **Exemple 1 :**
nl: **Voorbeeld 1:**

source: If the JSON root is left empty, the resulting dataset will be:
de: Wenn der JSON-Stamm leer gelassen wird, dann resultiert folgender Datensatz daraus:
es: Si la raíz JSON se ha dejado vacía, el conjunto de datos resultante será:
fr: Si le dossier racine JSON est laissé vide, le jeu de données résultant sera :
nl: Wanneer de JSON-root leeg is gelaten, zal de resulterende dataset de volgende zijn:

source: key
de: Schlüssel
es: llave
nl: sleutel

source: type1
de: Typ1

source: type2
de: Typ2

source: **Example 2:**
de: **2. Besipiel:**
es: **Ejemplo 2:**
fr: **Exemple 2 :**
nl: **Voorbeeld 2:**

source: For this complex JSON file, the correct JSON root is ``results.datasets.item``.
de: Für diese komplexe JSON-Datei lautet der korrekte JSON-Stamm ``results.datasets.item``.
es: Para este archivo JSON complejo, la raíz JSON correcta es ``results.datasets.item``.
fr: Pour ce fichier JSON complexe, la racine JSON est ``results.datasets.item``.
nl: Voor dit complexe JSON-bestand, is de correcte JSON root "results.datasets.item".

source: ``results.datasets`` leads to the array
de: ``results.datasets`` führt zum Array
es: ``results.datasets`` lleva a la matriz
fr: ``results.datasets`` mène au tableau
nl: ``results.datasets`` leidt naar de reeks

source: ``item`` iterates inside the array and get each object
de: ``item`` iteriert innerhalb des Arrays und ruft jedes Objekt ab
es: ``item`` itera dentro de la matriz y obtiene cada uno de los objetos
fr: ``item`` effectue une itération dans le tableau et récupère chaque objet
nl: "item" herhaalt binnen de reeks en krijgt elk voorwerp

source: description
de: Beschreibung
es: Descripción
nl: omschrijving

source: title
de: Titel
es: Título
nl: titel

source: A description about ABC
de: Eine Beschreibung von ABC
es: Una descripción acerca de ABC
nl: Een omschrijving over ABC

source: Another description
de: Eine andere Beschreibung
es: Otra descripción
nl: Een andere omschrijving

source: Array:
es: Matriz:
fr: Tableau :

source: Name
es: Nombre
fr: Nom
nl: Naam

source: JSON Dict
es: Dic JSON

source: name
nl: naam
