Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/json.po
Languages: de, es, fr, nl

source: JSON connectors
de: JSON-Konnektoren
es: Conectores de JSON
fr: Connecteurs JSON

source: JSON is an open-standard format that uses human-readable text to transmit data objects consisting of key–value pairs. It is the most common data format to build web APIs.
de: JSON ist ein offenes Standardformat, das zur Übermittlung von Datenobjekten, die aus Schlüssel-Wert-Paaren bestehen, visuell lesbaren Text verwendet. Dies ist das gängigste Format zur Erstellung von APIs.
es: JSON es un formato de estándar abierto que utiliza texto en lenguaje natural para transmitir objetos de datos formados por pares clave-valor. Es el formato de datos más habitual para la compilación de interfaces API de sitios web.
fr: JSON est un format standard ouvert qui utilise un texte lisible par l'homme pour transmettre des objets de données constitués de paires clé-valeur. Il s'agit du format de données le plus couramment utilisé pour créer des API Web.
nl: JSON is een open-standaard formaat dat tekst gebruikt die door mensen kan worden gelezen om datavoorwerpen door te sturen die uit sleutel-waarde paren bestaan. Het is het meest gebruikte dataformaat om web-API's te bouwen.

source: As JSON documents can have a lot of different forms, there are 3 JSON connectors to extract data from a JSON file:
de: Da JSON-Dokumente viele verschiedene Formen haben können, gibt es 3 JSON-Konnektoren, um Daten aus einer JSON-Datei zu extrahieren:
es: Como los documentos JSON pueden tener muchos formatos diferentes, hay 3 conectores de JSON para extraer los datos de un archivo JSON:
fr: Les documents JSON pouvant revêtir différentes formes, il existe 3 connecteurs JSON permettant d'extraire des données à partir d'un fichier JSON :
nl: Aangezien JSON-documenten heel veel verschillende vormen kunnen hebben, zijn er 3 JSON-connectoren om gegevens uit een JSON-bestand te halen:

source: the JSON File connector,
de: JSON Datei-Konnektor,
es: Conector de archivo JSON
fr: le connecteur Fichier JSON,
nl: De JSON File-connector,

source: the JSON Line connector,
de: JSON Zeilen-Konnektor,
es: Conector de línea JSON
fr: le connecteur Ligne JSON,
nl: de JSON Line connector,

source: the JSON Dict connector.
de: JSON Dict-Konnektor.
es: Conector de Dic JSON
fr: le connecteur JSON Dict.
nl: de JSON Dict connector.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: If the connector does not manage to fully extract a document with a complex structure, use one of the JSON processors to complete the extraction.
de: Sollte ein Konnektor die Extraktion eines Dokumentes mit komplexer Struktur nicht vollständig bewältigen, können Sie einen der JSON-Prozessoren verwenden, um die Extraktion abzuschließen.
es: Si el conector no consigue extraer por completo un documento con una estructura compleja, emplee uno de los procesadores JSON para efectuar la extracción.
fr: Si le connecteur ne parvient pas à extraire intégralement un document présentant une structure complexe, utilisez l'un des processeurs JSON pour terminer l'extraction.
nl: Wanneer de connector er niet in slaagt een document met een complexe structuur volledig te extraheren, gebruik dan een van de JSON-processoren om de extractie te voltooien;

source: JSON File
de: JSON-Datei
es: Archivo JSON
fr: Fichier JSON
nl: JSON-bestand

source: This connector extracts a valid JSON document (array or object) into one dataset of several records.
de: Dieser Konnektor extrahiert ein gültiges JSON-Dokument (Array oder Objekt) in einen Datensatz mehrerer Einträge.
es: Este conector extrae un documento JSON válido (matriz u objeto) en un conjunto de datos de varios registros.
fr: Ce connecteur extrait un document JSON valide (tableau ou objet) dans un jeu de données constitué de plusieurs enregistrements.
nl: Deze connector extraheert een geldig JSON-document (reeks of voorwerp) in één dataset met verschillende records.

source: If the document is a JSON array, a record will be created for each object inside the array (the keys will be used as column names).
de: Ist das Dokument ein JSON-Array, wird für jedes Objekt innerhalb des Arrays ein Eintrag erstellt (die Schlüssel dienen als Spaltennamen).
es: Si el documento es una matriz JSON, se creará un registro para cada uno de los objetos en la matriz (las claves se usarán como nombres de columna).
fr: Si un document est un tableau JSON, un enregistrement sera créé pour chaque objet du tableau (les clés seront utilisées en tant que noms de colonne).
nl: Indien het document een JSON-reeks is, zal een record worden aangemaakt voor elk voorwerp binnen de reeks (de sleutels zullen gebruikt worden als kolomnamen).

source: If the document is a JSON object, the parameter "JSON root" should contain a dot-separated path to the array inside your object. If not provided, the connector tries ``items``.
de: Ist das Dokument ein JSON-Objekt, sollte der Parameter "JSON-Stamm" einen durch einen Punkt getrennten Pfad zum Array in Ihrem Objekt enthalten. Bei fehlender Angabe probiert der Konnektor ``Elemente``.
es: Si el documento es un objeto JSON, el parámetro "JSON root" debe contener una ruta separada por un punto de la matriz dentro del objeto. Si no se proporciona, el conector prueba con ``items``.
fr: Si le document est un objet JSON, le paramètre "racine JSON" doit contenir un chemin d'accès séparé par des points menant au tableau contenu dans votre objet. S'il n'est pas inclus, le connecteur essaye les `items`.
nl: Indien het document een JSON-voorwerp is, zou de parameter "JSON root" een door punten gescheiden pad naar de reeks in uw voorwerp moeten hebben. Indien niet voorzien, probeert de connector "items".

source: For each item inside the array, the connector can follow another path before extracting the records thanks to the parameter "JSON object".
de: Dank des Parameters "JSON-Objekt" kann der Konnektor vor dem Extrahieren der Einträge einen anderen Pfad für jedes Element innerhalb des Arrays verfolgen.
es: Para cada uno de los elementos de la matriz, el conector puede seguir otra ruta antes de extraer los registros con el parámetro "Objeto JSON".
fr: Pour chaque élément dans le tableau, le connecteur peut suivre un autre chemin d'accès avant d'extraire les enregistrements grâce au paramètre "objet JSON".
nl: Voor elk item binnen de reeks kan de connector een ander pad volgen alvorens de records te extraheren dankzij de parameter "JSON object".

source: Supported field types
de: Unterstützte Feldtypen
es: Tipos de archivo permitidos
fr: Types de champs pris en charge
nl: Ondersteunde veldtypes

source: Regular fields (decimal, bool, string)
de: Reguläre Felder (dezimal, boolesch, Zeichenfolge)
es: Campos regulares (decimal, bool, string)
fr: Champs normaux (décimal, booléen, chaîne de caractères)
nl: Regelmatige velden (decimaal, bool, string)

source: JSON object: will be used as-is
de: JSON-Objekte werden verwendet wie sie sind
es: Objeto JSON: se usará tal cual.
fr: Objet JSON : sera utilisé tel quel
nl: JSON-voorwerp: zal gebruikt worden in de staat waarin het zich bevindt

source: if the array contains JSON objects, it will be used as-is
de: enthält das Array JSON-Objekte, wird es verwendet, wie es ist
es: Si la matriz contiene objetos JSON, se usará tal cual.
fr: si le tableau contient des objets JSON, il sera utilisé tel quel
nl: Indien de reeks JSON-voorwerpen bevat, zal ze gebruikt worden in de staat waarin ze zich bevindt

source: if it contains strings, a multivalued field will be created with all the strings separated by a semicolon (";")
de: enthält es Zeichenfolgen, wird ein mehrwertiges Feld mit allen durch ein Semikolon (";") getrennten Zeichenfolgen erstellt
es: Si contiene cadenas, se creará un campo multivalor con todas las cadenas separadas por un punto y coma (";").
fr: s'il contient des chaînes de caractères, un champ à valeurs multiples sera créé avec toutes les chaînes de caractères séparées par un point-virgule (";")
nl: Indien ze strings bevat, zal een veld met meerdere waarden worden aangemaakt waarbij alle strings gescheiden zijn door een punt komma (";")

source: Creation
de: Erstellung
es: Creación
fr: Création
nl: Aanmaak

source: See :doc:`how to source a file</publishing_data/01_creating_a_dataset/sourcing_data>`.
de: Siehe :doc:`eine Datei als Quelle auswählen</publishing_data/01_creating_a_dataset/sourcing_data>`.
es: Consulte :doc:`cómo añadir un archivo</publishing_data/01_creating_a_dataset/sourcing_data>`.
fr: Consultez :doc:`comment collecter un fichier </publishing_data/01_creating_a_dataset/sourcing_data>`.
nl: Zie :doc:`how to source a file</publishing_data/01_creating_a_dataset/sourcing_data>`.

source: Configuration
de: Konfiguration
es: Configuración
nl: Configuratie

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
nl: Gebruik

source: Extract filename
de: Dateinamen extrahieren
es: Extraer nombre de archivo
fr: Extraire le nom de fichier
nl: Extraheer bestandsnaam

source: Creates a new column with the name of the source file.
de: Es wird eine neue Spalte mit dem Namen der Quelldatei erstellt.
es: Crea una columna nueva con el nombre del archivo de origen.
fr: Crée une colonne avec le nom du fichier source.
nl: Maakt een nieuwe kolom aan met de naam van de bronbestand.

source: By default, the box is not checked. Check the box to extract filename in an added column.
de: Standardmäßig ist das Kontrollkästchen nicht markiert. Markieren Sie das Kontrollkästchen, um den Dateinamen in einer hinzugefügten Spalte zu extrahieren.
es: De forma predeterminada, la casilla no está marcada. Marque la casilla para extraer el nombre de archivo en una columna añadida.
fr: Par défaut, la case n'est pas cochée. Cochez la case pour extraire le nom de fichier dans une autre colonne.
nl: Standaard is het vakje niet aangevinkt. Vink het vakje aan om de bestandsnaam te extraheren in een toegevoegde kolom.

source: JSON root
de: JSON-Stamm
es: Raíz JSON
fr: Racine JSON

source: Path to the JSON array that contains the objects that will become the dataset records.
de: Pfad zum JSON-Array, das die Objekte enthält, die zu den Datensatzeinträgen werden sollen.
es: Ruta de la matriz JSON que contiene los objetos que se convertirán en los registros de conjuntos de datos.
fr: Chemin d'accès du tableau JSON qui contient les objets qui vont devenir les enregistrements du jeu de données.
nl: Pad naar de JSON-reeks die de voorwerpen bevat die de dataset records zullen worden.

source: If the JSON array is directly at the root, leave the textbox empty. If the JSON file is a JSON object, write the ijson path to the array in the textbox.
de: Wenn sich das JSON-Array direkt am Stamm befindet, lassen Sie das Textfeld leer. Wenn die JSON-Datei ein JSON-Objekt ist, geben Sie den ijson-Pfad zum Array in das Textfeld ein.
es: Si la matriz JSON está directamente en la raíz, deje el cuadro de texto vacío. Si el archivo JSON es un objeto JSON, escriba la ruta iJSON de la matriz en el cuadro de texto.
fr: Si le tableau JSON se trouve à la racine, laissez la zone de texte vide. Si le fichier JSON est un objet JSON, indiquez le chemin d'accès ijson au tableau dans la zone de texte.
nl: Wanneer de JSON-array rechtstreeks aan het begin staat, laat het tekstvak dan leeg. Wanneer het JSON-bestand een JSON-voorwerp is, noteer dan het ijson-pad naar de reeks in het tekstvak.

source: ijson is a syntax to navigate inside JSON objects. It consists in separating the attribute names with dots (e.g. `content.trains`). More features are available for advanced users.
de: ijson ist eine Syntax zur Navigation innerhalb von JSON-Objekten. Dabei werden die Attributnamen durch Punkte getrennt (z.B. "content.trains"). Für fortgeschrittene Benutzer stehen weitere Funktionen zur Verfügung.
es: iJSON es una sintaxis para navegar dentro de los objetos JSON. Consiste en separar los nombres de atributos por puntos (p. ej. `content.trains`). Hay más funciones disponibles para los usuarios avanzados.
fr: ijson est une syntaxe permettant de naviguer dans les objets JSON. Elle consiste à séparer les noms d’attribut avec des points (par exemple, `content.trains`). Des fonctionnalités supplémentaires sont disponibles pour les utilisateurs avancés.
nl: ijson is een syntax om in JSON-voorwerpen te navigeren. Het bestaat uit het scheiden van de attribuutnamen met puntjes (bijv. "content.trains"). Voor geavanceerde gebruikers zijn er extra functies beschikbaar.

source: JSON object
de: JSON-Objekt
es: Objeto JSON
fr: Objet JSON
nl: JSON-voorwerp

source: Relative path to the JSON object to extract.
de: Relativer Pfad des zu extrahierenden JSON-Objekts.
es: Ruta relativa del objeto JSON que se desea extraer.
fr: Chemin d'accès relatif à l'objet JSON à extraire.
nl: Relatief pad naar het JSON-voorwerp dat geëxtraheerd moet worden.

source: Once the JSON root has be set (or left empty), if the preview shows irrelevant columns, and that the JSON object has been extracted as the value of one column, write the name of that column inside the JSON object textbox.
de: Wenn der JSON-Stamm festgelegt (oder leer gelassen) wurde und die Vorschau irrelevante Spalten anzeigt und das JSON-Objekt als Wert einer Spalte extrahiert wurde, schreiben Sie den Namen dieser Spalte in das Textfeld des JSON-Objekts.
es: Una vez que la raíz JSON se ha establecido (o se ha dejado vacía), si la vista previa muestra columnas irrelevantes, y el objeto JSON se ha extraído como valor de una columna, escriba el nombre de esa columna en el cuadro de texto del objeto JSON.
fr: Une fois le dossier racine JSON défini (ou laissé vide), si l'aperçu montre des colonnes non pertinentes et si l'objet JSON a été extrait en tant que valeur d'une colonne, indiquez le nom de cette colonne dans la zone de texte de l'objet JSON.
nl: Eenmaal de JSON-root is ingesteld (of leeg is gelaten), wanneer in de voorbeeldweergave irrelevante kolommen worden getoond en het JSON-voorwerp geëxtraheerd is geworden als de waarde van één kolom, noteer dan de naam van die kolom in het tekstvak voor het JSON-voorwerp.

source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples
nl: Voorbeelden

source: Example 1:
de: 1. Beispiel:
es: Ejemplo 1:
fr: Exemple 1 :
nl: Voorbeeld 1:

source: In this JSON file, the JSON array is directly at the root. There is no need to fill up the JSON root configuration.
de: In dieser JSON-Datei befindet sich das JSON-Array direkt am Stamm. Es ist nicht erforderlich, die JSON-Stamm-Konfiguration auszufüllen.
es: En este archivo JSON, la matriz JSON está directamente en la raíz. No es necesario completar la configuración de la raíz JSON.
fr: Dans ce fichier JSON, le tableau JSON se trouve directement à la racine. Par conséquent, vous n'avez pas besoin de renseigner la configuration du dossier racine JSON.
nl: In dit JSON-bestand is de JSON-array rechtstreeks aan de root ligt. DE JSON-rootconfiguratie moet niet worden opgevuld.

source: The resulting dataset will be (columns order may vary):
de: Der resultierende Datensatz ist (die Reihenfolge der Spalten kann unterschiedlich sein):
es: El conjunto de datos resultante será (el orden de las columnas puede variar):
fr: Le jeu de données résultant sera (l'ordre des colonnes peut varier) :
nl: De resulterende kolom zal zijn (de volgorde van de kolommen kan verschillen):

source: origin
de: Herkunft
es: origen
nl: vertrekpunt

source: destination
de: Ziel
nl: bestemming

source: Example 2:
de: 2. Beispiel:
es: Ejemplo 2:
fr: Exemple 2 :
nl: Voorbeeld 2:

source: For this complex JSON file, the correct JSON root is ``content.trains``. If ``content.trains`` is set as JSON root, the resulting dataset will be:
de: Für diese komplexe JSON-Datei lautet der korrekte JSON-Stamm ``content.trains``. Wenn ``content.trains`` als JSON-Stamm festgelegt ist, dann resultiert folgender Datensatz daraus:
es: Para este archivo JSON complejo, la raíz JSON correcta es ``content.trains``. Si ``content.trains`` se ha establecido como raíz JSON, el conjunto de datos resultante será:
fr: Pour ce fichier JSON complexe, le dossier racine JSON correct est ``content.trains``. Si ``content.trains`` est défini en tant que dossier racine JSON, le jeu de données résultant sera :
nl: Voor dit complexe JSON-bestand is de juiste JSON-root "centent.trains". Wanneer "content.trains" is ingesteld als JSON-root, zal de resulterende dataset de volgende zijn:

source: {"origin": "Agra Cantt", "destination": "New Delhi", "name": "Agra Express"}
de: {"Herkunft": "Agra Cantt", "Ziel": "New Delhi", "Name": "Agra Express"}
nl: {"vertrekpunt": "Agra Cantt", "bestemming": "New Delhi", "naam": "Agra Express"}

source: {"origin": "Balurghat", "destination": "Sealdah", "name": "Gour Express"}
de: {"Herkunft": "Balurghat", "Ziel": "Sealdah", "Name": "Gour Express"}
nl: {"vertrekpunt": "Balurghat", "bestemming": "Sealdah", "naam": "Gour Express"}

source: To only extract the ``info`` JSON objects, and skip the ``id`` number, the correct JSON object is ``info``. If ``info`` is set as JSON object, the resulting dataset will be:
de: Um nur die JSON-Objekte ``info`` zu extrahieren und die ``id`` Nummer zu überspringen, ist das richtige JSON-Objekt ``info``. Wenn ``info`` als JSON-Objekt festgelegt ist, dann resultiert folgender Datensatz daraus:
es: Para extraer tan solo los objetos JSON ``info`` y pasar por alto el número ``id``, el objeto JSON correcto es ``info``. Si ``info`` se ha establecido como objeto JSON, el conjunto de datos resultante será:
fr: Pour extraire uniquement les objets JSON ``info`` et ignorer le nombre ``id``, l'objet JSON correct est ``info``. Si ``info`` est défini en tant qu'objet JSON, le jeu de données qui en résulte sera :
nl: Om enkel de "info" van JSON-voorwerpen te extraheren en het "id" nummer over te slaan, is het juiste JSON-voorwerp "info". Wanneer "info" ingesteld is als JSON-voorwerp, zal de resulterende dataset de volgende zijn:

source: JSON Line
de: JSON-Zeile
es: Línea JSON
fr: Ligne JSON
nl: JSON-lijn

source: This connector expects a file in which each line is a one-line JSON document. The whole file is not a valid JSON document but each line is.
de: Dieser Konnektor erwartet eine Datei, in der jede Zeile ein einzeiliges JSON-Dokument ist. Im Gegensatz zu jeder einzelnen Zeile ist die gesamte Datei kein gültiges JSON-Dokument.
es: Este conector espera un archivo en que cada una de las líneas es un documento JSON de una línea. El archivo entero no es un documento JSON válido, pero sí lo es cada una de las líneas.
fr: Ce connecteur attend un fichier dans lequel chaque ligne est un document JSON d'une seule ligne. Contrairement à chacune des lignes qu'il contient, le document en lui-même n'est pas un document JSON valide.
nl: Deze connector verwacht een bestand waarin elke lijn een JSON-document van één lijn is. Het volledige bestand is geen geldig JSON-document maar elke lijn is dat wel.

source: The connector supports 2 modes:
de: Der Konnektor unterstützt zwei Modi:
es: El conector admite 2 modos:
fr: Le connecteur prend en charge 2 modes :
nl: De connector ondersteunt 2 modi:

source: one JSON array on each line (or one array altogether)
de: ein JSON-Array in jeder Zeile (oder ein Array insgesamt)
es: Una matriz JSON en cada una de las líneas (o una matriz entera)
fr: un tableau JSON sur chaque ligne (ou un tableau global),
nl: één JSON-reeks op elke lijn (of één reeks alles bij elkaar genomen)

source: one JSON object on each line
de: ein JSON-Objekt in jeder Zeile
es: Un objeto JSON en cada una de las líneas
fr: un objet JSON sur chaque ligne.
nl: één JSON-voorwerp op elke lijn

source: Regular fields (decimal, string)
de: Reguläre Felder (dezimal, Zeichenfolge)
es: Campos regulares (decimal, string)
fr: Champs normaux (décimal, chaîne de caractères)
nl: Regelmatige velden (decimaal, string)

source: Array: will be used as-is
de: Array: wird verwendet, so wie es ist
es: Matriz: se usará tal cual
fr: Tableau : sera utilisé tel quel
nl: Reeks: zal worden gebruikt in de toestand waarin deze zich bevindt

source: First line number
de: Nummer der ersten Zeile
es: Primer número de línea
fr: Numéro de la première ligne
nl: Nummer van de eerste lijn

source: For files which do not start at the very first line, it is possible to decide which line is to be considered the first one. The lines above will be skipped from the dataset.
de: Bei Dateien, die nicht in der ersten Zeile beginnen, kann bestimmt werden, welche Zeile als die erste angesehen werden soll. Die Zeilen darüber werden vom Datensatz übersprungen.
es: Para los archivos que no empiezan en la primera línea, se puede decidir qué línea debe considerarse la primera. Las líneas por encima de esta se pasarán por alto en el conjunto de datos.
fr: Pour les fichiers qui ne commencent pas dès la première ligne, vous pouvez décider quelle ligne doit être considérée comme telle. Les lignes précédentes seront ignorées du jeu de données.
nl: Voor bestanden die niet op de allereerste lijn beginnen, is het mogelijk te beslissen met welke lijn eerst rekening moet worden gehouden. De lijnen erboven zullen worden overgeslagen in de dataset.

source: By default, the dataset starts at line 1. Indicate the number of the line that should be considered the beginning of the dataset.
de: Standardmäßig beginnt der Datensatz in Zeile 1. Geben Sie die Nummer der Zeile an, die als Anfang des Datensatzes berücksichtigt werden soll.
es: De forma predeterminada, el conjunto de datos empieza en la línea 1. Indique el número de la línea que debe considerarse el comienzo del conjunto de datos.
fr: Par défaut, le jeu de données commence à la ligne 1. Indiquez le numéro de la ligne qui doit être considérée comme le début du jeu de données.
nl: Standaard start de dataset op lijn 1. Vermeld het nummer van de lijn die overwogen zou moeten worden als het begin van de dataset.

source: Headers
de: Überschriften
es: Encabezados
fr: En-têtes

source: For files which first line contains column titles.
de: Für Dateien, deren erste Zeile Spaltentitel enthält.
es: Para los archivos en que la primera línea contiene títulos de columna.
fr: Pour les fichiers dont la première ligne contient des titres de colonne.
nl: Voor bestanden waarvan de eerste lijn kolomtitels bevat.

source: By default, the box is checked. It makes the values of the first line field labels. Uncheck the box if the first line doesn't contain titles but data: the field labels will then be empty by default.
de: Standardmäßig ist das Kontrollkästchen markiert. Es bezieht sich auf die Werte der Feldbeschriftungen der ersten Zeile. Entfernen Sie die Markierung des Kontrollkästchens, wenn die erste Zeile keine Titel, sondern Daten enthält: in diesem Fall sind die Feldbezeichnungen standardmäßig leer.
es: De forma predeterminada, la casilla está marcada. Hace de los valores de la primera línea las etiquetas de campo Desmarque la casilla si la primera línea no contiene títulos sino datos: así, las etiquetas de campo estarán vacías de forma predeterminada.
fr: Par défaut, la case est cochée. Les valeurs de la première ligne deviennent des labels de champs. Décochez la case si la première ligne contient des données plutôt que des titres : les labels de champs seront vides par défaut.
nl: Standaard is het vakje aangevinkt. Het maakt de waarden van het eerste veld tot veldlabels. Vink het vakje uit wanneer de eerste lijn geen titels waar wel gegevens bevat: de veldlabels zullen dan standaard leeg zijn.
