Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/mapinfo.po
Languages: de

source: MapInfo connector
de: MapInfo-Konnektor

source: The MapInfo connector is used for MapInfo ZIP archives. They should contain the following files:
de: Der MapInfo-Konnektor wird für MapInfo-ZIP-Archive verwendet. Sie sollten die folgenden Dateien enthalten:

source: ``.mid``: stores the attribute data
de: ``.mid``: speichert die Attributdaten

source: ``.mif``: stores the structure and the geometries
de: ``.mif``: speichert die Struktur und die Geometrien

source: or
de: oder

source: ``.map``: stores the graphic and geographic information needed to display each vector feature on a map
de: ``.map``: speichert die zur Anzeige der einzelnen Vektorfunktionen auf einer Karte erforderlichen grafischen und geografischen Informationen

source: ``.tab``: stores the link between all other files and holds information about the type of data set file
de: ``.tab``: speichert die Verknüpfung zwischen allen anderen Dateien und enthält Informationen über den Typ der Datensatzdatei

source: ``.id``: stores information linking graphic data to the database information
de: ``.id``: speichert Informationen, die grafische Daten mit der Datenbankinformation verknüpfen

source: ``.dat``: stores the attribute data
de: ``.dat``: speichert die Attributdaten

source: Note
de: Hinweis

source: The ZIP archive must be flat. All files must be at the root path (not in subdirectories).
de: Das ZIP-Archiv muss flach sein. Alle Dateien müssen sich im Stammverzeichnis (nicht in Unterverzeichnissen) befinden.

source: Creation
de: Erstellung

source: See :doc:`how to source a file</publishing_data/01_creating_a_dataset/sourcing_data>`.
de: Siehe :doc:`eine Datei als Quelle auswählen</publishing_data/01_creating_a_dataset/sourcing_data>`.

source: Configuration
de: Konfiguration

source: Description
de: Beschreibung

source: Usage
de: Verwendung

source: Encoding
de: Codierung

source: Encoding of the file.
de: Codierung der Datei.

source: Character encoding is the way characters are represented in a saved file. Unicode (or utf-8) is the universal standard but some files might be encoded in a legacy format (e.g. old versions of Excel), which would require setting the encoding manually. On modern software, this is usually unnecessary.
de: Die Zeichen werden in einer gespeicherten Datei mittels Zeichencodierung dargestellt. Unicode (oder utf-8) ist der universelle Standard, aber einige Dateien können in einem älteren Format kodiert sein (z.B. alte Versionen von Excel), was eine manuelle Einstellung der Kodierung erforderlich macht. Bei neuerer Software ist dies in der Regel nicht erforderlich.

source: By default, the platform uses a heuristic to guess the encoding. If the guessed encoding is not right, choose the right one among the list, or write it in the textbox. Any alias from `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_ can be used.
de: Standardmäßig verwendet die Plattform eine Heuristik, um die Kodierung zu ermitteln. Wenn die vermutete Codierung nicht richtig ist, wählen Sie die Richtige aus der Liste aus oder schreiben Sie sie in das Textfeld. Es kann jeder beliebige Alias von `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_ verwendet werden.

source: Extract filename
de: Dateinamen extrahieren

source: Creates a new column with the name of the source file.
de: Es wird eine neue Spalte mit dem Namen der Quelldatei erstellt.

source: By default, the box is not checked. Check the box to extract filename in an added column.
de: Standardmäßig ist das Kontrollkästchen nicht markiert. Markieren Sie das Kontrollkästchen, um den Dateinamen in einer hinzugefügten Spalte zu extrahieren.
