Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/netatmo.po
Languages: de, es, fr, nl

source: Netatmo extractor
de: Netatmo-Extraktor
es: Extractor de Netatmo
fr: Extracteur Netatmo

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: This connector is not available by default. Please contact Opendatasoft for the activation of this connector on a given Opendatasoft domain.
es: Este conector no está disponible de forma predeterminada. Póngase en contacto con Opendatasoft para solicitar la activación de este conector en un dominio Opendatasoft determinado.
fr: Ce connecteur n'est pas disponible par défaut. Veuillez contacter Opendatasoft si vous souhaitez l'activer dans un domaine Opendatasoft donné.
nl: Deze connector is standaard niet beschikbaar. Gelieve contact op te nemen met Opendatasoft om deze connector voor een welbepaald Opendatasoft-domein te activeren.

source: The Netatmo connector is used to extract data from the Netatmo API.
de: Der Netatmo-Konnektor wird verwendet, um Daten von der Netatmo-API abzurufen.
es: El conector de Netatmo se utiliza para extraer datos de la API de Netatmo.
fr: Le connecteur Netatmo sert à extraire des données de l'API Netatmo.
nl: De Netatmo-connector wordt gebruikt om gegevens van de Netatmo API te extraheren.

source: This connector features 2 modes:
de: Dieser Konnektor bietet 2 Modi:
es: Este conector incluye 2 modos:
fr: Ce connecteur est doté de 2 modes :
nl: Deze connector is voorzien van 2 modi:

source: the `Weathermap <https://weathermap.netatmo.com/>`_ mode, to create a dataset with the current data from every public Netatmo station,
de: der Modus `Weathermap <https://weathermap.netatmo.com/>`_, um einen Datensatz mit den aktuellen Daten von jeder öffentlichen Netatmo-Station zu erstellen,
es: El modo `Weathermap <https://weathermap.netatmo.com/>`_, para crear un conjunto de datos con los datos actuales de cada una de las estaciones Netatmo públicas.
fr: le mode `Weathermap <https://weathermap.netatmo.com/>`_ pour créer un jeu de données avec les données actuelles de chaque station Netatmo publique,
nl: de `Weerkaart <https://weathermap.netatmo.com/>`_ modus, om een dataset aan te maken met de huidige gegevens van elk publiek Netatmo-station,

source: the history mode, to create a dataset with the historical data from one specific Netatmo station.
de: der History-Modus, um einen Datensatz mit den historischen Daten einer bestimmten Netatmo-Station zu erstellen.
es: El modo de historial, para crear un conjunto de datos con los datos del historial de una estación Netatmo concreta.
fr: le mode historique pour créer un jeu de données avec les données historiques d'une station Netatmo spécifique.
nl: de historiekmodus om een dataset aan te maken met de historische gegevens van één specifiek Netatmo-station.

source: Creation
de: Erstellung
es: Creación
fr: Création
nl: Aanmaak

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: For this connector to work, an application must be created on Netatmo Connect beforehand. The "Technical Parameters" section of the application, in the website, displays information that are required to configure the Netatmo connector, such as the Client Id and the Client Secret.
de: Damit dieser Konnektor funktioniert, muss zunächst eine Anwendung auf Netatmo Connect erstellt werden. Der Abschnitt "Technische Parameter" der Anwendung auf der Website zeigt Informationen an, die zur Konfiguration des Netatmo-Konnektors erforderlich sind, wie z. B. die Kundennummer und das Kundengeheimnis.
es: Para que este conector funcione, previamente debe haberse creado una aplicación en Netatmo Connect. La sección "Parámetros técnicos" de la aplicación, en el sitio web, proporciona la información necesaria para configurar el conector de Netatmo, como el ID de cliente y el secreto de cliente.
fr: Pour que ce connecteur fonctionne, vous devez au préalable créer une application sur Netatmo Connect. Sur le site web, la section "Paramètres techniques" de l'application affiche les informations nécessaires pour configurer le connecteur Netatmo, comme l'id client ou le mot de passe client.
nl: Omdat deze connector werkt, moet op voorhand een applicatie aangemaakt worden op Netatmo Connect. In de rubriek "Technische parameters" van de applicatie op de website staat informatie die noodzakelijk om de Netatmo-connector te configureren, zoals het Klant ID en het Klant Geheim.

source: Enter ``netatmo://`` in the Enter a URL area, when creating a new dataset.
de: Geben Sie ``netatmo://`` in den Bereich zur Eingabe der URL ein, wenn Sie einen neuen Datensatz erstellen.
es: Introduzca ``netatmo://`` en el área Especificar una dirección URL cuando cree un conjunto de datos nuevo.
fr: Lors de la création d'un jeu de données, saisissez ``netatmo://`` dans le champ Saisir une URL.
nl: Voer ``netatmo://`` in het veld "een URL invoeren" bij het aanmaken van een nieuwe dataset.

source: Press Enter, or click the + button.
de: Drücken Sie die Eingabetaste, oder klicken Sie auf die Schaltfläche +.
es: Pulse Intro o haga clic en el botón +.
fr: Appuyez sur Entrée ou cliquez sur le bouton +.
nl: Druk op Enter of klik op de knop "+".

source: Configuration
de: Konfiguration
es: Configuración
nl: Configuratie

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
nl: Gebruik

source: Client Id
es: ID de cliente
fr: Id client
nl: Klant-ID

source: Client Id of the application created on Netatmo Connect.
de: Client-ID der Anwendung, die mit Netatmo Connect erstellt wurde.
es: ID de cliente de la aplicación creada en Netatmo Connect.
fr: Id client de l'application créée sur Netatmo Connect.
nl: Klant ID van de applicatie die is aangemaakt op Netatmo Connect.

source: Paste the client Id of the application in the textbox.
de: Fügen Sie die Client-ID der Anwendung in das Textfeld ein.
es: Pegue el ID de cliente de la aplicación en el cuadro de texto.
fr: Collez l'id client de l'application dans la zone de texte.
nl: Plak het klant ID van de applicatie in het tekstvak.

source: Client Secret
es: Secreto de cliente
fr: Mot de passe client
nl: Klantgeheim

source: Client Secret of the application created on Netatmo Connect.
de: Client Secret der Anwendung, die mit Netatmo Connect erstellt wurde.
es: Secreto de cliente de la aplicación creada en Netatmo Connect.
fr: Mot de passe client de l'application créée sur Netatmo Connect.
nl: Klant Geheim van de applicatie die is aangemaakt op Netatmo Connect.

source: Paste the client secret of the application in the textbox.
de: Fügen Sie das Kundengeheimnis der Anwendung in das Textfeld ein.
es: Pegue el secreto de cliente de la aplicación en el cuadro de texto.
fr: Collez le mot de passe client de l'application dans la zone de texte.
nl: Plak het Klant Geheim van de applicatie in het tekstvak.

source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
nl: Gebruikersnaam

source: Username of the user's personal Netatmo account.
de: Benutzername des persönlichen Netatmo-Kontos des Benutzers.
es: Nombre de usuario de la cuenta Netatmo personal del usuario.
fr: Nom d'utilisateur du compte Netatmo personnel d'un utilisateur.
nl: Gebruikersnaam van het persoonlijke Netatmo-account van de gebruiker.

source: Write the username in the textbox.
de: Geben Sie den Benutzernamen im Textfeld an.
es: Escriba el nombre de usuario en el cuadro de texto.
fr: Indiquez le nom d'utilisateur dans la zone de texte.
nl: Noteer de gebruikersnaam in het tekstvak.

source: Password
de: Passwort
es: Contraseña
fr: Mot de passe
nl: Wachtwoord

source: Password of the user's personal Netatmo account.
de: Passwort des persönlichen Netatmo-Kontos des Benutzers.
es: Contraseña de la cuenta Netatmo personal del usuario.
fr: Mot de passe du compte Netatmo personnel d'un utilisateur.
nl: Wachtwoord van het persoonlijke Netatmo-account van de gebruiker.

source: Write the password in the textbox.
de: Geben Sie das Passwort im Textfeld an.
es: Escriba la contraseña en el cuadro de texto.
fr: Indiquez le mot de passe dans la zone de texte.
nl: Noteer het wachtwoord in het tekstvak.

source: MAC address
de: MAC-Adresse
es: Dirección MAC
fr: Adresse MAC
nl: MAC-adres

source: Indicates whether the connector should be used in weathermap or history mode.
de: Zur Angabe, ob der Konnektor im Weathermap- oder im History-Modus verwendet werden soll.
es: Indica si el conector debe emplearse en modo Weathermap o de historial.
fr: Indique si le connecteur doit être utilisé en mode weathermap ou historique.
nl: Geeft aan of de connector moet worden gebruikt in weerkaart- of historiekmodus.

source: To use the connector in Weathermap mode: leave the textbox empty. In the created dataset, there will be one record per station available on the Netatmo Weathermap.
de: Um den Konnektor im Weathermap-Modus zu verwenden: Lassen Sie das Textfeld leer. Im erstellten Datensatz ist für die Netatmo Weathermap ein Eintrag pro Station verfügbar.
es: Para usar el conector en modo Weathermap: deje el cuadro de texto vacío. En el conjunto de datos creado, habrá un registro por estación disponible en Netatmo Weathermap.
fr: Pour utiliser le connecteur en mode Weathermap, laissez la zone de texte vide. Dans le jeu de données créé, il y aura un enregistrement par station disponible sur la carte Weathermap Netatmo.
nl: Om de connector in Weerkaartmodus te gebruiken: laat het tekstvak leeg. In de aangemaakte dataset zal er slechts één record per station beschikbaar zijn op de Netatmo Weathermap.

source: To use the connector in history mode: paste the MAC adress of the station (displayed in the Parameters section of a Netatmo account) in the textbox. The created dataset will be the whole history of the data retrieved for the given Netatmo station.
de: Um den Konnektor im History-Modus zu verwenden: fügen Sie die MAC-Adresse der Station (im Bereich "Parameter" eines Netatmo-Kontos angezeigt) in das Textfeld ein. Der erstellte Datensatz umfasst die gesamte Historie der von der angegebenen Netatmo-Station abgerufenen Daten.
es: Para usar el conector en modo de historial: pegue la dirección MAC de la estación (visualizada en la sección de parámetros de una cuenta Netatmo) en el cuadro de texto. El conjunto de datos creado será todo el historial de los datos recuperados para la estación Netatmo específica.
fr: Pour utiliser le connecteur en mode historique, collez l'adresse MAC de la station (affichée dans la section Paramètres d'un compte Netatmo) dans la zone de texte. Le jeu de données créé correspond à l'ensemble de l'historique des données récupérées pour une station Netatmo donnée.
nl: Om de connector in historiekmodus te gebruiken: plak het MAC-adres van het station (terug te vinden in de rubriek Parameters van een Netatmo-account) in het tekstvak. De aangemaakte dataset zal de volledige historiek zijn van de gegevens die zijn opgehaald voor het welbepaalde Netatmo-station.

source: Filter stations
de: Stationen filtern
es: Filtrar estaciones
fr: Filtrer les stations

source: If checked, excludes all stations with abnormal temperature measures. This configuration only works for the Weathermap mode of the connector.
de: Wenn diese Option aktiviert ist, werden alle Stationen mit abweichenden Temperaturmessungen ausgeschlossen. Diese Konfiguration funktioniert nur im Weathermap-Modus des Konnektors.
es: Si se selecciona, excluye todas las estaciones con mediciones de temperatura anormales. Esta configuración solo funciona para el modo Weathermap del conector.
fr: Si la case est cochée, toutes les stations avec des mesures de température anormales sont exclues. Cette configuration fonctionne uniquement pour le mode Weathermap du connecteur.
nl: Wanneer dit vakje is aangevinkt, worden alle stations met abnormale temperatuurmetingen uitgesloten. Deze configuratie werkt enkel voor de weerkaartmodus van de connector.

source: By default, the box is not checked. Check the box to filter stations.
de: Standardmäßig ist das Kontrollkästchen nicht markiert. Markieren Sie das Kontrollkästchen, um die Stationen zu filtern.
es: De forma predeterminada, la casilla no está marcada. Marque la casilla para filtrar estaciones.
fr: Par défaut, la case n'est pas cochée. Cochez-la pour filtrer les stations.
nl: Standaard is dit vakje niet aangevinkt. Vink het vakje aan om de stations te filteren.

source: This connector is not available by default. Please contact OpenDataSoft for the activation of this connector on a given OpenDataSoft domain.
de: Dieser Konnektor ist nicht standardmäßig verfügbar. Wenden Sie sich an OpenDataSoft, wenn dieser Konnektor für eine OpenDataSoft-Domain aktiviert werden soll.
