Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/openagenda.po
Languages: de, fr

source: OpenAgenda connector
de: OpenAgenda-Konnektor
fr: Connecteur OpenAgenda

source: Important
de: Wichtig

source: This connector is not available by default. Please contact Opendatasoft for the activation of this connector on a given Opendatasoft domain.
de: Dieser Konnektor ist nicht standardmäßig verfügbar. Wenden Sie sich an Opendatasoft, wenn dieser Konnektor für eine Opendatasoft-Domain aktiviert werden soll.
fr: Ce connecteur n'est pas disponible par défaut. Veuillez contacter Opendatasoft si vous souhaitez l'activer dans un domaine Opendatasoft donné.

source: The OpenAgenda connector extracts events from an agenda, using the OpenAgenda REST API. For more information, refer to the `OpenAgenda documentation <https://openagenda.zendesk.com/hc/fr/categories/115000324454-API>`__.
de: Der OpenAgenda-Konnektor ruft Ereignisse aus einem Terminkalender mit Hilfe der OpenAgenda REST API ab. Weitere Informationen finden Sie in der `OpenAgenda-Dokumentation <https://openagenda.zendesk.com/hc/fr/categories/115000324454-API>`__.
fr: Le connecteur OpenAgenda extrait des évènements d'un agenda à l'aide de l'API REST OpenAgenda. Pour plus d'informations, reportez-vous à la `documentation OpenAgenda <https://openagenda.zendesk.com/hc/fr/categories/115000324454-API>`__.

source: Creation
de: Erstellung
fr: Création

source: Enter a space in the Enter a URL area, when creating a new dataset.
de: Geben Sie ein Leerzeichen in den Bereich zur Eingabe der URL ein, wenn Sie einen neuen Datensatz erstellen.
fr: Lors de la création d'un jeu de données, entrez une espace dans le champ Saisir une URL.

source: Press Enter, or click the + button.
de: Drücken Sie die Eingabetaste, oder klicken Sie auf die Schaltfläche +.
fr: Appuyez sur Entrée ou cliquez sur le bouton +.

source: Select OpenAgenda V2 Extractor from the Type list in the Source configuration area.
de: Wählen Sie "OpenAgenda V2 Extractor" aus der Typen-Liste im Bereich zum Konfigurieren einer Quelle.
fr: Sélectionnez Extracteur OpenAgenda V2 dans la liste Type de la section Configuration de la source.

source: Configuration
de: Konfiguration

source: Description
de: Beschreibung

source: Usage
de: Verwendung
fr: Utilisation

source: Agenda
de: Terminkalender

source: Unique identifier for the agenda.
de: Eindeutige Kennung für den Terminkalender.
fr: Identifiant unique de l'agenda.

source: This field is required.
de: Dieses Feld ist erforderlich.
fr: Ce champ est obligatoire.

source: API key
de: API-Schlüssel
fr: Clé d'API

source: Unique identifier for your OpenAgenda account. You can find your API key in your OpenAgenda account settings.
de: Eindeutige Kennung für Ihr OpenAgenda-Konto. Sie finden Ihren API-Schlüssel unter den Einstellungen Ihres OpenAgenda-Kontos.
fr: Identifiant unique de votre compte OpenAgenda. Votre clé d'API est disponible dans les paramètres de votre compte OpenAgenda.

source: Providing an API key is optional, but it lets you access OpenAgenda data faster.
de: Die Bereitstellung eines API-Schlüssels ist optional, ermöglicht aber einen schnelleren Zugriff auf OpenAgenda-Daten.
fr: Indiquer une clé d'API est facultatif, mais cela vous permet d'accéder plus rapidement aux données OpenAgenda.

source: Incremental updates
de: Inkrementelle Updates
fr: Mises à jour incrémentales

source: When enabling incremental updates, the first publication loads all data. Subsequent updates are incremental.
de: Wenn Sie inkrementelle Updates aktivieren, werden bei erstmaliger Veröffentlichung alle Daten geladen. Nachfolgende Updates erfolgen inkrementell.
fr: Lors de l'activation des mises à jour incrémentales, la première publication charge toutes les données. Les mises à jour qui en résultent sont incrémentales.

source: To enable incremental updates, click the toggle.
de: Klicken Sie auf die entsprechende Schaltfläche, um inkrementelle Updates zu aktivieren.
fr: Cliquez sur le bouton bascule pour activer les mises à jour incrémentales.

source: Language
de: Sprache
fr: Langue

source: Language for the event, if specified. Represented as the language code for the specified language.
de: Sprache für das Ereignis (falls angegeben). Wird als Sprachcode für die angegebene Sprache dargestellt.
fr: Langue de l'évènement, si spécifiée. Indiquée sous la forme du code de langue correspondant à la langue spécifiée.

source: If no value has been selected or entered, then events in all languages are extracted.
de: Wenn kein Wert ausgewählt oder eingegeben wurde, werden die Ereignisse in allen Sprachen extrahiert.
fr: Dans le cas où aucune valeur n'a été sélectionnée ou saisie, les évènements dans toutes les langues sont extraits.

source: Country
de: Land
fr: Pays

source: Country where the event takes place. Represented as the country code for this country.
de: Land, in dem das Ereignis stattfindet. Wird als Ländercode für dieses Land dargestellt.
fr: Pays où l'évènement a lieu. Indiqué sous la forme du code de pays correspondant à ce pays.

source: If no value has been selected or entered, then events for all country codes are extracted.
de: Wenn kein Wert ausgewählt oder eingegeben wurde, werden die Ereignisse für alle Ländercodes extrahiert.
fr: Dans le cas où aucune valeur n'a été sélectionnée ou saisie, les évènements pour tous les codes pays sont extraits.

source: Languages to extract
de: Zu extrahierende Sprachen
fr: Langues à extraire

source: Languages to be extracted from multilingual fields.
de: Sprachen, die aus mehrsprachigen Feldern extrahiert werden sollen.
fr: Langues à extraire des champs multilingues.

source: Allowed values are ``fr`` (French), ``en`` (English), ``de`` (German), ``it`` (Italian), and ``es`` (Spanish). When creating the dataset, ``fr`` is the default value.
de: Erlaubte Werte: ``fr`` (Französisch), ``en`` (Englisch), ``de`` (Deutsch), ``it`` (Italienisch), and ``es`` (Spanisch). Beim Erstellen des Datensatzes ist ``fr`` der Standardwert.
fr: Les valeurs autorisées sont les suivantes :``fr`` (Français), ``en`` (Anglais), ``de`` (Allemand), ``it`` (Italien) et ``es`` (Espagnol). Lors de la création du jeu de données, ``fr`` est la valeur par défaut.

source: If no value has been selected or entered, then multilingual fields are not extracted.
de: Wenn kein Wert ausgewählt oder eingegeben wurde, werden die mehrsprachigen Felder nicht extrahiert.
fr: Dans le cas où aucune valeur n'a été sélectionnée ou saisie, les champs multilingues ne sont pas extraits.

source: Labels language
de: Sprache der Beschriftungen
fr: Langue des labels

source: Language of the fields used as column headers.
de: Sprache der Felder, die als Spaltenüberschriften verwendet werden.
fr: Langue des champs utilisés en tant qu'en-têtes de colonne.

source: Allowed values are ``fr`` (French) and ``en`` (English). ``fr`` is the default value.
de: Erlaubte Werte: ``fr`` (Französisch) und ``en`` (Englisch). ``fr`` der Standardwert.
fr: Les valeurs autorisées sont les suivantes :``fr`` (Français) et ``en`` (Anglais). ``fr`` est la valeur par défaut.

source: Custom fields to extract
de: Zu extrahierende benutzerdefinierte Felder
fr: Champs personnalisés à extraire

source: Custom fields that do not belong to the standard fields in OpenAgenda agendas.
de: Benutzerdefinierte Felder, die nicht zu den Standardfeldern in OpenAgenda-Terminkalendern gehören.
fr: Champs personnalisés qui n'appartiennent pas aux champs standard des agendas OpenAgenda.

source: For more information, refer to the `OpenAgenda documentation <https://openagenda.zendesk.com/hc/fr/articles/203034982-L-export-JSON-d-un-agenda>`__.
de: Weitere Informationen finden Sie in der `OpenAgenda-Dokumentation <https://openagenda.zendesk.com/hc/fr/articles/203034982-L-export-JSON-d-un-agenda>`__.
fr: Pour plus d'informations, reportez-vous à la `documentation OpenAgenda <https://openagenda.zendesk.com/hc/fr/articles/203034982-L-export-JSON-d-un-agenda>`__.

source: Enter the name of the custom fields to be extracted. Each custom field is extracted as a text field.
de: Geben Sie den Namen der zu extrahierenden benutzerdefinierten Felder ein. Jedes benutzerdefinierte Feld wird als Textfeld extrahiert.
fr: Entrez le nom des champs personnalisés à extraire. Chaque champ personnalisé est extrait en tant que champ de texte.

source: Tags to extract
de: Zu extrahierende Tags
fr: Tags à extraire

source: Tags represent properties of an event. Tag groups categorize tags.
de: Tags stellen Eigenschaften eines Ereignisses dar. Mithilfe von Tag-Gruppen werden Tags kategorisiert.
fr: Les tags représentent les propriétés d'un évènement. Les groupes de tags catégorisent les tags.

source: Enter the name of the tag groups to be extracted. Each tag group is extracted as a text field.
de: Geben Sie den Namen der zu extrahierenden Tag-Gruppen ein. Jede Tag-Gruppe wird als Textfeld extrahiert.
fr: Entrez le nom des groupes de tags à extraire. Chaque groupe de tags est extrait en tant que champ de texte.

source: Name
fr: Nom
