Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/osm.po
Languages: fr

source: OSM connector
fr: Connecteur OSM

source: The OSM File connector (OSM standing for OpenStreetMap) is used to extract data from OpenStreetMap files (.osm).
fr: Le connecteur Fichier OSM (OSM signifiant OpenStreetMap) est utilisé pour extraire des données des fichiers OpenStreetMap (.osm).

source: Note
fr: Remarque

source: A reliable server to download extracts from the OpenStreetMap project is `Geofabrik <http://download.geofabrik.de>`_. It provides exports for different regions of the world.
fr: `Geofabrik <http://download.geofabrik.de>`_ est un serveur fiable pour télécharger des extraits du projet OpenStreetMap. En outre, il fournit des exports pour différentes régions du monde.

source: The OSM connector can also read XML (.xml) files.
fr: Le connecteur OSM peut également lire des fichiers XML (.xml).

source: Creation
fr: Création

source: See :doc:`how to source a file</publishing_data/01_creating_a_dataset/sourcing_data>`.
fr: Consultez :doc:`comment collecter un fichier </publishing_data/01_creating_a_dataset/sourcing_data>`.

source: Name
fr: Nom

source: Usage
fr: Utilisation

source: Keep only amenities
fr: Conserver uniquement les équipements

source: Filters the export to only keep nodes and ways with the "amenity" tag.
fr: Filtre l'export pour conserver uniquement les nœuds et les chemins présentant le tag "amenity".

source: By default, the box is checked. To exclude all amenities, uncheck the box.
fr: Par défaut, la case est cochée. Pour exclure tous les équipements, décochez la case.

source: Tags to extract from the nodes and ways.
fr: Tags à extraire des nœuds et des chemins.

source: Write the tags to extract in the textbox. Tags should be separated with a comma.
fr: Indiquez les tags à extraire dans la zone de texte en les séparant avec une virgule.

source: Relation tags
fr: Tags de relation

source: Tags to extract from attached relations.
fr: Tags à extraire des relations jointes.
