Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/salesforce.po
Languages: es, nl

source: Salesforce connector
es: Conector de Salesforce

source: Important
es: Importante
nl: Belangrijk

source: This connector is not available by default. Please contact Opendatasoft for the activation of this connector on a given Opendatasoft domain.
es: Este conector no está disponible de forma predeterminada. Póngase en contacto con Opendatasoft para solicitar la activación de este conector en un dominio Opendatasoft determinado.
nl: Deze connector is standaard niet beschikbaar. Gelieve contact op te nemen met Opendatasoft om deze connector voor een welbepaald Opendatasoft-domein te activeren.

source: The Salesforce connector is used to extract data from the force.com REST API.
es: El conector de Salesforce se utiliza para extraer datos de la API REST force.com.
nl: De Salesforce-connector wordt gebruikt om gegevens uit de force.com REST API te extraheren.

source: Prerequisite
es: Requisito previo
nl: Voorvereiste

source: An application on the Salesforce instance must be created and configured. Please refer to the `Salesforce documentation <https://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/intro_understanding_username_password_oauth_flow.htm>`_ for more information.
es: Debe crearse y configurarse una aplicación en la instancia Salesforce. Consulte la `documentación de Salesforce <https://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/intro_understanding_username_password_oauth_flow.htm>`_ para obtener más información.
nl: Er moeten een applicatie op de Salesforce-instantie worden aangemaakt en geconfigureerd. Zie de `Salesforce documentatie <https://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/intro_understanding_username_password_oauth_flow.htm>`_ voor meer informatie.

source: Creation
es: Creación
nl: Aanmaak

source: Enter ``force://``, followed by the object name (e.g. ``force://GC_MY_Object__c``) in the Enter a URL area, when creating a new dataset.
es: Introduzca ``force://``, seguido del nombre de objeto (p. ej. ``force://GC_MY_Object__c``) en el área Especificar una dirección URL cuando cree un conjunto de datos nuevo.
nl: Voer ``force://`` in gevolgd door de naam van het voorwerp (bijv. ``force://GC_MY_Object__c``) in het veld "Een URL invoeren" bij het aanmaken van een nieuwe dataset.

source: Press Enter, or click the + button.
es: Pulse Intro o haga clic en el botón +.
nl: Druk op Enter of klik op de knop "+".

source: Configuration
es: Configuración
nl: Configuratie

source: Name
es: Nombre
nl: Naam

source: Description
es: Descripción
nl: Omschrijving

source: Usage
es: Uso
nl: Gebruik

source: Client Id
es: ID de cliente
nl: Klant-ID

source: Consumer key from the connected application definition.
es: La clave de consumidor de la definición de aplicación conectada.
nl: Sleutel van de consument uit de definitie van de verbonden applicatie.

source: Indicate the client ID in the textbox.
es: Indique el ID de cliente en el cuadro de texto.
nl: Vermeld het Klant ID in het tekstvak.

source: Client Secret
es: Secreto de cliente
nl: Klantgeheim

source: Consumer Secret from the connected application definition.
es: El secreto de consumidor de la definición de aplicación conectada.
nl: Klant Geheim uit de definitie van de verbonden applicatie.

source: Indicate the client secret in the textbox.
es: Indique el secreto de cliente en el cuadro de texto.
nl: Vermeld het klantgeheim in het tekstvak.

source: Username
es: Nombre de usuario
nl: Gebruikersnaam

source: End-user’s username.
es: El nombre de usuario del usuario final.
nl: De gebruikersnaam van de eindgebruiker.

source: Indicate the username in the textbox.
es: Indique el nombre de usuario en el cuadro de texto.
nl: Vermeld de gebruikersnaam in het tekstvak.

source: Password
es: Contraseña
nl: Wachtwoord

source: End-user’s password.
es: La contraseña del usuario final.
nl: Wachtwoord van de eindgebruiker.

source: Indicate the password in the textbox.
es: Indique la contraseña en el cuadro de texto.
nl: Vermeld het wachtwoord in het tekstvak.

source: Security Token
es: Token de seguridad
nl: Veiligheidstoken

source: End-user’s security token.
es: El token de seguridad del usuario final.
nl: Veiligheidstoken van de eindgebruiker.

source: Indicate the security token in the textbox.
es: Indique el token de seguridad en el cuadro de texto.
nl: Vermeld het veiligheidstoken in het tekstvak.

source: Use Sandbox
es: Utilizar el espacio aislado
nl: Gebruik Sandbox

source: To use the Salesforce sandbox for tests.
es: Para utilizar el espacio aislado de Salesforce para las pruebas.
nl: Om de Salesforce sandbox te gebruiken voor tests.

source: By default, the box is not checked. Check the box to use the sandbox.
es: De forma predeterminada, la casilla no está marcada. Marque la casilla para utilizar el espacio aislado.
nl: Standaard is dit vakje niet aangevinkt. Vink het vakje aan om de sandbox te gebruiken.

source: Filtered Fields
es: Campos filtrados
nl: Gefilterde velden

source: Fields to retrieve from the object.
es: Los campos que se recuperarán del objeto.
nl: Velden die moeten worden opgehaald uit het voorwerp.

source: Indicate the name of the field in the textbox. Relationships can be followed with the following notation: ``GC_OBO_Referential__r.Name``.
es: Indique el nombre del campo en el cuadro de texto. Las relaciones pueden ir seguidas de la notación siguiente: ``GC_OBO_Referential__r.Name``.
nl: Vermeld de naam van het veld in het tekstvak. Relaties kunnen worden gevolgd met de volgende notering: ``GC_OBO_Referential__r.Name``.
