Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/04_configuring_a_source/connectors/xml.po
Languages: de, nl

source: XML connector
de: XML-Konnektor

source: The XML connector is used for XML (.xml) files.
de: Der XML-Konnektor wird für XML-Dateien (.xml) verwendet.
nl: De XML-connector wordt gebruikt voor XML (.xml) bestanden.

source: This connector creates records from an arbitrary XML structure by converting all elements at a specific depth (optionnally filtered by tag) to a set of records. For each element converted to a record, both attributes, enclosed tags and content are converted to fields. Complex data inside fields is converted to a JSON representation containing both attributes and content.
de: Dieser Konnektor erzeugt Einträge aus einer beliebigen XML-Struktur, indem er alle Elemente bei einer bestimmten Tiefe (optional mit einem Tag gefiltert) zu einem Satz von Einträgen umwandelt. Für jedes Element, das in einen Eintrag umgewandelt wird, werden die beiden Attribute, die eingeschlossenen Tags und der Inhalt, in Felder konvertiert. Komplexe Daten innerhalb der Felder werden in eine JSON-Darstellung konvertiert, die beide Attribute und den Inhalt beinhaltet.
nl: Deze connector maakt records aan vanuit een willekeurige XML-structuur door alle elementen met een specifieke diepte (optioneel gefilterd per tag) te converteren naar een reeks records. Voor elk element dat wordt geconverteerd naar een record, worden zowel attributen, omsloten tags en content geconverteerd naar velden. Complexe gegevens in velden worden geconverteerd naar een JSON-weergave die zowel attributen als content bevat.

source: The XML connector can also read RDF (.rdf) files.
de: Der XML-Konnektor kann auch RDF-Dateien (.rdf) lesen.
nl: De XML-connector kan ook RDF (.rdf) bestanden lezen.

source: Creation
de: Erstellung
nl: Aanmaak

source: See :doc:`how to source a file</publishing_data/01_creating_a_dataset/sourcing_data>`.
de: Siehe :doc:`eine Datei als Quelle auswählen</publishing_data/01_creating_a_dataset/sourcing_data>`.
nl: Zie :doc:`how to source a file</publishing_data/01_creating_a_dataset/sourcing_data>`.

source: Configuration
de: Konfiguration
nl: Configuratie

source: Description
de: Beschreibung
nl: Omschrijving

source: Usage
de: Verwendung
nl: Gebruik

source: Depth of extracted elements
de: Tiefe der extrahierten Elemente
nl: Diepte van geëxtraheerde elementen

source: Depth of the tags that must be converted to records.
de: Tiefe der Tags, die in Einträge umgewandelt werden müssen.
nl: Diepte van de tags die geconverteerd moeten worden naar records.

source: Indicate the depth of the repeated tag in the textbox (e.g. ``3``).
de: Geben Sie die Tiefe des wiederholten Tags in der Textbox an (z.B. ``3``).
nl: Vermelde diepte van de herhaalde tag in het tekstvak (bijv. "3").

source: Extract filename
de: Dateinamen extrahieren
nl: Extraheer bestandsnaam

source: Creates a new column with the name of the source file.
de: Es wird eine neue Spalte mit dem Namen der Quelldatei erstellt.
nl: Maakt een nieuwe kolom aan met de naam van de bronbestand;

source: By default, the box is not checked. Check the box to extract filename in an added column.
de: Standardmäßig ist das Kontrollkästchen nicht markiert. Markieren Sie das Kontrollkästchen, um den Dateinamen in einer hinzugefügten Spalte zu extrahieren.
nl: Standaard is het vakje niet aangevinkt. Vink het vakje aan om de bestandsnaam te extraheren in een toegevoegde kolom.

source: Number of parents to get attributes from
de: Anzahl der übergeordneten Elemente, von denen Attribute abgerufen werden können
nl: Aantal ouders om attributen van te krijgen

source: If the enclosing tags contain relevant attributes, use this option to add them in the records.
de: Wenn die einschließenden Tags relevante Attribute enthalten, verwenden Sie diese Option, um sie den Einträgen hinzuzufügen.
nl: Wanneer de omsloten tags relevante attributen omvatten, gebruik dan deze optie om ze toe te voegen in de records.

source: Indicate the number of parent tags to get attributes from (e.g. ``2``).
de: Geben Sie die Anzahl der übergeordneten Tags an, von denen Attribute abgerufen werden sollen (z.B. ``2``).
nl: Vermeld het aantal parent tags om attributen van te krijgen (bijv. "2").

source: Tag of extracted elements
de: Tag der extrahierten Elemente
nl: Tag van geëxtraheerde elementen

source: If irrelevant tags are at the same depth as the extracted elements, use this option to only filter relevant tags.
de: Befinden sich irrelevante Tags bei derselben Tiefe wie die extrahierten Elemente, können Sie diese Option nutzen, um nur relevante Tags zu filtern.
nl: Wanneer irrelevante tags dezelfde diepte hebben als de geëxtraheerde elementen, gebruik dan deze optie om enkel relevante tags te filteren.

source: Indicate the tag to extract (e.g. ``item``). If left empty, all tags at the specified depth will be converted into records.
de: Geben Sie das zu extrahierende Tag an (z.B. ``Element``). Wird das Feld leer gelassen, werden alle Tags in der angegebenen Tiefe in Einträge umgewandelt.
nl: Vermeld de tag die geëxtraheerd moet worden (bijv. "item"). Wanneer dit leeg wordt gelaten, worden alle tags met de gespecificeerde diepte geconverteerd naar records.

source: Technical specifications
de: Technische Daten
nl: Technische specificaties

source: Field creation
de: Felderstellung
nl: Aanmaak van een veld

source: The policy for creating fields from an item is defined as in the example below.
de: Die Richtlinie zum Erstellen von Feldern aus einem Element ist wie im folgenden Beispiel definiert.
nl: Het beleid voor het aanmaken van velden vanuit een item staat gedefinieerd zoals in onderstaand voorbeeld.

source: **attribute**
de: **Attribut**
nl: **attribuut**

source: **other_attribute**
de: **anderes_Attribut**

source: **indicator**
de: **Indikator**

source: **country**
de: **Land**
nl: **land**

source: **decimal**
de: **dezimal**
nl: **decimaal**

source: **content**
de: **Inhalt**

source: attribute value
de: Attributwert
nl: waarde van een attribuut

source: other attribute value
de: anderer Attributwert
nl: waarde van een andere attibuut

source: GDP per capita
de: Pro-Kopf-BIP
nl: bbp per hoofd van de bevolking

source: Andean Region
de: Andenregion

source: 2nd data tag
de: 2. Daten-Tag
nl: tag van 2de data

source: Text only
de: Nur Text
nl: Enkel tekst

source: JSON representation
de: JSON-Darstellung
nl: JSON-weergave

source: Complex data inside fields is converted to JSON as per the example below.
de: Komplexe Daten innerhalb der Felder werden in eine JSON-Darstellung konvertiert, wie im unteren Beispiel dargestellt.
nl: Complexe data in velden wordt geconverteerd naar een JSON zoals in onderstaand voorbeeld..

source: Examples
de: Beispiele
nl: Voorbeelden

source: **Example 1:**
de: **Beispiel 1:**
nl: **Voorbeeld 1:**

source: In this example:
de: In diesem Beispiel:
nl: In dit voorbeeld:

source: depth=2 because ``wb:data`` is the 2nd tag in its path (``wb:rows/wb:data``)
de: Tiefe=2 denn``wb:data`` ist der 2. Tag im Pfad (``wb:rows/wb:data``)
nl: depth=2 omdat ``wb:data`` de 2de tag is in dit pad (``wb:rows/wb:data``)

source: tag filtering is not necessary because all elements at this depth are records
de: Eine Tag-Filterung ist nicht notwendig, da alle Elemente in dieser Tiefe Einträge sind
nl: het filteren van tags is niet noodzakelijk omdat alle elementen op deze diepte records zijn

source: Resulting dataset:
de: Resultierender Datensatz:
nl: Resulterende dataset:

source: wb:indicator
de: wb:Indikator

source: wb:country
de: wb:Land

source: wb:date
de: wb:Datum

source: wb:value
de: wb:Wert

source: wb:decimal
de: wb:dezimal

source: {"#text": "GDP per capita (2005 USD)", "@id": "6.0.GDPpc"}
de: {"#text": "Pro-Kopf-BIP (2005 USD)", "@id": "6.0.GDPpc"}
nl: {"#text": "bbp per hoofd van de bevolking (2005 USD)", "@id": "6.0.GDPpc"}

source: {"#text": "Andean Region", "@id": "L5"}
de: {"#text": "Andenregion", "@id": "L5"}

source: {"#text": "Bolivia", "@id": "BO"}
de: {"#text": "Bolivien", "@id": "BO"}

source: **Example 2:**
de: **Besipiel 2:**
nl: **Voorbeeld 2:**

source: Note: the XML structure of this document is complex so automatic parameters detection won't be able to guess the proper depth. The extractor must be manually configured.
de: Hinweis: Die XML-Struktur dieses Dokuments ist komplex, die automatische Parametererkennung also nicht in der Lage ist, die richtige Tiefe zu erkennen. Der Extraktor muss manuell konfiguriert werden.
nl: Opmerking: de XML-structuur van dit document is complex, dus zou de automatische detectie van parameters niet mogelijk zijn om de gepaste diepte te raden. De extractor moet manueel geconfigureerd worden.

source: depth=3 because ``item`` is the 3rd tag in its path (``shoppingList/basket/item``)
de: Tiefe=3 denn ``item`` ist der 3. Tag im Pfad (``shoppingList/basket/item``)
nl: diepte=3 omdat ``item`` de 3de tag is in dit pad (``shoppingList/basket/item``)

source: tag filtering on ``item`` is necessary because ``itemCount`` and ``totalQuantity`` are also at depth=3 but not relevant
de: Eine Tag-Filterung bei ``item`` ist notwendig, weil ``itemCount`` und ``totalQuantity`` sich ebenfalls bei Tiefe=3 befinden, jedoch nicht relevant sind
nl: het filteren van tags op ``item`` is noodzakelijk omdat ``itemCount`` en ``totalQuantity`` ook op de diepte=3 staan maar niet relevant zijn

source: quantity
de: Menge
nl: aantal

source: potato
de: Kartoffel
nl: aardappe

source: banana
de: Banane
nl: banaan

source: tomato
de: Tomate
nl: tomaat

source: Name
nl: Naam

source: name
nl: naam
