Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/03_scheduling_updates/scheduling_updates.po
Languages: de, es, fr, it, nl

source: If the records have been received correctly, the server will send the following response.
de: Wenn die Einträge korrekt empfangen wurden, sendet der Server die folgende Nachricht.
es: Si los registros se han recibido correctamente, el servidor enviará la respuesta siguiente.
fr: Si les enregistrements ont été correctement reçus, le serveur envoie la réponse suivante.
nl: Wanneer de records correct ontvangen geweest zijn, zal de server het volgende antwoord sturen.

source: If an error happened while trying to push a record, the response would specify the error.
de: Falls bei dem Versuch, einen Eintrag zu pushen, ein Fehler auftritt, wird dieser Fehler in der Antwort angegeben.
es: Si se ha producido un error al intentar insertar un registro, la respuesta especificará el error.
fr: Si une erreur se produit lorsque vous essayez de pousser un enregistrement, la réponse indiquera l'erreur.
nl: Wanneer er een fout is opgetreden tijdens het proberen pushen van een record, zal in het antwoord de fout gespecificeerd worden.

source: Realtime push requests are limited to a 5MB payload. A larger payload will trigger an error and should be split into several smaller requests instead.
de: Echtzeit-Push-Anfragen sind auf eine Datenmenge von 5 MB beschränkt. Ein größere Datenmenge verursacht einen Fehler und sollte daher in mehrere kleinere Anfragen aufgeteilt werden.
es: Las solicitudes push en tiempo real están limitadas a una carga útil de 5 MB. En caso de que la carga útil sea superior, se desencadenará un error y habrá que dividirla en varias solicitudes más pequeñas.
fr: Les requêtes de transmission en temps réel sont limitées à une charge utile de 5 Mo. Une erreur est déclenchée si ce seuil est dépassé ; la charge utile doit donc être répartie entre plusieurs requêtes de taille moins importante.
nl: Real time push-verzoeken zijn beperkt tot een payload van 5MB. Een grotere payload zal aanleiding geven tot een fout en dient in plaats daarvan te worden opgesplitst in verschillende kleinere verzoeken.

source: Pushing a field of type file
de: Pushen eines Felds oder einer Typ-Datei
es: Insertar un campo de tipo archivo
fr: Pousser un champ de type de fichier
it: Push di un campo di tipo immagine
nl: Een veld van een type bestand pushen

source: To push a field of type image, a JSON object containing the base64-encoded content and the MIME type of the file needs to be sent:
de: Um ein Feld vom Typ Bild zu pushen, muss ein JSON-Objekt mit dem Base64-kodierten Inhalt und dem MIME-Typ der Datei gesendet werden:
es: Para insertar un campo de tipo imagen, es preciso enviar un objeto JSON con el contenido con codificación Base 64 y el tipo MIME del archivo:
fr: Pour transmettre un champ de type image, un objet JSON contenant les données encodées en base64 et le type MIME du fichier doit être envoyé :
nl: Om een veld van het type afbeelding te pushen, moet een JSON-voorwerp dat de base64-encoded content en het MIME-type van het bestand bevat, worden opgestuurd:

source: Updating data by defining a unique key
de: Daten durch Definieren eines eindeutigen Schlüssels aktualisieren
es: Actualizar los datos definiendo una clave exclusiva
fr: Mettre à jour les données en définissant une clé unique
nl: Data updaten door het definiëren van een unieke sleutel

source: Sometimes, it is useful to update the existing records instead of pushing new ones. To set up such a system with the Opendatasoft platform, the fields used as a unique key must be marked as so.
de: In manchen Fällen ist es sinnvoll, die bestehenden Einträge zu aktualisieren, anstatt neue zu pushen. Zum Einrichten eines solchen Systems mit der Opendatasoft-Plattform müssen die Felder, die als eindeutiger Schlüssel verwendet werden sollen, als solche gekennzeichnet sein.
es: En ocasiones, es útil actualizar los registros existentes en lugar de simplemente insertar otros nuevos. Para configurar un sistema de este tipo con la plataforma Opendatasoft, los campos que se usarán a modo de clave exclusiva deben marcarse como tal.
fr: Parfois, il est utile de mettre à jour les enregistrements existants plutôt que d'en transmettre de nouveaux. Pour configurer un tel système avec la plateforme Opendatasoft, les champs utilisés en tant que clé unique doivent être marqués comme tel.
nl: Soms is het nuttig om de bestaande records te updaten in plaats van gewoon nieuwe te pushen. Om een dergelijk systeem binnen het Opendatasoft-platform op te zetten, moeten de velden die als unieke sleutel gebruikt zullen worden, als dusdanig gemarkeerd worden.

source: Procedure
de: Vorgehensweise
es: Procedimiento
fr: Procédure

source: To mark fields as a unique key, do the following:
de: Gehen Sie wie folgt vor, um Felder als eindeutigen Schlüssel zu markieren:
es: Para marcar campos a modo de clave exclusiva, siga estos pasos:
fr: Pour marquer des champs en tant que clé unique, procédez comme suit :
nl: Ga als volgt te werk om velden als een unieke sleutel te markeren:

source: In the preview area of the Processing tab, click the |icon-configuration| button of the field of your choice.
de: Klicken Sie im Vorschaubereich der Registerkarte "Verarbeitung" auf den Button |icon-configuration| des gewünschten Feldes.
es: En el área de vista previa de la ficha Procesadores, haga clic en el botón |icon-configuration| del campo que desee.
fr: Dans la zone d'aperçu de l'onglet Traitement, cliquez sur le bouton |icon-configuration| du champ de votre choix.
nl: Klik in de voorbeeldweergave van het tabblad Verwerken op de knop |icon-configuration| van het veld van uw keuze.

source: Select **Unique ID**.
de: Wählen Sie **Eindeutige ID**.
es: Seleccione **ID exclusivo**.
fr: Sélectionnez **ID unique**.
nl: Selecteer **Uniek ID**.

source: Save and publish the dataset.
de: Speichern und veröffentlichen Sie den Datensatz.
es: Guarde y publique el conjunto de datos.
fr: Enregistrez et publiez le jeu de données.
nl: Bewaar en publiceer de dataset.

source: If a new record whose key value is equal to an existing record is pushed, the new record will overwrite the old record.
de: Wenn ein neuer Eintrag, dessen Schlüsselwert mit einem bestehenden Eintrag übereinstimmt, übertragen wird, überschreibt der neue Eintrag den alten Eintrag.
es: Si se inserta un registro nuevo cuyo valor clave es igual a un registro existente, el registro nuevo sobrescribirá el antiguo.
fr: Si un nouvel enregistrement avec une valeur de clé égale à un enregistrement existant est transmis, le nouvel enregistrement remplace l'ancien enregistrement.
nl: Wanneer een nieuw record waarvan de sleutelwaarde gelijk is aan een bestaand record, wordt gepusht, zal het nieuwe record het oude record overschrijven.

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
nl: Voorbeeld

source: A dataset tracks the number of copies available for each book in a public library:
de: In einem Datensatz wird die Anzahl der verfügbaren Exemplare für jedes Buch in einer öffentlichen Bibliothek erfasst:
es: Un conjunto de datos hace el seguimiento del número de copias disponibles de cada uno de los libros de una biblioteca pública:
fr: Un jeu de données suit le nombre d'exemplaires disponibles pour chaque livre dans une bibliothèque municipale :
nl: Een dataset die het aantal kopieën opvolgt dat voor elk boek beschikbaar is in een openbare bibliotheek:

source: Suppose that this dataset contains two fields:
de: Nehmen wir an, dass dieser Datensatz zwei Felder enthält:
es: Supongamos que este conjunto de datos contiene 2 campos:
fr: Imaginons que ce jeu de données contient deux champs :
nl: Veronderstel dat deze dataset twee velden omvat:

source: ``isbn``, representing the `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ number of the book
de: ``isbn``, für die `ISBN-Nummer <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ des Buches
es: ``isbn``, que representa el número `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ del libro, y
fr: ``isbn``, qui représente le numéro `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ du livre
nl: ``isbn``, dat het `ISBN <https://en.wikipedia.org/wiki/International_Standard_Book_Number>`_ nummer van het boek vertegenwoordigt

source: ``number_of_copies`` tracking the current number of copies available in the library.
de: ``number_of_copies`` für die aktuelle Anzahl der in der Bibliothek verfügbaren Exemplare.
es: ``number_of_copies``, que hace el seguimiento del número actual de copias disponibles en la biblioteca.
fr: ``number_of_copies``, qui suit le nombre actuel d'exemplaires disponibles dans la bibliothèque.
nl: ``number_of_copies`` dat het huidig aantal kopieën dat beschikbaar is in de bibliotheek opvolgt.

source: In that case, it does not make sense to add one record for each new value of ``number_of_copies``. Instead, it would be better to set the new ``number_of_copies`` value to the record corresponding to the book ``isbn``.
de: In diesem Fall macht es keinen Sinn, für jeden neuen Wert von ``number_of_copies`` einen Eintrag hinzuzufügen. Stattdessen wäre es besser, den neuen ``number_of_copies`` Wert auf den Eintrag zu setzen, der dem Buch ``isbn`` entspricht.
es: En este caso, no tiene sentido añadir un registro para cada uno de los valores nuevos de ``number_of_copies``. Sería mucho mejor establecer el valor ``number_of_copies`` nuevo como el registro correspondiente al valor ``isbn`` del libro.
fr: Dans cette situation, ajouter un enregistrement pour chaque nouvelle valeur du champ ``number_of_copies`` n'est pas pertinent. Il serait plus judicieux de définir la nouvelle valeur ``number_of_copies`` sur l'enregistrement correspondant au champ ``isbn`` du livre.
nl: In dat geval zou het niet zinvol zijn om één record voor elke nieuwe waarde van ``number_of_copies`` toe te voegen. In plaats daarvan zou het beter zijn om de nieuwe ``number_of_copies`` waarde in te stellen voor het record dat overeenstemt met de ``isbn`` van het boek.

source: In this example, the unique key would be ``isbn`` because the rest of the data is linked to individual books, and these books are identified by the ISBN.
de: In diesem Beispiel wäre der eindeutige Schlüssel ``isbn``, da der Rest der Daten mit einzelnen Büchern verknüpft ist und diese Bücher durch die ISBN identifiziert werden.
es: En este ejemplo, la clave exclusiva sería ``isbn`` dado que los demás datos están vinculados con los libros individuales y estos se identifican por el ISBN.
fr: Dans cet exemple, la clé unique serait ``isbn``, car le reste des données est associé à chaque libre, et ces livres sont identifiés par l'ISBN.
nl: In dit voorbeeld zou de unieke sleutel ``isbn`` zijn omdat de rest van de data gekoppeld is aan individuele boeken en deze boeken geïdentificeerd worden door de ISBN.

source: If your dataset has ``isbn`` as the unique key and contains these two records:
de: Wenn Ihr Datensatz den ``isbn`` Wert als eindeutigen Schlüssel hat und diese beiden Einträge enthält:
es: Si el conjunto de datos tiene ``isbn`` como clave exclusiva y contiene estos 2 registros:
fr: Si vous jeu de données a ``isbn`` en tant que clé unique et contient ces deux enregistrements :
nl: Wanneer uw dataset ``isbn`` als unieke sleutel heeft en deze twee records bevat:

source: If somebody borrows a copy of Zen and the Art of Motorcycle Maintenance, and you push the following record:
de: Wenn jemand ein Exemplar von "Zen und die Kunst ein Motorrad zu warten" ausleiht und Sie den folgenden Eintrag übertragen:
es: Si alguien toma en préstamo una copia de ''Zen and the Art of Motorcycle Maintenance'' y se inserta el registro siguiente:
fr: Si quelqu'un emprunte un exemplaire de Traité du zen et de l'entretien des motocyclettes et que vous transmettez l'enregistrement suivant :
nl: Wanneer iemand een kopie van Zen en the Art of Motorcycle Maintenance leent en u het volgende record pusht:

source: You will still have two records, the first one being updated with the new value:
de: Dann haben Sie immer noch zwei Einträge, von denen der erste mit dem neuen Wert aktualisiert wird:
es: Seguirá habiendo 2 registros, el primero actualizado con el valor nuevo:
fr: Vous avez toujours deux enregistrements, le premier ayant été mis à jour avec la nouvelle valeur :
nl: U zal nog steeds twee records hebben, waarbij het eerste up-to-date wordt gebracht met de nieuwe waarde.

source: Deleting data
de: Daten löschen
es: Suprimir datos
fr: Supprimer des données
nl: Data verwijderen

source: Two endpoints allow for deleting a pushed records. One that uses the records values and one that uses the record ID.
de: Zwei Endpunkte ermöglichen das Löschen gepushter Einträge. Der eine verwendet Eintragswerte und der andere die Eintrags-ID.
es: Hay 2 puntos finales que permiten suprimir los registros insertados: uno utiliza los valores de registro; y otro, el ID de registro.
fr: Deux points d'entrée permettent de supprimer les enregistrements transmis. Le premier utilise les valeurs des enregistrements, tandis que le second utilise l'ID des enregistrements.
nl: Er zijn twee eindpunten die het mogelijk maken om gepushte records te verwijderen. Eén dat de waarden van records gebruikt en één dat het record-ID gebruikt.

source: Deleting data using the record values
de: Daten mithilfe von Eintragswerten löschen
es: Suprimir datos utilizando los valores de registro
fr: Supprimer des données à l'aide des valeurs des enregistrements
nl: Data verwijderen door recordwaarden te gebruiken

source: To delete a record knowing the record fields values, POST the record as if you were adding it for the first time, but replace ``/push/`` with ``/delete/`` in the push URL. If your push URL path is ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>``, then use instead ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>``.
de: Zum Löschen eines Eintrags bei bekannten Eintragsfeldwerten POSTEN Sie den Eintrag, als würden Sie ihn zum ersten Mal hinzufügen, ersetzen Sie dabei jedoch ``/push/`` durch ``/delete/`` in der Push-URL. Falls Ihr Push-URL-Pfad ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>`` lautet, verwenden Sie stattdessen ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>`` lautet.
es: Para suprimir un registro sabiendo los valores de los campos de registro, ejecute POST para el registro como si lo añadiera por primera vez, pero sustituya ``/push/`` por ``/delete/`` en la dirección URL de inserción. Si la ruta de dirección URL de inserción es ``/api/push/1.0/<ID_CONJUNTO_DATOS>/<ID_RECURSO>/push/?pushkey=<CLAVE_API_INSERCIÓN>``, utilice en su lugar ``/api/push/1.0/<ID_CONJUNTO_DATOS>/<ID_RECURSO>/delete/?pushkey=<CLAVE_API_INSERCIÓN>``.
fr: Pour supprimer un enregistrement dont vous connaissez les valeurs des champs, utilisez la méthode POST sur l'enregistrement comme si vous l'ajoutiez pour la première fois, mais remplacez ``/push/`` par ``/delete/`` dans l'URL de transmission. Si votre chemin d'accès d'URL de transmission est ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>``, utilisez alors ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>``.
nl: Om een record, waarvan u de waarden van de recordvelden kent, te verwijderen, POST het record alsof u dit voor de eerste keer zou toevoegen, maar vervang ``/push/`` door ``/delete/`` in de push-URL. Wanneer uw push URL-pad ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/push/?pushkey=<PUSH_API_KEY>`` is, gebruik dan in plaats daarvan ``/api/push/1.0/<DATASET_ID>/<RESSOURCE_ID>/delete/?pushkey=<PUSH_API_KEY>``.

source: Here is a minimal example to delete the record we pushed earlier:
de: Hier ist ein minimales Beispiel für das Löschen des Eintrags, den wir zuvor übertragen haben:
es: A continuación se muestra un ejemplo mínimo de supresión del registro insertado anteriormente:
fr: Voici un exemple simple illustrant la suppression de l'enregistrement que nous avons transmis précédemment :
nl: Hier is een minimaal voorbeeld om het record dat we eerder hebben gepusht, te verwijderen:

source: Deleting data using the record ID
de: Daten mithilfe der Eintrags-ID löschen
es: Suprimir datos utilizando el ID de registro
fr: Supprimer des données à l'aide de l'ID des enregistrements
nl: Data verwijderen door het record-ID te gebruiken

source: If you know the record ID of the record you want to delete, make a GET request to the push URL by replacing ``/push/`` with ``/<RECORD_ID>/delete/``:
de: Wenn Sie die Eintrags-ID des Eintrags kennen, den Sie löschen möchten, führen Sie einfach eine GET-Anfrage an die URL aus, indem Sie ``/push/`` durch ``/<RECORD_ID>/delete/`` ersetzen:
es: Si sabe el ID de registro del registro que desea suprimir, basta con efectuar una solicitud GET para la dirección URL que se obtiene sustituyendo ``/push/`` por ``/<ID_REGISTRO>/delete/``:
fr: Si vous connaissez l'ID de l'enregistrement que vous souhaitez supprimer, effectuez une requête GET sur l'URL de transmission en remplaçant ``/push/`` par ``/<RECORD_ID>/delete/`` :
nl: Wanneer u het record-ID van het record dat u wilt verwijderen, kent, doe dan gewoon een GET-aanvraag aan de push URL door ``/push/`` te vervangen door ``/<RECORD_ID>/delete/``:

source: Get notified in case of inactivity
de: Benachrichtigung bei Inaktivität
es: Recibir una notificación en caso de inactividad
fr: Être notifié en cas d'inactivité
it: Impostazione della notifica in caso di inattività
nl: Krijg een bericht in geval van inactiviteit

source: If you expect a system to push data to the platform often, you may want to be notified if the platform has received no record in a while.
de: Wenn Sie davon ausgehen, dass ein bestimmtes System häufig Daten an die Plattform sendet, möchten Sie vielleicht benachrichtigt werden, wenn die Plattform seit einiger Zeit keinen Eintrag mehr erhalten hat.
es: Si prevé que un sistema inserte datos en la plataforma con frecuencia, tal vez desee recibir una notificación si la plataforma no recibe ningún registro durante un tiempo.
fr: Si vous vous attendez à ce que des données soient fréquemment transmises à la plateforme, il peut être utile de recevoir une notification dans le cas où la plateforme n'aurait reçu aucun enregistrement depuis un certain temps.
nl: Wanneer u verwacht dat een systeem vaak data naar het platform zal pushen, is het mogelijk dat u hiervan in kennis wordt gesteld wanneer er al een tijdje geen record werd ontvangen door het platform.

source: To get notified, perform the following steps:
de: Gehen Sie wie folgt vor, um benachrichtigt zu werden:
es: Para recibir una notificación, siga estos pasos:
fr: Procédez comme suit pour recevoir des notifications :
nl: Voer de volgende stappen uit om in kennis te worden gesteld:

source: In **Catalog** > **Datasets**, click the desired dataset.
de: Klicken Sie unter **Katalog** > **Datensätze** auf den gewünschten Datensatz.
es: En **Catálogo** > **Conjuntos de datos**, haga clic en el conjunto de datos deseado.
fr: Dans **Catalogue** > **Jeux de données**, cliquez sur le jeu de données souhaité.
nl: Klik in **Catalogus** > **Datasets** op de gewenste dataset.

source: On the desired source, select |icon-action-menu| > **View source**.
de: Wählen Sie bei der gewünschten Quelle |icon-action-menu| > **Quelle anzeigen**.
es: En el origen deseado, seleccione |icon-action-menu| > **Ver origen**.
fr: Sélectionnez |icon-action-menu| > **Afficher source** sur la source désirée.
nl: Selecteer voor de gewenste bron |icon-action-menu| > **Bron bekijken**.

source: Click **Alert management**.
de: Klicken Sie auf **Alarmmanagement**.
es: Haga clic en **Gestión de alertas**.
fr: Cliquez sur **Gestion des alertes**.
nl: Klik op **Waarschuwingsbeheer**.

source: In the dialog box that opens, configure the alerting parameters:
de: Konfigurieren Sie in dem sich öffnenden Dialogfeld die Benachrichtigungsparameter:
es: En el cuadro de diálogo que se abre, configure los parámetros de las alertas:
fr: Dans la boîte de dialogue qui s'affiche, configurez les paramètres relatifs aux alertes :
nl: Configureer in het dialoogvenster dat wordt geopend de waarschuwingsparameters:

source: Select the **Alerting** check box.
de: Aktivieren Sie das Kontrollkästchen **Benachrichtigung**.
es: Seleccione la casilla **Alertas**.
fr: Cochez la case **Alertes**.
nl: Selecteer het aanvinkvakje **Waarschuwen**.

source: Enter a threshold in minutes in the **Inactivity alert** check box.
de: Geben Sie im Kontrollkästchen **Inaktivitätsalarm** einen Grenzwert in Minuten ein.
es: Especifique un umbral en minutos en la casilla **Alerta de inactividad**.
fr: Spécifiez un seuil en minutes dans la case **Alerte d'inactivité**.
nl: Voer een tijddrempel in minuten in in het aanvinkvakje **Inactiviteitswaarschuwing**.

source: If a time span greater than the threshold has occurred during which no record has been received, you will receive an email.
de: Wenn die Zeitspanne den angegebenen Wert überschreitet und kein Eintrag eingegangen ist, erhalten Sie eine E-Mail.
es: Si no recibe ningún registro durante un intervalo de tiempo superior al umbral, se le enviará un correo electrónico.
fr: Si aucun enregistrement n'a été reçu pendant une période supérieure au délai défini, vous recevrez un e-mail.
nl: Wanneer een periode verstreken is die langer is dan de drempel en waarin geen enkel record werd ontvangen, ontvangt u een e-mail.

source: Unpublishing and disabling the API
de: Aufheben der Veröffentlichung und Deaktivierung der API
es: Cancelar la publicación y desactivar la API
fr: Dépublier et désactiver l'API
nl: De publicatie van de API ongedaan maken en deze deactiveren

source: When unpublishing your dataset, existing records are not kept for the next time the dataset is published.
de: Wenn Sie die Veröffentlichung Ihres Datensatzes aufheben, werden die bestehenden Datensätze nicht für die nächste Veröffentlichung des Datensatzes beibehalten.
es: Al cancelar la publicación del conjunto de datos, no se conservarán los registros existentes para la próxima vez que se publique el conjunto de datos.
fr: Lorsque vous dépubliez votre jeu de données, les enregistrements existants ne sont pas conservés pour la prochaine publication du jeu de données.
nl: Wanneer u de publicatie van uw dataset ongedaan maakt, worden bestaande records niet bijgehouden voor de volgende keer dat de dataset wordt gepubliceerd.

source: To avoid getting new data, perform the following steps:
de: Gehen Sie wie folgt vor, um keine neuen Daten zu erhalten:
es: Para evitar obtener datos nuevos, siga estos pasos:
fr: Procédez comme suit pour éviter d'obtenir de nouvelles données :
nl: Voer de volgende stappen uit om te voorkomen dat u nieuwe data krijgt:

source: On the desired source, select |icon-action-menu| > **Disable push**.
de: Wählen Sie bei der gewünschten Quelle |icon-action-menu| > **Push deaktivieren**.
es: En el origen deseado, seleccione |icon-action-menu| > **Desactivar inserción**.
fr: Sélectionnez |icon-action-menu| > **Désactiver le Push** sur la source désirée.
nl: Op de gewenste bron, selecteer |icon-action-menu| > **Push deactiveren**.
