Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/03_scheduling_updates/scheduling_updates.po
Languages: de, es, fr, it, nl

source: Keeping data up to date
de: Daten auf dem neuesten Stand halten
es: Mantener los datos actualizados
fr: Maintenir les données à jour
it: Come mantenere aggiornati i tuoi dati
nl: Data up-to-date houden

source: The Opendatasoft platform makes it possible, in the very same data catalog, to handle completely static datasets (which need to be published only once) and live datasets (which need to be regularly updated).
de: Mit der Opendatasoft-Plattform ist es möglich, im selben Datenkatalog ganze statische Datensätze (die nur einmal veröffentlicht werden müssen) sowie Live-Datensätze (die regelmäßig aktualisiert werden müssen) zu bearbeiten.
es: La plataforma Opendatasoft permite, dentro del mismo catálogo de datos, manejar conjuntos de datos totalmente estáticos (que necesitan publicarse una sola vez) y conjuntos de datos dinámicos (que precisan actualizaciones periódicas).
fr: La plateforme Opendatasoft permet, au sein d'un même catalogue de données, de gérer des jeux de données entièrement statiques (qui n'ont besoin d'être publiés qu'une seule fois) et des jeux de données en temps réel (qui doivent être régulièrement mis à jour).
nl: Het Opendatasoft-platform maakt het mogelijk om, in precies dezelfde datacatalogus, statische datasets (die slechts één keer moeten worden gepubliceerd) en live datasets (die regelmatig up-to-date moeten worden gebracht), volledig te behandelen.

source: Two different mechanisms are made available to handle datasets refresh:
de: Es stehen zwei verschiedene Mechanismen zur Bearbeitung von Datensatzaktualisierungen zur Verfügung:
es: Para llevar a cabo la renovación de los conjuntos se datos, dispone de 2 mecanismos diferentes:
fr: Vous disposez de deux mécanismes pour gérer l'actualisation des jeux de données :
nl: Er worden twee mechanismen beschikbaar gesteld om het hernieuwen van datasets uit te voeren:

source: Scheduling consists of having a dataset being automatically republished at fixed intervals. This mode is most useful for datasets with a remote resource that is regularly updated.
de: Der Zeitplan: Er ermöglicht eine automatische Wiederveröffentlichung von Datensätzen in festgelegten Abständen. Dieser Modus ist sehr nützlich bei Datensätzen aus einer Remote-Quelle, die regelmäßig aktualisiert wird.
es: La planificación consiste en volver a publicar automáticamente un conjunto de datos en intervalos fijos. Este modo resulta de especial utilidad para los conjuntos de datos con un recurso remoto de actualización periódica.
fr: La planification, qui consiste à republier automatiquement un jeu de données à intervalles fixes. Ce mode se révèle particulièrement utile pour les jeux de données dotés d'une ressource distante régulièrement mise à jour.
nl: Planning bestaat erin dat een dataset met vaste tussenpozen automatisch opnieuw wordt gepubliceerd. Dit mechanisme is het nuttigst voor datasets met een bron op afstand die regelmatig up-to-date wordt gebracht.

source: Pushing realtime data on the Opendatasoft platform using a dedicated API endpoint. This mode is most useful when the data can be sent directly by the system that produces the data points, such as a computer program sending event metrics or a set of sensors sending their readings.
de: Übertragung von Echtzeit-Daten mit einem speziellen API-Endpunkt auf die Opendatasoft-Plattform. Dieser Modus ist sehr nützlich, wenn die Daten direkt vom System gesendet werden können, das die Datenpunkte generiert, wie etwa ein Computerprogramm, das Ereignismetriken sendet bzw. ein Sensorensatz, der seine Messwerte sendet.
es: El segundo consiste en insertar datos en tiempo real en la plataforma Opendatasoft mediante un extremo de API específico. Este método resulta de especial utilidad cuando los datos pueden ser enviados directamente por el sistema que produce los puntos de datos (como un programa informático que envía métricas de eventos o un conjunto de sensores que envían lecturas).
fr: La transmission des données en temps réel sur la plateforme Opendatasoft par l'intermédiaire du point d'entrée d'une API dédiée. Ce mode se révèle particulièrement utile lorsque les données peuvent être directement envoyées par le système produisant les points de données, par exemple un logiciel qui envoie des métriques d'événement ou un ensemble de sondes qui envoie ses mesures.
nl: Data wordt in real time op het Opendatasoft-platform gepusht door gebruik te maken van een speciaal API-eindpunt. Dit mechanisme is het nuttigst wanneer de data rechtstreeks wordt gestuurd door het systeem dat de datapunten produceert, zoals een computerprogramma dat cijfers van een evenement doorstuurt of een reeks sensoren die hun afleesresultaten doorsturen.

source: Using scheduling to keep a dataset up to date
de: Verwenden des Zeitplan-Modus, um einen Datensatz auf dem neuesten Stand zu halten
es: Utilizar la planificación para mantener actualizado un conjunto de datos
fr: Utiliser la planification pour maintenir un jeu de données à jour
it: Uso della pianificazione per l'aggiornamento dei dati
nl: Planning gebruiken om een dataset up-to-date te houden

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: The availability of this feature depends on the license of the Opendatasoft domain.
de: Die Verfügbarkeit dieser Funktion hängt von der Lizenz der Opendatasoft-Domain ab.
es: La disponibilidad de esta función depende de la licencia del dominio Opendatasoft.
fr: La disponibilité de cette fonctionnalité dépend de la licence du domaine Opendatasoft.
nl: De beschikbaarheid van deze functionaliteit hangt af van de licentie van het Opendatasoft-domein.

source: Datasets can be automatically republished at fixed intervals.
de: Datensätze können automatisch in bestimmten Abständen neu veröffentlicht werden.
es: Los conjuntos de datos pueden volver a publicarse automáticamente en intervalos fijos.
fr: Les jeux de données peuvent être republiés automatiquement à intervalles fixes.
nl: Datasets kunnen met vaste tussenpozen automatisch opnieuw worden gepubliceerd.

source: This solution is the easiest to implement. It does not require any development, only a remote source and some settings in the dataset configuration.
de: Diese Lösung ist am einfachsten zu implementieren. Sie erfordert keinerlei Entwicklung, sondern lediglich eine Remote-Quelle und ein paar Einstellungen in der Datensatzkonfiguration.
es: Esta solución es la más fácil de implementar. No requiere ningún desarrollo, únicamente un origen remoto y una serie de valores en la configuración del conjunto de datos.
fr: Cette solution est la plus facile à mettre en œuvre. Elle ne nécessite aucun développement, seulement une source distante et quelques paramètres dans la configuration du jeu de données.
nl: Deze oplossing is het gemakkelijkst om te implementeren. Ze vereist geen enkele ontwikkeling, enkel een bron op afstand en enkele instellingen in de datasetconfiguratie.

source: Adding a remote source
de: Eine Remote-Quelle hinzufügen
es: Añadir un origen remoto
fr: Ajouter une ressource distante
nl: Een bron op afstand toevoegen

source: To schedule a dataset, you need to add a remote source, specified as a URL (HTTP or FTP) to a file or configure a remote service. For more information, see :doc:`../01_creating_a_dataset/retrieving_file` and :doc:`../01_creating_a_dataset/configuring_remote_service`.
de: Um einen Datensatz zu planen, müssen Sie eine Remote-Quelle hinzufügen, die als URL (HTTP oder FTP) zu einer Datei angegeben wird, oder einen Remote-Dienst konfigurieren. Weitere Informationen finden Sie unter :doc:`../01_creating_a_dataset/retrieving_file` und :doc:`../01_creating_a_dataset/configuring_remote_service`.
es: Para planificar un conjunto de datos, tiene que añadir un origen remoto, especificado como una dirección URL (HTTP o FTP) para un archivo o configurar un servicio remoto. Para obtener más información, consulte :doc:`../01_creating_a_dataset/retrieving_file` y :doc:`../01_creating_a_dataset/configuring_remote_service`.
fr: Pour planifier un jeu de données, vous devez ajouter une ressource distante, spécifiée sous la forme d'une URL (HTTP ou FTP) vers un fichier, ou configurer un service distant. Pour plus d'informations, consultez :doc:`../01_creating_a_dataset/retrieving_file` et :doc:`../01_creating_a_dataset/configuring_remote_service`.
nl: Om een dataset te plannen, moet u een bron op afstand toevoegen, die gespecificeerd wordt als een URL (HTTP of FTP) naar een bestand, of een service op afstand configureren. Voor meer informatie, zie :doc:`../01_creating_a_dataset/retrieving_file` en :doc:`../01_creating_a_dataset/configuring_remote_service`.

source: Specifying scheduling interval
de: Festlegen des Zeitplanintervalls
es: Especificar el intervalo de planificación
fr: Spécifier un intervalle de planification
it: Impostazione dell'intervallo di pianificazione
nl: Planningsinterval specificeren

source: Once you saved a dataset with a remote source, the **Scheduling** tab is activated:
de: Sobald Sie einen Datensatz mit einer Remote-Quelle gespeichert haben, wird die Registerkarte **Zeitplan** aktiviert:
es: Una vez que guarde un conjunto de datos con un origen remoto, se activa la ficha **Planificación**:
fr: Une fois que vous avez enregistré un jeu de données avec une ressource distante, l'onglet **Planification** est activé :
nl: Eenmaal een dataset is opgeslagen met een bron op afstand, wordt het tabblad **Planning** geactiveerd:

source: From this tab, you can add as many schedules as you want. For example, if it fits your needs, you could decide to schedule a dataset to be reprocessed every Monday morning and every Wednesday afternoon.
de: In dieser Registerkarte können Sie so viele Zeitpläne hinzufügen, wie Sie möchten. Wenn Sie wünschen, können Sie zum Beispiel festlegen, dass ein Datensatz jeden Montagmorgen und jeden Mittwochnachmittag neu verarbeitet wird.
es: En esta ficha, puede añadir tantas planificaciones como desee. Por ejemplo, según sus necesidades, puede decidir planificar que se vuelva a procesar un conjunto de datos todos los lunes por la mañana y miércoles por la tarde.
fr: Depuis cet onglet, vous pouvez ajouter autant de planifications que vous voulez. Par exemple, en adéquation avec vos besoins, vous pouvez choisir de planifier le retraitement d'un jeu de données tous les lundis matins et tous les mercredis après-midi.
nl: Vanuit dit tabblad kunt u zoveel plannen toevoegen als u wilt. Bijvoorbeeld, indien dit voor u aangewezen is, zou u kunnen beslissen om te plannen dat een dataset elke maandagochtend en elke woensdagnamiddag opnieuw wordt verwerkt.

source: By default, the minimum scheduling interval is the day. Please contact Opendatasoft's support if you need minute-level scheduling on your domain.
de: Standardmäßig ist das minimale Zeitplan-Intervall der Tag. Bitte wenden Sie sich an den Support von Opendatasoft, wenn Sie eine minutengenaue Planung für Ihre Domain benötigen.
es: De forma predeterminada, el intervalo de planificación mínimo es el día. Póngase en contacto con el servicio de soporte de Opendatasoft si necesita una planificación a nivel de minutos en el dominio.
fr: Par défaut, l'intervalle de planification minimale est une journée. Veuillez contacter le support d'Opendatasoft si vous avez besoin d'une planification exprimée en minutes sur votre domaine.
nl: Standaard is de minimale planningsinterval een dag. Gelieve de support van Opendatasoft te contacteren indien u een planning van één minuut nodig heeft voor uw domein.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Schedules are defined to run in the timezone of Paris, France:
de: Die Zeitpläne werden auf Grundlage der Zeitzone von Paris, Frankreich, festgelegt:
es: Las planificaciones están definidas para ejecutarse en la zona horaria de París, Francia:
fr: Les planifications sont définies pour s'exécuter sur le fuseau horaire de Paris, France :
nl: Plannen zijn gedefinieerd om te lopen op de tijdzone van Parijs, Frankrijk:

source: In standard time, schedules run on GMT+1 (Central European Time).
de: In der Standardzeit basieren die Zeitpläne auf GMT+1 (Mitteleuropäische Zeit).
es: En el horario estándar, las planificaciones se ejecutan en GMT+1 (Hora Central Europea).
fr: En heure normale, les planifications sont exécutées sur le fuseau horaire GMT+1 (heure normale d'Europe centrale).
nl: In standaard tijd lopen plannen op GMT+1 (Central European Time).

source: In the summer months, schedules run on GMT+2 (Central European Summer Time).
de: In den Sommermonaten richtet sich der Zeitplan nach GMT+2 (Mitteleuropäische Sommerzeit).
es: En los meses de verano, las planificaciones se ejecutan en GMT+2 (Hora Central Europea de Verano).
fr: En été, les planifications sont exécutées sur le fuseau horaire GMT+2 (heure d'été d'Europe centrale).
nl: In de zomermaanden lopen de plannen op GMT+2 (Central European Summer Time).

source: Pushing realtime data
de: Echtzeitdaten übertragen
es: Insertar datos en tiempo real
fr: Transmettre des données en temps réel
nl: Real time data pushen

source: For some types of data, it can be helpful to push data instead of the more traditional model of having the data being pulled from a resource by the platform. To address this need, the Opendatasoft platform offers a realtime push API.
de: Bei einigen Datentypen kann es hilfreich sein, Daten zu übertragen (Push), anstatt die Daten auf herkömmliche Weise von der Plattform aus einer Ressource zu beziehen. Um diesen Bedarf zu decken, bietet die Opendatasoft-Plattform eine Realtime-Push-API.
es: En el caso de algunos tipos de datos, puede ser útil insertar los datos en lugar de seguir el método más tradicional por el cual la plataforma extrae los datos de un recurso. Para atender esta necesidad, la plataforma Opendatasoft ofrece una API de inserción en tiempo real.
fr: Pour certains types de données, il peut être utile de transmettre les données plutôt que de suivre le modèle classique d'extraction des données par la plateforme à partir d'une ressource. Pour répondre à ce besoin, la plateforme Opendatasoft propose une API de transmission en temps réel.
nl: Voor sommige types data kan het nuttig zijn om data te pushen in plaats van het meer traditionele model te gebruiken waarbij de data door het platform wordt weggehaald uit de bron. Om aan deze behoefte te beantwoorden, biedt het Opendatasoft-platform een real time push-API.

source: It is not to be confused with the ability to schedule a dataset processing. When scheduling, the dataset will periodically pull the resource and process the data inside it. In contrast, with the push API, the dataset is fed by an application through a push API, and records are processed one by one as soon as they are received.
de: Dies ist nicht mit der Möglichkeit zu verwechseln, die Verarbeitung eines Datensatzes zu planen. Bei der Planung wird der Datensatz in regelmäßigen Abständen die Ressource abrufen und die darin enthaltenen Daten verarbeiten. Im Gegensatz dazu wird der Datensatz bei der Push-API von einer Anwendung über eine Push-API versorgt. Die Einträge werden nacheinander verarbeitet, sobald sie empfangen werden.
es: No debe confundirse con la posibilidad de planificar el procesamiento de un conjunto de datos. Con la planificación, el conjunto de datos periódicamente extrae el recurso y procesa los datos de su interior. En cambio, con la API de inserción, una aplicación alimenta el conjunto de datos a través de una API de inserción y los registros se procesan uno a uno a medida que se reciben.
fr: Cela ne doit pas être confondu avec la possibilité de planifier le traitement des jeux de données. Lors de la planification, le jeu de données extraira la ressource et traitera les données qu'elle contient de façon périodique. À l'inverse, avec l'API de transmission, le jeu de données est alimenté par une application via une API de transmission et les enregistrement sont traités les uns après les autres dès leur réception.
nl: Deze mag niet verward worden met de mogelijkheid om de verwerking van een dataset te plannen. Wanneer gepland wordt, zal de dataset op periodieke basis de bron weghalen en de data die erin staan verwerken, terwijl met de push-API de dataset gevoed wordt door een applicatie via een push-API en records één voor één worden verwerkt zodra ze worden ontvangen.

source: Configuring the dataset schema
de: Konfigurieren des Datensatz-Schemas
es: Configurar el esquema de conjunto de datos
fr: Configurer le schéma du jeu de données
it: Configurazione dello schema del dataset
nl: Het datasetschema configureren

source: In **Catalog** > **Datasets**, click on the **New dataset** button.
de: Klicken Sie unter **Katalog** > **Datensätze** auf den Button **Neuer Datensatz**.
es: En **Catálogo** > **Conjuntos de datos**, haga clic en el botón **Conjunto de datos nuevo**.
fr: Dans **Catalogue** > **Jeux de données**, cliquez sur le bouton **Nouveau jeu de données**.
nl: Klik in **Catalogus** > **Datasets** op de knop **Nieuwe dataset**.

source: In the wizard that opens, select **Realtime** under the **Configure a remote service** section.
de: Wählen Sie in dem sich öffnenden Assistenten **Realtime** unter dem Abschnitt **Remote-Service konfigurieren**.
es: En el asistente que aparece, seleccione **Tiempo real** en la sección **Configurar un servicio remoto**.
fr: Sélectionnez **Realtime** dans l'assistant qui s'ouvre, sous la section **Configurer un service distant**.
nl: Selecteer in de wizard die wordt geopend **Realtime** onder de rubriek **Een service op afstand configureren**.

source: In the **Real time data schema** box, enter some bootstrap data. The data should have all the fields that will be sent through the API.
de: Geben Sie in das Feld **Echtzeit-Datenschema** einige Bootstrapdaten ein. Die Daten sollten alle Felder enthalten, die über die API gesendet werden.
es: En el cuadro **Esquema de datos en tiempo real**, especifique datos de arranque. Los datos deben tener todos los campos que se enviarán a través de la API.
fr: Dans le champ **Schéma de données en temps réel**, indiquez des données d'amorçage. Les données doivent inclure tous les champs qui seront envoyés via l'API.
nl: Voer in het vakje **Plan real time data** enkele bootstrap-gegevens in. De gegevens zouden alle velden moeten hebben die via de API worden gestuurd.

source: The bootstrap data is not used in the dataset: its sole purpose is to allow setting up the dataset.
de: Die Bootstrapdaten werden nicht im Datensatz verwendet: Sie dienen lediglich dazu, den Datensatz zu erstellen.
es: Los datos de arranque no se utilizan en el conjunto de datos: su única finalidad es hacer posible la configuración del conjunto de datos.
fr: Les données d'amorçage ne sont pas utilisées dans le jeu de données : leur seul objectif est d'autoriser la configuration du jeu de données.
nl: De bootstrap-gegevens worden niet in de dataset gebruikt: ze hebben enkel als doel het mogelijk te maken de dataset op te zetten.

source: Configure **Information** and **Alert Management** options.
de: Konfigurieren Sie die Optionen **Informationen** und **Alarmmanagement**.
es: Configure las opciones **Información** y **Gestión de alertas**.
fr: Configurez les options **Information** et **Gestion des alertes**.
nl: Opties **Informatie** en **Waarschuwingsbeheer** configureren.

source: Retrieve the push URL.
de: Push-URL abrufen.
es: Recupere la dirección URL de inserción.
fr: Récupérez l'URL de transmission.
nl: De push-URL ophalen

source: Using the push URL
de: Einsatz der Push-URL
es: Utilizar la dirección URL de inserción
fr: Utiliser l'URL Push
nl: De push-URL gebruiken

source: After configuring the realtime source parameters, a URL path containing a push API key appears. This path, appended to your domain base URL, is where the platform will expect data to be sent after publication.
de: Nach Konfiguration der Parameter der Echtzeit-Quelle wird ein URL-Pfad mit einem Push-API-Schlüssel angezeigt. Dieser Pfad, der an die Basis-URL Ihrer Domain angehängt wird, ist der Ort, an den die Plattform die Daten nach der Veröffentlichung sendet.
es: Después de configurar los parámetros del origen en tiempo real, aparecerá una ruta de dirección URL que contiene una clave de la API de inserción. Esta ruta, anexada a la dirección URL base del dominio, es donde la plataforma espera que se envíen los datos tras la publicación.
fr: Après avoir configuré les paramètres de la source en temps réel, un chemin d'accès URL comprenant une clé d'API de transmission s'affiche. Ce chemin d'accès, ajouté à l'URL de base de votre domaine, correspond à l'emplacement où la plateforme recevra les données après la publication.
nl: Na het configureren van de parameters van de real time bron, verschijnt een URL-pad dat een push API-sleutel bevat. Dit pad, dat aan de basis-URL van uw domein wordt gekoppeld, is waar verwacht wordt dat het platform data naar toe zal sturen na publicatie.

source: The data is expected to be sent in JSON format: - As a single JSON object for a single record - An array of JSON objects to push multiple records at once
de: Es wird damit gerechnet, dass die Daten im JSON-Format gesendet werden: - als einzelnes JSON-Objekt für einen einzelnen Datensatz - als Array von JSON-Objekten, um mehrere Datensätze auf einmal zu übermitteln
es: Los datos deben enviarse en formato JSON: o bien como un único objeto JSON para un único registro, o bien como una matriz de objetos JSON para insertar varios registros a la vez.
fr: Les données doivent être envoyées au format JSON : - Sous la forme d'un objet JSON unique pour un seul enregistrement. - Sous la forme d'un tableau d'objets JSON pour transmettre plusieurs enregistrements à la fois.
nl: Er wordt verwacht dat de data verstuurd wordt in JSON-formaat: - Als een enkel JSON-voorwerp voor een enkel record - Een array van JSON-voorwerpen om meerdere records in één keer te pushen.

source: A minimal example of the API usage for a dataset with a single field named ``message``, using curl, would be:
de: Nachfolgend ein Minimalbeispiel einer API-Verwendung für einen Datensatz mit einem einzigen Feld namens "Nachricht", das Curl verwendet:
es: Este sería un ejemplo mínimo del uso de la API para un conjunto de datos con un único campo denominado ``message``, utilizando curl:
fr: Voici un exemple simple d'utilisation de l'API avec la commande curl pour un jeu de données présentant un seul champ nommé ``message`` :
nl: Een minimaal voorbeeld van het gebruik van de API voor een dataset met een enkel veld met de naam ``bericht``, waarbij een URL wordt gebruikt, zou zijn:

source: Here is the resulting dataset:
de: Daraus ergibt sich der folgende Datensatz:
es: El conjunto de datos resultante es:
fr: Voici le jeu de données résultant :
nl: Dit is de eruit voortvloeiende dataset:

source: A minimal example with the same dataset, using the array form to send multiple records at once would be
de: Nachfolgend ein Minimalbeispiel mit demselben Datensatz, den das Array-Formular zum gleichzeitigen Versenden mehrerer Einträge verwendet:
es: Este sería un ejemplo mínimo con el mismo conjunto de datos, utilizando el formulario de matriz para enviar varios registros a la vez:
fr: Voici un autre exemple avec le même jeu de données, qui utilise cette fois un tableau pour envoyer plusieurs enregistrements simultanément
it: E, sempre sullo stesso dataset, ecco un esempio minimo con un formato array per l’invio simultaneo di più record:
nl: Een minimaal voorbeeld met dezelfde dataset, waarbij het array-formulier om meerdere records in één keer te versturen, wordt gebruikt, zou zijn
