Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/csw/describe_record.po
Languages: nl

source: The ``DescribeRecord`` operation allows clients to discover elements of the information model supported by the catalogue service.
nl: De operatie "DescribeRecord" laat klanten toe om elementen van het informatiemodel te ontdekken dat ondersteund wordt door de catalogusservice.

source: This is the list of the supported parameters specific to the ``DescribeRecord`` operation. You should also take into consideration the common parameters. `See more <intro.html#parameters>`_.
nl: Dit is de lijst met de ondersteunde parameters die specifiek zijn voor de operatie "DescribeRecord". U dient ook rekening te houden met de gewone parameters. `Zie meer <intro.html#parameters>`_.

source: The existing parameters in the CSW standard which are not listed in this table are currently not supported.
nl: De bestaande parameters in de CSW-standaard die niet opgenomen zijn in deze tabel worden momenteel niet ondersteund.

source: Supported parameters for the DescribeRecord operation
nl: Ondersteunde parameters voor de operatie "DescribeRecord"

source: Description
nl: Omschrijving

source: Optionality and use
nl: Keuzevrijheid en gebruik

source: Unordered list of zero or more type names that are to be described by the catalogue.
nl: Niet in volgorde geplaatste lijst van nul of meer types namen die beschreven moeten worden door de catalogus.

source: Optional. When omitted, return all types known.
nl: Optioneel. Wanneer weggelaten, geef alle gekende types.

source: Examples
nl: Voorbeelden

source: Here is an example of a ``DescribeRecord`` operation with the optional ``TypeName`` parameter, using a ``GET`` HTTP method :
nl: Hieronder vindt u een voorbeeld van een operatie ``DescribeRecord`` met de optionele parameter ``TypeName``, waarbij een ``GET`` HTTP methode wordt gebruikt:

source: And the same request using a ``POST`` HTTP method :
nl: En hetzelfde verzoek waarbij een ``POST`` HTTP methode wordt gebruikt:

source: The request body :
nl: De tekst van het verzoek:
