Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/csw/get_capabilities.po
Languages: de, es, it, nl

source: The ``GetCapabilities`` operation allows clients to retrieve service metadata. The response is a XML document containing the information.
de: Mit dem Vorgang ``GetCapabilities`` können Kunden Dienst-Metadaten abrufen. Die Antwort ist ein XML-Dokument mit den Informationen.
es: La operación ``GetCapabilities`` permite a los clientes recuperar metadatos de servicio. La respuesta es un documento XML con la información.
it: L'operazione ``GetCapabilities`` permette ai client di recuperare i metadati del servizio. La risposta è un documento XML contenente le informazioni.
nl: De operatie ``GetCapabilities`` laat klanten toe metadata van een service op te halen. De respons is een XML-document dat de informatie bevat.

source: Parameters
de: Parameter
es: Parámetros
it: Parametri

source: This is the list of the supported parameters specific to the ``GetCapabilities`` operation. You should also take into consideration the common parameters. `See more <intro.html#parameters>`_.
de: Das ist die für den Vorgang ``GetCapabilities`` spezifische Liste der unterstützten Parameter. Sie sollten auch die allgemeinen Parameter berücksichtigen. `Weitere Details siehe <intro.html#parameters>`_.
es: Esta es la lista de los parámetros permitidos específicos de la operación ``GetCapabilities``. Asimismo, debe tener en cuenta los parámetros comunes. `Consulte más información <intro.html#parameters>`_.
it: Di seguito è riportato l'elenco dei parametri supportati, specifici dell'operazione ``GetCapabilities``. Non dimenticare, inoltre, di prendere in considerazione i parametri comuni. `Per ulteriori informazioni, seleziona questo link <intro.html#parameters>`_.
nl: Dit is de lijst met de ondersteunde parameters die specifiek zijn voor de operatie ``GetCapabilities``. U dient ook rekening te houden met de gewone parameters. `Zie meer <intro.html#parameters>`_.

source: The existing parameters in the CSW standard which are not listed in this table are currently not supported.
de: Im CSW-Standard bestehende, aber in dieser Tabelle nicht aufgelistete Parameter werden gegenwärtig nicht unterstützt.
es: Los parámetros existentes en el estándar CSW que no figuran en esta tabla actualmente no están permitidos.
it: I parametri esistenti dello standard CSW non elencati nella tabella non sono attualmente supportati.
nl: De bestaande parameters in de CSW-standaard die niet opgenomen zijn in deze tabel worden momenteel niet ondersteund.

source: Supported parameters for the GetCapabilities operation
de: Unterstützte Parameter für den Vorgang GetCapabilities
es: Parámetros permitidos para la operación GetCapabilities
it: Parametri supportati per l'operazione GetCapabilities
nl: Ondersteunde parameters voor de operatie GetCapabilities

source: Parameter
es: Parámetro
it: Parametro

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Optionality and use
de: Optionalität und Verwendung
es: Carácter opcional y uso
it: Carattere facoltativo e utilizzo
nl: Keuzevrijheid en gebruik

source: Unordered list of zero or more names of sections of service metadata document to be returned in service metadata document.
de: Ungeordnete Liste mit null oder mehreren Namen der Abschnitte eines Dienst-Metadatendokuments, die in einem Dienst-Metadatendokument zurückzugeben sind.
es: Lista desordenada de cero o más nombres de secciones del documento de metadatos de servicio que se devolverán en el documento de metadatos de servicio.
it: Elenco non ordinato di zero o più nomi di sezioni del documento dei metadati del servizio che deve essere restituito nel documento stesso.
nl: Niet in volgorde geplaatste lijst met nul of meer namen van sectie van service metadata document om te bezorgen in service matadata document.

source: Optional. When omitted, return complete service metadata document.
de: Optional. Wenn weggelassen, komplettes Dienst-Metadatendokument zurückgeben.
es: Opcional. Si se omite, se devolverá el documento de metadatos de servicio completo.
it: Facoltativo. Se omesso, viene restituito l'intero documento dei metadati del servizio.
nl: Optioneel. Wanneer weggelaten, geef volledig service metadata document.

source: Prioritized sequence of one or more specification versions accepted by client, with preferred versions listed first.
de: Priorisierte Sequenz einer oder mehr Spezifikationsversionen vom Kunden akzeptiert, bevorzugte Versionen sind zuerst aufgelistet.
es: Secuencia clasificada por orden de prioridad de una o varias versiones de especificación aceptadas por el cliente, con las versiones preferidas en la parte superior de la lista.
it: Sequenza organizzata secondo priorità di una o più versioni delle specifiche accettate dal client; le versioni preferenziali sono riportate per prime.
nl: Geprioritiseerde opeenvolging van één of meerdere specificatieversies die aanvaard worden door de klant, met eerst de versies die de voorkeur wegdragen.

source: Optional. When omitted, return latest supported version.
de: Optional. Wenn weggelassen, zuletzt unterstützte Version zurückgeben.
es: Opcional. Si se omite, se devolverá la última versión permitida.
it: Facoltativo. Se omesso, restituisce l'ultima versione supportata.
nl: Optioneel. Wanneer weggelaten, geef laatst ondersteunde versie.

source: Sections
de: Abschnitte
es: Secciones
it: Sezioni
nl: Secties

source: This is the list of the existing section in the service metadata. The section name can be used as a value for the ``Sections`` parameter.
de: Das ist die Liste der in den Dienst-Metadaten bestehenden Abschnitte. Der Abschnittsname kann als ein Wert für die Parameter ``Abschnitte`` verwendet werden.
es: Esta es la lista de las secciones existentes en los metadatos de servicio. El nombre de sección se puede utilizar como un valor del parámetro ``Sections``.
it: Elenco delle sezioni esistenti nei metadati del servizio. Il nome della sezione può essere utilizzato come valore del parametro ``Sections``.
nl: Dit is de lijst met de bestaande sectie in de service metadata. De naam van de sectie kan gebruikt worden als waarde voor de parameter "Sections".

source: Section name and contents
de: Abschnittsname und Inhalte
es: Nombre de sección y contenido
it: Nomi e contenuti delle sezioni
nl: Naam en inhoud van de sectie

source: Section name
de: Abschnittsname
es: Nombre de sección
it: Nome della sezione
nl: Naam van de sectie

source: Contents
de: Inhalte
es: Contenido
it: Contenuto
nl: Inhoud

source: Metadata about the the CSW implementation.
de: Metadaten über die CSW-Implementierung.
es: Metadatos acerca de la implementación CSW.
it: Metadati relativi all'implementazione CSW.
nl: Metadata over de implementatie van CSW.

source: Metadata about the organization offering the CSW service.
de: Metadaten über die den CSW-Dienst anbietende Organisation.
es: Metadatos acerca de la organización que ofrece el servicio CSW.
it: Metadati relativi all'organizzazione che offre il servizio CSW.
nl: Metadata over de organisatie die de CSW-service aanbiedt.

source: Metadata about the CSW operations offered by a the CSW implementation.
de: Metadaten über die durch eine CSW-Implementierung angebotenen CSW-Dienste.
es: Metadatos acerca de las operaciones CSW que ofrece la implementación CSW.
it: Metadati relativi alle operazioni CSW offerte dall'implementazione CSW.
nl: Metadata over de CSW-operaties die aangeboden worden via de CSW-implementatie.

source: Metadata about the filter capabilities of the server. The OpenDataSoft CSW currently does not support filters.
de: Metadaten über die Filterfähigkeiten des Servers. Die CSW von OpenDataSoft unterstützen momentan keine Filter.
es: Metadatos acerca de las funciones de filtro del servidor. Actualmente los filtros no están permitidos por CSW de OpenDataSoft.
it: Metadati relativi alle funzionalità di filtro del server. Il CSW OpenDataSoft attualmente non supporta i filtri.
nl: Metadata over de filtermogelijkheden van de server. De OpenDataSoft CSW ondersteunt momenteel geen filters.

source: Examples
de: Beispiele
es: Ejemplos
it: Esempi
nl: Voorbeelden

source: Here is an example of a ``GetCapabilities`` operation with the optional ``Sections`` parameter, using a ``GET`` HTTP method :
de: Hier ist ein Beispiel eines ``GetCapabilities``-Vorgangs mit optionalem ``Sections`-Parameter unter Verwendung einer ``GET`` HTTP-Methode:
es: A continuación se muestra un ejemplo de una operación ``GetCapabilities`` con el parámetro ``Sections`` opcional, utilizando un método HTTP ``GET``:
it: Di seguito è riportato un esempio di un'operazione ``GetCapabilities`` con il parametro facoltativo ``Sections``, mediante il metodo HTTP ``GET``:
nl: Hieronder vindt u een voorbeeld van een operatie ``GetCapabilities`` met de optionele parameter ``Sections``, waarbij een ``GET`` HTTP methode wordt gebruikt:

source: And the same request using a ``POST`` HTTP method :
de: Und die gleiche Anforderung unter Verwendung einer ``POST`` HTTP-Methode:
es: Y la misma solicitud utilizando un método HTTP ``POST``:
it: E la stessa richiesta utilizzando il metodo HTTP ``POST``:
nl: En hetzelfde verzoek waarbij een ``POST`` HTTP methode wordt gebruikt:

source: The request body :
de: Der Anforderungskörper:
es: Cuerpo de la solicitud:
it: Corpo della richiesta:
nl: De tekst van het verzoek:
