Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/csw/get_record_by_*.po
Languages: id

source: The ``GetRecordById`` operation allows clients to retrieve the representation of catalogue records using their identifier. The response is a XML document and the output schema can be specified.
id: Mit dem Vorgang ``GetRecordById`` können Kunden die Darstellung von Katalogeinträgen unter Verwendung ihrer Bezeichner abrufen. Die Antwort ist ein XML-Dokument und das Ausgabeschema kann festgelegt werden.

source: Parameters
id: Parameter

source: This is the list of the supported parameters specific to the ``GetRecordById`` operation. You should also take into consideration the common parameters. `See more <intro.html#parameters>`_.
id: Das ist die für den Vorgang ``GetRecordById`` spezifische Liste der unterstützten Parameter. Sie sollten auch die allgemeinen Parameter berücksichtigen. `Weitere Details siehe <intro.html#parameters>`_.

source: The existing parameters in the CSW standard which are not listed in this table are currently not supported.
id: Im CSW-Standard bestehende, aber in dieser Tabelle nicht aufgelistete Parameter werden gegenwärtig nicht unterstützt.

source: Supported parameters for the GetRecordById operation
id: Unterstützte Parameter für den Vorgang GetRecordById

source: Description
id: Beschreibung

source: Optionality and use
id: Optionalität und Verwendung

source: Used to indicate the schema of the output that is generated in response to a ``GetRecordById`` request.
id: Dient zur Festlegung des Schemas der als Antwort auf die Anfrage ``GetRecordById`` generierten Ausgabe.

source: Optional. Values can be ``http://www.opengis.net/cat/csw/2.0.2`` or ``http://www.isotc211.org/2005/gmd``. Default value is ``http://www.opengis.net/cat/csw/2.0.2``.
id: Optional. Mögliche Werte sind ``http://www.opengis.net/cat/csw/2.0.2`` oder ``http://www.isotc211.org/2005/gmd``. Der Standardwert ist ``http://www.opengis.net/cat/csw/2.0.2``.

source: Used to indicate which named set the service shall present to the client. It usually defines the level of details present in the result set.
id: Dient zur Angabe, welchen benannten Satz der Dienst dem Kunden präsentieren soll. Definiert normalerweise die Detailstufe im Ergebnissatz.

source: Optional. Values can be ``full``, ``summary`` or ``brief``. Default value is ``summary``.
id: Optional. Mögliche Werte sind ``voll``, ``Übersicht`` oder ``kurz``. Der Standardwert ist ``Übersicht``.

source: A list of record identifiers for the records that a CSW shall return to the client.
id: Eine Liste von Eintragsbezeichnern für die Einträge, die ein CSW an den Kunden zurückgeben soll.

source: Mandatory. List of resource identifier.
id: Erforderlich. Liste von Ressourcenbezeichnern.

source: Examples
id: Beispiele

source: Here is an example of a ``GetRecordById`` operation with the optional ``outputSchema`` parameter, using a ``GET`` HTTP method :
id: Hier ist ein Beispiel eines ``GetRecordById``-Vorgangs mit optionalem ``outputSchema``-Parameter unter Verwendung einer ``GET`` HTTP-Methode:

source: And the same request using a ``POST`` HTTP method :
id: Und die gleiche Anforderung unter Verwendung einer ``POST`` HTTP-Methode:

source: The request body :
id: Der Anforderungskörper:
