Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/csw/get_records.po
Languages: de, es, fr, it, nl

source: The ``GetRecords`` operation allows clients to discover resources (datasets). The response is a XML document and the output schema can be specified.
de: Mit dem Vorgang ``GetRecords`` können Kunden Ressourcen (Datensätze) auffinden. Die Antwort ist ein XML-Dokument und das Ausgabeschema kann festgelegt werden.
es: La operación ``GetRecords`` permite a los clientes descubrir recursos (conjuntos de datos). La respuesta es un documento XML y se puede especificar el esquema de salida.
fr: L'opération ``GetRecords`` permet aux clients de récupérer les ressources du catalogue (jeux de données). La réponse est un document XML et le schéma utilisé pour ce document peut être spécifié.
it: L'operazione ``GetRecords`` permette ai client di rilevare le risorse, cioè i dataset. La risposta è un documento XML ed è possibile specificare lo schema di output.
nl: De operatie``GetRecords`` laat klanten toe bronnen (datasets) te ontdekken. De respons is een XML-document en het outputschema kan worden gespecificeerd.

source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres
it: Parametri

source: This is the list of the supported parameters specific to the ``GetRecords`` operation. You should also take into consideration the common parameters. `See more <intro.html#parameters>`_.
de: Das ist die für den Vorgang ``GetRecords`` spezifische Liste der unterstützten Parameter. Sie sollten auch die allgemeinen Parameter berücksichtigen. `Weitere Details siehe <intro.html#parameters>`_.
es: Esta es la lista de los parámetros permitidos específicos de la operación ``GetRecords``. Asimismo, debe tener en cuenta los parámetros comunes. `Consulte más información <intro.html#parameters>`_.
fr: Voici la liste des paramètres supportés, spécifiques à l'opération ``GetRecords``. Il faut également prendre en compte les paramètres communs à chaque opération CSW. `En savoir plus <intro.html#parameters>`_.
it: Di seguito è riportato l'elenco dei parametri supportati, validi per l'operazione ``GetRecords``. Ricorda inoltre di prendere in considerazione i parametri comuni. `Maggiori informazioni qui <intro.html#parameters>`_.
nl: Dit is de lijst met de ondersteunde parameters die specifiek zijn voor de operatie ``GetRecords``. U dient ook rekening te houden met de gewone parameters. `Zie meer <intro.html#parameters>`_.

source: The existing parameters in the CSW standard which are not listed in this table are currently not supported.
de: Im CSW-Standard bestehende, aber in dieser Tabelle nicht aufgelistete Parameter werden gegenwärtig nicht unterstützt.
es: Los parámetros existentes en el estándar CSW que no figuran en esta tabla actualmente no están permitidos.
fr: Les paramètres qui ne sont pas listés dans ce tableau mais qui existent dans le standard CSW ne sont pas supportés pour le moment.
it: I parametri dello standard CSW assenti nella tabella non sono attualmente supportati.
nl: De bestaande parameters in de CSW-standaard die niet opgenomen zijn in deze tabel worden momenteel niet ondersteund.

source: Supported parameters for the GetRecords operation
de: Unterstützte Parameter für den Vorgang GetRecords
es: Parámetros permitidos para la operación GetRecords
fr: Paramètres supportés pour l'opération GetRecords
it: Parametri supportati nell'operazione GetRecords
nl: Ondersteunde parameters voor de operatie GetRecords

source: Parameter
es: Parámetro
fr: Paramètre
it: Parametro

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Optionality and use
de: Optionalität und Verwendung
es: Carácter opcional y uso
fr: Fréquence d'utilisation et caractère optionnel
it: Carattere facoltativo e utilizzo
nl: Keuzevrijheid en gebruik

source: Determines whether the catalogue returns just a summary of the result set, or includes one or more records from the result set.
de: Legt fest, ob der Katalog nur eine Zusammenfassung des Ergebnissatzes zurückgibt oder einen oder mehr Einträge des Ergebnissatzes einschließt.
es: Determina si el catálogo devuelve solo un resumen del conjunto de resultados o incluye uno o varios registros del conjunto de resultados.
fr: Détermine si le catalogue doit juste retourner un résumé des résultats ou également inclure chaque enregistrement du résultat.
it: Determina se il catalogo deve restituire solo un riepilogo del set di risultati o includere uno o più record.
nl: Bepaalt of de catalogus enkel een samenvatting van de resultatenreeks geeft of één of meerdere records uit de resultatenreeks opneemt.

source: Optional. Values can be ``hits`` or ``results``. Default value is ``hits``.
de: Optional. Mögliche Werte sind ``Treffer`` oder ``Ergebnisse``. Der Standardwert ist ``Treffer``.
es: Opcional. Los valores pueden ser ``hits`` y ``results``. El valor predeterminado es ``hits``.
fr: Optionnel. Les valeurs peuvent être ``hits`` ou ``results``. La valeur par défaut est ``hits``.
it: Facoltativo. I valori possono essere ``hits`` o ``results``. Il valore predefinito è ``hits``.
nl: Optioneel. Waarden kunnen zijn "hits" of "resultaten". Standaardwaarde is "hits.

source: Used to indicate the schema of the output that is generated in response to a ``GetRecords`` request.
de: Dient zur Angabe des Schemas der Ausgabe, die als Antwort auf eine ``GetRecords``-Anforderung generiert wird.
es: Se utiliza para indicar el esquema de la salida que se genera en respuesta a una solicitud ``GetRecords``.
fr: Utilisé pour indiquer le schéma utilisé pour le document XML en réponse à une requête ``GetRecords``.
it: Utilizzato per indicare lo schema dell'output generato in risposta a una richiesta``GetRecords``.
nl: Wordt gebruikt om het schema van de output aan te geven die gegenereerd wordt in respons op een ``GetRecords``-verzoek.

source: Optional. Values can be ``http://www.opengis.net/cat/csw/2.0.2`` or ``http://www.isotc211.org/2005/gmd``. Default value is ``http://www.opengis.net/cat/csw/2.0.2``.
de: Optional. Mögliche Werte sind ``http://www.opengis.net/cat/csw/2.0.2`` oder ``http://www.isotc211.org/2005/gmd``. Der Standardwert ist ``http://www.opengis.net/cat/csw/2.0.2``.
es: Opcional. Los valores pueden ser ``http://www.opengis.net/cat/csw/2.0.2`` y ``http://www.isotc211.org/2005/gmd``. El valor predeterminado es ``http://www.opengis.net/cat/csw/2.0.2``.
fr: Optionnel. Les valeurs peuvent être ``http://www.opengis.net/cat/csw/2.0.2`` ou ``http://www.isotc211.org/2005/gmd``. La valeur par défaut est ``http://www.opengis.net/cat/csw/2.0.2``.
it: Facoltativo. I valori possono essere ``http://www.opengis.net/cat/csw/2.0.2`` o ``http://www.isotc211.org/2005/gmd``. Il valore predefinito è ``http://www.opengis.net/cat/csw/2.0.2``.
nl: Optioneel. Waarden kunnen zijn ``http://www.opengis.net/cat/csw/2.0.2`` of ``http://www.isotc211.org/2005/gmd``. Standaardwaarde is ``http://www.opengis.net/cat/csw/2.0.2``.

source: Used to indicate at which record position the catalogue should start generating output.
de: Dient zur Angabe, bei welcher Eintragsposition der Katalog mit der Ausgabengenerierung beginnen sollte.
es: Se utiliza para indicar en qué posición de registro el catálogo debería empezar a generar salida.
fr: Utilisé pour indiquer à partir de quelle position parmi les enregistrements le catalogue doit générer la réponse.
it: Utilizzato per indicare la posizione a partire dalla quale il catalogo deve generare l'output.
nl: Wordt gebruikt om aan te geven op welke recordpositie de catalogus zou moeten starten met het genereren van output.

source: Optional. Value must be a non-zero positive integer. Default value is 1.
de: Optional. Wert muss eine Ganzzahl ungleich Null sein. Standardwert ist 1.
es: Opcional. El valor debe ser un entero positivo distinto de cero. El valor predeterminado es 1.
fr: Optionnel. La valeur doit être un nombre entier positif supérieur à zéro. La valeur par défaut est 1.
it: Facoltativo. Il valore deve essere un numero intero positivo diverso da zero. Il valore predefinito è 1.
nl: Optioneel. Waarde moet een positieve geheel getal zijn dat niet nul is. Standaardwaarde is 1.

source: Used to define the maximum number of records that should be returned from the result set of a query.
de: Dient zur Festlegung der maximalen Anzahl von Einträgen, die vom Ergebnissatz einer Anfrage zurückgegeben werden sollte.
es: Se utiliza para definir el número máximo de registros que debería devolverse del conjunto de resultados de una consulta.
fr: Utilisé pour définir le maximum d'enregistrements qui doivent être retournées dans le jeu de résultats.
it: Utilizzato per definire il numero massimo di record che deve essere restituito nel set di risultati di una query.
nl: Wordt gebruikt om het maximaal aantal records te definiëren waaruit de resultatenreeks van een verzoek bestaat.

source: Optional. Value must be a positive integer. Default value is 10.
de: Optional. Wert muss eine positive Ganzzahl sein. Standardwert ist 10.
es: Opcional. El valor debe ser un entero positivo distinto de cero. El valor predeterminado es 10.
fr: Optionnel. La valeur doit être un nombre entier positif supérieur à zéro. La valeur par défaut est 10.
it: Facoltativo. Il valore deve essere un numero intero positivo. Il valore predefinito è 10.
nl: Optioneel. Waarde moet een positief geheel getal zijn. Standaardwaarde is 10.

source: Used to indicate which named set the service shall present to the client. It usually defines the level of details present in the result set.
de: Dient zur Angabe, welchen benannten Satz der Dienst dem Kunden präsentieren soll. Definiert normalerweise die Detailstufe im Ergebnissatz.
es: Se utiliza para indicar qué conjunto específico presentará al cliente el servicio. Normalmente define el nivel de detalle presente en el conjunto de resultados.
fr: Utilisé pour indiquer quel ensemble nommé le service doit présenter au client. En général, cela définit le niveau de détail des résultats.
it: Utilizzato per indicare quale specifico set deve essere presentato al client da parte del servizio. Generalmente definisce il livello di dettaglio presente nel set dei risultati.
nl: Wordt gebruikt om aan te geven welke benoemde reeks de service zal voorstellen aan de klant. Deze definieert meestal het detailniveau dat aanwezig is in de resultatenreeks.

source: Optional. Values can be ``full``, ``summary`` or ``brief``. Default value is ``summary``.
de: Optional. Mögliche Werte sind ``voll``, ``Übersicht`` oder ``kurz``. Der Standardwert ist ``Übersicht``.
es: Opcional. Los valores pueden ser ``full``, ``summary`` y ``brief``. El valor predeterminado es ``summary``.
fr: Optionnel. Les valeurs peuvent être ``full``, ``summary`` ou ``brief``. La valeur par défaut est ``summary``.
it: Facoltativo. I valori possono essere ``full``, ``summary`` o ``brief``. Il valore predefinito è ``summary``.
nl: Optioneel. Waarden kunnen zijn "volledig", "samenvatting" of "kort". Standaardwaarde is "samenvatting".

source: Mandatory. Values can be ``csw:Record`` or ``gmd:MD_Metadata``.
de: Erforderlich. Mögliche Werte sind ``csw:Record`` oder ``gmd:MD_Metadata``.
es: Obligatorio. Los valores pueden ser ``csw:Record`` y ``gmd:MD_Metadata``.
fr: Obligatoire. Les valeurs peuvent être ``csw:Record`` or ``gmd:MD_Metadata``.
it: Obbligatorio. I valori possono essere ``csw:Record`` o ``gmd:MD_Metadata``.
nl: Verplicht. Waarden kunnen ``csw:Record`` of ``gmd:MD_Metadata`` zijn.

source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples
it: Esempi
nl: Voorbeelden

source: Here is an example of a ``GetRecords`` operation with the optional ``resultType``, ``outputSchema`` and ``ElementSetName`` parameters, using a ``GET`` HTTP method :
de: Hier ist ein Beispiel eines ``GetRecords``-Vorgangs mit optionalen ``resultType``-, ``outputSchema``- und ``ElementSetName``-Parametern unter Verwendung einer ``GET`` HTTP-Methode:
es: A continuación se muestra un ejemplo de una operación ``GetRecords`` con los parámetros ``resultType``, ``outputSchema`` y ``ElementSetName``, utilizando un método HTTP ``GET``:
fr: Voici un exemple d'opération``GetRecords`` utilisant les paramètres optionnels ``resultType``, ``outputSchema``, ``ElementSetName`` et la méthode HTTP ``GET`` :
it: Di seguito è riportato un esempio di un'operazione ``GetRecords`` con i parametri facoltativi ``resultType``, ``outputSchema`` e ``ElementSetName``, mediante il metodo HTTP ``GET``:
nl: Hieronder vindt u een voorbeeld van een operatie ``GetRecords`` met de optionele parameters ``resultType``, ``outputSchema`` en ``ElementSetName``, waarbij een "`GET`` HTTP methode wordt gebruikt:

source: And the same request using a ``POST`` HTTP method :
de: Und die gleiche Anforderung unter Verwendung einer ``POST`` HTTP-Methode:
es: Y la misma solicitud utilizando un método HTTP ``POST``:
fr: Et voici la même requête en utilisant la méthode HTTP ``POST`` :
it: E la stessa richiesta utilizzando il metodo HTTP ``POST``:
nl: En hetzelfde verzoek waarbij een ``POST`` HTTP methode wordt gebruikt:

source: The request body :
de: Der Anforderungskörper:
es: Cuerpo de la solicitud:
fr: Le corps de la requête :
it: Corpo della richiesta:
nl: De tekst van het verzoek:
