Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/csw/intro.po
Languages: de, es, it, nl

source: Using the service
de: Nutzen des Services
es: Utilizar el servicio
it: Uso del servizio
nl: De service gebruiken

source: OpenDataSoft datasets can be accessed through a Catalog Service for the Web (CSW). This is a standard for exposing a catalogue of geospatial records in XML. The OpenDataSoft platform uses the CSW specification version 2.0.2.
de: Auf OpenDataSoft-Einträge können Sie über einen Catalog Service for the Web (CSW) zugreifen. Das ist ein Standard, um einen Katalog von raumbezogenen Einträgen in XML verfügbar zu machen. Die OpenDataSoft-Plattform verwendet die CSW-Spezifikation Version 2.0.2.
es: Se puede acceder a los conjuntos de datos de OpenDataSoft por medio de CSW (Catalog Service for the Web). Este es un estándar para exponer un catálogo de registros geoespaciales en XML. La plataforma OpenDataSoft utiliza la versión de especificación de CSW 2.0.2.
it: Per accedere ai dataset OpenDataSoft è possibile utilizzare un servizio CSW (Catalog Service for the Web), uno standard che consente di esporre un catalogo di record geospaziali XML. La piattaforma OpenDataSoft utilizza le specifiche CSW versione 2.0.2.
nl: Datasets van OpenDataSoft zijn toegankelijk via een Catalog Service for the Web (CSW). Dit is een standaard voor het beschikbaar stellen van een catalogus van geospatiale records in XML. Het OpenDataSoft-platform gebruikt de CSW specificatieversie 2.0.2.

source: Operations supported
de: Unterstützte Vorgänge
es: Operaciones permitidas
it: Operazioni supportate
nl: Ondersteunde operaties

source: OpenDataSoft platform implements four operations defined by the CSW standard :
de: Die OpenDataSoft-Plattform implementiert vier durch den CSW-Standard definierte Vorgänge:
es: La plataforma OpenDataSoft implementa 4 operaciones definidas por el estándar CSW:
it: La piattaforma OpenDataSoft implementa quattro operazioni definite dallo standard CSW:
nl: Het OpenDataSoft-platform implementeert vier operaties die gedefinieerd worden door de CSW-standaard:

source: CSW Operations
de: CSW-Vorgänge
es: Operaciones CSW
it: Operazioni CSW
nl: CSW-operaties

source: Operation
de: Vorgang
es: Operación
it: Operazione
nl: Operatie

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Retrieve service metadata.
de: Service-Metadaten abrufen.
es: Recuperar metadatos de servicio.
it: Richiama i metadati del servizio.
nl: Service metadata ophalen.

source: Discover elements of the information model by the catalogue.
de: Elemente des Informationsmodells nach Katalog auffinden.
es: Descubrir elementos del modelo de información por parte del catálogo.
it: Scopre gli elementi del modello di informazioni del catalogo.
nl: Ontdek elementen van het informatiemodel via de catalogus.

source: Search for records and get their metadata and identifier.
de: Nach Einträgen suchen und ihre Metadaten und Bezeichner erhalten.
es: Buscar registros y obtener sus metadatos y su identificador.
it: Cerca i record, recuperandone i metadati e l'identificatore.
nl: Zoek naar records en krijg hun metadata en identifier.

source: Search for a record with a specific identifier.
de: Nach einem Eintrag mit einem spezifischen Bezeichner suchen.
es: Buscar un registro con un identificador específico.
it: Cerca un record con uno specifico identificatore.
nl: Zoek naar een record met een specifieke identifier.

source: Service address and methods
de: Serviceadresse und -methoden
es: Dirección de servicio y métodos
it: Metodi e indirizzo del servizio
nl: Adres en methodes van de service

source: The service can be reached at the following entry address :
de: Sie erreichen den Service unter der folgenden Eingangsadresse:
es: Se puede acceder al servicio en la dirección de entrada siguiente:
it: Il servizio può essere raggiunto al seguente indirizzo di ingresso:
nl: De service kan bereikt worden op het volgende invoeradres:

source: For this documentation, we use the the domain ``http://public.opendatasoft.com`` as an example but you should replace it by your custom domain name.
de: Für diese Dokumentation verwenden wir als Beispiel die Domain ``http://public.opendatasoft.com``, die Sie jedoch durch Ihren eigenen Domainnamen ersetzen sollten.
es: Para esta documentación, utilizamos el dominio ``http://public.opendatasoft.com`` a modo de ejemplo, pero usted debería sustituirlo por su nombre de dominio personalizado.
it: Per questa documentazione, utilizzeremo come esempio il dominio ``http://public.opendatasoft.com``, che tuttavia puoi sostituire con il tuo nome di dominio personalizzato.
nl: Voor deze documentatie gebruiken we het domein ``http://public.opendatasoft.com`` als voorbeeld maar dient u dit te vervangen door uw aanpasbare domeinnaam.

source: The CSW supports both ``GET`` and ``POST`` HTTP methods.
de: Der CSW unterstützt sowohl ``GET``- als auch ``POST``-HTTP-Methoden.
es: CSW admite los métodos HTTP ``GET`` y ``POST``.
it: Il servizio CSW supporta entrambi i metodi HTTP ``GET`` e ``POST``.
nl: De CSW ondersteunt zowel de ``GET`` als de ``POST`` HTTP methodes.

source: Request Headers
de: Anfragekopfzeilen
es: Encabezados de solicitud
it: Header di richiesta
nl: Vraag headers aan

source: The only supported HTTP header is the optional ``Content-Type`` header, which must be set to ``text/xml`` when using a ``POST`` HTTP request.
de: Der einzige unterstützte HTTP-Header ist der optionale Header ``Inhaltstyp``, der bei der Verwendung einer ``POST``-HTTP-Anfrage auf ``text/xml`` eingestellt sein muss.
es: El único encabezado HTTP permitido es el encabezado ``Content-Type`` opcional, que debe establecerse como ``text/xml`` al utilizar una solicitud HTTP ``POST``.
it: L'unico header HTTP supportato è l'header facoltativo ``Content-Type``, che quando si utilizza una richiesta HTTP ``POST`` deve essere impostato su ``text/xml``.
nl: De enige HTTP-header die ondersteund wordt, is de optionele ``Content-Type``-header, die ingesteld moet worden op ``text/xml`` wanneer een ``POST`` HTTP-aanvraag wordt gebruikt.

source: Parameters
de: Parameter
es: Parámetros
it: Parametri

source: When the HTTP ``GET`` method is used, the parameters are appended to the URL using a Keyword Value Pair (KVP) encoding. When the HTTP ``POST`` method is used, the operation request message is encoded as an XML document in the body of the ``POST`` message.
de: Bei Verwendung der HTTP-Methode ``GET`` werden die Parameter der URL mittels einer Keyword Value Pair-Codierung (KVP) angefügt. Bei Verwendung der HTTP-Methode ``POST`` wird die Vorgangsanforderungsnachricht als XML-Dokument im Körper der ``POST``-Nachricht codiert.
es: Cuando se utiliza el méotod HTTP ``GET``, los parámetros se anexan a la dirección URL mediante una codificación de par clave-valor (KVP). Cuando se utiliza el método HTTP ``POST``, el mensaje de solicitud de la operación se codifica como un documento XML en el cuerpo del mensaje ``POST``.
it: Quando si utilizza il metodo HTTP ``GET``, i parametri vengono aggiunti all'URL tramite una codifica KVP (Keyword Value Pair). Quando si utilizza il metodo HTTP ``POST``, il messaggio di richiesta dell'operazione è codificato come un documento XML nel corpo del messaggio ``POST``.
nl: Wanneer de HTTP ``GET`` methode wordt gebruikt, worden de parameters aan de URL toegevoegd via de encodage van een Keyword Value Pair (KVP). Wanneer de HTTP ``POST`` methode wordt gebruikt, wordt het aanvraagbericht voor de operatie gecodeerd als een XML-document in de body van het ``POST`` bericht.

source: Here is the list of the common parameters, supported by all CSW operations :
de: Hier ist die Liste der von allen CSW-Vorgängen unterstützten allgemeinen Parameter:
es: A continuación se muestra la lista de los parámetros comunes permitidos por todas las operaciones CSW:
it: Di seguito è riportato un elenco dei parametri comuni supportati da tutte le operazioni CSW:
nl: Hieronder vindt u de lijst met de meest gebruikte parameters die ondersteund worden door alle CSW-operaties:

source: Request Parameters
de: Anforderungsparameter
es: Parámetros de solicitud
it: Parametri di richiesta
nl: Vraag parameters aan

source: Possible values
de: Mögliche Werte
es: Valores posibles
it: Possibili valori
nl: Mogelijke waarden

source: Optionality and use
de: Optionalität und Verwendung
es: Carácter opcional y uso
it: Carattere facoltativo e utilizzo
nl: Keuzevrijheid en gebruik

source: The requested service
de: Der angeforderte Service
es: Servicio solicitado.
it: Il servizio richiesto.
nl: De aangevraagde service

source: One (Mandatory)
de: Einer (Erforderlich)
es: Un valor (obligatorio).
it: Uno (obbligatorio)
nl: Eén (verplicht)

source: The requested operation
de: Der angeforderte Vorgang
es: Operación solicitada.
it: L’operazione richiesta.
nl: De aangevraagde operatie

source: The requested version of the service.
de: Die angeforderte Version des Services.
es: Versión del servicio solicitada.
it: La versione del servizio richiesta.
nl: De aangevraagde versie van de service.

source: One (Optional)
de: Eins (Optional)
es: Un valor (opcional).
it: Uno (facoltativo)
nl: Eén (optioneel)

source: Exception reports
de: Ausnahmeberichte
es: Informes de excepciones
it: Report di eccezioni

source: When an error occurs, the service respond to the client using an Exception Report message to describe the error.
de: Tritt ein Fehler auf, antwortet der Service dem Client mithilfe einer Ausnahmeberichtsnachricht, um den Fehler zu beschreiben.
es: Cuando se produce un error, el servicio responde al cliente utilizando un mensaje de informe de excepciones para describir el error.
it: Quando si verifica un errore, il servizio risponde al client inviando un report di eccezioni contenente la relativa descrizione.
nl: Wanneer er een fout optreedt, antwoordt de service aan de klant die een Exception Report-bericht gebruikt om de fout te omschrijven.

source: Parameters in Exception element
de: Parameter in Ausnahmeelement
es: Parámetros del elemento de excepción
it: Parametri dell'elemento Eccezione
nl: Parameters in element Exception

source: Name
es: Nombre
it: Nome
nl: Naam

source: Definition
es: Definición
it: Definizione
nl: Definitie

source: Data type and value
de: Datentyp und Wert
es: Tipo de datos y valor
it: Tipo di dati e valore
nl: Type en waarde van de data

source: Multiplicity and use
de: Multiplizität und Verwendung
es: Multiplicidad y uso
it: Molteplicità e utilizzo
nl: Multipliciteit en gebruik

source: Text describing specific exception represented by the exceptionCode
de: Text, der die durch den exceptionCode dargestellte spezifische Ausnahme beschreibt
es: Texto que describe la excepción específica representada por exceptionCode.
it: Testo che descrive l’eccezione rappresentata da exceptionCode.
nl: Tekst die een specifieke uitzondering omschrijft die weergegeven wordt door de exceptionCode

source: Character String type, not empty. Value is an exception description as defined by individual servers
de: Zeichenfolgentyp, nicht leer. Wert ist eine von individuellen Servern definierte Ausnahmebeschreibung
es: Tipo de cadena de caracteres, no vacío. El valor es una descripción de excepción según la definición de servidores individuales.
it: Tipo stringa di caratteri, non vuota. Il valore è una descrizione dell'eccezione secondo le definizioni dei singoli server.
nl: Character String type, niet leeg. Waarde is een omschrijving van de uitzondering zoals die gedefinieerd wordt door individuele servers

source: Zero or more (optional). Omitted only when no more useful information available
de: Null oder größer (optional). Nur ausgelassen, wenn keine hilfreichen Informationen mehr verfügbar
es: Cero o más (opcional). Se omite solo cuando no hay más información útil disponible.
it: Zero o più (facoltativo). Viene omesso solo quando non sono più disponibili informazioni utili.
nl: Nul of meer (optioneel). Enkel weggelaten wanneer er geen nuttige informatie meer beschikbaar is

source: Code representing type of this exception
de: Code, der Typ dieser Ausnahme darstellt
es: Código que representa el tipo de esta excepción.
it: Codice che descrive il tipo di eccezione.
nl: Code die het type van deze uitzondering vertegenwoordigt

source: Character String type, not empty. Allowed values are specified by each implementation specification and server implementation
de: Zeichenfolgentyp, nicht leer. Zulässige Werte werden durch jede Implementierungsspezifikation und Serverimplementierung spezifiziert
es: Tipo de cadena de caracteres, no vacío. Los valores permitidos son especificados por cada especificación de implementación e implementación de servidor.
it: Tipo stringa di caratteri, non vuota. I valori consentiti sono definiti da ogni specifica implementativa e da ogni implementazione server.
nl: Character String type, niet leeg. Toegelaten waarden worden gespecificeerd door elke implementatiespecificatie en serverimplementatie

source: One (mandatory)
de: Eins (erforderlich)
es: Un valor (obligatorio).
it: Uno (obbligatorio)
nl: Eén (verplicht)

source: Indicator of location in the client's operation request where this exception was encountered
de: Indikator des Ortes in der Vorgangsanfrage des Kunden, wo diese Ausnahme aufgetreten ist
es: Indicador de ubicación de la solicitud de la operación del cliente donde se ha encontrado esta excepción.
it: Indicatore della posizione in cui si trova l'eccezione nella richiesta di operazione del client.
nl: Indicator van de locatie in de operatieaanvraag van de klant waar deze uitzondering werd tegengekomen

source: Character String type, not empty. Contents defined for each allowed exceptionCode value for each operation
de: Zeichenfolgentyp, nicht leer. Für jeden Vorgang für jeden zulässigen exceptionCode-Wert definierte Inhalte
es: Tipo de cadena de caracteres, no vacío. Contenido definido para cada valor de exceptionCode permitido para cada operación.
it: Tipo stringa di caratteri, non vuota. Il contenuto è definito per ogni valore di exceptionCode consentito in ogni operazione.
nl: Character String type, niet leeg. Inhoud gedefinieerd voor elke toegelaten exceptionCode-waarde voor elke operatie

source: Zero or one (optional). Omitted when no useful value available
de: Null oder eins (optional). Ausgelassen, wenn kein brauchbarer Wert verfügbar
es: Cero o uno (opcional). Se omite cuando no hay ningún valor útil disponible.
it: Zero o uno (facoltativo). Viene omesso quando non vi sono valori utili disponibili.
nl: Nul of meer (optioneel). Enkel weggelaten wanneer er geen nuttige waarde meer beschikbaar is

source: Example :
de: Beispiel:
es: Ejemplo:
it: Esempio:
nl: Voorbeeld:

source: DescribeRecord
de: BeschreibungEintrag
