Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/06_configuring_metadata/configuring_metadata.po
Languages: de, es, fr, nl

source: Configuring metadata
de: Konfigurieren von Metadaten
es: Configurar los metadatos
fr: Configurer les métadonnées
nl: Metadata configureren

source: Metadata can be seen as the data describing the dataset itself. They are indeed a set of fields that, once filled up, describe the dataset and the data it contains. Filling up the metadata of a dataset is really important: it helps make sure that the dataset can be found, understood, and reused by users. When activated, interoperability metadata are just as important: they help make sure that other systems can understand the content of the dataset.
de: Metadaten können als die Daten verstanden werden, die den Datensatz selbst beschreiben. Es handelt sich um eine Reihe von Feldern, die nach dem Ausfüllen den Datensatz und die darin enthaltenen Daten beschreiben. Das Ausfüllen der Metadaten eines Datensatzes ist wichtig: so wird sichergestellt, dass der Datensatz von den Benutzern gefunden, verstanden und wiederverwendet werden kann. Wenn sie aktiviert sind, sind die Interoperabilitäts-Metadaten ebenso wichtig: Sie helfen sicherzustellen, dass andere Systeme den Inhalt des Datensatzes verstehen können.
es: Los metadatos son datos que describen el conjunto de datos en sí. En realidad, son un conjunto de campos que una vez rellenados describen el conjunto de datos y los datos que contiene. Especificar los metadatos de un conjunto de datos es muy importante: ayuda a asegurarse de que los usuarios puedan encontrar, entender y reutilizar el conjunto de datos. Los metadatos de interoperatividad, cuando están activados, son igual de importantes: ayudan a asegurarse de que otros sistemas puedan entender el contenido del conjunto de datos.
nl: Metadata kunnen beschouwd worden als de gegevens die de dataset zelf beschrijven. Het is inderdaad een reeks velden die, eenmaal ze is ingevuld, de dataset en de gegevens die ze bevat, beschrijven. Het invullen van de metadata van een dataset is echt belangrijk. Het helpt ervoor zorgen dat de dataset kan worden teruggevonden, begrepen en hergebruikt door gebruikers. Metadata over de interoperabiliteit, wanneer deze zijn geactiveerd, zijn net zo belangrijk: ze helpen ervoor zorgen dat andere systemen de inhoud van de dataset kunnen begrijpen.

source: In the Opendatasoft platform, all metadata configurations are done in the Information tab.
de: Auf der Opendatasoft-Plattform werden alle Metadaten-Konfigurationen in der Registerkarte "Informationen" vorgenommen.
es: En la plataforma Opendatasoft, todas las configuraciones de metadatos se llevan a cabo en la ficha Información.
fr: Dans la plateforme Opendatasoft, toutes les configurations de métadonnées sont effectuées dans l'onglet Informations.
nl: In het Opendatasoft-platform gebeuren alle metadataconfiguraties in het informatietabblad.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: The Information tab also contains an Attachments tab that allows the upload of files related to the dataset (for example, information documents to explain in details the fields and data, methodology documents on how the data was collected, etc.).
de: Die Registerkarte "Informationen" enthält außerdem eine Registerkarte "Anhänge". Hier können Dateien hochgeladen werden, die sich auf den Datensatz beziehen (z.B. Informationsdokumente, um die Felder und Daten detailliert zu erklären, methodische Unterlagen mit Informationen darüber, wie die Daten erfasst wurden usw.).
es: La ficha Información también contiene una ficha Asociaciones que permite cargar archivos relacionados con el conjunto de datos (por ejemplo, documentos de información para explicar en detalle los campos y datos, documentos de metodología sobre cómo se recopilan los datos, etc.)
nl: De Information tab bevat ook een Attachments tab die toelaat bestanden te uploaden die betrekking hebben op de dataset (bijv. informatiedocumenten om in detail de velden en data uit te leggen, methodologiedocumenten over hoe de data werden ingezameld, enz.).

source: Metadata is not stripped from uploaded files. The tags may expose sensitive information, such as geolocation data or device information.
de: Die Metadaten werden nicht aus den hochgeladenen Dateien entfernt. Die Tags könnten sensible Informationen preisgeben, wie etwa Geolokalisierungsdaten oder Geräteinformationen.
es: No se han quitado los metadatos de los archivos cargados. Las etiquetas pueden exponer información confidencial, como datos de geolocalización o información de dispositivos.
nl: Metadata worden niet gestript uit geüploade bestanden. De tags kunnen gevoelige informatie blootstellen, zoals geolocatiegegevens of informatie over het toestel.

source: Before uploading files, make sure you strip metadata you want to keep private.
de: Stellen Sie vor dem Hochladen sicher, dass Sie vertrauliche Metadaten isolieren.
es: Antes de cargar los archivos, quite los metadatos que desee mantener en privado.
nl: Alvorens bestanden te uploaden, zorg ervoor dat u metadata stript die u privé wilt houden.

source: There are 4 kinds of metadata in the Opendatasoft platform:
de: Es gibt 4 Arten von Metadaten auf der Opendatasoft-Plattform:
es: Hay 4 tipos de metadatos en la plataforma Opendatasoft:
fr: La plateforme Opendatasoft accueille 4 catégories de données :
nl: Er zijn 4 soorten metadata in het Opendatasoft-platform:

source: **Standard metadata** *(default)*: basic metadata displayed in the front office for the users.
de: **Standard-Metadaten** *(Standard)*: Grundlegende Metadaten, die im Front-Office für die Benutzer angezeigt werden.
es: **Metadatos estándar** *(predeterminado)*: los metadatos básicos visualizados en el front office para los usuarios.
fr: **Métadonnées standard** *(valeur par défaut)* : métadonnées de base affichées dans l'interface de navigation pour les utilisateurs.
nl: **Standaard metadata**: basismetadata die weergegeven worden in de front office voor de gebruikers.

source: **Interoperability metadata** *(on demand)*: intended for automatic usage by other systems for interoperability purposes or regulatory compliance.
de: **Interoperabilitäts-Metadaten** *(auf Anforderung)*: zur automatischen Verwendung durch andere Systeme für Interoperabilitätszwecke oder zur Einhaltung gesetzlicher Vorschriften.
es: **Metadatos de interoperatividad** *(bajo demanda)*: destinados al uso automático por parte de otros sistemas con fines de interoperatividad o cumplimiento de normativas.
nl: **Metadata over de interoperabiliteit** *(op verzoek)*: bedoeld voor automatisch gebruik door andere systemen voor interoperabiliteitsdoeleinden of om in overeenstemming te zijn met de regelgeving.

source: **Admin metadata** *(on demand)*: intended for administrators usage only, therefore never displayed anywhere in the front office.
de: **Admin-Metadaten** *(auf Anforderung)*: nur für Administratoren bestimmt und daher nie im Front-Office angezeigt.
es: **Metadatos de administración** *(bajo demanda)*: destinados al uso exclusivo de los administradores y, por lo tanto, nunca visibles en el front office.
fr: **Métadonnées administratives** *(à la demande)* : destinées à une utilisation par les administrateurs uniquement. Par conséquent, elles ne sont jamais affichées dans l'interface de navigation.
nl: **Admin metadata** *(op verzoek)*: enkel bedoeld om te worden gebruikt door beheerders. Daarom worden ze nergens in de front office weergegeven.

source: **Applicative metadata** *(on demand)*: intended for specific applications and not expected to be used by users directly. In most cases, the users will never have to access or edit them by themselves. They can be visible from the front office but also through the Opendatasoft Search API. The extra metadata will not be included in this documentation. Please contact Opendatasoft for more information about these metadata.
de: **Anwendungsbezogene Metadaten** *(auf Anforderung)*: für bestimmte Anwendungen bestimmt, sollten nicht direkt von Benutzern verwendet werden. In den meisten Fällen müssen die Benutzer nie selbst darauf zugreifen oder sie bearbeiten. Sie können über das Front-Office, aber auch über die Opendatasoft Search API sichtbar sein. Die zusätzlichen Metadaten werden in dieser Dokumentation nicht beschrieben. Bitte kontaktieren Sie Opendatasoft für weitere Informationen zu diesen Metadaten.
es: **Metadatos aplicativos** *(bajo demanda)*: destinados a aplicaciones específicas y no al uso directamente de los usuarios. En la mayoría de los casos, los usuarios nunca tendrán que acceder a ellos ni editarlos por sí mismos. Pueden estar visibles en el front office pero también en la API de búsqueda de Opendatasoft. Los metadatos adicionales no se incluyen en esta documentación. Póngase en contacto con Opendatasoft para obtener más información acerca de estos metadatos.
nl: **Applicative metadata** *(op verzoek)*: bedoeld voor specifieke applicaties en er wordt niet verwacht dat ze rechtstreeks door gebruikers worden gebruikt. In de meeste gevallen zullen de gebruikers er nooit toegang toe hebben of ze zelf nooit kunnen bewerken. Ze kunnen zichtbaar zijn vanuit de front office maar ook via de Opendatasoft Search API. De extra metadata zullen niet worden gedocumenteerd in de documentatie. Voor meer informatie over deze metadata gelieve contact op te nemen met Opendatasoft.

source: Metadata can be seen as the data describing the dataset itself. They are indeed a set of fields that once filled up, describe the dataset and the data it contains. Filling up the metadata of a dataset is really important: it helps making sure that the dataset can be found, understood, and reused by users. Interoperability metadata, when activated, are just as important: they help making sure that other systems can understand the content of the dataset.
fr: Les métadonnées peuvent être considérées comme les données qui décrivent le jeu de données à proprement parler. Elles correspondent à un ensemble de champs qui, une fois renseignés, décrivent le jeu de données et les données qu'il contient. Indiquer les métadonnées d'un jeu de données est primordial, puisqu'elles permettent de s'assurer que le jeu de données peut être détecté, compris et réutilisé par les utilisateurs. Les métadonnées d'interopérabilité, quand elles sont activées, sont aussi importantes : elles servent à garantir que les autres systèmes sont en mesure d'interpréter le contenu du jeu de données.

source: The Information tab also contains an Attachments tab, that allows the upload files related to the dataset (e.g. information documents to explain in details the fields and data, methodology documents on how the data was collected, etc.).
fr: L'onglet Informations comprend aussi un onglet Fichiers joints qui permet de mettre en ligne des fichiers en lien avec le jeu de données (par exemple, des documents d'informations expliquant les champs et données en détail, des documents sur la méthodologie de collecte des données, etc.).

source: **Interoperability metadata** *(on demand)*: intended for automatic usage by other systems for interoperability purposes, or for regulatory compliance.
fr: **Métadonnées d'interopérabilité** *(à la demande)* : destinées à une utilisation automatique par d'autres systèmes à des fins d'interopérabilité ou de conformité réglementaire.

source: **Applicative metadata** *(on demand)*: intended for specific applications, and not expected to be used by users directly. In most cases, the users will never have to access or edit them by themselves. They can be visible from the front office but also through the Opendatasoft Search API. The extra metadata will not be documented in this documentation, please contact Opendatasoft for more information about these metadata.
fr: **Métadonnées applicatives** *(à la demande)* : destinées à des applications spécifiques. Elles ne doivent pas être utilisées par les utilisateurs directement. Dans la plupart des cas, les utilisateurs n'y ont pas accès et ne peuvent pas les modifier eux-mêmes. Elles peuvent être visibles dans l'interface de navigation, mais également via l'API Opendatasoft Search. Les métadonnées supplémentaires ne sont pas décrites dans cette documentation ; veuillez contacter Opendatasoft si vous souhaitez obtenir davantage d'informations sur ce type de métadonnées.
