Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/06_configuring_metadata/interoperability_metadata.po
Languages: de, es, fr, nl

source: Interoperability metadata
de: Interoperabilitäts-Metadaten
es: Metadatos de interoperatividad
fr: Métadonnées d'interopérabilité
nl: Metadata over de interoperabiliteit

source: Interoperability metadata are activated on demand. They should be configured in the Information tab of the edition interface of a dataset, in specific tabs displayed under the standard metadata. Once the dataset is published, all interoperability metadata will be displayed in the Information tab of the dataset (front office).
de: Interoperabilitäts-Metadaten werden bei Anforderung aktiviert. Sie sollten in der Registerkarte Informationen der Bearbeitungsoberfläche eines Datensatzes konfiguriert werden, in bestimmten Registerkarten, die unter den Standard-Metadaten angezeigt werden. Nach der Veröffentlichung des Datensatzes werden alle Interoperabilitäts-Metadaten in der Registerkarte Informationen des Datensatzes angezeigt (Front-Office).
es: Los metadatos de interoperatividad se activan bajo demanda. Deben configurarse en la ficha Información de la interfaz de edición de un conjunto de datos, en fichas específicas bajo los metadatos estándar. Una vez publicado el conjunto de datos, todos los metadatos de interoperatividad se visualizarán en la ficha Información del conjunto de datos (front office).
fr: Les métadonnées d'interopérabilité sont activées à la demande et doivent être configurées dans l'onglet Informations de l'interface d'édition d'un jeu de données, dans les onglets spécifiques affichés sous les métadonnées standard. Une fois le jeu de données publié, toutes les métadonnées d'interopérabilité apparaissent dans l'onglet Informations de ce jeu de données (interface de navigation).

source: There are 3 kinds of interoperability metadata available:
de: 3 Arten von Interoperabilitäts-Metadaten sind verfügbar:
es: Hay 3 tipos de metadatos de interoperatividad disponibles:
fr: Les métadonnées d'interopérabilité disponibles sont réparties en 3 catégories :
nl: Er zijn 3 soorten metadata over de interoperabiliteit beschikbaar:

source: DCAT-AP for Switzerland
de: DCAT-AP für die Schweiz
es: DCAT-AP para Suiza
fr: DCAT-AP pour la Suisse,
nl: DCAT-AP voor Zwitserland

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Custom interoperability metadata can be created and activated on demand. Please contact OpenDataSoft to know more about custom interoperability metadata.
de: Auf Anforderung können benutzerdefinierte Interoperabilitäts-Metadaten erstellt und aktiviert werden. Bitte wenden Sie sich an OpenDataSoft, um mehr über benutzerdefinierte Interoperabilitäts-Metadaten zu erfahren.
es: Los metadatos de interoperatividad personalizados se pueden crear y activar bajo demanda. Póngase en contacto con OpenDataSoft para obtener más información acerca de los metadatos de interoperatividad personalizados.
fr: Des métadonnées d'interopérabilité personnalisées peuvent être créées et activées à la demande. Veuillez contacter OpenDataSoft pour en apprendre davantage sur les métadonnées d'interopérabilité personnalisées.

source: DCAT metadata
de: DCAT-Metadaten
es: Metadatos DCAT
fr: Métadonnées DCAT

source: DCAT metadata aim at facilitating interoperability between data catalogs published on the Web.
de: Mit DCAT-Metadaten soll die Interoperabilität zwischen den im Internet veröffentlichten Datenkatalogen erleichtert werden.
es: Los metadatos DCAT pretenden facilitar la interoperatividad entre catálogos de datos publicados en Internet.
fr: L'objectif des métadonnées DCAT est de simplifier l'interopérabilité entre les catalogues de données publiés sur le web.
nl: DCAT metadata zijn erop gericht de interoperabiliteit tussen datacatalogi die gepubliceerd worden op het net te vergemakkelijken.

source: For more information about the DCAT metadata, please refer to the `W3C Data Catalog Vocabulary (DCAT) documentation <https://www.w3.org/TR/vocab-dcat/>`_. To know how to configure the metadata on the OpenDataSoft platform, refer to the table below.
de: Weitere Informationen zu DCAT-Metadaten finden Sie in der `W3C Data Catalog Vocabulary (DCAT) Dokumentation <https://www.w3.org/TR/vocab-dcat/>`_. In der folgenden Tabelle erfahren Sie, wie Sie die Metadaten auf der OpenDataSoft-Plattform konfigurieren.
es: Para obtener más información acerca de los metadatos DCAT, consulte la `documentación sobre Data Catalog Vocabulary (DCAT) de W3C <https://www.w3.org/TR/vocab-dcat/>`_. Para aprender a configurar los metadatos en la plataforma OpenDataSoft, consulte la tabla siguiente.
fr: Pour plus d'informations sur les métadonnées DCAT, consultez la `documentation Data Catalog Vocabulary (DCAT) de W3C (Glossaire sur le catalogue de données (DCAT)) <https://www.w3.org/TR/vocab-dcat/>`_. Pour apprendre à configurer les métadonnées sur la plateforme OpenDataSoft, consultez le tableau ci-après.

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
nl: Gebruik

source: Created
de: Erstellt
es: Creado
fr: Créé
nl: Aangemaakt

source: Click on the calendar icon on the right of the grey textbox.
de: Klicken Sie auf das Kalendersymbol rechts neben dem grauen Textfeld.
es: Haga clic en el icono de calendario a la derecha del cuadro de texto gris.
fr: Cliquez sur l'icône de calendrier à droite de la zone de texte grise.
nl: Klik op het kalendericoon rechts van het grijze tekstvak.

source: Choose the right date.
de: Wählen Sie das richtige Datum.
es: Elija la fecha apropiada.
fr: Choisissez la date souhaitée.
nl: Kies de juiste datum.

source: Click outside the box. The chosen date is now displayed in the grey textbox.
de: Klicken Sie außerhalb des Feldes. Das gewählte Datum wird nun in dem grauen Textfeld angezeigt.
es: Haga clic fuera del cuadro. La fecha seleccionada aparece ahora en el cuadro de texto gris.
fr: Cliquez en dehors du champ ; la date choisie est maintenant affichée dans la zone de texte grise.
nl: Klik buiten het vakje. De gekozen datum staat nu weergegeven in het grijze tekstvak.

source: Issued
de: Ausgegeben
es: Emitido
fr: Publié
nl: Gepubliceerd

source: Creator
de: Ersteller
es: Creador
fr: Créateur
nl: Aanmaker

source: Indicate the creator in the textbox.
de: Geben Sie den Ersteller im Textfeld an.
es: Indique el creador en el cuadro de texto.
fr: Indiquez le créateur dans la zone de texte.
nl: Vermeld de maker aan in het tekstvak.

source: Contributor
de: Mitwirkender
es: Colaborador
fr: Contributeur
nl: Bijdrager

source: Indicate the contributor in the textbox.
de: Geben Sie den Mitwirkenden im Textfeld an.
es: Indique el colaborador en el cuadro de texto.
fr: Indiquez le contributeur dans la zone de texte.
nl: Vermeld de bijdrager aan in het tekstvak.

source: Contact name
de: Kontaktname
es: Nombre de contacto
fr: Nom du contact
nl: Naam van de contactpersoon

source: Indicate the contact name in the textbox.
de: Geben Sie den Kontaktnamen im Textfeld an.
es: Indique el nombre de contacto en el cuadro de texto.
fr: Indiquez le nom du contact dans la zone de texte.
nl: Vermeld de naam van de contactpersoon in het tekstvak.

source: Contact email
de: Kontakt-E-Mail
es: Correo electrónico de contacto
fr: Email du contact
nl: E-mail van de contactpersoon

source: Indicate the contact email in the textbox.
de: Geben Sie die Kontakt-E-Mail im Textfeld an.
es: Indique el correo electrónico de contacto en el cuadro de texto.
fr: Indiquez l'email du contact dans la zone de texte.
nl: Vermeld het e-mailadres van de contactpersoon in het tekstvak;

source: Accrual periodicity
de: Periodenabgrenzung
es: Periodicidad de acumulación
fr: Fréquence de mise à jour
nl: Updatefrequentie

source: Indicate the accrual periodicity in the textbox.
de: Geben Sie die Periodenabgrenzung im Textfeld an.
es: Indique la periodicidad de acumulación en el cuadro de texto.
fr: Indiquez la fréquence de mise à jour dans la zone de texte.
nl: Vermeld de updatefrequentie in het tekstvak

source: Spatial
de: Räumlich
es: Espacial
fr: Emplacement
nl: Ruimtelijk

source: Indicate the spatial coverage in the textbox.
de: Geben Sie die räumliche Abdeckung im Textfeld an.
es: Indique la cobertura espacial en el cuadro de texto.
fr: Indiquez l'emplacement dans la zone de texte.
nl: Vermeld de ruimtelijke dekking in het teksvak.

source: Indicate the temporal coverage in the textbox.
de: Geben Sie die zeitliche Abdeckung im Textfeld an.
es: Indique la cobertura temporal en el cuadro de texto.
fr: Indiquez la période de temps dans la zone de texte.
nl: Vermeld de tijdelijke dekking in het tekstvak.

source: Granularity
de: Granularität
es: Granularidad
fr: Granularité
nl: Granulariteit

source: Indicate the granularity in the textbox.
de: Geben Sie die Granularität im Textfeld an.
es: Indique la granularidad en el cuadro de texto.
fr: Indiquez la granularité dans la zone de texte.
nl: Vermeld de granulariteit in het tekstvak.

source: Data quality
de: Datenqualität
es: Calidad de datos
fr: Qualité des données
nl: Kwaliteit van de data

source: Indicate the data quality in the textbox.
de: Geben Sie die Datenqualität im Textfeld an.
es: Indique el nivel de calidad de datos en el cuadro de texto.
fr: Indiquez la qualité des données dans la zone de texte.
nl: Vermeld de kwaliteit van de gegevens in het tekstvak.

source: DCAT-AP for Switzerland are DCAT-AP metadata specifically created for Swiss portals and datasets.
de: DCAT-AP für die Schweiz sind DCAT-AP-Metadaten, die speziell für Schweizer Portale und Datensätze erstellt wurden.
es: DCAT-AP para Suiza son metadatos DCAT-AP creados específicamente para los portales y conjuntos de datos de Suiza.
fr: Les métadonnées DCAT-AP pour la Suisse ont été spécifiquement créées pour les portails et jeux de données suisses.
nl: DCAT-AP voor Zwitserland zijn DCAT-AP metadata die specifiek zijn aangemaakt voor Zwitserse portalen en datasets.

source: For more information about the DCAT-AP for Switzerland metadata, please refer to the `related Open Data Handbook <https://handbook.opendata.swiss/en/library/ch-dcat-ap>`_. To know how to configure the metadata on the OpenDataSoft plateform, refer to the table below.
de: Weitere Informationen zu DCAT-Metadaten für die Schweiz finden Sie im `entsprechenden Open Data Handbuch <https://handbook.opendata.swiss/en/library/ch-dcat-ap>`_. In der folgenden Tabelle erfahren Sie, wie Sie die Metadaten auf der OpenDataSoft-Plattform konfigurieren.
es: Para obtener más información acerca de los metadatos DCAT-AP para Suiza, consulte el `manual Open Data Handbook correspondiente <https://handbook.opendata.swiss/en/library/ch-dcat-ap>`_. Para aprender a configurar los metadatos en la plataforma OpenDataSoft, consulte la tabla siguiente.
fr: Pour plus d'informations sur les métadonnées DCAT-AP pour la Suisse, consultez le `guide Open Data associé <https://handbook.opendata.swiss/en/library/ch-dcat-ap>`_. Pour apprendre à configurer les métadonnées sur la plateforme OpenDataSoft, consultez le tableau ci-après.

source: Domain
es: Dominio
fr: Domaine
nl: Domein

source: Indicate the domain (as expected by opendata.swiss) in the textbox.
de: Geben Sie die Domain (wie von opendata.swiss erwartet) im Textfeld an.
es: Indique el dominio (tal como se espera en opendata.swiss) en el cuadro de texto.
fr: Indiquez le domaine (tel qu'attendu par opendata.swiss) dans la zone de texte.
nl: Vermeld het domein (zoals verwacht wordt door opendata.swiss) in het tekstvak.

source: Rights
de: Rechte
es: Derechos
fr: Droits
nl: Rechten

source: Indicate the rights in the textbox.
de: Geben Sie die Rechte im Textfeld an.
es: Indique los derechos en el cuadro de texto.
fr: Indiquez les droits dans la zone de texte.
nl: Vermeld de rechten in het tekstvak.

source: INSPIRE metadata are defined by the European Commission. They should ensure that metadata are created for specific spatial data sets and services and that those metadata are kept up to date. These metadata particularly focus on datasets with geographic coordinates.
de: INSPIRE-Metadaten werden von der Europäischen Kommission definiert. Sie sollen sicherstellen, dass Metadaten für bestimmte Geodatensätze und -dienste erstellt werden und dass diese Metadaten auf dem neuesten Stand gehalten werden. Diese Metadaten beziehen sich insbesondere auf Datensätze mit geografischen Koordinaten.
es: Los metadatos INSPIRE están definidos por la Comisión Europea. Deben asegurarse de que los metadatos se crean para conjuntos de datos y servicios espaciales específicos, y que esos metadatos se mantienen actualizados. Estos metadatos se centran especialmente en los conjuntos de datos con coordenadas geográficas.
fr: Les métadonnées INSPIRE sont définies par la Commission européenne. Sa mission consiste à s'assurer que des métadonnées sont créées pour des services et jeux de données spatiaux spécifiques, et que celles-ci sont à jour. Ces métadonnées ciblent principalement des jeux de données avec des coordonnées géographiques.
nl: INSPIRE metadata worden gedefinieerd door de Europese Commissie. Ze zouden er moeten voor zorgen dat metadata voor specifieke ruimtelijke datasets worden aangemaakt en dat die metadata up-to-date worden gehouden. Deze metadata richten zich vooral op datasets met geografische coÃ¶rdinaten.

source: For more information about the INSPIRE metadata, please refer to the `INSPIRE knowledge base <https://inspire.ec.europa.eu/metadata/6541>`_. To know how to configure the metadata on the OpenDataSoft platform, refer to the table below.
de: Weitere Informationen zu INSPIRE-Metadaten finden Sie in der `INSPIRE Wissensdatenbank <https://inspire.ec.europa.eu/metadata/6541>`_. In der folgenden Tabelle erfahren Sie, wie Sie die Metadaten auf der OpenDataSoft-Plattform konfigurieren.
es: Para obtener más información acerca de los metadatos INSPIRE, consulte la `Knowledge Base de INSPIRE <https://inspire.ec.europa.eu/metadata/6541>`_. Para aprender a configurar los metadatos en la plataforma OpenDataSoft, consulte la tabla siguiente.
fr: Pour plus d'informations sur les métadonnées INSPIRE, consultez la `base de connaissances INSPIRE <https://inspire.ec.europa.eu/metadata/6541>`_. Pour apprendre à configurer les métadonnées sur la plateforme OpenDataSoft, consultez le tableau ci-après.

source: Theme
de: Thema
es: Tema
fr: Thème
nl: Thema

source: Click on the theme textbox. A drop down selection of themes automatically appears.
de: Klicken Sie auf das Themen-Textfeld. Eine Dropdown-Liste mit Themen wird angezeigt.
es: Haga clic en el cuadro de texto de tema. Automáticamente aparece una selección de temas desplegable.
fr: Cliquez sur la zone de texte Thème ; une liste déroulante des thèmes apparaît automatiquement.
nl: Klik op het thema tekstvak. Er verschijnt automatisch een drop down-selectie van thema's.

source: Click on the chosen theme.
de: Klicken Sie auf das gewünschte Thema.
es: Haga clic en el tema elegido.
fr: Cliquez sur le thème souhaité.
nl: Klik op het gekozen thema.

source: (optional) To add another theme to the dataset, click on the + button on the right of the textbox.
de: (optional) Um dem Datensatz ein weiteres Thema hinzuzufügen, klicken Sie auf die Schaltfläche + rechts neben dem Textfeld.
es: (Opcional) Para añadir otro tema al conjunto de datos, haga clic en el botón + a la derecha del cuadro de texto.
fr: (facultatif) Pour ajouter un autre thème au jeu de données, cliquez sur le bouton + à droite de la zone de texte.
nl: (optioneel) Om een ander thema aan de dataset toe te voegen, klik op de knop + rechts van het tekstvak.

source: (optional) Follow the steps 1 and 2 of this procedure.
de: (optional) Befolgen Sie die Schritte 1 und 2 dieses Verfahrens.
es: (Opcional) Siga los pasos 1 y 2 de este procedimiento.
fr: (facultatif) Suivez les étapes 1 et 2 de cette procédure.
nl: (optioneel) Volg de stappen 1 en 2 van deze procedure.

source: Type
de: Typ
es: Tipo

source: Click on the type textbox. A drop down selection of types automatically appears.
de: Klicken Sie auf das Typen-Textfeld. Eine Dropdown-Liste mit Typen wird angezeigt.
es: Haga clic en el cuadro de texto de tipo. Automáticamente aparece una selección de tipos desplegable.
fr: Cliquez sur la zone de texte Type ; une liste déroulante des types apparaît automatiquement.
nl: Klik op het type tekstvak. Er verschijnt automatisch een drop down-selectie van types.

source: Click on the chosen type.
de: Klicken Sie auf den gewünschten Typ.
es: Haga clic en el tipo elegido.
fr: Cliquez sur le type souhaité.
nl: Klik op het gekozen type.

source: (optional) To add another type to the dataset, click on the + button on the right of the textbox.
de: (optional) Um dem Datensatz einen weiteren Typ hinzuzufügen, klicken Sie auf die Schaltfläche + rechts neben dem Textfeld.
es: (Opcional) Para añadir otro tipo al conjunto de datos, haga clic en el botón + a la derecha del cuadro de texto.
fr: (facultatif) Pour ajouter un autre type au jeu de données, cliquez sur le bouton + à droite de la zone de texte.
nl: (optioneel) Om een andere type aan de dataset toe te voegen, klik op de knop + rechts van het tekstvak.

source: File identifier
de: Dateikennung
es: Identificador de archivo
fr: Identificateur de ressource unique
nl: Bestands-ID

source: Indicate the file identifier in the textbox.
de: Geben Sie die Dateikennung im Textfeld an.
es: Indique el identificador de archivo en el cuadro de texto.
fr: Indiquez l'identificateur de ressource unique dans la zone de texte.
nl: Vermeld het bestands-ID in het tekstvak

source: Contact position
de: Kontaktposition
es: Posición de contacto
fr: Poste du contact
nl: Positie van de contactpersoon

source: Indicate the contact position in the textbox.
de: Geben Sie die Kontaktposition im Textfeld an.
es: Indique la posición de contacto en el cuadro de texto.
fr: Indiquez le poste du contact dans la zone de texte.
nl: Vermeld de positie van de contactpersoon in het tekstvak.

source: Contact address
de: Kontaktadresse
es: Dirección de contacto
fr: Adresse du contact
nl: Adres van de contactpersoon

source: Indicate the contact address in the textbox.
de: Geben Sie die Kontaktadresse im Textfeld an.
es: Indique la dirección de contacto en el cuadro de texto.
fr: Indiquez l'adresse du contact dans la zone de texte.
nl: Vermeld het adres van de contactpersoon in het tekstvak.

source: Purpose
de: Zweck
es: Propósito
fr: Objectif
nl: Doel

source: Indicate the purpose in the textbox. HTML is accepted. A set of formatting options are available in the grey bar at the top of the textbox: hover the buttons for more information and click on the chosen buttons to use any formatting option.
de: Geben Sie den Zweck im Textfeld an. HTML wird akzeptiert. Eine Reihe von Formatierungsoptionen sind in der grauen Leiste oben im Textfeld verfügbar: Bewegen Sie den Mauszeiger über die Buttons für weitere Informationen und klicken Sie auf die ausgewählten Buttons, um eine Formatierungsoption zu verwenden.
es: Indique el propósito en el cuadro de texto. Se acepta HTML. Hay una serie de opciones de formato disponibles en la barra gris sobre el cuadro de texto: pase por encima de los botones para obtener más información y haga clic en los botones elegidos para usar las opciones de formato.
fr: Indiquez l'objectif dans la zone de texte. Le format HTML est accepté. Un ensemble d'options de mise en forme est disponible dans la barre grise, en haut de la zone de texte : survolez les boutons avec la souris pour obtenir plus d'informations, et cliquez sur les boutons de votre choix pour utiliser les options de mise en forme.
nl: Vermeld het doel in het tekstvak. HTML wordt aanvaard; Er is een reeks formatteringsopties beschikbaar in de grijze balk bovenaan het tekstvak: ga met de cursor over de knoppen voor meer informatie en klik op de gekozen knoppen om een formatteringsoptie te gebruiken.

source: Geographic area description
de: Beschreibung des geografischen Bereichs
es: Descripción de área geográfica
fr: Description de la zone géographique
nl: Beschrijving van het geografisch gebied

source: Indicate the description of the geographic area in the textbox.
de: Geben Sie die Beschreibung des geografischen Bereichs im Textfeld an.
es: Indique la descripción del área geográfica en el cuadro de texto.
fr: Indiquez la description de la zone géographique dans la zone de texte.
nl: Vermeld de beschrijving van het geografisch gebied in het tekstvak.

source: Westbound longitude
de: Westlicher Längengrad
es: Longitud Oeste
fr: Longitude Ouest
nl: Lengtegraad west

source: Indicate the Westbound longitude in the textbox.
de: Geben Sie den westlichen Längengrad im Textfeld an.
es: Indique la longitud Oeste en el cuadro de texto.
fr: Indiquez la longitude Ouest dans la zone de texte.
nl: Vermeld de lengtegraad west in het tekstvak

source: Eastbound longitude
de: Östlicher Längengrad
es: Longitud Este
fr: Longitude Est
nl: Lengtegraad oost

source: Indicate the Eastbound longitude in the textbox.
de: Geben Sie den östlichen Längengrad im Textfeld an.
es: Indique la longitud Este en el cuadro de texto.
fr: Indiquez la longitude Est dans la zone de texte.
nl: Vermeld de lengtegraad oost in het tekstvak;

source: Southbound latitude
de: Südlicher Breitengrad
es: Latitud Sur
fr: Latitude Sud
nl: Lengtegraad zuid

source: Indicate the Southbound latitude in the textbox.
de: Geben Sie den südlichen Breitengrad im Textfeld an.
es: Indique la latitud Sur en el cuadro de texto.
fr: Indiquez la latitude Sud dans la zone de texte.
nl: Vermeld de lengtegraad zuid in het tekstvak.

source: Northbound latitude
de: Nördlicher Breitengrad
es: Latitud Norte
fr: Latitude Nord
nl: Lengtegraad noord

source: Indicate the Northbound latitude in the textbox.
de: Geben Sie den nördlicher Breitengrad im Textfeld an.
es: Indique la latitud Norte en el cuadro de texto.
fr: Indiquez la latitude Nord dans la zone de texte.
nl: Vermeld de lengtegraad noord in het tekstvak.

source: Temporal
de: Zeitlich
fr: Période de temps
nl: Tijdelijk

source: Interoperability metadata are activated on demand. They should be configured in the Information tab of the edition interface of a dataset, each type of metadata having their own specific tab. Once the dataset is published, all interoperability metadata will be displayed in the Information tab of the dataset (front office).
nl: Metadata over de interoperabiliteit worden op verzoek geactiveerd. Ze zouden geconfigureerd moeten worden in de Information tab van de bewerkingsinterface van een dataset, waarbij elk type metadata zijn eigen specifieke tab heeft. Eenmaal de data is gepubliceerd, zullen alle metadata over de interoperabiliteit worden weergegeven in de Information tab van de dataset (front office).

source: Custom interoperability metadata can be created and activated on demand. Please contact Opendatasoft to know more about custom interoperability metadata.
nl: Er kunnen gepersonaliseerde metadata over de interoperabiliteit worden gecreÃ«erd en op verzoek worden geactiveerd. Gelieve contact op te nemen met Opendatasoft voor meer informatie over gepersonaliseerde metadata over de interoperabiliteit.

source: For more information about the DCAT metadata, please refer to the `W3C Data Catalog Vocabulary (DCAT) documentation <https://www.w3.org/TR/vocab-dcat/>`_. To know how to configure the metadata on the Opendatasoft platform, refer to the table below.
nl: Voor meer informatie over de DCAT metadata verwijzen we naar de `W3C Data Catalog Vocabulary (DCAT) documentatie <https://www.w3.org/TR/vocab-dcat/>`_. Om te weten hoe u de metadat op het Opendatasoft-platform kunt configureren, verwijzen we naar onderstaande tabel.
