Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/06_configuring_metadata/interoperability_metadata.po
Languages: de, es, fr, nl

source: For more information about the DCAT-AP for Switzerland metadata, please refer to the `related Open Data Handbook <https://handbook.opendata.swiss/en/library/ch-dcat-ap>`_. To know how to configure the metadata on the Opendatasoft plateform, refer to the table below.
nl: Voor meer informatie over de DCAT-AP voor Zwitserland verwijzen we naar het `related Open Data Handbook <https://handbook.opendata.swiss/en/library/ch-dcat-ap>`_. Om te weten hoe u de metadata iin het Opendatasoft-platform kunt configureren, verwijzen we naar onderstaande tabel.

source: For more information about the INSPIRE metadata, please refer to the `INSPIRE knowledge base <https://inspire.ec.europa.eu/metadata/6541>`_. To know how to configure the metadata on the Opendatasoft platform, refer to the table below.
nl: Voor meer informatie over de INSPIRE metadata, verwijzen we naar de `INSPIRE knowledge base <https://inspire.ec.europa.eu/metadata/6541>`_. Om te weten hoe u de metadata op het Opendatasoft-platform kunt configureren, verwijzen we naar onderstaande tabel.
