Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/06_configuring_metadata/metadata.po
Languages: de, es, fr, it, nl

source: Configuring metadata
de: Konfigurieren von Metadaten
es: Configurar los metadatos
fr: Configurer les métadonnées
it: Configurazione dei metadati
nl: Metadata configureren

source: What is metadata?
de: Was sind Metadaten?
es: ¿Qué son los metadatos?
fr: Que sont les métadonnées ?
it: Definizione di metadati
nl: Wat zijn metadata?

source: Metadata is data describing the dataset itself. This is a set of fields describing the data, such as a title, a description, a list of keywords, a modification date, or whether the dataset is compliant to a specific geospatial norm. Adding metadata on a dataset is important to make sure it can be found, understood, and reused by users. In some cases, it can also be important for interoperability, to make sure other systems can understand the content of the dataset.
de: Metadaten sind Daten, die den Datensatz selbst beschreiben. Sie bestehen aus einem Satz Feldern, die die Daten beschreiben, z. B. einen Titel, eine Beschreibung, eine Liste mit Schlüsselwörtern, ein Änderungsdatum oder wenn der Datensatz einer spezifischen raumbezogenen Norm entspricht. Es ist wichtig, Datensätzen Metadaten hinzuzufügen, um sicherzustellen dass die Datensätze von Benutzern gefunden, verstanden und wiederverwendet werden können. In manchen Fällen sind sie auch für die Interoperabilität wichtig, um sicherzustellen, dass andere Systeme den Content des Datensatzes verstehen können.
es: Los metadatos son datos que describen el juego de datos en sí. Es una serie de campos que describen los datos, como un título, una descripción, una lista de palabras claves, una fecha de modificación o si el juego de datos es compatible con una norma geoespacial específica. Añadir metadatos en un juego de datos es importante para asegurarse de que los usuarios puedan encontrarlo, entenderlo y reutilizarlo. En algunos casos, también puede ser importante para la interoperatividad, a fin de asegurarse de que otros sistemas puedan entender el contenido del juego de datos.
fr: Les métadonnées sont les données qui décrivent un jeu de données à proprement parler. Il s'agit d'un ensemble de champs décrivant les données, tels qu'un titre, une description, une liste de mots-clés, une date de modification, ou si le jeu de données est conforme à une norme géospatiale spécifique. Il est important d'ajouter des métadonnées à un jeu de données afin de s'assurer qu'il puisse être détecté, compris et réutilisé par les utilisateurs. Dans certains cas, elles peuvent également être essentielles en termes d'interopérabilité, afin de garantir que les autres systèmes sont en mesure d'interpréter le contenu du jeu de données.
it: I metadati sono dati organizzati in una serie di campi che descrivono un dataset. Ad esempio: titolo, descrizione, elenco di parole chiave, data dell'ultima modifica, conformità del dataset a una determinata norma geospaziale, ecc. L'aggiunta dei metadati a un dataset è importante affinché gli utenti possano individuarlo, comprenderlo e riutilizzarlo appropriatamente. In alcuni casi, può essere rilevante per l'interoperabilità, poiché consente agli altri sistemi di interpretare correttamente il contenuto del dataset.
nl: Metadata zijn data die de dataset zelf omschrijven. Dit is een reeks velden die de data omschrijven, zoals een titel, een omschrijving, een lijst met trefwoorden, een wijzigingsdatum of het feit of de dataset in overeenstemming is met een specifieke geospatiale norm. Het is belangrijk om metadata toe te voegen aan een dataset om ervoor te zorgen dat deze door gebruikers kan worden teruggevonden, begrepen en hergebruikt. In sommige gevallen kan het ook belangrijk zijn voor de interoperabiliteit, om ervoor te zorgen dat andere systemen de content van de dataset kunnen begrijpen.

source: Different kinds of metadata
de: Verschiedene Arten von Metadaten
es: Tipos de metadatos
fr: Les différents types de métadonnées
it: Diversi tipi di metadati
nl: Verschillende soorten metadata

source: The OpenDataSoft platform considers three kinds of metadata:
de: Die OpenDataSoft-Plattform unterscheidet drei Arten von Metadaten:
es: La plataforma OpenDataSoft comprende 3 tipos de metadatos:
fr: La plateforme OpenDataSoft prend en compte trois types de métadonnées :
it: La piattaforma OpenDataSoft considera tre tipi di metadati:
nl: Het OpenDataSoft-platform onderscheidt drie soorten metadata:

source: basic: this is the information users can see in the "Informations" tab of your dataset, and is generally intended to be readable by humans. This includes the title, the license attached to the data... If you want an information to be seen by users on the portal, it should probably be a basic metadata.
de: Basic: Dabei handelt es sich um die Informationen, die Benutzer in dem Tab "Informationen" Ihres Datensatzes sehen können. Sie sollen generell für Menschen lesbar sein. Dazu gehören der Titel, die zu den Daten gehörende Lizenz etc. Falls Sie möchten, dass eine Information für die Portal-Benutzer sichtbar sein soll, muss es sich dabei meist um Basic-Metadaten handeln.
es: Básicos: La información que los usuarios pueden ver en la ficha "Información" del juego de datos, destinada a la lectura humana. Incluye el título, la licencia asociada a los datos... Si desea que los usuarios del portal puedan ver alguna información, probablemente deba formar parte de los metadatos básicos.
fr: Basiques : il s'agit des informations que les utilisateurs peuvent consulter dans l'onglet "Informations" de votre jeu de données. Celles-ci sont généralement conçues pour être lisibles par des humains. Elles comprennent le titre, la licence à laquelle les données sont rattachées... Si vous souhaitez que des informations soient consultables par les utilisateurs du portail, il est conseillé de les ajouter aux métadonnées basiques.
it: Metadati di base: si tratta delle informazioni visualizzate dagli utenti nella scheda "Informazioni" del dataset e sono generalmente espressi in forma comprensibile. Comprendono il titolo, la licenza associata ai dati e così via. Le informazioni che desideri rendere visibili agli utenti sul portale devono essere incluse nei metadati di base.
nl: basis: dit is de informatie die gebruikers kunnen zien in het tabblad "informatie" van uw dataset en is over het algemeen bedoeld om gelezen te kunnen worden door mensen. Dit omvat de titel, de licentie die gekoppeld is aan de data, ... Wanneer u wil dat een bepaald informatie-elementen op het portaal gezien wordt door gebruikers, zou dit waarschijnlijk een basismetadata moeten zijn.

source: interoperability: metadata usually described in specific standards (such as DCAT or INSPIRE), intended for automatic usage by other systems for interoperability purposes, or for regulatory compliance.
de: Interoperabilität: Metadaten, die normalerweise in spezifischen Standards beschrieben werden (wie DCAT oder INSPIRE), vorgesehen für die automatische Nutzung durch andere Systeme zu Interoperabilitätszwecken oder zur Erfüllung gesetzlicher Auflagen.
es: Interoperatividad: Los metadatos normalmente descritos en estándares específicos (como DCAT o INSPIRE), destinados al uso automático por parte de otros sistemas con fines de interoperatividad o cumplimiento de normativas.
fr: Interopérabilité : métadonnées généralement décrites selon des normes spécifiques (par ex. DCAT ou INSPIRE), conçues pour être automatiquement utilisées par d'autres systèmes à des fins d'interopérabilité ou de conformité réglementaire.
it: Metadati di interoperabilità: sono metadati solitamente descritti mediante standard specifici, come DCAT o INSPIRE, e che vengono utilizzati in maniera automatica da altri sistemi ai fini dell'interoperabilità o della conformità normativa.
nl: interoperabiliteit: metadata die meestal beschreven staan in specifieke standaarden (zoals DCAT of INSPIRE), bedoeld voor automatisch gebruik door andere systemen voor interoperabiliteitsdoeleinden of voor regelmatige compliance.

source: extra: metadata intended for specific applications, and not expected to be used by users directly. For example, if you configure your default visualizations on the OpenDataSoft portal, this information is stored as an extra metadata. In most cases, you will never have to access or edit them by yourself.
de: Extra: Metadaten, die für spezifische Anwendungen vorgesehen sind und nicht direkt von Benutzern verwendet werden sollen. Wenn Sie beispielsweise Ihre Standardvisualisierungen auf dem OpenDataSoft-Portal konfigurieren, werden diese Informationen als Extra-Metadaten gespeichert. In den meisten Fällen müssen Sie nicht selbst auf sie zuzugreifen bzw. sie bearbeiten.
es: Metadatos adicionales: Los metadatos destinados a aplicaciones específicas y no al uso directamente de los usuarios. Por ejemplo, si configura las visualizaciones predeterminadas en el portal OpenDataSoft, esta información se almacenará en forma de metadatos adicionales. En la mayoría de los casos, nunca tendrá que acceder a ellos ni editarlos usted mismo.
fr: Supplémentaires : métadonnées conçues pour des applications spécifiques et non pour une utilisation directe par les utilisateurs. Par exemple, si vous configurez vos visualisations par défaut sur le portail OpenDataSoft, ces informations sont stockées en tant que métadonnées supplémentaires. Dans la plupart des cas, vous n'aurez jamais à y accéder ni à les modifier directement.
it: Metadati aggiuntivi: comprendono metadati pensati per applicazioni specifiche e non destinati all’utilizzo da parte degli utenti. Ad esempio, se configuri le tue visualizzazioni predefinite sul portale OpenDataSoft, queste informazioni vengono memorizzate come metadati aggiuntivi. Nella maggior parte dei casi, l’utente non avrà mai bisogno di consultarli o modificarli.
nl: extra: metadata bedoeld voor specifieke applicaties en waarvan niet verwacht wordt dat deze rechtstreeks door gebruikers worden gebruikt. Bijvoorbeeld, wanneer u uw standaard weergaves op het OpenDataSoft-portaal configureert, wordt deze informatie opgeslagen als een extra metadata. In de meeste gevallen zal u nooit zelf toegang ertoe hebben of deze zelf kunnen bewerken;

source: Filling metadata
de: Metadaten ausfüllen
es: Rellenar los metadatos
fr: Saisir les métadonnées
it: Inserimento dei metadati
nl: Metadata opvullen

source: When creating or editing a dataset from the back-office, you can fill the metadata from the "Information" tab.
de: Beim Erstellen oder Bearbeiten eines Datensatzes aus dem Back-Office können Sie die Metadaten aus dem Tab "Informationen" ausfüllen.
es: Al crear o editar un juego de datos del back office, puede rellenar los metadatos en la ficha "Información".
fr: Lors de la création ou de l'édition d'un jeu de données dans le back office, vous pouvez saisir les métadonnées depuis l'onglet "Informations".
it: Durante la creazione o la modifica di un dataset nell'interfaccia di back-office, i metadati vengono inseriti nella scheda "Informazioni".
nl: Wanneer u vanuit de back-office een dataset aanmaakt of bewerkt, kan u de metadata opvullen vanuit het tabblad "Informatie".

source: You are presented with a form representing all the available metadata to fill for the dataset. The first part of the form represents all the basic metadata. The second part of the form represent the groups of interoperability metadata available on the portal.
de: Sie sehen ein Formular, das sämtliche verfügbaren Metadaten zum Ausfüllen für diesen Datensatz darstellt. Der erste Teil des Formulars stellt sämtliche Basic-Metadaten dar. Der zweite Teil des Formulars stellt die Gruppen der Interoperabilitätsmetadaten dar, die auf dem Portal zur Verfügung stehen.
es: Se le presenta un formulario que representa todos los metadatos disponibles para rellenar en relación con el juego de datos. La primera parte del formulario representa todos los metadatos básicos. La segunda parte del formulario representa los grupos de metadatos de interoperatividad disponibles en el portal.
fr: Un formulaire contenant toutes les métadonnées disponibles à saisir pour le jeu de données s'affiche. La première partie du formulaire représente toutes les métadonnées basiques. La deuxième partie du formulaire représente les groupes de métadonnées d'interopérabilité disponibles sur le portail.
it: Il sistema presenta un modulo contenente tutti i metadati che è possibile compilare per il dataset. Nella prima parte sono riportati i metadati di base, mentre nella seconda i gruppi di metadati di interoperabilità disponibili sul portale.
nl: Er wordt u een formulier voorgesteld waarop alle beschikbare metadata staan waarmee de dataset kan worden opgevuld. Het eerste deel vertegenwoordigt alle basis metadata. Het tweede deel van het formulier vertegenwoordigt de interoperabiliteitsgroepen die beschikbaar zijn op het portaal.

source: Standard metadata
de: Standard-Metadaten
es: Metadatos estándar
fr: Métadonnées standard
it: Metadati standard
nl: Standaard metadata

source: The following metadata fields are available by default:
de: Folgende Metadatenfelder stehen standardmäßig zur Verfügung:
es: Los campos de metadatos siguientes están disponibles de forma predeterminada:
fr: Les champs de métadonnées suivants sont disponibles par défaut :
it: I seguenti campi di metadati sono disponibili per impostazione predefinita:
nl: De volgende metadatavelden worden standaard beschikbaar gesteld:

source: **Title**: the title of the dataset
de: **Titel**: der Titel des Datensatzes
es: **Título**: El título del juego de datos.
fr: **Titre** : titre du jeu de données
it: **Titolo**: titolo del dataset
nl: **Titel**: de titel van de dataset

source: **Description**: the full description of the dataset (HTML is accepted)
de: **Beschreibung**: die vollständige Beschreibung des Datensatzes (HTML wird akzeptiert)
es: **Descripción**: La descripción completa del juego de datos (se acepta HTML).
fr: **Description** : description complète du jeu de données (possibilité d'inclure du code HTML)
it: **Descrizione**: descrizione completa del dataset (l’HTML è accettato)
nl: **Omschrijving**: de volledige omschrijving van de dataset (HTML wordt aanvaard)

source: **Geographic area**: the geographical coverage of the data
de: **Geografischer Bereich**: die geografische Abdeckung der Daten
es: **Área geográfica**: La cobertura geográfica de los datos.
fr: **Zone géographique** : couverture géographique des données
it: **Area geografica**: copertura geografica dei dati
nl: **Geografisch gebied**: de geografische dekking van de data

source: **Last modification**: the last modification date of the dataset (manually set)
de: **Letzte Änderung**: das Datum der letzten Änderung des Datensatzes (manuell eingegeben)
es: **Última modificación**: La fecha de la última modificación del juego de datos (definida manualmente).
fr: **Dernière modification** : date de la dernière modification du jeu de données (définie manuellement)
it: **Ultima modifica**: data dell'ultima modifica apportata al dataset, impostata manualmente
nl: **Laatste wijziging**: de datum waarop de dataset het laatst werd gewijzigd (manueel ingesteld)

source: **Language**: the language (as a two-letter language code) of the dataset's data and metadata
de: **Sprache**: die Sprache (als Zwei-Buchstaben-Sprachencode) der Daten und Metadaten des Datensatzes
es: **Idioma**: El idioma (código de idioma de 2 letras) de los datos y metadatos del juego de datos.
fr: **Langue** : langue (code de langue avec deux caractères) des données et des métadonnées du jeu de données
it: **Lingua**: lingua dei dati e dei metadati del dataset, espressa con un codice di due lettere
nl: **Taal**: de taal (als een taalcode van twee letters) van de data en de metadata van de dataset

source: **License**: the license attached to the dataset; should always be filled for any public dataset
de: **Lizenz**: die mit dem Datensatz verbundene Lizenz; muss für jeden öffentlichen Datensatz ausgefüllt werden
es: **Licencia**: La licencia asociada al juego de datos; debe rellenarse siempre para cualquier juego de datos público.
fr: **Licence** : licence rattachée au jeu de données ; champ obligatoire pour les jeux de données publics
it: **Licenza**: licenza associata al dataset, obbligatoria per i dataset pubblici
nl: **Licentie**: de licentie die gekoppeld is aan de dataset; moet altijd ingevuld zijn voor een publieke dataset

source: **Theme**: one or more themes associated to the dataset (Environment...)
de: **Thema**: eines oder mehrere mit dem Datensatz verbundene Themen (Umwelt etc.)
es: **Tema**: Uno o varios temas asociados al juego de datos (Medio ambiente...).
fr: **Thème** : le ou les thèmes sur lesquels porte le jeu de données (environnement...)
it: **Tema**: uno o più temi associati al dataset (ambiente, ecc.)
nl: **Thema**: één of meerdere thema's die verbonden zijn aan de dataset (milieu, ...)

source: **Keywords**: one or more keywords for the dataset, mostly used to make it easier to find in the catalog
de: **Schlüsselwörter**: eines oder mehrere Schlüsselwörter für den Datensatz, meist für eine einfachere Katalogsuche verwendet
es: **Palabras claves**: Una o varias palabras claves para el juego de datos, utilizadas principalmente para facilitar la localización del catálogo.
fr: **Mots-clés** : un ou plusieurs mots-clés pour le jeu de données, ils sont le plus souvent utilisés pour faciliter la recherche dans le catalogue
it: **Parole chiave**: una o più parole chiave, per agevolare il reperimento del dataset all'interno del catalogo
nl: **Trefwoorden**: één of meerdere trefwoorden voor de dataset. Worden meestal gebruikt om het gemakkelijker te maken om in de catalogus terug te vinden

source: **Publisher**: the publisher of the dataset (the name of a person or of an organization)
de: **Veröffentlicher**: der Veröffentlicher des Datensatzes (der Name einer Person oder einer Organisation)
es: **Publicador**: El publicador del juego de datos (el nombre de una persona o una organización).
fr: **Producteur** : producteur du jeu de données (nom d'une personne ou d'une organisation)
it: **Entità di pubblicazione**: editore del dataset, con il nome di una persona o di un'organizzazione
nl: **Uitgever**: de uitgever van de dataset (de naam van een persoon of van een organisatie)

source: **References**: one or more links to indicate the references or sources of the dataset
de: **Referenzen**: einer oder mehrere Links für die Angabe der Referenzen oder Quellen des Datensatzes
es: **Referencias**: Uno o varios vínculos para indicar las referencias o los orígenes del juego de datos.
fr: **Références** : un ou plusieurs liens indiquant les références ou les sources du jeu de données
it: **Riferimenti**: uno o più link per indicare i riferimenti o le origini del dataset
nl: **Referenties**: één of meerdere koppelingen om de referenties of bronnen van de dataset aan te geven

source: Customizing available metadata
de: Anpassen der verfügbaren Metadaten
es: Personalizar los metadatos disponibles
fr: Personnaliser les métadonnées disponibles
it: Personalizzazione dei metadati disponibili
nl: Beschikbare metadata aanpassen

source: It is possible to add custom metadata, or groups of metadata on an OpenDataSoft portal. If you need additional metadata, please contact us for more information.
de: Es können benutzerspezifische Metadaten oder Metadatengruppen auf das OpenDataSoft-Portal gestellt werden. Falls Sie zusätzliche Metadaten benötigen, kontaktieren Sie uns bitte, um weitere Informationen zu erhalten.
es: Puede añadir metadatos personalizados o grupos de metadatos en un portal OpenDataSoft. Si necesita metadatos adicionales, póngase en contacto con nosotros para obtener más información.
fr: Il est possible d'ajouter des métadonnées ou des groupes de métadonnées sur un portail OpenDataSoft. Si vous avez besoin de métadonnées supplémentaires, veuillez nous contacter pour obtenir davantage d'informations.
it: Per esigenze più specifiche, è possibile aggiungere metadati personalizzati o gruppi di metadati al proprio portale OpenDataSoft. In questo caso, ti preghiamo di contattarci per ulteriori informazioni.
nl: Het is mogelijk om aanpasbare metadata of groepen metadata toe te voegen op een OpenDataSoft-portaal. Indien u bijkomende metadata nodig hebt, gelieve dan contact met ons op te nemen voor meer informatie.
