Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/06_configuring_metadata/standard_metadata.po
Languages: de, es, fr, nl

source: Specific: Enter the name of the data location(s) in the textbox ; a drop-down selection of matching location names will appear. Click on the right location(s), which will appear on the map.
es: Específico: especifique el nombre de la(s) ubicación(es) de los datos en el cuadro de texto; aparecerá una selección desplegable de nombres de ubicaciones coincidentes. Haga clic en la(s) ubicación(es) correcta(s), que aparecerán en el mapa.
nl: Specifiek: Voer de naam van de locatie(s) van de dataset in in het tekstvak; er verschijnt een keuzelijst van overeenkomstige locatienamen. Klik op de juiste locatie(s) die op de kaart zullen verschijnen.

source: Caution
es: Precaución
nl: Opgelet

source: All added locations must be at the same administrative level.
es: Todas las ubicaciones añadidas deben estar en el mismo nivel administrativo.
nl: Alle toegevoegde locaties moeten hetzelfde administratieve niveau hebben.

source: Timezone
de: Zeitzone
es: Zona horaria
fr: Fuseau horaire
nl: Tijdzone

source: Forces the dataset visualizations to use the defined timezone for the date and datetime fields. It avoids the dataset visualizations to depend on the timezone on which the user's computer is set.
de: Erzwingt, dass die Visualisierungen des Datensatzes die festgelegte Zeitzone für die Felder Datum und Uhrzeit verwenden. Es wird vermieden, dass die Datensatz-Visualisierungen von der Zeitzone abhängen, auf der der Computer des Benutzers eingestellt ist.
es: Fuerza las visualizaciones de conjuntos de datos a usar la zona horaria definida en los campos de tipo Fecha o Fecha y hora. Impide que las visualizaciones de conjuntos de datos dependan de la zona horaria en la que se haya configurado el equipo del usuario.
fr: Force les visualisations du jeu de données à utiliser le fuseau horaire spécifié pour les champs Date et DateTime. Cela évite que les visualisations du jeu de données dépendent du fuseau horaire sur lequel se trouve l'ordinateur de l'utilisateur.
nl: Forceert de weergave van de dataset om de gedefinieerde tijdzone voor de datum en de datumtijdvelden te gebruiken. Het voorkomt dat de weergaves van een dataset afhangen van de tijdzone waarop de computer van de gebruiker is ingesteld.

source: Click on the arrow on the right of the textbox. A drop down selection of timezones appears.
de: Klicken Sie auf den Pfeil rechts neben dem Textfeld. Eine Dropdown-Auswahl der Zeitzonen wird angezeigt.
es: Haga clic en la flecha a la derecha del cuadro de texto. Automáticamente aparece una selección desplegable de zonas horarias.
fr: Cliquez sur la flèche à droite de la zone de texte. Une liste déroulante des fuseaux horaires s'affiche.
nl: Klik op de pijl rechts van het tekstvak. Er verschijnt een drop down-selectie van tijdzones.

source: Click on the chosen timezone.
de: Klicken Sie auf die gewünschte Zeitzone.
es: Haga clic en la zona horaria elegida.
fr: Cliquez sur le fuseau horaire souhaité.
nl: Klik op de gekozen tijdzone.

source: It is also possible to write in the textbox. Matching results will appear: click on a result to select it.
de: Sie können sie auch in das Textfeld eintragen. Die passenden Ergebnisse werden angezeigt: Klicken Sie auf ein Ergebnis, um es auszuwählen.
es: Se puede escribir también en el cuadro de texto. Aparecerán los resultados coincidentes: haga clic en uno de ellos para seleccionarlo.
fr: Il est aussi possible d'écrire directement dans la zone de texte. Des résultats correspondants s'afficheront : cliquez sur l'un de ces résultats pour le sélectionner.
nl: Het is ook mogelijk om in het tekstvak te schrijven. Overeenkomstige resultaten verschijnen: klik op een resultaat om het te selecteren.

source: **Licensing & Attribution**
es: **Licencia y atribución**
fr: **Licences et attribution**

source: License
de: Lizenz
es: Licencia
fr: Licence
nl: Licentie

source: License attached to the dataset.
de: Die Lizenz, die dem Datensatz zugeordnet ist.
es: La licencia asociada al conjunto de datos.
fr: Licence associée au jeu de données.
nl: Licentie die gekoppeld is aan de dataset.

source: Click on the arrow on the right of the textbox. A drop down selection of :ref:`licences defined for the domain <licenses-config>` automatically appears.
es: Haga clic en la flecha a la derecha del cuadro de texto. Aparece una selección desplegable de :ref:`licencias definidas para el dominio <licenses-config>` .
fr: Cliquez sur la flèche à droite de la zone de texte. Une liste déroulante des :ref:`licences définies pour le domaine <licenses-config>` apparaît automatiquement.
nl: Klik op de pijl rechts van het tekstvak. Er verschijnt automatisch een keuzelijst :ref:`licences defined for the domain <licenses-config>`.

source: Click on the chosen license.
es: Haga clic en la licencia elegida.
fr: Cliquez sur la licence souhaitée.
nl: Klik op de gekozen licentie.

source: Publisher
de: Veröffentlicher
es: Publicador
fr: Producteur

source: Name of the person or organization who published the dataset.
de: Name der Person oder Organisation, die den Datensatz veröffentlicht hat.
es: Nombre de la persona u organización que ha publicado el conjunto de datos.
fr: Nom de la personne ou de l'organisation qui a publié le jeu de données.
nl: Naam van de persoon of organisatie die de dataset publiceert.

source: Write the name of the publisher in the textbox. A list of already used publisher names appears, matching the letters just written. It is possible to click on one of these names to reuse them.
de: Schreiben Sie den Namen des Veröffentlichers in das Textfeld. Es erscheint eine Liste der bereits bekannten Veröffentlicher, entsprechend der Buchstaben, die in das Textfeld geschriebenen werden. Sie können auf einen dieser Namen klicken, um ihn wiederzuverwenden.
es: Escriba el nombre del publicador en el cuadro de texto. Aparece una lista de los nombres de publicador que ya están en uso, acorde con las letras introducidas. Se puede hacer clic en uno de estos nombres para reutilizarlo.
fr: Indiquez le nom du producteur dans la zone de texte. Une liste des noms de producteur déjà utilisés s'affiche, qui correspond aux lettres venant d'être saisies. Vous avez la possibilité de cliquer sur l'un de ces noms pour le réutiliser.
nl: Noteer de naam van de publisher in het tekstvak. Er verschijnt een lijst van al gebruikte namen van publishers die overeenstemmen met de letters die je net hebt genoteerd. Het is mogelijk een van deze namen aan te klikken om ze opnieuw te gebruiken.

source: Reference
de: Referenz
es: Referencia
nl: Referentie

source: Link of the source of the dataset.
de: Link der Quelle des Datensatzes.
es: Vínculo con el origen del conjunto de datos.
fr: Lien de la source du jeu de données.
nl: Link naar de bron van de dataset.

source: Enter the URL of the reference of the dataset in the textbox.
de: Geben Sie die URL der Referenz des Datensatzes in das Textfeld ein.
es: Especifique la dirección URL de la referencia del conjunto de datos en el cuadro de texto.
fr: Saisissez l'URL de la référence du jeu de données dans la zone de texte.
nl: Voer de URL van de referentie van de dataset in het tekstvak in.

source: Attributions
de: Zuordnungen
es: Atribuciones
nl: Toewijzingen

source: Link of a source of the dataset that should be mentioned for legal reasons (e.g. if the license demands the mention of a specific source or organization).
de: Link der Quelle des Datensatzes, der aus rechtlichen Gründen erwähnt werden sollte (z.B. wenn die Lizenz die Angabe einer bestimmten Quelle oder Organisation erfordert).
es: Vínculo con un origen del conjunto de datos que debe mencionarse por motivos legales (p. ej. si la licencia requiere la mención de un origen u organización concreto).
fr: Lien d'une source du jeu de données qui doit être mentionnée pour des raisons légales (par exemple, si la licence exige qu'une source ou organisation spécifique soit mentionnée).
nl: Link naar een bron van de dataset die om wettelijke redenen vermeld zou moeten worden (bijv. wanneer de licentie vereist dat een specifieke bron of organisatie wordt vermeld).

source: Enter the URL of the source in the textbox.
de: Geben Sie die URL der Quelle in das Textfeld ein.
es: Especifique la dirección URL del origen en el cuadro de texto.
fr: Saisissez l'URL de la source dans la zone de texte.
nl: Voer de URL van de bron in het tekstvak in.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Custom standard metadata can be created and activated on demand. Please contact Opendatasoft to know more about custom standard metadata.
de: Auf Anforderung können benutzerdefinierte Standard-Metadaten erstellt und aktiviert werden. Bitte wenden Sie sich an Opendatasoft, um mehr über benutzerdefinierte Standard-Metadaten zu erfahren.
es: Los metadatos estándar personalizados se pueden crear y activar bajo demanda. Póngase en contacto con Opendatasoft para obtener más información acerca de los metadatos estándar personalizados.
fr: Des métadonnées standard personnalisées peuvent être créées et activées à la demande. Veuillez contacter Opendatasoft pour en apprendre davantage sur les métadonnées standard personnalisées.
nl: Gepersonaliseerde standaard metadata kan op verzoek aangemaakt en geactiveerd worden. Gelieve contact op te nemen met Opendatasoft voor meer informatie over gepersonaliseerde standaard metadata.

source: Geographic area
de: Geografischer Bereich

source: Geographic area of the data contained in the dataset. This metadata is directly linked to :ref:`the mini map displayed in the front office of the portal <using-the-minimap>` : if the geographic area metadata is set for a dataset, an end-user will be able to find it through a geographic search of the catalog.
de: Der geografische Bereich der im Datensatz enthaltenen Daten. Diese Metadaten sind direkt mit :ref:`der Minikarte verknüpft, die im Front-Office des Portals angezeigt wird<using-the-minimap>` : Wenn die Metadaten des geografischen Bereichs für einen Datensatz festgelegt sind, kann ein Endbenutzer sie über eine geografische Suche im Katalog finden.

source: None *(default)*: the geographic area won't be set for the dataset, which won't be searchable through the mini map.
de: Keiner *(Standard)*: Der geografische Bereich wird nicht für den Datensatz festgelegt und kann nicht über die Minikarte gesucht werden.
