Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/06_configuring_metadata/standard_metadata.po
Languages: de, es, fr, nl

source: Standard metadata
de: Standard-Metadaten
es: Metadatos estándar
fr: Métadonnées standard
nl: Standaard metadata

source: Standard metadata are common to all Opendatasoft portal. They are the default metadata of any dataset. They should be configured in the Information > Standard tab of the edition interface of a dataset. Once the dataset is published, the standard metadata will be displayed in the Information tab of the dataset (front office).
es: Los metadatos estándar son comunes en todo el portal Opendatasoft. Son los metadatos predeterminados de cualquier conjunto de datos. Deben configurarse en la ficha Información > ficha Estándar de la interfaz de edición de un conjunto de datos. Una vez publicado el conjunto de datos, los metadatos estándar se visualizarán en la ficha Información del conjunto de datos (front office).
fr: Les métadonnées standard sont communes à l'ensemble des portails Opendatasoft. Il s'agit des métadonnées par défaut de tous les jeux de données, et elles doivent être configurées dans l'onglet Informations > Standard de l'interface d'édition d'un jeu de données. Une fois le jeu de données publié, les métadonnées standard apparaissent dans l'onglet Informations de ce jeu de données (interface de navigation).
nl: Standaard metadata zijn gebruikelijk voor alle Opendatasoft-portalen. Ze zijn de standaard metadata voor om het even welke dataset. Ze zouden geconfigureerd moeten worden in de tab Information > Standard van de bewerkingsinterface van een dataset. Eenmaal de dataset is gepubliceerd, zullen de standaard metadata gepubliceerd worden in de Information tab van de dataset (front office).

source: Refer to the table below to know more about the available metadata and how to configure them.
de: In der folgenden Tabelle erfahren Sie mehr über die verfügbaren Metadaten und wie sie konfiguriert werden.
es: Consulte la tabla siguiente para obtener más información acerca de los metadatos disponibles y cómo configurarlos.
fr: Consultez le tableau ci-dessous pour en savoir plus sur les métadonnées disponibles et leur configuration.
nl: Zie onderstaande tabel voor meer informatie over de beschikbare metadata en hoe u ze kunt configureren.

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
nl: Gebruik

source: Title
de: Titel
es: Título
fr: Titre
nl: Titel

source: Title of the dataset. Only metadata located above the edition tabs of the interface instead of in the Information tab.
de: Titel des Datensatzes. Nur Metadaten, die sich über den Bearbeitungs-Registerkarten und nicht in der Registerkarte Informationen befinden.
es: Título del conjunto de datos. Solo los metadatos ubicados en las fichas de edición de la interfaz en lugar de en la ficha Información.
fr: Titre du jeu de données. Il s'agit de la seule métadonnée qui se trouve au-dessus des onglets d'édition de l'interface plutôt que dans l'onglet Informations.
nl: Titel van de dataset. Enkel metadata die boven de bewerkingstabbladen van de interface staan in plaats van in het informatietabblad.

source: Write a dataset title in the textbox. All special characters are supported. Modifying the title does not change the technical identifier of the dataset.
de: Geben Sie einen Datensatz-Titel in das Textfeld ein. Alle Sonderzeichen werden unterstützt. Die Änderung des Titels ändert nichts an der technischen Kennung des Datensatzes.
es: Escriba un título de conjunto de datos en el cuadro de texto. Todos los caracteres especiales están permitidos. Al modificar el título, no se cambia el identificador técnico del conjunto de datos.
fr: Indiquez un titre de jeu de données dans la zone de texte. Tous les caractères spéciaux sont acceptés, et la modification du titre ne change pas l'identifiant technique du jeu de données.
nl: Noteer de titel van de dataset in het tekstvak. Alle bijzondere karakters worden ondersteund. Het wijzigen van de titel wijzigt de technische identifier van de dataset niet.

source: **General information**
es: **Información general**
fr: **Informations générales**
nl: **Algemene informatie**

source: Identifier
de: Kennung
es: Identificador
fr: Identifiant

source: Technical identifier of the dataset.
de: Technische Kennung des Datensatzes.
es: Identificador técnico del conjunto de datos.
fr: Identifiant technique du jeu de données.
nl: Technische identifier van de dataset.

source: Click the "Edit" button. A window opens.
es: Haga clic en el botón "Editar". Se abre una ventana.
fr: Cliquez sur le bouton "Modifier". Une fenêtre s'ouvre alors.
nl: Klik op de knop "Bewerken". Er wordt een venster geopend.

source: Modify the current identifier of the dataset in that window.
es: Modifique el identificador actual del conjunto de datos en esta ventana.
fr: Dans cette fenêtre, modifiez l'identifiant actuel du jeu de données.
nl: Wijzig in dat venster de huidige identifier van de dataset.

source: Click the "Submit" button for the changes to be taken into account.
es: Haga clic en el botón "Enviar" para que se introduzcan los cambios que ha efectuado.
fr: Cliquez sur le bouton "Envoyer" pour que les modifications soient prises en compte.
nl: Klik op de knop "Submit" opdat rekening wordt gehouden met de wijzigingen;

source: Warning
de: Warnung
es: Aviso
fr: Avertissement
nl: Waarschuwing

source: Changing the technical identifier of a dataset could break third-party applications using it. Embedded visualizations from the dataset also won't work anymore. Note also that the technical identifier cannot be modified while the dataset is published.
es: Al cambiar el identificador técnico de un conjunto de datos, pueden interrumpirse las aplicaciones de terceros que lo utilicen. Las visualizaciones incrustadas del conjunto de datos tampoco funcionarán. Además, tenga en cuenta que el identificador técnico no se podrá modificar mientras el conjunto de datos esté publicado.
fr: La modification de l'identifiant technique d'un jeu de données peut altérer les applications tierces qui l'utilisent, ainsi que les visualisations intégrées du jeu de données. Notez également que l'identifiant technique ne peut pas être modifié tant que le jeu de données est publié.
nl: Wanneer de technische identifier van een dataset wordt gewijzigd, zou dit er toe kunnen leiden dat derde applicaties niet meer kunnen worden gebruikt. Embedded weergaves uit de dataset zullen ook niet meer werken. Merk ook op dat de technische identifier niet kan worden gewijzigd terwijl de dataset wordt gepubliceerd.

source: Description of the dataset.
de: Beschreibung des Datensatzes.
es: Descripción del conjunto de datos.
fr: Description du jeu de données.
nl: Beschrijving van de dataset.

source: Write a dataset description in the textbox. HTML is accepted. A set of formatting options are available in the grey bar at the top of the textbox: hover the buttons for more information and click on the chosen buttons to use any formatting option.
de: Schreiben Sie eine Beschreibung des Datensatzes in das Textfeld. HTML wird akzeptiert. Eine Reihe von Formatierungsoptionen sind in der grauen Leiste oben im Textfeld verfügbar: Bewegen Sie den Mauszeiger über die Buttons für weitere Informationen und klicken Sie auf die ausgewählten Buttons, um eine Formatierungsoption zu verwenden.
es: Escriba una descripción del conjunto de datos en el cuadro de texto. Se acepta HTML. Hay una serie de opciones de formato disponibles en la barra gris sobre el cuadro de texto: pase por encima de los botones para obtener más información y haga clic en los botones elegidos para usar las opciones de formato.
fr: Indiquez une description du jeu de données dans la zone de texte. Le format HTML est accepté. Un ensemble d'options de mise en forme est disponible dans la barre grise, en haut de la zone de texte : survolez les boutons avec la souris pour obtenir plus d'informations, et cliquez sur les boutons de votre choix pour utiliser les options de mise en forme.
nl: Noteer een beschrijving van de dataset in het tekstvak. HTML wordt aanvaard. Er is een reeks formatteringsopties beschikbaar in de grijze balk bovenaan het tekstvak: ga met de cursor over de knoppen voor meer informatie en klik op de knoppen om een formatteringsoptie te gebruiken.

source: Themes
de: Themen
es: Temas
fr: Thèmes
nl: Thema's

source: Theme(s) the dataset belongs to. Dataset themes are one of the catalog filters available in the front office of an Opendatasoft portal.
de: Thema/Themen zu dem/denen der Datensatz gehört. Datensatz-Themen sind einer der Katalogfilter, die im Front-Office eines Opendatasoft-Portals zur Verfügung stehen.
es: Tema(s) a que pertenece el conjunto de datos. Los temas de conjunto de datos son uno de los filtros de catálogo disponibles en el front office de un portal Opendatasoft.
fr: Thèmes auxquels le jeu de données appartient. Les thèmes de jeux de données sont l'un des filtres de catalogue disponibles dans l'interface de navigation d'un portail Opendatasoft.
nl: Thema('s) waartoe de dataset behoort. Datasetthema's zijn één van de catalogusfilters die beschikbaar zijn in de front office van een Opendatasoft-portaal.

source: Click on the textbox. A drop down selection of the themes defined for the domain automatically appears.
de: Klicken Sie auf das Textfeld. Eine Dropdown-Liste mit den für die Domain definierten Themen wird automatisch angezeigt.
es: Haga clic en el cuadro de texto. Automáticamente aparece una selección desplegable de los temas definidos para el dominio.
fr: Cliquez sur la zone de texte ; une liste déroulante des thèmes définis pour le domaine apparaît automatiquement.
nl: Klik op het tekstvak. Er verschijnt automatisch een drop down-selectie van de thema's die gedefinieerd zijn voor de dataset.

source: Click on the chosen theme.
de: Klicken Sie auf das gewünschte Thema.
es: Haga clic en el tema elegido.
fr: Cliquez sur le thème souhaité.
nl: Klik op het gekozen thema.

source: (optional) To add another theme to the dataset, click repeat steps 1 and 2 of this procedure.
es: (Opcional) Para añadir otro tema al conjunto de datos, repita los pasos 1 y 2 de este procedimiento.
fr: (facultatif) Pour ajouter un autre thème au jeu de données, répétez les étapes 1 et 2 de cette procédure.
nl: (optioneel) Om een ander thema aan de dataset toe te voegen, klik herhaaldelijk op stappen 1 en 2 van deze procedure.

source: To delete a dataset theme, click on the cross at the right of the dataset theme name.
es: Para eliminar un tema de conjunto de datos, haga clic en la cruz situada a la derecha del nombre del tema de conjunto de datos.
fr: Pour supprimer un thème du jeu de données, cliquez sur la croix située à droite du nom du jeu de données.
nl: Om een thema van de dataset te verwijderen, klik op het kruis rechts van de naam van het thema van de dataset.

source: Keywords
de: Schlüsselwörter
es: Palabras claves
fr: Mots-clés
nl: Kernwoorden

source: Keyword(s) to define the dataset and better find it through searches. Keywords are one of the catalog filters available in the front office of an Opendatasoft portal.
de: Schlüsselwort/Schlüsselwörter, um den Datensatz zu bestimmen und ihn besser über die Suche zu finden. Schlüsselwörter sind einer der Katalogfilter, die im Front-Office eines Opendatasoft-Portals zur Verfügung stehen.
es: Palabra(s) clave para definir el conjunto de datos y mejorar su búsqueda. Las palabras clave son uno de los filtros de catálogo disponibles en el front office de un portal Opendatasoft.
fr: Les mots-clés pour définir le jeu de données et le trouver plus facilement via les recherches. Les mots-clés sont l'un des filtres de catalogue disponibles dans l'interface de navigation d'un portail Opendatasoft.
nl: Trefwoord(en) om de dataset te definiëren en beter terug te vinden door middel van zoekopdrachten. Trefwoorden zijn één van de catalogusfilters die beschikbaar zijn in de front office van een Opendatasoft-portaal.

source: Write a keyword in the textbox. It can contain special characters and be comprised of one or more words.
de: Schreiben Sie ein Schlüsselwort in das Textfeld. Es kann Sonderzeichen enthalten und aus einem oder mehreren Wörtern bestehen.
es: Escriba una palabra clave en el cuadro de texto. Puede contener caracteres especiales y constar de una o varias palabras.
fr: Indiquez un mot-clé dans la zone de texte. Les caractères spéciaux sont acceptés, et plusieurs termes peuvent composer le mot-clé.
nl: Noteer een trefwoord in het tekstvak. Het mag bijzondere karakters bevatten en bestaan uit één of meerdere woorden.

source: (optional) A list of already used keywords appears, matching the letters just written in the textbox. It is possible to click on one of these keywords to reuse them.
de: (optional) Es erscheint eine Liste der bereits verwendeten Schlüsselwörter, entsprechend der Buchstaben, die in das Textfeld geschriebenen werden. Sie können auf eines dieser Schlüsselwörter klicken, um es wiederzuverwenden.
es: (Opcional) Aparece una lista de las palabras clave que ya están en uso, acorde con las letras introducidas en el cuadro de texto. Se puede hacer clic en una de estas palabras clave para reutilizarla.
fr: (facultatif) Une liste des mots-clés déjà utilisés s'affiche, qui correspond aux lettres venant d'être saisies dans la zone de texte. Vous pouvez cliquer sur l'un de ces mots-clés pour le réutiliser.
nl: (optioneel) Een lijst van al gebruikte trefwoorden verschijnt die overeenstemmen met de letters die net genoteerd werden in het tekstvak. Het is mogelijk om een van deze trefwoorden aan te klikken om ze opnieuw te gebruiken.

source: Once the keyword is selected or written, press Enter.
de: Betätigen Sie die Eingabetaste, nachdem das Schlüsselwort eingegeben oder ausgewählt wurde.
es: Una vez seleccionada o escrita la palabra clave, pulse Entrar.
fr: Une fois le mot-clé sélectionné ou saisi, appuyez sur Entrée.
nl: Eenmaal het trefwoord is geselecteerd of genoteerd, druk op Enter:

source: (optional) To add other keywords, repeat steps 1 to 3 of this procedure.
de: (optional) Befolgen Sie die Schritte 1 bis 3 dieses Verfahrens, um weitere Schlüsselwörter hinzuzufügen.
es: (Opcional) Para añadir otras palabras clave, repita los pasos 1-3 de este procedimiento.
fr: (facultatif) Pour ajouter d'autres mots-clés, répétez les étapes 1 à 3 de cette procédure.
nl: (optioneel) Om andere trefwoorden toe te voegen, herhaal stappen 1 tot 3 van deze procedure.

source: To delete a keyword, click on the cross at the right of that keyword.
es: Para eliminar una palabra clave, haga clic en la cruz situada a la derecha de la palabra clave.
fr: Pour supprimer un mot-clé, cliquez sur la croix à droite de celui-ci.
nl: Om een trefwoord te verwijderen, klik op het kruis rechts van dat trefwoord.

source: Display modification date
es: Mostrar fecha de modificación
fr: Afficher la date de modification
nl: Wijzigingsdatum weergeven

source: Date indicating when the dataset was last modified.
de: Datum, zu dem der Datensatz zuletzt geändert wurde.
es: Fecha que indica cuándo se ha modificado el conjunto de datos por última vez.
fr: Date de dernière modification du jeu de données.
nl: Datum waarop de dataset voor het laatst is gewijzigd.

source: The date can either be set manually or automatically.
de: Das Datum kann manuell oder automatisch eingestellt werden.
es: La fecha puede establecerse de forma manual o automática.
fr: Elle peut être définie manuellement ou automatiquement.
nl: De datum kan zowel manueel als automatisch worden ingesteld.

source: To set the date manually, click the "Update manually" switch button. Using the date picker displayed below the button, choose a date and time.
es: Para establecer la fecha manualmente, haga clic en el botón conmutador "Actualizar manualmente". Seleccione la fecha y la hora mediante el seleccionador de fecha que se muestra debajo del botón.
fr: Pour paramétrer manuellement la date, cliquez sur le bouton interrupteur "Mettre à jour manuellement". Sélectionnez un jour et une heure dans le menu de sélection de la date situé sous le bouton.
nl: Om de datum manueel in te stellen, klik op de knop "Update manually". Kies een datum en een tijdstip door gebruik te maken van de date picker die onder de knop staat weergegeven.

source: To set the date automatically, depending on which action should lead to the modification of the date, click either or both:
es: Para establecer la fecha automáticamente, según qué acción conduzca a la modificación de la fecha, haga clic en uno o en ambos:
fr: Pour définir la date automatiquement, en fonction de l'action qui doit conduire à la modification de la date, cliquez sur l'un des boutons suivants, ou les deux :
nl: Om de datum automatisch in te stellen, afhankelijk van welke actie zou moeten leiden tot de wijziging van de datum, klik ofwel op een of beide:

source: the "Update automatically when metadata has changed" switch button,
es: botón conmutador "Actualizar automáticamente al cambiar los metadatos"
fr: "Mettre à jour la date lors d'un changement dans les métadonnées",
nl: de knop "Update automatically when metadata has changed",

source: the "Update automatically when data has changed" switch button.
es: botón conmutador "Actualizar automáticamente al cambiar los datos"
fr: "Mettre à jour la date après un traitement des données".
nl: de knop "Update automatically when data has changed".

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Depending on the dataset, some options can be unavailable. If the dataset is federated, or if there is no data source, the last modification date can only be set manually, or when metadata have changed.
es: Dependiendo del conjunto de datos, puede haber opciones adicionales disponibles. Si se trata de un conjunto de datos federado, o si no hay fuente de datos, la última fecha de modificación solo puede establecerse manualmente, o cuando hayan cambiado los metadatos.
fr: Certaines options peuvent être indisponibles, en fonction du jeu de données. Si celui-ci est fédéré ou qu'il n'y a pas de source de données, la date de dernière modification peut seulement être réglée manuellement ou lors d'un changement dans les métadonnées.
nl: Afhankelijk van de dataset is het mogelijk dat sommige opties niet beschikbaar zijn. Wanneer de dataset is gefedereerd of wanneer er geen databron is, kan de laatste datumwijziging enkel manueel worden ingesteld of wanneer metadata zijn gewijzigd.

source: **Regional information**
es: **Información regional**
fr: **Informations régionales**
nl: **Regionale informatie**

source: Language
de: Sprache
es: Idioma
fr: Langue
nl: Taal

source: Language of the data in the dataset.
de: Die Sprache der Daten im Datensatz.
es: Idioma de los datos del conjunto de datos.
fr: Langue des données du jeu de données.
nl: Taal van de gegevens in de dataset.

source: Click on the drop down menu.
de: Klicken Sie auf das Dropdown-Menü.
es: Haga clic en el menú desplegable.
fr: Cliquez sur le menu déroulant.
nl: Klik op het drop down-menu.

source: Choose a language amongst the Domain languages or other languages available.
de: Wählen Sie eine Sprache unter den Domain-Sprachen oder anderen verfügbaren Sprachen.
es: Elija un idioma de los idiomas de dominio o demás idiomas disponibles.
fr: Choisissez une langue parmi celles des domaines ou les autres langues disponibles.
nl: Kies de taal uit het Domein talen of andere talen die beschikbaar zijn.

source: Geographic coverage
es: Cobertura geográfica
nl: Geografische dekking

source: Geographic coverage of the data contained in the dataset. This metadata is directly linked to :ref:`the geographic filter displayed in the front office of the portal <using-the-minimap>` : if the geographic coverage metadata is set for a dataset, users will be able to find it through a geographic search of the catalog.
es: Cobertura geográfica de los datos que contiene el conjunto de datos. Estos metadatos están vinculados directamente con :ref:`el filtro geográfico que se visualiza en el front office del portal <using-the-minimap>`: si se establecen los metadatos de la cobertura geográfica de un conjunto de datos, los usuarios podrán encontrarlos por medio de una búsqueda geográfica del catálogo.
nl: Geografische dekking van de data in de dataset. Deze metadata is rechtstreeks gekoppeld aan :ref:`de geografische filter die wordt weergegeven in de front office van het portaal <using-the-minimap>` : wanneer de geografische dekkingsmetadata is ingesteld voor een dataset, zullen gebruikers deze kunnen terugvinden door middel van een geografische zoekopdracht van de catalogus.

source: Click the button of the chosen option amongst the following:
es: Haga clic en el botón de la opción elegida entre las siguientes disponibles:
fr: Cliquez sur le bouton correspondant à l'option choisie parmi les suivantes :
nl: Klik op de knop van de gekozen optie uit de volgende:

source: None *(default for datasets without geographical data)*: the geographic coverage won't be set for the dataset, which won't be searchable through the geographic filter.
es: Ninguno *(predeterminado para los conjuntos de datos sin datos geográficos)*: no se establece la cobertura geográfica para el conjunto de datos, que no se podrá buscar mediante el filtro geográfico.
nl: Geen *(standaard voor datasets zonder geografische data)*: de geografische dekking wordt niet ingesteld voor de dataset, die niet opgezocht kan worden door middel van de geografische filter.

source: Automatic *(default)*: if the dataset contains geopoints, the geographic coverage will be automatically defined as the smallest envelope containing all of the records' locations. Note that all data will be taken into account for this computation, regardless of security parameters. If the dataset doesn't contain geopoints, but that a :doc:`Datasets default location </configuring_domain/05_configuring_domain/regional_settings>` was set for the domain, this default location will be used.
es: Automático *(predeterminado)*: si el conjunto de datos contiene puntos geográficos, la cobertura geográfica se definirá automáticamente como el contenedor más pequeño de las ubicaciones de todos los registros. Tenga presente que se tendrán en cuenta todos los datos para este cálculo, independientemente de los parámetros de seguridad. Si el conjunto de datos no contiene puntos geográficos, pero se ha establecido una :doc:`ubicación de conjunto de datos predeterminada </configuring_domain/05_configuring_domain/regional_settings>` para el dominio, se utilizará esta ubicación predeterminada.
nl: Automatisch (*standaard)*: wanneer de dataset geografische punten bevat, zal de geografische dekking automatisch worden gedefinieerd als de kleinste omslag die alle locaties van de records bevat. Merk op dat met alle data rekening zal worden gehouden voor de berekening ervan, ongeacht de beveiligingsparameters. Wanneer de dataset geen geografische punten bevat, maar een :doc:`Standaard locatie van de datasets </configuring_domain/05_configuring_domain/regional_settings>` ingesteld geweest is voor het domein, zal deze standaard locatie worden gebruikt.
