Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/01_managing_security/oidc.po
Languages: de, es, fr, nl

source: Single sign-on with OpenID Connect
de: Single Sign-on mit OpenID Connect
es: SSO (Single Sign-On) con OpenID Connect
fr: Authentification unique avec OpenID Connect
nl: Eenmalig inloggen met OpenID Connect

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: The availability of this feature depends on the license of the Opendatasoft domain.
de: Die Verfügbarkeit dieser Funktion hängt von der Lizenz der Opendatasoft-Domain ab.
es: La disponibilidad de esta función depende de la licencia del dominio Opendatasoft.
fr: La disponibilité de cette fonctionnalité dépend de la licence du domaine Opendatasoft.
nl: De beschikbaarheid van deze functionaliteit hangt af van de licentie van het Opendatasoft-domein.

source: Register your OpenID Connect provider on your domain
de: Registrieren Sie Ihren OpenID Connect-Provider auf Ihrer Domain
es: Registre su proveedor OpenID Connect en el dominio.
fr: Inscrire votre fournisseur OpenID Connect sur votre domaine
nl: Registreer uw OpenID Connect provider op uw domein

source: Navigate to the signup page in the domain configuration interface.
de: Navigieren Sie zur Anmeldeseite in der Domain-Konfigurationsschnittstelle.
es: Navegue a la página de registro de la interfaz de configuración del dominio.
fr: Rendez vous sur la page de configuration des intégrations du domaine.
nl: Ga naar de intekenpagina in de configuratie-interface van het domein.

source: Check "Allow access for OpenID Connect users"
de: Klicken Sie auf "Zugriff für OpenID Connect-Benutzer erlauben"
es: Seleccione "Permitir acceso para usuarios de OpenID Connect".
fr: Activez l'option "Autoriser l'accès aux utilisateurs OpenID Connect".
nl: Vink "Toegang voor gebruikers van OpenID Connect toelaten" aan

source: Copy your provider discovery document in the "OpenID Connect provider information field".
de: Kopieren das Discovery Document Ihres Providers in das "Informationsfeld des Providers OpenID Connect".
es: Copie el documento de descubrimiento del proveedor en el campo "Información del proveedor de OpenID Connect".
fr: Copiez le document de détection de votre fournisseur dans le champ "Informations du fournisseur OpenID Connect".
nl: Kopieer uw ontdekkingsdocument van de proiver in het "OpenID Connect provider informatieveld".

source: This document should be formatted in JSON and can usually be retrieved from your provider endpoint. It must at least contain the following attributes:
de: Dieses Dokument sollte in JSON formatiert sein und kann in der Regel von Ihrem Provider-Endpunkt abgerufen werden. Sie muss mindestens die folgenden Attribute enthalten:
es: Este documento debe tener el formato JSON y normalmente se puede recuperar del extremo del proveedor. Debe contener como mínimo los atributos siguientes:
fr: Ce document doit être au format JSON. Il peut généralement être récupéré depuis le point d'entrée de votre fournisseur. Il doit au minimum contenir les attributs suivants :
nl: Dit document zou moeten worden geformatteerd in JSON en kan meestal opgehaald worden van uw provider eindpunt. Het moet minstens een van de volgende attributen bevatten:

source: If you would like to disable local user creation, making sure only existing users can connect to the platform through OpenID Connect, check the "Disable local user provisioning" checkbox.
de: Wenn Sie die Erstellung lokaler Benutzer deaktivieren und damit sicherstellen möchten, dass nur bereits vorhandene Benutzer über OpenID Connect eine Verbindung zur Plattform herstellen können, so markieren Sie das Kontrollkästchen "Lokale Benutzerbereitstellung deaktivieren".
es: Si desea desactivar la creación de usuarios locales, y asegurarse así de que únicamente los usuarios existentes se conecten a la plataforma con OpenID Connect, marque la casilla "Desactivar aprovisionamiento de usuarios locales".
fr: Si vous souhaitez désactiver la création d'utilisateurs locaux afin que seuls les utilisateurs existants puissent se connecter à la plateforme via OpenID Connect, cochez la case "Désactiver le provisionnement d'utilisateurs locaux".
nl: Indien u het aanmaken van lokale gebruikers zou willen uitschakelen, door ervoor te zorgen dat enkel bestaande gebruikers via OpenID Connect kunnen inloggen op het platform, vink dan "Het aanmaken van lokale gebruikers deactiveren" aan.

source: Input the application credentials associated with your Opendatasoft domain.
de: Geben Sie die Anmeldeinformationen der Anwendung für Ihre Opendatasoft-Domain ein.
es: Introduzca las credenciales de aplicación asociadas al dominio Opendatasoft.
fr: Saisissez les identifiants de l'application associés à votre domaine Opendatasoft.
nl: Voer de gegevens van de applicatie in die verbonden zijn aan uw Opendatasoft-domein.

source: As you have registered your Opendatasoft domain as an OpenID Connect client on your provider, you should get a pair of credentials, namely ``Client ID`` and ``Client secret``.
de: Da Sie Ihre Opendatasoft-Domain als OpenID Connect-Client bei Ihrem Provider registriert haben, sollten Sie entsprechende Anmeldeinformationen erhalten, und zwar "Client ID" und "Client secret".
es: Al registrar su dominio Opendatasoft como cliente OpenID Connect en el proveedor, debe obtener un par de credenciales, denominadas ``ID de cliente`` y ``Secreto de cliente``.
fr: Étant donné que vous avez inscrit votre domaine Opendatasoft en tant que client OpenID Connect sur votre fournisseur, vous devez obtenir une paire d'identifiants, à savoir ``ID client`` et ``Mot de passe client``.
nl: Aangezien u uw Opendatasoft-domein hebt geregistreerd als een OpenID Connect-klant op uw provider, zou u een paar gegevens moeten krijgen, namelijk ``Client ID`` en ``Client secret``.

source: These credentials are used to authenticate requests made by the Opendatasoft plateform on the provider endpoint.
es: Estas credenciales permiten autenticar las solicitudes realizadas por la plataforma Opendatasoft en el extremo del proveedor.
nl: De gegevens worden gebruikt om verzoeken te identificeren die door het Opendatasoft-platform worden gedaan op het eindpunt van de provider.

source: Simply copy these credentials in the "Client ID" and "Client secret" fields.
es: Simplemente copie estas credenciales en los campos "ID de cliente" y "Secreto de cliente".
nl: Kopieer deze gegevens gewoon in de velden "Client ID" en "Client secret".

source: If you would like to use JWT tokens to impersonate API calls on the Opendatasoft platform, check the "Enable direct authentication with JWT bearer tokens" checkbox.
de: Wenn Sie JWT-Tokens verwenden möchten, um API-Aufrufe auf der Opendatasoft-Plattform zu imitieren, markieren Sie das Kontrollkästchen "Direkte Authentifizierung mit JWT-Bearer-Token aktivieren".
es: Si desea usar tokens JWT para suplantar llamadas de API en la plataforma Opendatasoft, marque la casilla "Activar autenticación directa con tokens de portador JWT".
fr: Si vous souhaitez utiliser des jetons JWT pour imiter des appels d'API sur la plateforme Opendatasoft, cochez la case "Autoriser l'authentification directe avec des jetons d'accès JWT".
nl: Indien u JWT-tokens zou willen gebruiken om API-oproepen op het Opendatasoft-platform te imiteren, vink dan het vakje "Rechtstreekse identificatie met JWT bearer tokens activeren" aan.

source: List optional additional scopes
de: Optionale zusätzliche Geltungsbereiche auflisten
es: Lista de ámbitos adicionales opcionales
fr: Répertorier des scopes supplémentaires optionnels
nl: Lijst van optionele bijkomende toepassingsgebieden

source: Scopes in OpenID Connect are used to define the set of information (claims) an application would like to receive about a connected user. By default, Opendatasoft uses the following scopes: openid, profile and email. These scopes make it possible to authenticate a user and to retrieve their email, first name and last name.
es: Los ámbitos en OpenID Connect permiten definir el conjunto de información (reclamaciones) que una aplicación desea recibir sobre un usuario conectado. De forma predeterminada, Opendatasoft utiliza los ámbitos siguientes: openid, perfil y correo electrónico. Estos ámbitos permiten autenticar a un usuario y recuperar su correo electrónico, nombre y apellido.
nl: Toepassingsgebieden in OpenID Connect worden gebruikt om de reeks informatie (claims) te definiÃ«ren die een applicatie zou willen ontvangen over een ingelogde gebruiker. Standaard gebruikt Opendatasoft de volgende toepassingsgebieden: openid, profile en email. Deze toepassingsgebieden maken het mogelijk om een gebruiker te identificeren en om hun e-mail, voornaam en familienaam terug te vinden.

source: You can use additional scopes to add claims as additional attributes in a user's profile and use them in :doc:`datasets security filters </configuring_domain/01_managing_security/portal>`
de: Sie können weitere Geltungsbereiche verwenden, um Ansprüche als zusätzliche Attribute dem Profil eines Benutzers hinzuzufügen und sie in :doc:`Sicherheitsfiltern für Datensätze </configuring_domain/01_managing_security/portal>` zu nutzen.
es: Puede usar ámbitos adicionales para añadir reclamaciones como atributos adicionales en el perfil de un usuario y usarlos en los :doc:`filtros de seguridad de los conjuntos de datos </configuring_domain/01_managing_security/portal>`.
fr: Vous pouvez utiliser des scopes supplémentaires pour ajouter des revendications en tant qu'attributs additionnels dans le profil d'un utilisateur et vous en servir dans les :doc:`filtres de sécurité des jeux de données</configuring_domain/01_managing_security/portal>`.
nl: U kunt bijkomende toepassingsgebieden als bijkomende attributen toevoegen in het profiel van een gebruiker en ze gebruiken in :doc:`veiligheidsfilters voor datasets</configuring_domain/01_managing_security/portal>`

source: List optional additional claims
de: Optionale zusätzliche Ansprüche auflisten
es: Lista de reclamaciones adicionales opcionales
fr: Répertorier des revendications supplémentaires optionnelles
nl: Lijst met optionele bijkomende claims

source: Claims are attributes that are collected during the authentication process and that describe the user. By default, Opendatasoft only stores the `sub` claim. It is possible to store additionnal claims in the user profile. These claims can then be used in :doc:`datasets security filters </configuring_domain/01_managing_security/portal>`.
es: Las reclamaciones son atributos que se recopilan durante el proceso de autenticación y describen al usuario. De forma predeterminada, Opendatasoft solo almacena la reclamación `sub`. Se pueden almacenar reclamaciones adicionales en el perfil de usuario. Estas reclamaciones se podrán usar después en los :doc:`filtros de seguridad de los conjuntos de datos </configuring_domain/01_managing_security/portal>`.
nl: Claims zijn attributen die ingezameld worden tijdens het identificatieproces en die de gebruiker beschrijven. Standaard slaat Opendatasoft enkel de claim `sub` op. Het is ook mogelijk om bijkomende claims op te slaan in het profiel van de gebruiker. Deze claims kunnen dan gebruikt worden in :doc:`veiligheidsfilters voor datasets </configuring_domain/01_managing_security/portal>`.

source: Input the URL on which the user can edit their user profile on the identity provider. When set, a link to this URL will be shown to the user in their user account page. If left blank, no URL will be shown to the user in their account page.
es: Especifique la dirección URL en la que el usuario puede editar su perfil de usuario en el proveedor de identidad. Cuando se haya especificado, el usuario visualizará un enlace a esta dirección URL en la página de su cuenta de usuario. Si se deja en blanco, no se mostrará ninguna dirección URL al usuario en la página de su cuenta.
nl: Voer de URL in waarop de gebruiker zijn gebruikersprofiel kan bewerken op de identiteitsprovider. Wanneer deze is ingesteld, zal een link naar deze URL aan de gebruiker getoond worden in zijn gebruikersaccountpagina. Wanneer deze blanco wordt gelaten, zal geen URL aan de gebruiker worden getoond in zijn accountpagina.

source: Customize the OpenID Connect login link text. If left blank, a localized default message will be displayed.
de: Passen Sie den Text für den Link zum OpenID Connect-Login an. Wenn keine Eingabe erfolgt, wird eine Standardnachricht in der verwendeten Sprache angezeigt.
es: Personalice el texto del vínculo de inicio de sesión de OpenID Connect. Si se deja en blanco, se visualizará un mensaje predeterminado localizado.
fr: Personnalisez le texte du lien de connexion OpenID Connect. Si ce champ n'est pas renseigné, un message localisé par défaut s'affichera.
nl: De tekst van de inloglink voor OpenID Connect personaliseren. Wanneer deze blanco wordt gelaten, zal een gelokaliseerd standaardbericht worden weergegeven.

source: Register your domain on your identity provider
de: Registrieren Sie Ihre Domain bei Ihrem Identity Provider
es: Registre su dominio en el proveedor de identidad.
fr: Inscrire votre domaine sur votre fournisseur d'identité
nl: Registreer uw domein op uw identiteitsprovider

source: The configuration of the identity provider is implementation-dependant, but it usually consists into specifiying on the identity provider the value of the redirection URI, which should be under the form ``https://<YOUR DOMAIN>/oidc/authenticate``.
es: La configuración del proveedor de identidad depende de la implementación, pero suele consistir en especificar en el proveedor de identidad el valor del URI de redirección, que debe tener el formato ``https://<SU_DOMINIO>/oidc/authenticate``.
nl: De configuratie van de identiteitsprovider is implementatie-afhankelijk, maar bestaat meestal uit het specificeren van de waarde van de doorverwijzings-URL op de identiteitsprovider, die onder de vorm ``https://<YOUR DOMAIN>/oidc/authenticate`` zou moeten zijn.

source: Some providers may support a preformated configuration document in JSON format. This document can be downloaded from the following address: ``https://<YOUR DOMAIN>/oidc/client_info``
es: Algunos proveedores pueden admitir un documento de configuración con preformato JSON. Este documento se puede descargar de la dirección siguiente: ``https://<SU_DOMINIO>/oidc/client_info``
nl: Sommige providers kunnen een vooraf geformatteerd configuratiedocument in JSON-formaat ondersteunen. Dit document kan worden gedownload vanaf het volgende adres: ``https://<YOUR DOMAIN>/oidc/client_info``

source: Single logout
es: SLO (Single Log-Out)
fr: Déconnexion unique
nl: Eenmalig uitloggen

source: The Opendatasoft platform supports single logout with OpenID Connect by means of the draft protocol OpenID Connect Back-Channel Logout.
de: Die Opendatasoft-Plattform unterstützt das Single Log-out mit OpenID Connect mittels OpenID Connect Back-Channel Logout.
es: La plataforma Opendatasoft ofrece soporte para SLO (Single Log-Out) con OpenID Connect mediante el protocolo de borrador OpenID Connect Back-Channel Logout.
fr: La plateforme Opendatasoft prend en charge la déconnexion unique avec OpenID Connect via le projet de protocole OpenID Connect Back-Channel Logout.
nl: Het Opendatasoft-platform ondersteunt eenmalig uitloggen met OpenID Connect door middel van een ontwerpprotocol OpenID Connect Back-Channel Logout.

source: These credentials are used to authenticate requests made by the Opendatasoft platform on the provider endpoint.
de: Diese Anmeldeinformationen werden zur Authentifizierung von Anfragen verwendet, die von der Opendatasoft-Plattform auf dem Provider-Endpunkt gestellt werden.
fr: Ces identifiants permettent d'authentifier les requêtes effectuées par la plateforme Opendatasoft sur le point d'entrée du fournisseur.

source: Copy these credentials in the "Client ID" and "Client secret" fields.
de: Kopieren Sie diese Anmeldeinformationen in die Felder "Client ID" und "Client secret".
fr: Copiez ces identifiants dans les champs "ID client" et "Mot de passe client".

source: Scopes in OpenID Connect are used to define the set of information (claims) an application would like to receive about a connected user. By default, Opendatasoft uses the following scopes: openid, profile, and email. These scopes make it possible to authenticate a user and to retrieve their email, first name, and last name.
de: OpenID Connect verwendet Geltungsbereiche, um die Informationen (Ansprüche) zu definieren, die eine Anwendung über einen angemeldeten Benutzer erhalten möchte. Opendatasoft verwendet standardmäßig die folgenden Geltungsbereiche: openid, Profil und E-Mail. Diese Geltungsbereiche ermöglichen die Authentifizierung eines Benutzers und das Abrufen seiner E-Mail sowie seines Vor- und Nachnamens.
fr: Dans OpenID Connect, les scopes sont utilisés pour définir le jeu d'informations (revendications) qu'une application souhaite recevoir au sujet d'un utilisateur connecté. Opendatasoft utilise les scopes suivants par défaut : openid, profil et e-mail. Ces scopes permettent d'authentifier un utilisateur et de récupérer son e-mail, son prénom et son nom de famille.

source: Claims are attributes that are collected during the authentication process and that describe the user. By default, Opendatasoft only stores the `sub` claim. It is possible to store additional claims in the user profile. These claims can then be used in :doc:`datasets security filters </configuring_domain/01_managing_security/portal>`.
de: Ansprüche sind Attribute, die während des Authentifizierungsprozesses erfasst werden und den Benutzer beschreiben. Standardmäßig speichert Opendatasoft nur den Anspruch `sub`. Es ist möglich, weitere Ansprüche im Benutzerprofil zu speichern. Diese Ansprüche können dann in :doc:`Sicherheitsfiltern für Datensätze </configuring_domain/01_managing_security/portal>` verwendet werden.
fr: Les revendications sont des attributs collectés pendant le processus d'authentification. Ces derniers décrivent l'utilisateur. Par défaut, Opendatasoft stocke uniquement la revendication `sub`. Vous avez la possibilité de stocker d'autres revendications dans le profil utilisateur. Ces revendications peuvent ensuite être utilisées dans les :doc:`filtres de sécurité des jeux de données</configuring_domain/01_managing_security/portal>`.

source: Input the URL on which the user can edit their user profile on the identity provider. When set, a link to this URL will be shown to the user on their user account page. If left blank, no URL will be shown to the user on their account page.
de: Geben Sie die URL ein, über die der Benutzer sein Benutzerprofil beim Identity Provider bearbeiten kann. Wenn sie definiert wurde, wird ein Link zu dieser URL auf der Seite seines Benutzerkontos angezeigt. Wenn keine Eingabe erfolgt, wird keine URL auf der Seite der Kontoverwaltung angezeigt.
fr: Saisissez l'URL vers laquelle l'utilisateur peut modifier son profil utilisateur sur le fournisseur d'identité. Une fois ce champ défini, un lien vers cette URL sera affiché pour l'utilisateur sur la page de son compte d'utilisateur. Si ce champ n'est pas renseigné, aucune URL ne s'affichera pour l'utilisateur sur la page de son compte.

source: The configuration of the identity provider is implementation-dependant, but it usually consists of specifying on the identity provider the value of the redirection URI, which should be under the form ``https://<YOUR DOMAIN>/oidc/authenticate``.
de: Die Konfiguration des Identity Providers hängt von der Implementierung ab. Sie besteht jedoch in der Regel darin, dem Identity Provider den Wert der Umleitungs-URL anzugeben, die folgende Form haben sollte:``https://<YOUR DOMAIN>/oidc/authenticate``.
fr: La configuration du fournisseur d'identité dépend de l'implémentation de celui-ci, mais elle consiste généralement à indiquer la valeur de l'URI de redirection sur le fournisseur d'identité, qui doit être au format ``https://<YOUR DOMAIN>/oidc/authenticate``.

source: Some providers may support a preformatted configuration document in JSON format. This document can be downloaded from the following address: ``https://<YOUR DOMAIN>/oidc/client_info``
de: Einige Anbieter unterstützen möglicherweise ein im Vorfeld formatiertes Konfigurationsdokument im JSON-Format: ``https://<YOUR DOMAIN>/oidc/client_info``
fr: Certains fournisseurs peuvent prendre en charge un document de configuration préformaté au format JSON. Ce document peut être téléchargé à l'adresse suivante : ``https://<YOUR DOMAIN>/oidc/client_info``.
