Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/01_managing_security/portal.po
Languages: es, fr, it, nl

source: Configuring your portal's general security policy
es: Configurar la directiva de seguridad general del portal
fr: Configurer la politique de sécurité générale de votre portail
it: Configurazione della politica di sicurezza generale del portale
nl: Het algemeen veiligheidsbeleid van uw portaal configureren

source: Public or private?
es: ¿Público o privado?
fr: Public ou privé ?
it: Pubblico o privato?
nl: Publiek of privaat?

source: The most important choice is whether your portal should be public or private. That is whether you want anonymous users to be able to access the portal or if you'll require people to signup before they can access anything.
es: La decisión más importante es la de elegir si el portal debe ser público o privado. O lo que es lo mismo, si desea que los usuarios anónimos puedan acceder al portal o les exigirá registrarse antes de poder acceder al contenido.
fr: Le choix le plus important consiste à déterminer si votre portail doit être public ou privé. Il s'agit de savoir si des utilisateurs non authentifiés seront en mesure d'accéder au portail ou s'il sera demandé aux visiteurs de s'inscrire pour y accéder.
it: La scelta più importante da fare è sull'eventualità che il tuo portale sia pubblico o privato. Devi cioè decidere se rendere i dati accessibili anche agli utenti anonimi o solo a chi ha effettuato la registrazione.
nl: De belangrijkste keuze is of uw portaal publiek of privaat dient te zijn. Dit is de keuze of u anonieme gebruikers wil toelaten om toegang te krijgen tot het portaal of wanneer u van mensen vereist dat ze zich eerst inschrijven alvorens ze tot iets toegang hebben.

source: Making your portal public doesn't mean that anybody will have access to all of the datasets! You'll always be able to limit what the general public can see through the use of sensible default security parameters for your datasets and explicit parameters on each single dataset.
es: ¡Hacer que el portal sea público no significa que cualquiera pueda acceder a todos los conjuntos de datos! Siempre puede limitar lo que el público en general puede ver estableciendo parámetros de seguridad predeterminados razonables para sus conjuntos de datos y parámetros explícitos en conjuntos de datos individuales.
fr: Le fait de rendre votre portail public ne signifie pas que tout le monde aura accès à l'ensemble des jeux de données ! À l'aide des paramètres de sécurité précis pour les jeux de données et de paramètres explicites pour chacun d'entre eux, il vous sera toujours possible de restreindre ce à quoi les utilisateurs ont accès.
it: Rendere pubblico un portale non significa lasciare libero accesso a tutti i tuoi dataset! Grazie alla precisione dei parametri di sicurezza disponibili, potrai sempre limitare le aree a cui il pubblico avrà accesso, anche impostando parametri espliciti per i singoli dataset.
nl: Uw portaal publiek maken betekent niet dat iedereen toegang zal hebben tot alle datasets! U zal altijd kunnen beperken wat het algemene publiek zal kunnen zien door gebruik te maken van gevoelige standaard veiligheidsparameters voor uw datasets en expliciete parameters voor elke dataset op zich.

source: See the :doc:`dedicated section </publishing_data/09_managing_dataset_security/security>` for more information about dataset security.
es: Consulte la :doc:`sección específica </publishing_data/09_managing_dataset_security/security>` para obtener más información acerca de la seguridad de los conjuntos de datos.
fr: Reportez-vous à la :doc:`section dédiée </publishing_data/09_managing_dataset_security/security>` pour plus d'informations sur la sécurité des jeux de données.
nl: Zie het :doc:`speciale rubriek </publishing_data/09_managing_dataset_security/security>` voor meer informatie over de veiligheid van datasets.

source: This setting can be found in the **security** subsection of the **configuration** section of your portal's back office.
es: Estos parámetros se pueden hallar en la subsección **Seguridad** de la sección **Configuración** del back office del portal.
fr: Ce paramètre se trouve dans la sous-section **sécurité** de la section **configuration** de l'interface d'administration de votre portail.
nl: Deze instelling is terug te vinden in de subsectie **veiligheid** van de sectie **configuratie** van de back-office van uw portaal.

source: Note that if you decide not to allow anonymous users to access your portal, they will be redirected to the login page unless you'd rather they land on a specific page you've written.
es: Tenga en cuenta que si decide no permitir el acceso de los usuarios anónimos al portal, estos serán redirigidos a la página de inicio de sesión salvo que prefiera que vayan a una página concreta que haya creado.
fr: Notez que si vous décidez de ne pas autoriser les utilisateurs non authentifiés à accéder à votre portail, ils seront redirigés vers la page de connexion, sauf si vous préférez qu'ils soient redirigés vers une page spécifique que vous avez créée.
it: Ricorda che se decidi di impedire l'accesso al tuo portale da parte degli utenti anonimi, questi verranno reindirizzati alla pagina di login, a meno che tu non selezioni un'altra pagina da te creata.
nl: Merk op dat, wanneer u beslist om anonieme gebruikers niet toe te laten om zich toegang te verschaffen tot uw portaal, ze doorgestuurd zullen worden naar de inlogpagina tenzij u eerder wil dat ze terecht komen op een specifieke pagina die u hebt geschreven.

source: Signup policy
es: Directiva de registro
fr: Politique d'inscription
it: Politica di registrazione
nl: Intekenbeleid

source: No matter your choice of public or private, you can then decide on who will be able to become a registered member of your portal. In order to do this, go to the **Configuration/Signup** subsection of your portal's back office.
es: Sea cuál sea su elección entre público y privado, posteriormente podrá decidir quién puede convertirse en un miembro registrado del portal. Para ello, vaya a la subsección **Configuración/Registro** del back office del portal.
fr: Quel que soit votre choix, public ou privé, vous pouvez par la suite décider de qui sera en mesure de devenir un membre enregistré de votre portail. Pour ce faire, accédez à la sous-section **Configuration/Inscription** de l'interface d'administration de votre portail.
nl: Ongeacht uw keuze inzake publiek of privaat, kunt u altijd beslissen over wie in staat zal worden gesteld om een geregistreerd lid te worden van uw portaal. Om dit te doen, ga naar de subsectie **Configuratie/Inschrijving** van de back-office van uw portaal.

source: Closed signup policy
es: Directiva de registro cerrado
fr: Politique d'inscription fermée
it: Politica di registrazione chiusa
nl: Gesloten intekenbeleid

source: If you decide not to allow people to signup freely, the only way of adding members to your portal will be through :doc:`direct email invitations </managing_domain/01_managing_users_and_groups/users>`.
es: Si decide no permitir a las personas registrarse libremente, el único modo de añadir miembros al portal será mediante :doc:`invitaciones directas por correo electrónico </managing_domain/01_managing_users_and_groups/users>`.
fr: Si vous décidez de ne pas autoriser les inscriptions publiques, la seule manière d'ajouter des membres à votre portail sera par l'intermédiaire :doc:`d'invitations directes par e-mail </managing_domain/01_managing_users_and_groups/users>`.
nl: Wanneer u beslist om mensen niet toe te laten gratis in te schrijven, kunt u leden enkel aan uw portaal toevoegen door middel van een :doc:`rechtstreekse uitnodiging via e-mail </managing_domain/01_managing_users_and_groups/users>`.

source: Open signup policy
es: Directiva de registro abierto
fr: Politique d'inscription ouverte
it: Politica di registrazione aperta
nl: Open intekenbeleid

source: If you allow people to register, you'll then have to decide whether you want to approve each access request to your portal manually or not. Note that whatever your decision, each member of the portal able to manage users will receive a notification for each new access request.
es: Si permite que las personas se registren, deberá decidir si desea aprobar cada una de las solicitudes de acceso al portal o no manualmente. Tenga en cuenta que, cualquiera que sea su decisión, cada uno de los miembros del portal que pueda administrar usuarios recibirá una notificación para cada una de las solicitudes de acceso nuevas.
fr: Si vous autorisez les inscriptions publiques, il vous faudra alors déterminer si vous souhaitez approuver manuellement ou non chaque demande d'accès à votre portail. Notez que, quelle que soit votre décision, chaque membre du portail autorisé à gérer les utilisateurs recevra une notification pour chaque nouvelle demande d'accès.
nl: Wanneer u daarentegen mensen wil toelaten zich in te schrijven, moet u beslissen of u wil dat elke toegangsaanvraag voor uw portaal al dan niet manueel moet worden goedgekeurd. Merk op dat, ongeacht uw beslissing, elk lid van het portaal dat in staat is om gebruikers te beheren, een kennisgeving zal ontvangen voor elke nieuwe toegangsaanvraag.

source: Do not forget to add the signup button to your header's menu, or people won't see a signup form until they try to access a restricted area of your portal.
es: No olvide añadir el botón de registro al menú del encabezado o, de lo contrario, los visitantes no verán un formulario de registro hasta que intenten acceder a una área restringida del portal.
fr: N'oubliez pas d'ajouter le bouton d'inscription à votre menu d'en-tête, sinon les utilisateurs ne verront pas le formulaire d'inscription avant d'essayer d'accéder à une zone de votre portail dont l'accès est restreint.
nl: Vergeet niet om de intekenknop toe te voegen aan het menu van uw header. Zo niet zullen mensen geen intekenformulier kunnen zien tot ze proberen toegang te krijgen tot een gelimiteerde rubriek op uw portaal.

source: The signup process is usually very straightforward: an email, a password, and that's it. You can decide to customize the experience by setting up a custom text as a disclaimer, request users to accept your terms and conditions, and even require that they leave a message for the portal's administrator (useful when you want to manually approve access requests).
es: El proceso de registro acostumbra a ser muy sencillo: un correo electrónico, una contraseña y listo. Puede decidir personalizar la experiencia configurando un texto específico como aviso de declinación de responsabilidades, solicitar a los usuarios que acepten los términos y condiciones, o incluso solicitarles que dejen un mensaje para el administrador del portal (una opción útil si desea aprobar manualmente cada una de las solicitudes de acceso).
fr: La procédure d'inscription est généralement très simple : une adresse e-mail, un mot de passe, et le tour est joué. Vous pouvez décider de personnaliser l'expérience en utilisant un texte personnalisé comme avis de non-responsabilité, en exigeant des utilisateurs qu'ils acceptent vos conditions d'utilisation et même qu'ils laissent un message à l'administrateur du portail (utile lorsque vous souhaitez approuver manuellement les demandes d'accès).
nl: Het intekenproces is meestal zeer vanzelfsprekend: een e-mail, een wachtwoord en meer is er niet nodig. Wel kan u beslissen om de ervaring aan te passen door een gepersonaliseerde tekst in te stellen als disclaimer, kan u gebruikers vragen om uw algemene voorwaarden te aanvaarden en zelfs vereisen dat ze een bericht nalaten voor de beheerder van het portaal (nuttig wanneer u toegangsaanvragen manueel wil goedkeuren).

source: User session timeout
es: Tiempo de espera de sesión del usuario
fr: Délai d'expiration de session utilisateur
nl: Time-out gebruikerssessie

source: By default, all authenticated users are automatically logged out after a 2-week inactivity period. This duration can be changed in the **Configuration/Security** section of the back office.
es: De forma predeterminada, todos los usuarios autenticados son desconectados automáticamente tras un periodo de 2 semanas de inactividad. La duración de este periodo puede modificarse en la sección **Configuración/Seguridad** del back office.
fr: Par défaut, tous les utilisateurs authentifiés sont automatiquement déconnectés après une période d'inactivité de 2 semaines. Cette durée peut être modifiée dans la section **Configuration/Sécurité** de l'interface d'administration.
nl: Standaard worden alle geauthentificeerde gebruikers na een periode van inactiviteit van 2 weken automatisch uitgelogd. Deze periode kan worden gewijzigd in de rubriek **Configuratie/Veiligheid** van de back-office.

source: Note that every user request to the portal resets the timeout, so sessions can actually last longer than the timeout duration.
es: Tenga en cuenta que cada solicitud del usuario al portal reinicia el tiempo de espera por lo que, en realidad, la sesión puede durar más que el tiempo de espera predeterminado.
fr: Veuillez noter que chaque requête d'utilisateur envoyée au portail réinitialise le délai d'expiration ; les sessions peuvent donc rester actives plus longtemps que la durée spécifiée pour le délai d'expiration.
it: Ogni richiesta al portale da parte dell'utente azzera il timeout. Le sessioni possono quindi avere una durata maggiore dell'intervallo di timeout.
nl: Gelieve er rekening mee te houden dat telkens wanneer een gebruiker een verzoek doet aan het portaal, de time-out opnieuw wordt ingesteld. Dit betekent dat sessies effectief langer kunnen duren dan de time-outperiode.

source: Single sign-on
es: SSO (Single Sign-On)
fr: Authentification unique
nl: Eenmalig intekenen

source: If your organization already has its own identity management system, you can set up a bridge between your identity provider and your Opendatasoft portal. This will give general access to your portal to each of your organization's members.
es: Si su organización ya tiene su propio sistema de gestión de identidades, puede configurar un puente entre el proveedor de identidad y el portal Opendatasoft. De este modo, dará acceso general al portal a todos los miembros de la organización.
fr: Si votre organisation possède déjà son propre système de gestion des identités, vous pouvez configurer un relais entre votre fournisseur d'identité et votre portail Opendatasoft. Cela aura pour conséquence d'octroyer un accès général à votre portail à chacun des membres de votre organisation.
nl: Wanneer uw organisatie reeds haar eigen identiteitsbeheersysteem heeft, kunt u een brug opzetten tussen uw identiteitsprovider en uw Opendatasoft-portaal. Hierdoor wordt een algemene toegang tot uw portaal verleend voor elk van de leden van uw organisatie.

source: Opendatasoft supports two types of identity providers:
es: Opendatasoft admite dos tipos de proveedores de identidad:
fr: Opendatasoft prend en charge deux types de fournisseurs d'identité :
nl: Opendatasoft ondersteunt twee soorten identiteitsproviders:

source: About local users and linked users
es: Acerca de los usuarios locales y los usuarios vinculados
fr: À propos des utilisateurs locaux et des utilisateurs liés
nl: Over plaatselijke gebruikers en gekoppelde gebruikers

source: When a **SAML** or an **OpenID Connect** identity provider is configured on a domain, a user can belong to 3 categories.
es: Cuando hay un proveedor de identidad **SAML** u **OpenID Connect** configurado en un dominio, un usuario puede pertenecer a 3 categorías.
fr: Lorsqu'un fournisseur d'identité **SAML** ou **OpenID Connect** est configuré sur un domaine, un utilisateur peut appartenir à 3 catégories.
nl: Wanneer een **SAML** of een **OpenID Connect** identiteitsprovider geconfigureerd is op een domein, kan een gebruiker tot 3 categorieën behoren.

source: A standard **Opendatasoft user** that was invited by email or signed-up on a domain: this user logs in on the domain using the standard sign-in interface with their usual Opendatasoft username and password and the account is accessible on the whole Opendatasoft network. Opendatasoft users are represented throughout the platform with the |icon-world| pictogram.
es: Un **usuario de Opendatasoft** estándar invitado por correo electrónico o registrado en un dominio: este usuario inicia la sesión en el dominio mediante la interfaz de inicio de sesión estándar con su nombre de usuario y contraseña de Opendatasoft habitual, y la cuenta está accesible en toda la red de Opendatasoft. Los usuarios de Opendatasoft se representan en la plataforma con el pictograma |icon-world|.
fr: Un **utilisateur Opendatasoft** standard qui a été invité par e-mail ou qui s'est inscrit sur un domaine : cet utilisateur se connecte sur le domaine grâce à l'interface de connexion standard avec son nom d'utilisateur et son mot de passe Opendatasoft habituels, et le compte est accessible dans tout le réseau Opendatasoft. Les utilisateurs Opendatasoft sont représentés sur la plateforme par le pictogramme |icon-world|.
nl: Een standaard **Opendatasoft user** die via e-mail werd uitgenodigd of zich heeft geabonneerd op een domein: deze gebruiker logt in op het domein met behulp van de standaard sign-in interface met zijn gebruikelijke gebruikersnaam en wachtwoord van Opendatasoft en dit account is toegankelijk op het volledige Opendatasoft-netwerk. Opendatasoft-gebruikers worden op het volledige platform vertegenwoordigd met het |icon-world| pictogram.

source: A **local user** that authenticates through the organization's identity provider: this user logs in on the domain exclusively via the organization's identity provider, and as it is only available on a specific domain, it can be limited in the use of features relying on the Opendatasoft network. Local users are represented throughout the platform with the |icon-id-card| pictogram.
es: Un **usuario local** que se autentica por medio del proveedor de identidad de la organización: este usuario inicia la sesión en el dominio exclusivamente a través del proveedor de identidad de la organización y, como solo está disponible en un dominio específico, puede tener limitado el uso de funciones basadas en la red de Opendatasoft. Los usuarios locales se representan en la plataforma con el pictograma |icon-id-card|.
fr: Un **utilisateur local** qui s'authentifie via le fournisseur d'identité de l'organisation : cet utilisateur se connecte sur le domaine exclusivement via le fournisseur d'identité de l'organisation, et n'étant disponible que sur un domaine précis, il peut avoir un accès limité à certaines fonctionnalités basées sur le réseau Opendatasoft. Les utilisateurs locaux sont représentés sur la plateforme par le pictogramme |icon-id-card|.
nl: Een **plaatselijke gebruiker** die wordt geauthentificeerd via de IdP van de organisatie: deze gebruiker logt uitsluitend via de IdP van de organisatie in op het domein en aangezien dit enkel beschikbaar is op een specifiek domein, kan het worden beperkt in het gebruik van de functies die vertrouwen op het Opendatasoft-netwerk. Plaatselijke gebruikers worden op het volledige platform vertegenwoordigd met het |icon-id-card| pictogram.

source: A **linked user** that has a standard Opendatasoft account but is associated on this specific domain with an identity from the organization's identity provider. This user is a standard Opendatasoft user that can both authenticate through the Opendatasoft sign-in interface and the organization's identity provider. Since linked users are Opendatasoft users with ``SAML`` or ``OpenID Connect`` authentication abilities, they are represented throughout the platform with both the |icon-world| and the |icon-id-card| pictograms.
es: Un **usuario vinculado** que tiene una cuenta Opendatasoft estándar pero está asociado en este dominio específico a una identidad del proveedor de identidad de la organización. Este usuario es un usuario de Opendatasoft estándar que se puede autenticar tanto por medio de la interfaz de inicio de sesión de Opendatasoft como del proveedor de identidad de la organización. Dado que los usuarios vinculados son usuarios de Opendatasoft con posibilidades de autenticación ``SAML`` u ``OpenID Connect``, se representan en la plataforma con los pictogramas |icon-world| y |icon-id-card|.
fr: Un **utilisateur lié** qui a un compte Opendatasoft standard associé sur ce domaine précis à une identité du fournisseur d'identité de l'organisation. Cet utilisateur est un utilisateur Opendatasoft standard qui peut à la fois s'authentifier via l'interface d'authentification Opendatasoft et via le fournisseur d'identité de l'organisation. Les utilisateurs liés étant des utilisateurs Opendatasoft disposant de la capacité de se connecter via ``SAML`` ou ``OpenID Connect``, ils sont représentés sur la plateforme par les deux pictogrammes |icon-world| et |icon-id-card|.
nl: Een **gekoppelde gebruiker** die een standaard Opendatasoft-account heeft maar gekoppeld is aan dit specifieke domein met een identiteit van de IdP van de organisatie. Deze gebruiker is een standaard Opendatasoft-gebruiker die zich kan authentificeren met behulp van zowel de sign-in interface van Opendatasoft en de IdP van de organisatie. Aangezien gekoppelde gebruikers gebruikers van Opendatasoft zijn met ``SAML`` of ``OpenID Connect`` authentificatiemogelijkheden, worden ze op het volledige platform vertegenwoordigd met zowel het |icon-world| als het |icon-id-card| pictogram.

source: **Local user**
es: **Usuario local**
fr: **Utilisateur local**
nl: **Plaatselijke gebruiker**

source: Every user that has a user account on the identity provider trusted by a domain and doesn't have an Opendatasoft user account can connect through. During the first connection, a local user will be created for the user based on the domain's identity provider settings.
es: Todo usuario que tenga una cuenta de usuario en el proveedor de identidad considerado de confianza por un dominio y no tenga una cuenta de usuario Opendatasoft podrá conectarse. En la primera conexión, se creará un usuario local para el usuario a partir de los valores de configuración del proveedor de identidad del dominio.
fr: Chaque utilisateur disposant d'un compte utilisateur auprès du fournisseur d'identité approuvé par un domaine, mais ne disposant pas d'un compte utilisateur Opendatasoft, peut se connecter. Lors de la première connexion, un utilisateur local sera créé pour l'utilisateur, en fonction des paramètres du fournisseur d'identité du domaine.
nl: Elke gebruiker die een gebruikersaccount op de identiteitsprovider heeft die toevertrouwd is door een domein en geen gebruikersaccount van Opendatasoft heeft, kan inloggen. Wanneer voor het eerst wordt ingelogd, zal een plaatselijke gebruiker worden aangemaakt voor de gebruiker op basis van de instellingen van de identiteitsprovider van het domein.
