Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/01_managing_security/portal.po
Languages: es, fr, it, nl

source: These local users have the permission to explore the public datasets of the domain by default. Extra permissions can be given to these users at the domain level, on individual datasets, or via groups (other than the ``SAML users`` or ``OpenID Connect users`` groups, of which they are automatically members).
es: Estos usuarios locales tienen permiso para explorar los conjuntos de datos públicos del dominio de forma predeterminada. Se pueden conceder permisos adicionales a estos usuarios a nivel de dominio, en conjuntos de datos individuales o mediante grupos (al margen de los grupos de ``usuarios de SAML`` o ``usuarios de OpenID Connect``, del cual son automáticamente miembros).
fr: Ces utilisateurs locaux disposent des permissions pour explorer les jeux de données publics du domaine par défaut. Des permissions supplémentaires peuvent être octroyées à ces utilisateurs au niveau du domaine, pour des jeux de données individuels ou via des groupes (autres que les groupes ``Utilisateurs SAML`` ou ``Utilisateurs OpenID Connect``, auxquels ils appartiennent automatiquement).
nl: Deze plaatselijke gebruikers hebben de toelating om de publieke datasets op het standaard domein te exploreren. Er kunnen extra toelatingen worden gegeven aan deze gebruikers op domeinniveau, op individuele datasets of via groepen (andere dan de groepen ``SAML users`` of ``OpenID Connect users`` waarvan ze automatisch lid zijn).

source: The creation of new local users via an identity provider authentication can be disabled using the "Disable local user provisioning" checkbox in the identity provider configuration (SAML or OpenID Connect) configuration. Disabling local user provisioning will not prevent existing local users from signing in.
es: La creación de nuevos usuarios locales a través de la autenticación de un proveedor de identidad se puede desactivar mediante la casilla de selección "Desactivar aprovisionamiento de usuarios locales" en la configuración del proveedor de identidad (SAML u OpenID Connect). El hecho de desactivar el aprovisionamiento de usuarios locales no impedirá a los usuarios locales existentes iniciar la sesión.
fr: La création d'utilisateurs locaux via l'authentification sur un fournisseur d'identité peut être désactivée en cochant la case "Désactiver le provisionnement d'utilisateurs locaux" dans la configuration du fournisseur d'identité (SAML ou OpenID Connect). La désactivation du provisionnement d'utilisateurs locaux n'empêchera pas les utilisateurs locaux existants de se connecter.
nl: Het aanmaken van nieuwe plaatselijke gebruikers via een IdP authentificatie kan worden gedeactiveerd met behulp van het "Disable local user provisioning" aanvinkvakje in de configuratie van de IdP (SAML of OpenID Connect-configuratie. Het deactiveren van het aanmaken van plaatselijke gebruikers zal niet verhinderen dat bestaande plaatselijke gebruikers intekenen.

source: **Linked user**
es: **Usuario vinculado**
fr: **Utilisateur lié**
nl: **Gekoppelde gebruiker**

source: Users that have an Opendatasoft user account can link this account to another account at the identity provider. This procedure is called account linking.
es: Los usuarios que tengan una cuenta de usuario Opendatasoft podrán vincular esta cuenta a otra cuenta del proveedor de identidad. Este procedimiento se denomina vinculación de cuentas.
fr: Les utilisateurs disposant d'un compte utilisateur Opendatasoft peuvent lier ce dernier à un autre compte du fournisseur d'identité. Cette procédure s'appelle : liaison de comptes.
nl: Gebruikers die een Opendatasoft gebruikersaccount hebben kunnen dit account koppelen aan een andere account bij de identiteitsprovider. Deze procedure wordt "accountkoppeling" genoemd.

source: After the link has been established, linked users who log in through their identity provider will be logged in to their Opendatasoft user account. They'll still be able to log in with their Opendatasoft password, though.
es: Una vez establecido el vínculo, los usuarios vinculados que inicien la sesión a través de su proveedor de identidad iniciarán la sesión en su cuenta de usuario Opendatasoft. No obstante, seguirán pudiendo iniciar la sesión con su contraseña de Opendatasoft.
fr: Une fois la liaison établie, les utilisateurs liés qui se connectent via leur fournisseur d'identité seront connectés à leur compte utilisateur Opendatasoft. Néanmoins, ils seront toujours en mesure de se connecter avec leur mot de passe Opendatasoft.
nl: Nadat de link werd aangemaakt, zullen gebruikers die inloggen via hun IdP ingelogd worden op hun Opendatasoft gebruikersaccount. Ze zullen wel nog kunnen inloggen met hun Opendatasoft wachtwoord.

source: There are 2 methods for linking an Opendatasoft user account:
es: Hay 2 métodos para vincular una cuenta de usuario Opendatasoft:
fr: Il existe 2 méthodes pour lier un compte utilisateur Opendatasoft :
nl: Er zijn twee manieren om een Opendatasoft-gebruikersaccount te koppelen:

source: The first one is to click on ``Link your account to a SAML account on this domain`` or ``Link your account to an OpenID connect account on this domain`` in the identity tab of the user account settings:
es: El primero es hacer clic en ``Vincular la cuenta a una cuenta SAML en este dominio`` o ``Vincular la cuenta a una cuenta OpenID Connect en este dominio`` en la ficha de identidad de la configuración de la cuenta de usuario.
fr: La première consiste à cliquer sur ``Lier votre compte à un compte SAML sur ce domaine`` ou ``Lier votre compte à un compte OpenID Connect sur ce domaine`` dans l'onglet Identité des paramètres de compte utilisateur :
nl: De eerste is om te klikken op ``Link your account to a SAML account on this domain`` of ``Link your account to an OpenID connect account on this domain`` in de identiteitstab van de instellingen van het gebruikersaccount:

source: The other method is to create the link during the user account creation process by clicking the link to complete the registration through SAML. This actually speeds up the user account creation process and allows for a quick account linking:
es: El otro método consiste en crear el vínculo durante el proceso de creación de la cuenta de usuario, haciendo clic en el vínculo para completar el registro a través de SAML. En realidad, esta operación acelera el proceso de creación de la cuenta de usuario y permite vincular la cuenta rápidamente.
fr: L'autre méthode consiste à établir la liaison lors du processus de création du compte utilisateur en cliquant sur le lien permettant de terminer l'inscription via le protocole SAML. Cette méthode permet d'accélérer le processus de création du compte utilisateur et de lier rapidement ce dernier :
nl: De andere methode is om de koppeling aan te maken tijdens het aanmaakproces van het gebruikersaccount door te klikken op de koppeling om de registratie via SAML te voltooien. Hierdoor wordt het aanmaakproces van het gebruikersaccount versneld en wordt een snelle koppeling van het account mogelijk gemaakt:

source: Note
es: Nota
fr: Remarque
nl: Opmerking

source: Linking during sign-in is only supported with SAML identity providers.
es: La vinculación durante el inicio de sesión solo está permitida con proveedores de identidad SAML.
fr: La liaison pendant l'authentification est uniquement prise en charge avec les fournisseurs d'identité SAML.
nl: Koppelen tijdens intekenen wordt enkel ondersteund door SAML-identiteitsproviders.

source: Default login page selection
es: Seleccionar la página de inicio de sesión predeterminada
fr: Sélection de la page de connexion par défaut
nl: Selectie standaard inlogpagina

source: The Opendatasoft platform allows to choose the login page that will be displayed to users when they click on a login link or try to access a restricted page.
es: La plataforma Opendatasoft permite elegir la página de inicio de sesión que se mostrará a los usuarios cuando hagan clic en un enlace de inicio de sesión o intenten acceder a una página restringida.
fr: La plateforme Opendatasoft permet de choisir la page de connexion qui s'affichera lorsque les utilisateurs cliqueront sur un lien d'identification ou essaieront d'accéder à une page à accès limité.
nl: Het Opendatasoft-platform laat toe de inlogpagina te kiezen die weergegeven wordt aan gebruikers wanneer ze op een inloglink klikken of toegang proberen te krijgen tot een pagina waarvan de toegang beperkt is.

source: If the identity provider login page is selected as default, the authentication flow (SAML or OpenID Connect) will be initiated automatically if an anonymous user clicks on the login link or try to access a restricted page like the back office. When the identity provider login page is selected, users who wish to connect to the platform using their Opendatasoft credentials have the option to do so by manually visiting the domain login page at ``https://<platform-url>/login/``.
es: Si se selecciona como página predeterminada la página de inicio de sesión del proveedor de identidad, el flujo de autenticación (SAML u OpenID Connect) se iniciará automáticamente en el caso de que un usuario anónimo haga clic en el enlace de inicio de sesión o intente acceder a una página restringida, como puede ser el back office. Si se selecciona la página de inicio de sesión del proveedor de identidad, los usuarios que deseen conectarse a la plataforma con las credenciales de Opendatasoft tienen la opción de hacerlo manualmente visitando la página de inicio de sesión del dominio en ``https://<platform-url>/login/``.
fr: Si la page de connexion du fournisseur d'identité est sélectionnée par défaut, le processus d'identification (SAML ou OpenID Connect) sera démarré automatiquement lorsqu'un utilisateur non authentifié cliquera sur le lien de connexion ou essaiera d'accéder à une page dont l'accès est limité, comme l'interface d'administration. Lorsque la page de connexion du fournisseur d'identité est sélectionnée, les utilisateurs qui souhaitent se connecter à la plateforme avec leurs identifiants Opendatasoft auront la possibilité de le faire en se rendant sur la page de connexion du domaine à l'adresse ``https://<platform-url>/login/``.
nl: Wanneer de IdP inlogpagina wordt geselecteerd als standaard, zal de authentificatiestroom (SAML of OpenID Connect) automatisch worden opgestart wanneer een anonieme gebruiker op de inloglink klikt of toegang probeert te krijgen tot een pagina waarvan de toegang beperkt is, zoals de back office. Wanneer de IdP inlogpagina wordt geselecteerd, hebben gebruikers, die met hun Opendatasoft-gegevens willen inloggen op het platform, de mogelijkheid om dit te doen door de inlogpagina van het domein handmatig te bezoeken via ``https://<platform-url>/login/``.

source: Using user attributes to filter data
es: Utilizar atributos de usuario para filtrar datos
fr: Utilisation des attributs utilisateur pour filtrer des données
nl: Gebruikersattributen gebruiken om data te filteren

source: Users who have been logged in through identity federation (SAML 2.0 or OpenID Connect) may have been set specific profile attributes. These attributes can be used to filter the content of the datasets these users can access.
es: Los usuarios que han iniciado la sesión a través de la federación de identidades (SAML 2.0 u OpenID Connect) pueden tener configurados atributos de perfil específicos. Estos atributos se pueden usar para filtrar el contenido de los conjuntos de datos al que pueden acceder estos usuarios.
fr: Les utilisateurs qui se sont connectés via la fédération d'identité (SAML 2.0 ou OpenID Connect) peuvent avoir défini des attributs de profil spécifiques. Ces derniers peuvent être utilisés pour filtrer le contenu des jeux de données auxquels ces utilisateurs ont accès.
nl: Voor gebruikers die hebben ingelogd via identiteitssamenvoeging (SAML 2.0 of OpenID Connect) kunnen specifieke profielattributen zijn ingesteld. Deze attributen kunnen gebruikt worden om de inhoud van datasets waar deze gebruikers toegang tot kunnen hebben, te filteren.

source: To do so, you can edit the :doc:`security configuration </publishing_data/09_managing_dataset_security/security>` of a specific dataset and use the #attr function in the filter query of the **SAML** or **OpenID Connect** security group attached to the dataset. This way, users belonging to these groups will only see dataset records that match the filtering query, as explained below.
es: Para ello, puede editar la :doc:`configuración de seguridad </publishing_data/09_managing_dataset_security/security>` de un conjunto de datos específico y usar la función #attr en la consulta de filtro del grupo de seguridad **SAML** u **OpenID Connect** asociado al conjunto de datos. De este modo, los usuarios pertenecientes a estos grupos solo verán los registros de conjunto de datos coincidentes con la consulta de filtro tal como se explica a continuación.
fr: Pour ce faire, vous pouvez modifier la :doc:`configuration de sécurité </publishing_data/09_managing_dataset_security/security>` d'un jeu de données spécifique et utiliser la fonction #attr dans la requête de filtre du groupe de sécurité **SAML** ou **OpenID Connect** associé à ce jeu de données. Ainsi, les utilisateurs appartenant à ces groupes seront uniquement en mesure de voir les enregistrements de jeu de données qui correspondent à la requête de filtrage, comme expliqué ci-dessous.
nl: Om dit te doen, kunt u de :doc:`veiligheidsconfiguratie </publishing_data/09_managing_dataset_security/security>` van een specifieke dataset bewerken en de #attr functie gebruiken in de filterzoekopdracht van de **SAML** of **OpenID Connect** veiligheidsgroep die gekoppeld is aan de dataset. Zo zullen gebruikers die tot deze groepen behoren enkel de dataset records kunnen zien die overeenstemmen met de filterzoekopdracht, zoals hieronder staat uitgelegd.

source: Through the #attr function, it is possible to filter dataset records in such a way that the only records returned are the ones that match a value set in the user attributes sent by the identity provider. For the following examples, we assume that we have the 3 users, with respective usernames and SAML attributes ``user-country`` and ``user-language``:
es: Mediante la función #attr, se pueden filtrar los registros de conjunto de datos de modo que solo se devuelvan los registros que coincidan con un valor establecido en los atributos de usuario enviados por el proveedor de identidad. En los ejemplos siguientes, suponemos que tenemos los 3 usuarios con los nombres de usuario y atributos SAML ``user-country`` y ``user-language`` respectivos:
fr: La fonction #attr vous permet de filtrer les enregistrements d'un jeu de données de façon que seuls les enregistrements renvoyés soient ceux qui correspondent à une valeur définie dans les attributs utilisateur envoyés par le fournisseur d'identité. Dans les exemples suivants, nous partons du principe que nous avons 3 utilisateurs avec des noms d'utilisateur et attributs SAML respectifs ``user-country`` et ``user-language`` :
nl: Via de #attr functie is het mogelijk om dataset records zodanig te filteren dat de enige records die worden weergegeven die zijn die overeenstemmen met een waarde die ingesteld is in de attributen van de gebruiker die worden doorgestuurd door de identiteitsprovider. Voor de volgende voorbeelden gaan we ervan uit dat we de 3 gebruikers hebben, met de respectieve gebruikersnamen en SAML-attributen ``user-country`` en ``user-language``:

source: User
es: Usuario
fr: Utilisateur
nl: Gebruiker

source: User1
fr: Utilisateur1
nl: Gebruiker1

source: France
es: Francia
nl: Frankrijk

source: French
es: Francés
fr: Français
nl: Frans

source: User2
fr: Utilisateur2
nl: Gebruiker2

source: User3
fr: Utilisateur3
nl: Gebruiker3

source: United States
es: Estados Unidos
fr: États-Unis
nl: Verenigde Staten

source: English
es: Inglés
fr: Anglais
nl: Engels

source: And a dataset with the following records:
es: Y un conjunto de datos con los registros siguientes:
fr: Et un jeu de données avec les enregistrements suivants :
nl: En een dataset met de volgende records:

source: Worldwide
fr: Monde
nl: Wereldwijd

source: Hello world
nl: Hallo wereld

source: Hello to all Canadians
nl: Hallo aan alle Canadezen

source: Hello to all Americans
nl: Hallo aan alle Amerikanen

source: We can restrict these users so that they see only messages that apply to their respective countries, with the query ``#attr(country, user-country)``.
es: Podemos restringir estos usuarios de modo que solo vean los mensajes que son válidos para sus países respectivos, con la consulta ``#attr(country, user-country)``.
fr: Nous pouvons limiter ces utilisateurs de façon qu'ils voient uniquement les messages concernant leur pays respectif en utilisant la requête "#attr(country, user-country)".
nl: We kunnen deze gebruikers zodanig beperken dat ze enkel die berichten zien die van toepassing zijn op hun respectieve landen, met de zoekopdracht ``#attr(country, user-country)``.

source: User1 sees
es: User1 ve
fr: Utilisateur1 voit
nl: Gebruiker1 ziet

source: User2 sees
es: User2 ve
fr: Utilisateur2 voit
nl: Gebruiker2 ziet

source: User3 sees
es: User3 ve
fr: Utilisateur3 voit
nl: Gebruiker3 ziet

source: We can also restrict these users so that they only see messages that are in their respective language, with the query ``#attr(language, user-language)``.
es: También podemos restringir estos usuarios a fin de que solo vean los mensajes que están en su idioma respectivo, con la consulta ``#attr(language, user-language)``.
fr: Nous pouvons également limiter ces utilisateurs de façon qu'ils voient uniquement les messages dans leur langue respective en utilisant la requête "#attr(language, user-language)".
nl: We kunnen deze gebruikers ook zodanig beperken dat ze enkel berichten zien die in hun respectieve taal zijn weergegeven, met de zoekopdracht ``#attr(language, user-language)``.

source: Since it is a function of the query language, it can also be grouped with the usual operators. For example, we can restrict users to only seeing messages that fit their country and languages with the query ``#attr(language, user-language) AND #attr(country, user-country)``.
es: Al ser una función del lenguaje de consulta, también se puede agrupar con los operadores habituales. Por ejemplo, podemos restringir los usuarios para que solo vean los mensajes adecuados para su país e idioma con la consulta ``#attr(language, user-language) AND #attr(country, user-country)``.
fr: Cette fonction étant propre au langage de requête, elle peut également être combinée aux opérateurs habituels. Nous pouvons, par exemple, limiter les utilisateurs de façon qu'ils voient uniquement les messages adaptés à leur pays et à leur langue en utilisant la requête ``#attr(language, user-language) AND #attr(country, user-country)``.
nl: Aangezien het een functie is van de taal van de zoekopdracht, kan ze ook gegroepeerd worden met de gebruikelijke operatoren. Zo kunnen we bijvoorbeeld gebruikers beperken tot diegene die enkel berichten zien die passen bij hun land en hun talen, en dit met de zoekopdracht ``#attr(language, user-language) AND #attr(country, user-country)``.

source: :doc:`SAML 2.0 ready identity providers </configuring_domain/01_managing_security/saml>`
fr: :doc:`Fournisseurs d'identité compatibles SAML 2.0 </configuring_domain/01_managing_security/saml>`

source: :doc:`OpenID Connect ready identity providers </configuring_domain/01_managing_security/oidc>`
fr: :doc:`Fournisseurs d'identité compatibles OpenID Connect </configuring_domain/01_managing_security/oidc>`

source: Canada
es: Canadá

source: This setting can be found in the **security** subsection of the **configuration** section of your portal's backoffice.
it: Per configurare questa impostazione sul tuo portale, clicca su **Sicurezza** nella sezione **Configurazione** dell'interfaccia di back-office.

source: No matter your choice of public or private, you can then decide on who will be able to become a registered member of your portal. In order to do this, go to the **Configuration/Signup** subsection of your portal's backoffice.
it: A prescindere dalla scelta tra un portale pubblico e privato, potrai sempre decidere chi potrà diventare un membro registrato del tuo portale. Per fare ciò, accedi alla sezione **Configurazione/Crea un account** dell'interfaccia di back-office.

source: If on the other hand you allow people to register, you'll then have to decide whether you want to manually approve each access request to your portal or not. Note that whatever your decision, each member of the portal able to manage users will receive a notification for each new access request.
it: Al contrario, se consenti agli utenti di registrarsi, dovrai poi decidere se impostare l'approvazione manuale di ogni richiesta di accesso. Ricorda che, qualunque sia la tua decisione, tutti i membri del portale autorizzati a gestire gli utenti riceveranno una notifica a ogni nuova richiesta di accesso.

source: Do not forget to add the signup button to your header's menu or people won't see a signup form until they try to access a restricted area of your portal.
it: Non dimenticare di aggiungere il pulsante per la creazione dell'account nel menu dell'header, altrimenti gli utenti non avranno accesso al modulo di registrazione fino a che non proveranno a entrare in un'area riservata del portale.

source: The signup process is usually very straightforward: an email, a password and that's it. You can however decide to customize the experience by setting up a custom text as disclaimer, request users to accept your terms and conditions and even require that they leave a message for the portal's administrator (useful when you want to manually approve access requests).
it: La procedura di registrazione è solitamente molto semplice: un'e-mail e una password, niente di più. Tuttavia, puoi sempre scegliere di arricchirla con testi personalizzati, come la dichiarazione di non responsabilità, la richiesta agli utenti di accettare le condizioni generali o anche l'invito a lasciare un messaggio all'amministratore del portale, particolarmente utile in caso di approvazione manuale delle richieste.

source: Granting access for all of your organisation's members
it: Come autorizzare l'accesso dei membri della tua organizzazione

source: If your organisation already has its own credentials management system, you can set up a bridge between your identity provider and your OpenDataSoft portal. This will give general access to your portal (no specific rights) to each of your organisation's members.
it: Se la tua organizzazione possiede già un sistema di gestione delle credenziali, puoi impostare un bridge tra il tuo provider di identità e il portale OpenDataSoft. In questo modo, autorizzerai l'accesso al portale da parte dei membri della tua organizzazione, senza definire diritti specifici.

source: Configuring the users' authenticated sessions timeout
it: Configurazione del timeout nelle sessioni autenticate degli utenti

source: By default, all authenticated users are automatically logged out after a 2-week inactivity period. This duration can be changed in the **Configuration/Security** section of the backoffice.
it: Per impostazione predefinita, tutti gli utenti autenticati vengono automaticamente disconnessi dopo un periodo di inattività di 2 settimane. Questo intervallo di tempo può essere modificato nella sezione **Configurazione/Sicurezza** del back-office.
