Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/01_managing_security/saml.po
Languages: de, es, it, nl

source: For instance, if your users are defined by the attribute "FirstName" and "LastName" transmitted by your IdP, first input "FirstName" in the box and press enter, then "LastName" and press enter again.
de: Wenn Ihre Benutzer beispielsweise durch das von Ihrem IdP übermittelte Attribut "FirstName" und "LastName" definiert sind, geben Sie zunächst "FirstName" in die Box ein, drücken Sie auf Enter, geben Sie danach "LastName" ein und drücken Sie erneut auf Enter.
es: Por ejemplo, si los usuarios se definen por los atributos "FirstName" y "LastName" transmitidos por el IdP, primero especifique "FirstName" en la casilla y pulse Entrar, y después "LastName" y vuelva a pulsar Entrar.
it: Ad esempio, se i tuoi utenti sono definiti dall'attributo "Nome" e "Cognome" trasmesso dal tuo IdP, prima inserisci "Nome" nella casella, poi premi Invio e infine inserisci "Cognome", sempre seguito da Invio.
nl: Bijvoorbeeld, wanneer uw gebruikers worden geïdentificeerd worden door het attribuut "FirstName" en "LastName" dat wordt doorgestuurd door uw IdP, voer dan eerst "FirstName" in het vakje en druk op Enter, en vervolgens "LastName" en druk opnieuw op Enter.

source: Input the attributes mappings for the username, last name, first name and email address.
de: Geben Sie die Attribut-Mappings für den Benutzernamen ein: Nachname, Vorname und E-Mail-Adresse.
es: Introduzca las asignaciones de atributos correspondientes al nombre de usuario, el apellido, el nombre y la dirección de correo electrónico.
it: Inserisci la mappatura degli attributi per username, cognome, nome e indirizzo e-mail.
nl: Voer de mappings van attributen voor de gebruikersnaam, familienaam, voornaam en e-mailadres in.

source: Here, you need to declare the fields names as they are sent by the identity provider.
de: Hier müssen Sie die Feldnamen angeben, wie sie vom Identity Provider gesandt wurden.
es: Aquí tiene que declarar los nombres de campo tal como los ha enviado el proveedor de identidad.
it: Qui dovrai digitare i nomi dei campi nello stesso formato fornito dal provider di identità.
nl: Hier moet u de namen van de velden aangeven aangezien deze door de identiteitsprovider zijn opgestuurd.

source: For instance, if your identity provider transmits the connected user's first name in an attribute called "GivenName", this is what you will need to type in the "First name" field.
de: Wenn Ihr Identity Provider beispielsweise den Vornamen des verbundenen Benutzers in einem Attribut namens "GivenName" übermittelt, ist es dieser Name, den Sie in das Feld "FirstName" eingeben müssen.
es: Por ejemplo, si el proveedor de identidad transmite el nombre del usuario conectado en un atributo denominado "GivenName", esto es lo que usted deberá escribir en el campo "First name".
it: Ad esempio, se il tuo provider di identità trasmette il nome dell'utente connesso in un attributo denominato "NomeProprio", sarà questo a dover essere inserito nel campo "Nome".
nl: Bijvoorbeeld, wanneer uw identiteitsprovider de aan de gebruiker verbonden voornaam overmaakt in een attribuut met de naam "GivenName", is het dit wat u moet invullen in het veld "FirstName".

source: If for any reason your identity provider doesn't send all of these elements, let the corresponding fields blank. The platform will automatically generate them based on other available attributes.
de: Falls Ihr Identity Provider Ihnen aus irgendeinem Grund nicht alle diese Elemente übermittelt, lassen Sie die entsprechenden Felder bitte frei. Die Plattform generiert sie automatisch auf Grundlage anderer verfügbarer Attribute.
es: Si por algún motivo el proveedor de identidad no enviara todos estos elementos, deje los campos correspondientes en blanco. La plataforma los generará automáticamente a partir de los demás atributos disponibles.
it: Se per qualsiasi motivo il provider di identità non invia tutti questi elementi, lascia vuoti i rispettivi campi. La piattaforma li genererà automaticamente a partire dagli attributi disponibili.
nl: Wanneer uw identiteitsprovider om een of andere reden niet al deze elementen opstuurt, dient u de overeenkomstige velden leeg te laten. Het platform zal deze automatisch genereren op basis van andere beschikbare attributen.

source: Input an access condition.
es: Especifique una condición de acceso.
nl: Een toegangsvoorwaarde invoeren.

source: The first box is the name of the attribute to check for, and the second one the value of that attribute. If you just want to check for the presence of an attribute, without value restriction, just leave the second box blank. If both fields are left blank no condition is set and any successful login on the IdP side will trigger a login on your Opendatasoft domain.
es: La primera casilla es el nombre del atributo que se examinará y el segundo es el valor de ese atributo. Si solo desea comprobar la presencia de un atributo, sin restricción de valor alguna, deje la segunda casilla en blanco.Si se dejan ambos campos vacíos, no se establece ninguna condición y cualquier inicio de sesión satisfactorio en el lado del IdP desencadenará un inicio de sesión en el dominio Opendatasoft.
nl: Het eerste vakje is de naam van het attribuut dat gecontroleerd moet worden en het tweede is de waarde van dat attribuut. Indien je enkel de aanwezigheid van een attribuut wilt controleren zonder waardebeperking, kunt u het tweede vakje gewoon blanco laten. Wanneer beide velden blanco worden gelaten, wordt er geen voorwaarde ingesteld en zal elke succesvolle login op de IdP-zijde aanleiding geven tot een login op uw Opendatasoft-domein.

source: For instance, if your identity provider sends a list of "Roles" for the users and you want to make sure that only users that have a role can get access, input "Roles" in the first box under "Conditionnal access". If you only want users with the role "DataAccess" to be able to connect to the domain, input "DataAccess" in the second box.
de: Falls Ihnen beispielsweise Ihr Identity Provider eine Liste mit "Rollen" für die Benutzer zuschickt und Sie sicherstellen wollen, dass nur diejenigen Benutzer Zugang erhalten, die eine Rolle haben, dann geben Sie "Rollen" in die erste Box unter "Bedingter Zugang" ein. Wenn Sie nur Benutzern mit der Rolle "DataAccess" eine Verbindung zur Domain erlauben wollen, geben Sie bitte "DataAccess" in die zweite Box ein.
es: Por ejemplo, si el proveedor de identidad envía una lista de "Roles" para los usuarios y desea comprobar que solo puedan acceder los usuarios que tengan un rol, introduzca "Roles" en la primera casilla bajo "Acceso condicional". Si desea que solo puedan conectarse al dominio los usuarios con el rol "DataAccess", introduzca "DataAccess" en la segunda casilla.
it: Ad esempio, se il tuo provider di identità invia un elenco di ruoli ("Roles") per gli utenti e desideri concedere l'accesso solo agli utenti che ne abbiano uno, inserisci "Roles" nella prima casella, sotto la sezione "Accesso condizionale". Se poi vuoi che l'accesso sia riservato solo agli utenti con il ruolo di "DataAccess", inserisci "DataAccess" nella seconda casella.
nl: Bijvoorbeeld, wanneer uw identiteitsprovider een lijst met "Rollen" voor de gebruikers opstuurt en u er zeker van wil zijn dat enkele gebruikers die een rol hebben, toegang kunnen krijgen, voer dan "Rollen" in in het eerste vakje onder "Voorwaardelijke toegang". Indien u enkel wil dat gebruikers met de rol "DataAccess" kunnen inloggen op het domein, voer dan "DataAccess" in het tweede vakje in.

source: Input the URL on which the user can check their user profile on the IdP. When set, a link to this URL will be shown to the user in their user account page. If left blank, no URL will be shown to the user in their account page.
es: Especifique la dirección URL en la que el usuario puede revisar su perfil de usuario en el IdP. Cuando se haya especificado, el usuario visualizará un enlace a esta dirección URL en la página de su cuenta de usuario. Si se deja en blanco, no se mostrará ninguna dirección URL al usuario en la página de su cuenta.
nl: Voer de URL in op basis waarvan de gebruiker zijn gebruikersprofiel kan controleren op de IdP. Bij het instellen zal er een link naar deze URL aan de gebruiker worden getoond in zijn gebruikersaccountpagina. Wanneer deze blanco wordt gelaten, zal geen URL aan de gebruiker worden getoond in zijn gebruikersaccountpagina.

source: Input a custom EntityID for the Service Provider. If left blank the URL of the Service Provider metadata document will be used as the EntityID. If your IdP doesn't support EntityIDs in URL format, you can set any EntityID here.
es: Especifique un ID de entidad personalizado para el proveedor de servicios. Si se deja en blanco la dirección URL del proveedor de servicios, se utilizará el documento de metadatos como ID de entidad. Si su IdP no admite ID de entidad en formato URL, puede establecer cualquier ID de entidad aquí.
nl: Een gepersonaliseerd EntityID voor de Service Provider invoeren. Wanneer deze blanco wordt gelaten, zal de URL van het metadatadocument van de Service Provider gebruikt worden als het EntityID. Wanneer uw IdP EntityID's in URL-formaat niet ondersteunt, kunt u hier om het even welk EntityID instellen.

source: Customize the SAML login link text. If left blank, a localized default message will be displayed.
es: Personalice el texto del vínculo de inicio de sesión de SAML. Si se deja en blanco, se visualizará un mensaje predeterminado localizado.
nl: De SAML login link tekst personaliseren. Wanneer deze blanco wordt gelaten, zal een gelokaliseerd standaardbericht worden weergegeven.

source: Optionally configure the default login page
es: Configurar opcionalmente la página de inicio predeterminada
nl: De standaard inlogpagina optioneel configureren

source: The default login page configuration can be found by navigating to the security page in the domain configuration interface.
es: La configuración de la página de inicio de sesión predeterminada se encuentra en la página de seguridad de la interfaz de configuración del dominio.
nl: De standaard inlogpaginaconfiguratie kan worden teruggevonden door te surfen naar de veiligheidspagina in de configuratie-interface van het domein.

source: Configure your identity provider
de: Konfigurieren Ihres Identity Providers
es: Configurar el proveedor de identidad
it: Configurazione del provider di identità
nl: Configureer uw identiteitsprovicder

source: The configuration of the identity provider is implementation-dependant, but it always consist of importing the service provider metadata document to enable a identity federation.
de: Die Konfiguration des Identity Providers hängt von der Implementierung ab. Sie umfasst jedoch in jedem Fall den Import des Metadatendokuments des Service Providers, um einen Identitätsverbund zu ermöglichen.
es: La configuración del proveedor de identidad varía en función de la implementación, pero siempre es necesario importar el documento de metadatos de proveedor de identidad para hacer posible la federación de identidades.
it: La configurazione del provider di identità dipende dall'implementazione ma prevede sempre l'importazione del documento di metadati del provider di servizi, in modo da attivare la federazione di identità.
nl: De configuratie van de identiteitsprovider staat los van de implementatie maar bestaat altijd uit het importeren van het metadatadocument van de dienstverlener om een identiteitsfederatie mogelijk te maken.

source: You can download the metadata document for your Opendatasoft domain on ``https://<YOUR DOMAIN>.opendatasoft.com/saml2/metadata.xml``
es: Puede descargar el documento de metadatos del dominio Opendatasoft en ``https://<SU_DOMINIO>.opendatasoft.com/saml2/metadata.xml``.
nl: U kan het metadatadocument voor uw Opendatasoft-domein downloaden op ``https://<YOUR DOMAIN>.opendatasoft.com/saml2/metadata.xml``

source: Using user attributes to filter data
de: Benutzerattribute zum Filtern von Daten vewenden
es: Utilizar atributos de usuario para filtrar datos
it: Utilizzo degli attributi dell'utente per filtrare i dati
nl: Gebruikersattributen gebruiken om data te filteren

source: Through the #attr function, it is possible to filter a dataset records in such a way that the only records returned are the ones that match a value set in the user attributes sent by the IdP. For the following examples, we assume that we have the 3 users, with respective usernames and SAML attributes ``user-country`` and ``user-language`` given by the following table.
de: Über die Funktion #attr können Sie Datensatzeinträge so filtern, dass nur Einträge zurückgegeben werden, die einem Wert entsprechen, der in den vom IdP gesendeten Benutzerattributen festgelegt wurde. Bei den folgenden Beispielen nehmen wir an, dass wir die 3 Benutzer mit den entsprechenden Benutzernamen und SAML-Attributen ``user-country`` (Benutzerland) und ``user-language`` (Benutzersprache) laut folgender Tabelle haben.
es: Mediante la función #attr, se pueden filtrar los registros de un conjunto de datos de modo que solo se devuelvan los registros que coincidan con un valor establecido en los atributos de usuario enviados por el IdP. En los ejemplos siguientes, suponemos que tenemos los 3 usuarios con los nombres de usuario y atributos SAML ``user-country`` y ``user-language`` respectivos que figuran en la tabla siguiente.
it: Tramite la funzione #attr, è possibile filtrare i record di un dataset sulla base di un valore presente negli attributi dell'utente inviati dall'IdP. Nei prossimi esempi, ipotizziamo 3 utenti con il proprio username e gli attributi SAML ``user-country`` e ``user-language``, secondo la seguente tabella.
nl: Via de #attr-functie is het mogelijk om records van een dataset zodanig te filteren dat de enige records die worden opgeleverd diegene zijn die overeenstemmen met een waarde die ingesteld is in de gebruikersattributen die door de IdP is opgestuurd. Voor de volgende voorbeelden gaan we ervan uit dat we de 3 gebruikers hebben met de respectieve gebruikersnamen en SAML-attributen ``gebruiker-land`` en ``gebruiker-taal`` zoals die vermeld staan in de volgende tabel.

source: User
de: Benutzer
es: Usuario
it: Utente
nl: Gebruiker

source: user-country
de: Benutzerland
nl: gebruiker-land

source: user-language
de: Benutzersprache
nl: gebruiker-taal

source: User1
de: Benutzer1
it: Utente1
nl: Gebruiker1

source: France
de: Frankreich
es: Francia
it: Francia
nl: Frankrijk

source: French
de: Französisch
es: Francés
it: Francese
nl: Frans

source: User2
de: Benutzer2
it: Utente2
nl: Gebruiker2

source: User3
de: Benutzer3
it: Utente3
nl: Gebruiker3

source: United States
de: Vereinigte Staaten
es: Estados Unidos
it: Stati Uniti
nl: Verenigde Staten

source: English
de: Englisch
es: Inglés
it: Inglese
nl: Engels

source: And a dataset with records given by the following table.
de: Und einen Datensatz mit Einträgen laut folgender Tabelle.
es: Y un conjunto de datos con los registros indicados en la tabla siguiente.
it: E un dataset contenente record basati sulla seguente tabella.
nl: En een dataset met records zoals die vermeld staan in de volgende tabel.

source: country
de: Land
it: paese
nl: land

source: language
de: Sprache
es: Idioma
nl: taal

source: message
de: Nachricht
it: messaggio
nl: bericht

source: Worldwide
de: Weltweit
it: Mondo
nl: Wereldwijd

source: Hello world
de: Hallo allerseits
nl: Hallo wereld

source: Hello to all Canadians
nl: Hallo aan alle Canadezen

source: Hello to all Americans
nl: Hallo aan alle Amerikanen

source: We can restrict these users so that they see only messages that apply to their respective countries, with the query ``#attr(country, user-country)``.
de: Mit der Anfrage ``#attr(country, user-country)`` können wir Beschränkungen für diese Benutzer festlegen, damit sie nur für ihr jeweiliges Land geltende Nachrichten sehen.
es: Podemos restringir estos usuarios de modo que solo vean los mensajes que son válidos para sus países respectivos, con la consulta ``#attr(country, user-country)``.
it: Tramite la query ``#attr(country, user-country)``, possiamo impostare alcune restrizioni per questi utenti in modo che vedano solo i messaggi relativi al loro paese.
nl: We kunnen deze gebruikers zodanig beperken dat ze enkel die berichten zien die van toepassing zijn op hun respectieve landen, met de zoekopdracht ``#attr(country, user-country)``.

source: User1 sees
de: Benutzer1 sieht
es: User1 ve
it: L'Utente1 visualizza
nl: Gebruiker1 ziet

source: User2 sees
de: Benutzer2 sieht
es: User2 ve
it: L'Utente2 visualizza
nl: Gebruiker2 ziet

source: User3 sees
de: Benutzer3 sieht
es: User3 ve
it: L'Utente3 visualizza
nl: Gebruiker3 ziet

source: We can also restrict these users so that they only see messages that are in their respective language, with the query ``#attr(language, user-language)``.
de: Mit der Anfrage ``#attr(language, user-language)`` können wir auch Beschränkungen für diese Benutzer festlegen, damit sie nur Nachrichten in ihrer jeweiligen Sprache sehen.
es: También podemos restringir estos usuarios a fin de que solo vean los mensajes que están en su idioma respectivo, con la consulta ``#attr(language, user-language)``.
it: Tramite la query ``#attr(language, user-language)``, possiamo inoltre impostare delle restrizioni in modo che gli utenti vedano solo i messaggi nella loro lingua.
nl: We kunnen deze gebruikers ook zodanig beperken dat ze enkel berichten zien die in hun respectieve taal zijn weergegeven, met de zoekopdracht ``#attr(language, user-language)``.

source: Since it is a function of the query language, it can also be grouped with the usual operators, for instance, we can restrict users to only seeing messages that fit their country and languages with the query ``#attr(language, user-language) AND #attr(country, user-country)``.
de: Da dies eine Funktion der Anfragensprache ist, kann sie auch mit den üblichen Operatoren gruppiert werden. Zum Beispiel können wir mit der Anfrage ``#attr(language, user-language) AND #attr(country, user-country)`` Beschränkungen für Benutzer festlegen, damit sie nur Nachrichten sehen, die ihrem Land und ihrer Sprache entsprechen.
es: Al ser una función del lenguaje de consulta, también se puede agrupar con los operadores habituales; por ejemplo, podemos restringir los usuarios para que solo vean los mensajes adecuados para su país e idioma con la consulta ``#attr(language, user-language) AND #attr(country, user-country)``.
it: Trattandosi di una funzione del linguaggio query, è possibile creare delle combinazioni utilizzando i normali operatori. Ad esempio, tramite la query ``#attr(language, user-language) AND #attr(country, user-country)``, possiamo impostare delle restrizioni sugli utenti in modo che vedano solo i messaggi nella loro lingua e che siano relativi al loro paese.
nl: Aangezien het een functie is van de taal van de zoekopdracht, kan ze ook gegroepeerd worden met de gebruikelijke operatoren. Zo kunnen we bijvoorbeeld gebruikers beperken tot diegene die enkel berichten zien die passen bij hun land en hun talen, en dit met de zoekopdracht ``#attr(language, user-language) AND #attr(country, user-country)``.

source: Some organizations already have a user directory service that manages their users authentication and permission, and see little value in using the built in OpenDataSoft user management features.
de: Einige Unternehmen haben bereits einen Benutzer-Verzeichnisdienst zur Verwaltung der Authentifizierung und Berechtigung ihrer Benutzer, weshalb sie die Benutzerverwaltungsfunktionen von OpenDataSoft nicht zwingend benötigen.

source: In order to address this use case, the OpenDataSoft platform supports external Identity Providers (IdP) through the SAMLv2 standard. This allows for setting up an identity federation between a domain, which will act as a service provider, and this IdP. This federation allows users of a domain to connect to the platform using the identity provider, and if they have one, reuse their active security context to create a SSO mechanism.
de: Um diesem Anwendungsfall gerecht zu werden, unterstützt die OpenDataSoft-Plattform externe Identity Provider (IdP) über den SAMLv2-Standard. Dies ermöglicht die Einrichtung eines Identitätsverbunds zwischen einer Domain (die als Service Provider fungiert) und dem IdP. Mit einer solchen Föderation können sich die Benutzer einer Domain über einen Identity Provider bei der Plattform anmelden. Außerdem können sie in diesem Fall ihren aktiven Sicherheitskontext wiederverwenden, um einen SSO-Mechanismus zu erstellen.

source: A standard **OpenDataSoft user** that was invited by e-mail or signed-up on a domain: this user logs in on the domain using the standard sign-in interface with their usual OpenDataSoft username and password, and the account is accessible on the whole OpenDataSoft network. OpenDataSoft users are represented throughout the platform with the |icon-world| pictogram.
de: Ein standardmäßiger **OpenDataSoft-Nutzer**, der per E-Mail eingeladen wurde oder sich auf einer Domain registriert hat: Dieser Benutzer meldet sich über die Standard-Anmeldeoberfläche mit seinem üblichen OpenDataSoft-Benutzernamen und Passwort an. Das Konto ist im gesamten OpenDataSoft-Netzwerk verfügbar. OpenDataSoft-Nutzer sind auf der gesamten Plattform mit dem Piktogramm |icon-world| gekennzeichnet.

source: A **local user** that authenticates through the organization's IdP: this user logs in on the domain exclusively via the organization's IdP, and as it is only available on a specific domain, it can be limited in the use of features relying on the OpenDataSoft network. Local users are represented throughout the platform with the |icon-id-card| pictogram.
de: Ein **lokaler Nutzer**, der sich über den IdP des Unternehmens authentifiziert: dieser Benutzer meldet sich ausschließlich über den IdP des Unternehmens an. Da dies auf eine bestimmte Domain beschränkt ist, kann die Nutzung der Funktionen des OpenDataSoft-Netzwerks eingeschränkt sein. Lokale Nutzer sind auf der gesamten Plattform mit dem Piktogramm |icon-id-card| gekennzeichnet.

source: A **linked user** that has a standard OpenDataSoft account, but associated on this specific domain with an identity from the organization's IdP. This user is a standard OpenDataSoft user that can both authenticate through the OpenDataSoft sign-in interface and the organization's IdP. Since linked users are OpenDataSoft users with SAML authentication abilities, they are represented throughout the platform with both the |icon-world| and the |icon-id-card| pictograms.
de: Ein **verknüpfter Benutzer**, der ein standardmäßiges OpenDataSoft-Konto hat, aber auf dieser spezifischen Domain mit einer Identität vom IdP des Unternehmens verknüpft ist. Dieser Benutzer ist ein standardmäßiger OpenDataSoft-Nutzer, der sich sowohl über die OpenDataSoft-Anmeldeoberfläche als auch über den IdP des Unternehmens authentifizieren kann. Da es sich bei den verknüpften Benutzern um OpenDataSoft-Benutzer mit SAML-Authentifizierungsfähigkeiten handelt, sind sie auf der gesamten Plattform mit den Piktogrammen |icon-world| und |icon-id-card| gekennzeichnet.

source: Every user that has a user account on the IdP trusted by a domain and doesn't have an OpenDataSoft user account can connect through SAML. On first connection, a local user will be created for the user based on the domain's SAML settings.
de: Jeder Benutzer, der ein Benutzerkonto bei dem von einer Domain vertrauten IdP und kein OpenDataSoft-Benutzerkonto hat, kann sich über SAML verbinden. Bei erstmaliger Anmeldung wird für den Benutzer ein lokaler Nutzer basierend auf den SAML-Einstellungen der Domain erstellt.
