Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/01_managing_security/saml.po
Languages: de, es, it, nl

source: Federate identity with SAML
de: Identität mit SAML verbinden
es: Federar identidades con SAML
it: Come federare le identità tramite SAML
nl: Identiteit samenvoegen met SAML

source: Caution
es: Precaución
nl: Opgelet

source: The availability of this feature depends on the license of the Opendatasoft domain.
es: La disponibilidad de esta función depende de la licencia del dominio Opendatasoft.
nl: De beschikbaarheid van deze functionaliteit hangt af van de licentie van het Opendatasoft-domein.

source: Some organizations already have a user directory service that manages their users authentication and permission, and see little value in using the built in Opendatasoft user management features.
es: Algunas organizaciones ya tienen un servicio de directorio de usuarios que administra la autenticación y el permiso de los usuarios, y les resulta poco útil emplear las funciones de administración de usuarios integradas en Opendatasoft.
nl: Sommige organisaties hebben reeds een user directory service die de authentificatie en toelating van hun gebruikers beheert en zien weinig waarde in het gebruik van de ingebouwde gebruikersbeheerfuncties van Opendatasoft.

source: In order to address this use case, the Opendatasoft platform supports external Identity Providers (IdP) through the SAMLv2 standard. This allows for setting up an identity federation between a domain, which will act as a service provider, and this IdP. This federation allows users of a domain to connect to the platform using the identity provider, and if they have one, reuse their active security context to create a SSO mechanism.
es: Para abordar este caso de uso, la plataforma Opendatasoft admite proveedores de identidad (IdP) externos por medio del estándar SAMLv2. Este permite configurar una federación de identidades entre un dominio, que actuará como proveedor de servicio, y este IdP. Esta federación permite a los usuarios de un dominio conectar con la plataforma utilizando el proveedor de identidad y, si tienen uno, reutilizar su contexto de seguridad activo para crear un mecanismo SSO.
nl: Om deze gebruikerscase aan te pakken, ondersteunt het Opendatasoft-portaal externe Identity Providers (IdP) via de SAMLv2-norm. Zo kan een identiteitssamenvoeging worden opgezet tussen een domein, dat zal optreden als service provider, en deze IdP. Deze samenvoeging laat gebruikers van een domein toe in te loggen op het platform met de identity provider en wanneer ze er een hebben, kunnen ze hun actieve veiligheidscontext hergebruiken om een SSO-mechanisme aan te maken.

source: When a SAML identity provider is configured on a domain, a user can belong in 3 categories.
de: Wird ein SAML-Identity-Provider auf einer Domain konfiguriert, kann ein Benutzer in 3 Kategorien eingeteilt werden.
es: Cuando hay un proveedor de identidad SAML configurado en un dominio, un usuario puede pertenecer a 3 categorías.
nl: Wanneer een SAML identity provider is geconfigureerd op een domein, kan een gebruiker tot 3 categorieën behoren.

source: A standard **Opendatasoft user** that was invited by e-mail or signed-up on a domain: this user logs in on the domain using the standard sign-in interface with their usual Opendatasoft username and password, and the account is accessible on the whole Opendatasoft network. Opendatasoft users are represented throughout the platform with the |icon-world| pictogram.
es: Un **usuario de Opendatasoft estándar** invitado por correo electrónico o registrado en un dominio: este usuario inicia la sesión en el dominio mediante la interfaz de inicio de sesión estándar con su nombre de usuario y contraseña de Opendatasoft habitual, y la cuenta está accesible en toda la red de Opendatasoft. Los usuarios de Opendatasoft se representan en la plataforma con el pictograma |icon-world|.
nl: Een standaard **Opendatasoft user** die via e-mail werd uitgenodigd of zich heeft geabonneerd op een domein: deze gebruiker logt in op het domein met behulp van de standaard sign-in interface met zijn gebruikelijke gebruikersnaam en wachtwoord van Opendatasoft en dit account is toegankelijk op het volledige Opendatasoft-netwerk. Opendatasoft-gebruikers worden op het volledige platform vertegenwoordigd met het |icon-world| pictogram.

source: A **local user** that authenticates through the organization's IdP: this user logs in on the domain exclusively via the organization's IdP, and as it is only available on a specific domain, it can be limited in the use of features relying on the Opendatasoft network. Local users are represented throughout the platform with the |icon-id-card| pictogram.
es: Un **usuario local** que se autentica por medio del IdP de la organización: este usuario inicia la sesión en el dominio exclusivamente a través del IdP de la organización y, como solo está disponible en un dominio específico, puede tener limitado el uso de funciones basadas en la red de Opendatasoft. Los usuarios locales se representan en la plataforma con el pictograma |icon-id-card|.
nl: Een **local user** die wordt geauthentificeerd via de IdP van de organisatie: deze gebruiker logt uitsluitend via de IdP van de organisatie in op het domein en aangezien dit enkel beschikbaar is op een specifiek domein, kan het worden beperkt in het gebruik van de functies die vertrouwen op het Opendatasoft-netwerk. Plaatselijke gebruikers worden op het volledige platform vertegenwoordigd met het |icon-id-card| pictogram.

source: A **linked user** that has a standard Opendatasoft account, but associated on this specific domain with an identity from the organization's IdP. This user is a standard Opendatasoft user that can both authenticate through the Opendatasoft sign-in interface and the organization's IdP. Since linked users are Opendatasoft users with SAML authentication abilities, they are represented throughout the platform with both the |icon-world| and the |icon-id-card| pictograms.
es: Un **usuario vinculado** que tiene una cuenta Opendatasoft estándar, pero asociada en este dominio específico a una identidad del IdP de la organización. Este usuario es un usuario de Opendatasoft estándar que se puede autenticar tanto por medio de la interfaz de inicio de sesión de Opendatasoft como del IdP de la organización. Dado que los usuarios vinculados son usuarios de Opendatasoft con posibilidades de autenticación SAML, se representan en la plataforma con los pictogramas |icon-world| y |icon-id-card|.
nl: Een **linked user** die een standaard Opendatasoft-account heeft maar gekoppeld is aan dit specifieke domein met een identiteit van de IdP van de organisatie. Deze gebruiker is een standaard Opendatasoft-gebruiker die zich kan authentificeren met behulp van zowel de sign-in interface van Opendatasoft en de IdP van de organisatie. Aangezien linked users gebruikers van Opendatasoft met SAML authentificatiemogelijkheden zijn, worden ze op het volledige platform vertegenwoordigd met zowel het |icon-world| als het |icon-id-card| pictogram.

source: Local user
de: Lokaler Nutzer
es: Usuario local
nl: Plaatselijke gebruiker

source: Every user that has a user account on the IdP trusted by a domain and doesn't have an Opendatasoft user account can connect through SAML. On first connection, a local user will be created for the user based on the domain's SAML settings.
es: Todo usuario que tenga una cuenta de usuario en el IdP considerado de confianza por un dominio y no tenga una cuenta de usuario Opendatasoft podrá conectarse a través de SAML. En la primera conexión, se creará un usuario local para el usuario a partir de los valores de configuración SAML del dominio.
nl: Elke gebruiker die een gebruikersaccount op de IdP heeft die toevertrouwd is door een domein en geen gebruikersaccount van Opendatasoft heeft, kan inloggen via SAML. Wanneer voor het eerst wordt ingelogd, zal een plaatselijke gebruiker worden aangemaakt voor de gebruiker op basis van de SAML-instelling van het domein.

source: These settings are:
de: Dabei handelt es sich um folgende Einstellungen:
es: Estos valores son:
nl: Deze instellingen zijn:

source: the **account mapper**: a set of IdP-sent parameters that uniquely identify a user,
de: **Account Mapper**: ein Paramtersatz, der vom IdP gesendet wurde und den Benutzer eindeutig identifiziert,
es: el **mapeador de cuentas**: un conjunto de parámetros enviados por el IdP que identifican un usuario de forma exclusiva;
nl: de **account mapper**: een reeks door IdP gestuurde parameters die een gebruiker op een unieke manier identificeren,

source: the **attribute mapper**: the parameters that correspond to the user first name, last name and email address.
de: **Attribute Mapper**: die Parameter, die dem Vornamen, Nachnamen und der E-Mail-Adresse des Benutzers entsprechen.
es: el **mapeador de atributos**: los parámetros correspondientes al nombre, apellido y dirección de correo electrónico del usuario.
nl: de **attribute mapper**: de parameters die overeenstemmen met de voornaam, familienaam en e-mailadres van de gebruiker.

source: These local users have the permission to explore the public datasets of the domain by default. Extra permissions can be given to these users at the domain level, on individual datasets or via groups (other than the ``SAML users`` group, of which they are automatic members).
de: Diese lokalen Nutzer haben die Berechtigung, die öffentlichen Datensätze der Domain standardmäßig zu durchsuchen. Diesen Benutzern können zusätzliche Berechtigungen auf Domainebene, für einzelne Datensätze oder über Gruppen erteilt werden (mit Ausnahme der Gruppe ``SAML-Benutzer`` zu der sie automatisch gehören).
es: Estos usuarios locales tienen permiso para explorar los conjuntos de datos públicos del dominio de forma predeterminada. Se pueden conceder permisos adicionales a estos usuarios a nivel de dominio, en conjuntos de datos individuales o mediante grupos (al margen del grupo de ``usuarios de SAML``, del cual son automáticamente miembros).
nl: Deze plaatselijke gebruikers hebben de toelating om de publieke datasets van het standaard domein te exploreren. Er kunnen extra toelatingen worden gegeven aan deze gebruikers op domeinniveau, op individuele datasets of via groepen (andere dan de "SAML users" groep, waarvan ze automatisch lid zijn).

source: The creation of new local users via an IdP authentication can be disabled using the "Disable local user provisioning" checkbox in the SAML configuration. Disabling local user provisioning will not prevent existing local users from signing in using SAML.
de: Das Erstellen neuer lokaler Benutzer über eine IdP-Authentifizierung kann über das Kontrollkästchen "Disable local user provisioning" (lokale Benutzerbereitstellung deaktivieren) in der SAML-Konfiguration deaktiviert werden. Das Deaktivieren der lokalen Benutzerbereitstellung verhindert nicht, dass sich bestehende lokale Benutzer mit SAML anmelden.
es: La creación de nuevos usuarios locales a través de la autenticación de un IdP se puede desactivar mediante la casilla de selección "Desactivar aprovisionamiento de usuarios locales" en la configuración de SAML. El hecho de desactivar el aprovisionamiento de usuarios locales no impedirá a los usuarios locales existentes iniciar la sesión mediante SAML.
nl: Het aanmaken van nieuwe plaatselijke gebruikers via een IdP authentificatie kan worden gedeactiveerd met behulp van het "Disable local user provisioning" aanvinkvakje in de SAML configuratie. Het deactiveren van het aanmaken van plaatselijke gebruikers zal niet verhinderen dat bestaande plaatselijke gebruikers intekenen met behulp van SAML.

source: Linked user
de: Verknüpfter Benutzer
es: Usuario vinculado
nl: Gekoppelde gebruikers

source: Users that have an Opendatasoft user account can link this account to particular values of the set of parameters defined in the account mapper setting.
es: Los usuarios que tengan una cuenta de usuario Opendatasoft podrán vincular esta cuenta a valores específicos del conjunto de parámetros definidos en la configuración del mapeador de cuentas.
nl: Gebruikers die een Opendatasoft gebruikersaccount hebben kunnen dit account koppelen aan specifieke waarden van de reeks parameters die gedefinieerd staan in de account mapper setting.

source: After the link has been established, users who log in through SAML will be logged in to their Opendatasoft user account. Linked users may be assigned the any permissions and added to groups just like any users and are considered as Opendatasoft users. They are also automatic members of the ``SAML users`` group.
es: Una vez establecido el vínculo, los usuarios que inicien la sesión a través de SAML iniciarán la sesión en su cuenta de usuario Opendatasoft. Los usuarios vinculados pueden tener asignados los mismos permisos y añadirse a grupos igual que los demás usuarios y se consideran usuarios de Opendatasoft. También son automáticamente miembros del grupo de ``usuarios de SAML``.
nl: Nadat de link werd aangemaakt, zullen gebruikers die inloggen via SAML, ingelogd worden op hun Opendatasoft-gebruikersaccount. Aan gekoppelde gebruikers kunnen toelatingen worden toegekend en ze kunnen worden toegevoegd aan groepen, net zoals alle gebruikers en worden beschouwd als Opendatasoft-gebruikers. Ze zijn ook automatisch lid van de "SAML users" groep.

source: This mode allows any user to have an Opendatasoft account, but still connect through SAML on a specific domain.
es: Este modo permite a cualquier usuario tener una cuenta Opendatasoft, pero seguir conectándose por SAML en un dominio específico.
nl: Met deze modus kunnen gebruikers een Opendatasoft-account hebben maar nog steeds via SAML inloggen op een specifiek domein.

source: There are 2 methods for linking an Opendatasoft user account:
es: Hay 2 métodos para vincular una cuenta de usuario Opendatasoft:
nl: Er zijn twee manieren om een Opendatasoft-gebruikersaccount te koppelen:

source: the first one is to click on ``Link your account to a SAML account on this domain`` in the identity tab of the user account settings:
de: eine Möglichkeit besteht darin, in der Registerkarte Identität der Benutzerkontoeinstellungen auf "Verknüpfen Sie Ihr Konto mit einem SAML-Konto auf dieser Domain" zu klicken:
es: el primero es hacer clic en ``Vincular la cuenta a una cuenta SAML en este dominio`` en la ficha de identidad de la configuración de la cuenta de usuario;
nl: de eerste is om te klikken op "Link your account to a SAML account on this domein" in de identiteitstab van de instellingen van het gebruikersaccount:

source: the other method is to create the link during the user account creation process by clicking the link to complete the registration through SAML. This actually speeds up the user account creation process and allows for a quick account linking:
de: die zweite Methode ist das Erstellen der Verknüpfung während des Kontoerstellungsprozesses durch Klicken auf den Link zum Abschließen der Registrierung über SAML. Dies beschleunigt den Kontoerstellungsprozess und die Kontoverknüpfung.
es: el otro método consiste en crear el vínculo durante el proceso de creación de la cuenta de usuario, haciendo clic en el vínculo para completar el registro a través de SAML. En realidad, esta operación acelera el proceso de creación de la cuenta de usuario y permite vincular la cuenta rápidamente.
nl: de andere methode is om de koppeling aan te maken tijdens het aanmaakproces van het gebruikersaccount door te klikken op de koppeling om de registratie via SAML te voltooien. Hierdoor wordt het aanmaakproces van het gebruikersaccount versneld en wordt een snelle koppeling van het account mogelijk gemaakt:

source: Default login page selection
es: Seleccionar la página de inicio de sesión predeterminada
nl: Selectie standaard inlogpagina

source: The Opendatasoft platform allows to choose the login page that will be displayed to users when they click on a login link or try to access a restricted page.
es: La plataforma Opendatasoft permite elegir la página de inicio de sesión que se mostrará a los usuarios cuando hagan clic en un enlace de inicio de sesión o intenten acceder a una página restringida.
nl: Het Opendatasoft-platform laat toe de inlogpagina te kiezen die weergegeven wordt aan gebruikers wanneer ze op een inloglink klikken of toegang proberen te krijgen tot een pagina waarvan de toegang beperkt is.

source: If the IdP login page is selected as default, the SAML authentication flow will be initiated automatically if an anonymous user clicks on the login link or try to access a restricted page like the backoffice. When the IdP login page is selected, users who wish to connect to the platform using their Opendatasoft credentials have the option to do so by manually visiting the domain login page at ``https://<platform-url>/login/``.
es: Si se selecciona como página predeterminada la página de inicio de sesión IdP, el flujo de autenticación SAML se iniciará automáticamente en el caso de que un usuario anónimo haga clic en el enlace de inicio de sesión o intente acceder a una página restringida, como puede ser el backoffice. Si se selecciona la página de inicio de sesión IdP, los usuarios que deseen conectarse a la plataforma con las credenciales de Opendatasoft tienen la opción de hacerlo manualmente visitando la página de inicio de sesión del dominio en ``https://<platform-url>/login/``.
nl: Wanneer de IdP inlogpagina wordt geselecteerd als standaard, zal de SAML-authentificatiestroom automatisch worden opgestart wanneer een anonieme gebruiker op de inloglink klikt of toegang probeert te krijgen tot een pagina waarvan de toegang beperkt is, zoals de back office. Wanneer de IdP inlogpagina wordt geselecteerd, hebben gebruikers, die met hun Opendatasoft-gegevens willen inloggen op het platform, de mogelijkheid om dit te doen door de inlogpagina van het domein handmatig te bezoeken via ``https://<platform-url>/login/``.

source: Single Log Out
es: SLO (Single Log-Out)
it: Disconnessione singola
nl: Eenmalig Uitloggen

source: The Opendatasoft platform supports the standard SAML Single Log Out flow using the HTTP-Redirect binding. That means that if the IdP supports it, a log out from a SAML-connected user will trigger a log out from the IdP, and log out requests from the IdP will trigger a log out of the user on the platform.
es: La plataforma Opendatasoft admite el flujo SLO (Single Log-Out) SAML estándar por medio de las vinculaciones HTTP-Redirect. Esto significa que si el IdP lo permite, un cierre de sesión de un usuario conectado por SAML desencadenará un cierre de sesión del IdP, y las solicitudes de cierre de sesión del IdP desencadenarán un cierre de sesión del usuario en la plataforma.
nl: Het Opendatasoft-platform ondersteunt de standaard SAML Eenmalig Uitloggen-stroom door gebruik te maken van de HTTP-Redirect binding. Dit betekent dat, wanneer de IdP het ondersteunt, een log out uit een SAML-verbonden gebruiker aanleiding zal geven tot een log out uit de IdP en log out-verzoeken vanuit de IdP zullen aanleiding geven tot een log out van de gebruiker op het platform.

source: Register and configure an identity provider
de: Registrieren und Konfigurieren eines Identity Providers
es: Registrar y configurar un proveedor de identidad
it: Registrazione e configurazione del provider di identità
nl: Een identiteitsprovider registreren en configureren

source: Navigate to the signup page in the domain configuration interface.
de: Navigieren Sie zur Anmeldeseite in der Domain-Konfigurationsschnittstelle.
es: Navegue a la página de registro de la interfaz de configuración del dominio.
it: Clicca su "Crea un account" nell'interfaccia di configurazione del dominio.
nl: Ga naar de intekenpagina in de configuratie-interface van het domein.

source: Check "Allow access for SAML users"
de: Klicken Sie auf "Zugriff für SAML-Benutzer erlauben"
es: Seleccione "Permitir acceso para usuarios de SAML".
it: Spunta l'opzione "Consenti l'accesso agli utenti SAML".
nl: Vink het vakje "Toegang verlenen voor SAML-gebruikers"

source: Paste your identity provider metadata document in the "IDP metadata document" field.
de: Kopieren Sie Ihr Identity Provider Metadatendokument in das Feld "IDP Metadatendokument".
es: Pegue el documento de metadatos de proveedor de identidad en el campo "Documento de metadatos de proveedor de identidad (IdP)".
it: Incolla il documento di metadati del tuo provider di identità nel campo "Documento di metadati del provider di identità (idp)".
nl: Plak het metadatadocument van uw identiteitsprovider in het veld "IDP metadatadocument".

source: If you are using Microsoft Azure Active Directory as an IDP, check the related checkbox.
de: Falls Sie Microsoft Azure Active Directory als IDP verwenden, klicken Sie das entsprechende Kontrollkästchen an.
es: Si utiliza Microsoft Azure Active Directory como IdP, seleccione la casilla en cuestión.
it: Se il tuo IdP è Microsoft Azure Active Directory, spunta la relativa casella.
nl: Wanneer u Microsoft Azure Active Directory gebruikt als een IDP, vink dan het overeenkomstige vakje aan.

source: If you wish to disable local user creation, making sure only existing users can connect to the platform through SAML, check the "Disable local user provisioning" checkbox.
es: Si desea desactivar la creación de usuarios locales, y asegurarse así de que únicamente los usuarios existentes se conecten a la plataforma con SAML, marque la casilla "Desactivar aprovisionamiento de usuarios locales".
nl: Indien u het aanmaken van een plaatselijke gebruiker wil deactiveren, zorg er dan voor dat enkel bestaande gebruikers via SAML kunnen inloggen op het platform. Vink hiervoor het vakje "Disable local user provisioning" aan.

source: Input the set of attributes sent by the IDP that uniquely define a user.
de: Geben Sie den vom IDP gesandten Attributsatz ein, der nur den Benutzer definiert.
es: Introduzca el conjunto de atributos enviados por el IdP que definen un usuario de forma exclusiva.
it: Inserisci il set di attributi inviato dall'IdP che identifica in modo univoco l'utente.
nl: Voer de reeks attributen in die door de IDP zijn doorgestuurd en waarmee een gebruiker op unieke wijze kan worden geïdentificeerd.

source: If the users are defined by their NameID and the NameID format used by your IdP is not transient, there is no need to fill anything.
de: Falls die Benutzer durch ihre NameID definiert werden und das NameID-Format nicht transient ist, muss nichts ausgefüllt werden.
es: Si los usuarios se definen por su ID de nombre y el formato del ID de nombre utilizado por el IdP no es transitorio, no es necesario especificar nada.
it: Se gli utenti sono definiti tramite il loro NameID e il formato NameID utilizzato dall'IdP non è transitorio, non c'è bisogno di inserire altro.
nl: Wanneer de gebruikers geïdentificeerd worden op basis van hun NameID en indien het NameID-formaat dat door uw IDP gebruikt wordt, niet overgankelijk is, hoeft u niets in te vullen.
