Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/01_managing_security/saml.po
Languages: de, es, it, nl

source: Users that have an OpenDataSoft user account can link this account to particular values of the set of parameters defined in the account mapper setting.
de: Benutzer mit einem OpenDataSoft-Benutzerkonto können dieses Konto mit bestimmten Werten des Parametersatzes verknüpfen, der in der Account-Mapper-Einstellung festgelegt wurde.

source: After the link has been established, users who log in through SAML will be logged in to their OpenDataSoft user account. Linked users may be assigned the any permissions and added to groups just like any users and are considered as OpenDataSoft users. They are also automatic members of the ``SAML users`` group.
de: Sobald diese Verknüpfung hergestellt wurde, werden Benutzer, die sich über SAML anmelden, bei ihrem OpenDataSoft-Benutzerkonto angemeldet. Verknüpften Nutzern können beliebige Berechtigungen zugewiesen werden und sie können wie alle anderen Benutzer zu Gruppen hinzugefügt werden. Sie werden wie OpenDataSoft-Benutzer betrachtet und sind zugleich automatisch Mitglieder der Gruppe ``SAML-Benutzer``.

source: This mode allows any user to have an OpenDataSoft account, but still connect through SAML on a specific domain.
de: In diesem Modus kann jeder Benutzer ein OpenDataSoft-Konto haben, sich aber trotzdem über SAML bei einer bestimmten Domain anmelden.

source: There are 2 methods for linking an OpenDataSoft user account:
de: Es gibt zwei Möglichkeiten, um ein OpenDataSoft-Benutzerkonto zu verknüpfen:

source: Automatic Single Sign On
de: Automatisches Single Sign-on
it: Accesso singolo automatico

source: The OpenDataSoft platform offers a mechanism to automatically log in users when they first visit the domain.
de: Die OpenDataSoft-Plattform bietet die Möglichkeit zur automatischen Anmeldung der Benutzer, wenn diese die Domain zum ersten Mal besuchen.

source: It works by starting the SAML authentication flow for anonymous users, as if they had clicked "log in with SAML", as soon as they encounter (almost) any page in the domain. This feature only makes sense for private domains as it prevents anonymous access to the domain. When Automatic Single Sign On is activated, users who wish to connect to the platform using their OpenDataSoft credentials have the option to do so by manually visiting the domain login page at ``https://<platform-url>/login/``
de: Dabei wird der SAML-Authentifizierungsprozess für anonyme Benutzer gestartet, so als ob sie auf "Mit SAML anmelden" geklickt hätten, sobald sie eine Seite der Domain (dies gilt für fast alle Seiten) aufrufen. Diese Funktion ist nur für private Domains sinnvoll, da sie den anonymen Zugriff auf die Domain verhindert. Ist das automatische Single Sign-on aktiviert, können Benutzer, die sich mit ihren OpenDataSoft-Anmeldeinformationen bei der Plattform anmelden möchten, dies tun, indem sie die Login-Seite der Domain unter ``https://<platform-url>login/`` aufrufen.

source: The OpenDataSoft platform supports the standard SAML Single Log Out flow using the HTTP-Redirect binding. That means that if the IdP supports it, a log out from a SAML-connected user will trigger a log out from the IdP, and log out requests from the IdP will trigger a log out of the user on the platform.
de: Die OpenDataSoft-Plattform unterstützt das standardmäßigen SAML Single Log-out-Verfahren unter Einsatz der HTTP-Redirect-Bindung. Wird dies vom IDP unterstützt, hat die Abmeldung eines über SAML verbundenen Benutzers eine Abmeldung beim IDP zur Folge und die Abmeldeanfrage des IDP führt zur Abmeldung des Benutzers auf der Plattform.
it: La piattaforma OpenDataSoft supporta lo standard del flusso SAML Single Log Out tramite binding di reindirizzamento HTTP. Ciò significa che, se l'IdP lo supporta, la disconnessione da parte di un utente connesso mediante SAML attiva anche la disconnessione dall'IdP e le richieste di disconnessione dall'IdP attivano a loro volta la disconnessione dell'utente dalla piattaforma.

source: Optionally input an access condition.
de: Optionale Eingabe einer Zugangsbedingung.
it: Inserisci una condizione di accesso (facoltativo).

source: The first box is the name of the attribute to check for, and the second one the value of that attribute. If you just want to check for the presence of an attribute, without value restriction, just leave the second box blank.
de: Die erste Box ist der Name des Attributs, das geprüft werden soll, und die zweite der Wert dieses Attributs. Wenn Sie nur das Vorhandensein eines Attributs prüfen möchten, ohne Wertbegrenzung, können Sie die zweite Box einfach leer lassen.
it: La prima casella corrisponde al nome dell'attributo da controllare e la seconda al suo valore. Se desideri unicamente controllare la presenza di un attributo senza indicare un valore specifico, lascia vuota la seconda casella.

source: Optionally configure automatic single sign on
de: Optionale Konfiguration des automatischen Single Sign-on
it: Se desiderato è possibile configurare l'accesso singolo automatico

source: The automatic single sign on configuration can be found by navigating to the security page in the domain configuration interface.
de: Die Konfiguration des automatischen Single Sign-on ist auf der Sicherheitsseite der Domain-Konfiguration zu finden.
it: Puoi trovare l'accesso singolo automatico alla configurazione nella pagina delle impostazioni di sicurezza dell'interfaccia di configurazione del dominio.

source: You can download the metadata document for your OpenDataSoft domain on ``https://<YOUR DOMAIN>.opendatasoft.com/saml2/metadata.xml``
de: Sie können das Metadatendokument für Ihre OpenDataSoft -Domain auf ``https://<YOUR DOMAIN>.opendatasoft.com/saml2/metadata.xml`` herunterladen.
it: Per scaricare il documento di metadati del tuo dominio OpenDataSoft, vai all'indirizzo: ``https://<TUO DOMINIO>.opendatasoft.com/saml2/metadata.xml``.

source: Canada
de: Kanada
es: Canadá

source: Some organizations already have a user directory service that manages their users authentication and permission, and see little value in using the built in OpenDataSoft user management features. In order to address this use case, the OpenDataSoft platform supports external Identity Providers (IdP) through the SAMLv2 standard. This allows for setting up an identity federation between your domain, which will act as a service provider, and this IdP. This federation allows users of your domain to connect to the platform using the identity provider, and if they have one, reuse their active security context to create a SSO mechanism. Such a federation permits user access through 2 different modes: the transient mode, where users are created on the fly when validated by the IdP, and the linked mode, where an OpenDataSoft user account is linked to a SAML identity through a set of properties known by the IdP. Those two modes can coexist on a domain, but a single user can only connect through one mode.
it: Le organizzazioni che dispongono già di un servizio di directory per gestire l'autenticazione e i permessi degli utenti potrebbero considerare superfluo utilizzare le funzionalità di gestione dell'utente integrate in OpenDataSoft. Per questo motivo, la piattaforma OpenDataSoft supporta l'uso di provider d'identità esterni (IdP) servendosi dello standard SAMLv2. In questo modo, potrai configurare una federazione di identità tra il tuo dominio, che agirà da provider di servizio, e il tuo IdP. Questa federazione consente agli utenti del tuo dominio di connettersi alla piattaforma tramite il provider d'identità e, nel caso in cui dispongano di un contesto di sicurezza già attivo, di riutilizzarlo per creare un sistema di SSO. L'accesso degli utenti può avvenire secondo 2 modalità: la modalità transitoria, che crea sul momento un profilo utente convalidato dall'IdP, e la modalità collegata, che stabilisce il collegamento tra l'account OpenDataSoft dell'utente e un'identità SAML attraverso una serie di proprietà note all'IdP. Queste due opzioni possono coesistere all'interno di uno stesso dominio, ma il singolo utente può connettersi tramite una sola modalità.

source: Transient mode
it: Modalità transitoria

source: In the transient mode, every user that has a user account on the IdP trusted by a domain, and doesn't have a OpenDataSoft user account can connect through SAML. A transient user will be created for the user, based on SAML settings for the domain. These settings are the account mapper (the set of IdP-sent parameters that uniquely identify a user) and the the attribute mapper (the parameters that correspond to the user first name, last name and email address). These transient users have the permission to explore the public datasets of the domain. Extra permissions can be given to these users by using the generic ``SAML users`` group. Transient users may not be assigned any special permissions on individual datasets or added to groups (other than the ``SAML users`` group, of which they are automatic members).
it: Con la modalità transitoria, gli utenti che possiedono un account su un IdP verificato dal dominio, ma che sono sprovvisti di un account OpenDataSoft, hanno la possibilità di connettersi tramite lo standard SAML. Durante la procedura verrà infatti creato un utente transitorio sulla base delle impostazioni SAML del dominio. Queste ultime sono: il mapper di account (il set di parametri inviato dall'IdP che permette di identificare un utente) e il mapper di attributi (i parametri che corrispondono al nome, al cognome e all'indirizzo e-mail dell'utente). Gli utenti transitori hanno il permesso di esplorare i dataset pubblici del dominio, ma possono anche disporre di permessi aggiuntivi assegnati tramite il gruppo di ``utenti SAML``. Gli utenti transitori non possono avere permessi speciali per singoli dataset né essere aggiunti ad alcun gruppo, fatta eccezione per quello degli ``utenti SAML``, di cui entrano a far parte automaticamente.

source: The transient mode can be disabled altogether using the "Disable transient authentication mode" checkbox in the SAML configuration. If transient mode is disabled, only linked users will be able to connect through SAML.
it: Anche la modalità transitoria può essere disabilitata, selezionando la casella di controllo "Disabilita la modalità di autenticazione transitoria" nella configurazione SAML. Se si disabilita la modalità transitoria, solo gli utenti collegati potranno connettersi mediante SAML.

source: Linked mode
it: Modalità collegata

source: In the linked mode, users that have an OpenDataSoft user account can link this account to particular values of the set of parameters defined in the account mapper setting. After the link has been established, users who log in through SAML will be logged to their OpenDataSoft user account. Linked users may be assigned the same permissions and added to groups just like normal users (as they are normal users). They are also automatic members of the ``SAML users`` group. This mode allows a more fine-grained permission control, while retaining most of the advantages of the transient mode. The only drawback is the necessity for users to create an account on the domain before linking it to their SAML identity. There are two method for linking an OpenDataSoft user account. The first one is to click on ``Link your account to a SAML account on this domain`` in the identity tab of the user account settings.
it: Tramite la modalità collegata, gli utenti con un account utente OpenDataSoft possono collegarlo a valori specifici del set di parametri, definiti nella configurazione del mapper di account. Dopo che il collegamento è stato stabilito, gli utenti che si autenticano su SAML potranno accedere al loro account OpenDataSoft. Gli utenti collegati possono essere aggiunti a qualsiasi gruppo e disporre degli stessi permessi di un normale utente, poiché tali sono considerati. In aggiunta a ciò, vengono automaticamente inseriti nel gruppo di ``utenti SAML``. Questa modalità consente un controllo più accurato, conservando al contempo gran parte dei vantaggi della modalità transitoria. Il solo inconveniente riguarda la necessità di creare un account sul dominio prima di poter collegare la propria identità SAML. Esistono due modi per collegare un account utente OpenDataSoft. Il primo consiste nel cliccare su ``Collega il tuo account a un account SAML su questo dominio``, nella scheda "Le mie identità" delle impostazioni dell'account.

source: The other method is to create the link during the user account creation process, by clicking the link to complete the registration through SAML. This actually speeds up the user account creation process and allows for a quick account linking.
it: Con l'altro si stabilisce il collegamento alla creazione dell'account, cliccando sull'apposito link per completare la registrazione su SAML. Questa procedura velocizza sia la creazione dell'account sia la definizione del collegamento.

source: The OpenDataSoft platform offers a mechanism to automatically log in users when they first visit the domain. It works by starting the SAML authentication flow for anonymous users, as if they had clicked "log in with SAML", as soon as they encounter (almost) any page in the domain. This feature only makes sense for private domains as it prevents anonymous access to the domain. When Automatic Single Sign On is activated, users who wish to connect to the platform using their OpenDataSoft credentials have the option to do so by manually visiting the domain login page at ``https://<platform-url>/login/``
it: La piattaforma OpenDataSoft offre un meccanismo che permette agli utenti di accedere automaticamente quando visitano il dominio per la prima volta. Esso avvia il flusso di autenticazione SAML per gli utenti anonimi, come se l'utente in questione avesse fatto clic su "Accedi con SAML", non appena apre (quasi) qualsiasi pagina del dominio. Questa funzionalità è appropriata solo per i domini privati, poiché impedisce l'accesso anonimo al dominio. Quando si attiva l'opzione Accesso singolo automatico, gli utenti che desiderano connettersi alla piattaforma utilizzando le credenziali OpenDataSoft possono farlo manualmente, visitando la pagina di accesso al dominio all'indirizzo ``https://<platform-url>/login/``

source: If you wish to disable transient connection mode, thereby making sure only linked users can connect to the platform through SAML, check the related checkbox.
it: Per disabilitare la modalità di connessione transitoria, e fare in modo che solo gli utenti collegati possano connettersi alla piattaforma tramite SAML, seleziona la relativa casella di controllo.
