Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/contact_form/contact_form.po
Languages: de, es, nl

source: Contact form
de: Kontaktformular
es: Formulario de contacto
nl: Contactformulier

source: This widget inserts a form that users can use to contact the domain's administrators. It uses reCaptcha to make sure anonymous users cannot spam the administrators.
de: Dieses Widget fügt ein Formular ein, über das Benutzer den Administrator einer Domain kontaktieren können. Um sicherzustellen, dass anonyme Benutzer den Administratoren keinen Spam schicken können, nutzt es reCaptcha.
es: Este widget inserta un formulario que los usuarios pueden emplear para ponerse en contacto con los administradores del dominio. Utiliza reCaptcha para impedir el envío de spam de usuarios anónimos a los administradores.
nl: Deze widget voegt een formulier in dat gebruikers kunnen gebruiken om contact op te nemen met de beheerders van het domein. Deze gebruikt reCaptcha om ervoor te zorgen dat anonieme gebruikers geen spam kunnen sturen naar de beheerders.

source: Type
de: Typ
es: Tipo

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: ``page-id`` **required**
de: ``Seiten-ID`` **erforderlich**
es: ``page-id`` **obligatorio**
nl: ``page-id`` **vereist**

source: string
de: Zeichenfolge
es: cadena

source: The slug of the current page so that administrators know where the request came from.
de: Die Informationen der aktuellen Seite, damit Administratoren wissen, von wo die Anforderung stammt.
es: El slug de la página actual para que los administradores conozcan la procedencia de la solicitud.
nl: De slug van de huidige pagina zodat de beheerders weten waar de aanvraag vandaan kwam.

source: ``form-disabled``
de: ``Formular-deaktiviert``

source: boolean (default: false)
de: boolesch (Standard: falsch)
es: booleano (valor predeterminado: false)
nl: booleaans (standaard: onwaar)

source: Specify whether to disable (that is prevent data input and submission) the contact form or not.
de: Legen Sie fest, ob das Kontaktformular (d. h. die Dateneingabe und das Senden) deaktiviert werden soll.
es: Especifique si se desactivará (es decir, impedir la entrada y el envío de datos) el formulario de contacto o no.
nl: Specificeer of het contactformulier al dan niet moet worden gedeactiveerd (m.a.w. dat de input en het doorsturen van data wordt voorkomen).

source: ``logged-in``
de: ``eingeloggt``

source: boolean (default: autodetected)
de: boolesch (Standard: automatisch erkannt)
es: booleano (valor predeterminado: autodetected)
nl: booleaans (standaard: automatisch opgespoord)

source: Specify whether the current user is logged in or not. If true, the recaptcha is not displayed.
de: Legen Sie fest, ob der aktuelle Benutzer eingeloggt ist. Ist dies der Fall, wird reCaptcha nicht angezeigt.
es: Especifique si el usuario actual tiene iniciada la sesión o no. Si es true, no se visualiza el recaptcha.
nl: Specificeer of de huidige gebruiker al dan niet is ingelogd. Indien dit zo is, wordt de recaptcha niet weergegeven.

source: ``name-label``
de: ``Namenbeschriftung``

source: string (default: `Your name`)
de: Zeichenfolge (Standard: `Ihr Name`)
es: cadena (valor predeterminado: `Su nombre`)
nl: string (standaard: `Uw naam`)

source: Specify the label displayed in front of the name field.
de: Legen Sie fest, welche Beschriftung vor dem Namensfeld angezeigt wird.
es: Especifique la etiqueta visualizada delante del campo de nombre.
nl: Specificeer het label dat vóór het naamveld wordt weergegeven.

source: ``email-label``
de: ``E-Mail-Beschriftung``

source: string (default: `Email`)
de: Zeichenfolge (Standard: `E-Mail`)
es: cadena (valor predeterminado: `Correo electrónico`)
nl: string (standaard: `E-mail`)

source: Specify the label displayed in front of the email field.
de: Legen Sie fest, welche Beschriftung vor dem E-Mail-Feld angezeigt wird.
es: Especifique la etiqueta visualizada delante del campo de correo electrónico.
nl: Specificeer het label dat vóór het e-mailveld wordt weergegeven.

source: ``message-label``
de: ``Nachrichtenbeschriftung``

source: string (default: `Message`)
de: Zeichenfolge (Standard: `Nachricht`)
es: cadena (valor predeterminado: `Mensaje`)
nl: string (standaard: `Bericht`)

source: Specify the label displayed in front of the message field.
de: Legen Sie fest, welche Beschriftung vor dem Nachrichtenfeld angezeigt wird.
es: Especifique la etiqueta visualizada delante del campo de mensaje.
nl: Specificeer het label dat vóór het berichtveld wordt weergegeven.

source: ``additional-fields``
de: ``zusätzliche-Felder``
nl: ``extra velden``

source: Array of field objects
de: Array von Feldobjekten
es: Matriz de objetos de campo
nl: Waaier van veldvoorwerpen

source: (default: `[]`)
de: (Standard: `[]`)
es: (valor predeterminado: `[]`)
nl: (standaard: `[]`)

source: Specify a list of fields to be inserted between the `email` and the `message` inputs.
de: Geben Sie eine Liste der Felder ein, die zwischen den Eingaben `E-Mail` und `Nachricht` eingefügt werden sollen.
es: Especifique una lista de campos que se instarán entre las entradas de `correo electrónico` y `mensaje`.
nl: Specificeer een lijst met velden die ingevoegd moeten worden tussen de inputs `e-mail` en `bericht` .

source: Each field must contain the following properties
de: Jedes Feld muss die folgenden Eigenschaften enthalten
es: Cada uno de los campos debe contener las propiedades siguientes:
nl: Elk veld moet de volgende eigenschappen hebben

source: ``id``: unique lowercase string without special characters
de: ``id``: eindeutige Kleinbuchstaben-Zeichenfolge ohne Sonderzeichen
es: ``id``: cadena exclusiva en minúsculas sin caracteres especiales
nl: ``id``: unieke string in kleine letters zonder speciale karakters

source: ``label``: unique string
de: ``label``: eindeutige Zeichenfolge
es: ``label``: cadena exclusiva
nl: ``label``: unieke string

source: ``name``: unique lowercase string without special characters
de: ``name``: eindeutige Kleinbuchstaben-Zeichenfolge ohne Sonderzeichen
es: ``name``: cadena exclusiva en minúsculas sin caracteres especiales
nl: ``name``: unieke string in kleine letters zonder speciale karakters

source: ``type``: one of 'text' or 'choice'
de: ``type``: eine von 'text' oder 'auswahl'
es: ``type``: uno de los valores 'text' o 'choice'
nl: ``type``: één van 'tekst' of 'keuze'

source: ``choices``: to be set if type is 'choice' only. Array of unique strings.
de: ``Auswahl``: einzurichten, wenn der Typ nur 'Auswahl' ist. Array von eindeutigen Zeichenfolgen.
es: ``choices``: se debe establecer solo si el tipo es 'choice'; matriz de cadenas exclusivas
nl: ``choices``: moet ingesteld worden enkel wanneer het type 'keuze' is. Waaier van unieke strings.

source: ``required``: boolean
de: ``erforderlich``: Boolesch
es: ``required``: booleano

source: Full example
de: Komplettes Beispiel
es: Ejemplo completo
nl: Volledig voorbeeld

source: Parameter
es: Parámetro
