Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesting_a_catalog.po
Languages: de, es, fr, it, nl

source: Unless otherwise specified, all harvesters use HTTPS by default, but support HTTP if specified in the provided URL.
de: Sofern nicht anders festgelegt, nutzen alle Harvester standardmäßig HTTPS, unterstützen aber auch HTTP, wenn es in der angegebenen URL so festgelegt wurde.
es: A menos que se estipule lo contrario, todos los recolectores utilizan HTTPS de forma predeterminada, pero admiten HTTP si así se especifica en la dirección URL.
fr: Sauf indication contraire, tous les moissonneurs utilisent le HTTPS par défaut mais supportent le HTTP si spécifié dans l'URL fournie.
it: A meno che non sia indicato diversamente, tutti gli harvester utilizzano di default il protocollo HTTPS, ma supportano HTTP se presente nell'URL fornito.
nl: Tenzij anders staat aangegeven, gebruiken alle harvesters standaard HTTPS, maar ondersteunen ze ook HTTP wanneer dit aangegeven wordt in de meegeleverde URL.

source: The FTP harvester uses FTPS (explicit mode on port 21) by default, but supports FTP if specified in the provided URL or if FTPS is not supported by the remote server.
de: Die FTP-Harvester nutzen standardmäßig FTPS (Explicit-Modus über Port 21), unterstützen aber auch FTP, wenn es in der angegebenen URL so festgelegt wurde oder wenn FTPS vom Remote-Server nicht unterstützt wird.
es: El recolector de FTP utiliza FTPS (modo explícito en el puerto 201) de forma predeterminada pero admite FTP si así se especifica en la dirección de URL o si el servidor remoto no admite FTPS.
fr: Le moissonneur FTP utilise FTPS (en mode explicite sur le port 21) par défaut, mais supporte le FTP si spécifié dans l'URL fournie ou si le FTPS n'est pas supporté par le serveur distant.
it: L'harvester FTP utilizza di default il protocollo FTPS (modalità esplicita sulla porta 21), ma supporta FTP se presente nell'URL fornito o qualora FTPS non sia supportato dal server remoto.
nl: De FTP-harvester gebruikt standaard FTPS (expliciete modus op poort 21), maar ondersteunt ook FTP wanneer dit aangegeven wordt in de meegeleverde URL of wanneer FTPS niet wordt ondersteund door de server op afstand.

source: Scheduling
de: Zeitplan
es: Planificación
fr: Planification
it: Pianificazione
nl: Planning

source: From the configuration page of a harvester, it is possible to make it run periodically. To do this, scroll to the bottom of the page and click on "Set recurring runs". You can run the harvester every day, or choose the days of week or the days of month it will run on. However, you always have to choose the time of day when it will run because it can not run more than once a day.
de: Auf der Konfigurationsseite des Harvesters können Sie einstellen, dass er in regelmäßigen Abständen durchgeführt wird. Scrollen Sie dazu nach unten an das Seitenende und klicken auf "Regelmäßige Durchführung". Sie können den Harvester täglich ablaufen lassen oder die Wochentage bzw. Monatstage auswählen, an denen er ablaufen soll. In jedem Fall müssen Sie die Uhrzeit an dem gewünschten Tag auswählen, da er nicht mehr als ein mal pro Tag ablaufen kann.
es: En la página de configuración de un recolector, se puede establecer que este se ejecute periódicamente. Para ello, desplácese a la parte inferior de la página y haga clic en "Establecer ejecuciones recurrentes". Puede ejecutar el recolector todos los días o elegir qué días de la semana o mes se ejecutará. Sin embargo, siempre debe elegir la hora del día en que se ejecutará porque solo se admite una ejecución al día.
fr: Il est possible d'exécuter périodiquement un moissonneur depuis sa page de configuration. Pour ce faire, faites défiler la page jusqu'en bas et cliquez sur "Définir un traitement récurrent". Vous pouvez exécuter le moissonneur chaque jour, ou sélectionner les jours de la semaine ou du mois au cours desquels il sera exécuté. Vous devez néanmoins toujours sélectionner l'heure de la journée à laquelle le moissonneur sera exécuté car il ne peut pas être exécuté plus d'une fois par jour.
it: Per impostare l'esecuzione periodica di un harvester, utilizza la relativa pagina di configurazione. Scorri in fondo alla pagina e clicca su "Imposta esecuzioni ricorrenti". La frequenza di esecuzione può essere giornaliera, oppure limitata ad alcuni specifici giorni della settimana o del mese. In ogni caso, è necessario selezionare l'orario di avvio dell’operazione, che può essere eseguita solo una volta al giorno.
nl: Vanuit de configuratiepagina van een harvester is het mogelijk om ervoor te zorgen dat deze op periodieke basis werkt. Scroll hiervoor naar beneden op de pagina en klik op *Stel terugkerende runs in*. U kan de harvester elke dag runnen of de dagen van de week of de dagen van de maand kiezen waarop deze zal runnen. Wel moet u altijd het tijdstip van de dag kiezen wanneer deze moet runnen omdat hij niet meer dan één keer per dag kan runnen.

source: The periodic run will only trigger if the harvester has been run at least once.
de: Die regelmäßige Durchführung wird nur dann ausgelöst, wenn der Harvester mindestens einmal durchgeführt worden ist.
es: La ejecución periódica tan solo se desencadenará si el recolector se ha ejecutado como mínimo una vez.
fr: L'exécution périodique sera uniquement déclenchée si le moissonneur a déjà été exécuté au moins une fois.
it: L’operazione verrà eseguita periodicamente solo se l'harvester è già stato avviato almeno una volta.
nl: De periodieke run zal enkel worden geactiveerd wanneer de harvester minstens één keer heeft gerund.

source: At the end of a scheduled run, all the harvester's already published datasets will be republished, but unpublished datasets or new datasets will not be automatically published.
de: Nach Abschluss des programmierten Ablaufs werden sämtliche bereits veröffentlichten Datensätze des Harvesters erneut veröffentlicht. Nicht veröffentlichte Datensätze bzw. neue Datensätze hingegen werden nicht automatisch veröffentlicht.
es: Al final de una ejecución planificada, se habrán vuelto a publicar los conjuntos de datos ya publicados de todos los recolectores, aunque no se habrán publicado automáticamente los conjuntos de datos con la publicación cancelada o los conjuntos de datos nuevos.
fr: À la fin d'une exécution planifiée, tous les jeux de données déjà publiés d'un moissonneur seront republiés. Les jeux de données dépubliés ou les nouveaux jeux de données ne seront cependant pas publiés automatiquement.
it: Al termine dell'esecuzione pianificata, tutti i dataset raccolti che al momento sono già pubblicati verranno ripubblicati. Per quelli nuovi o non pubblicati, invece, la pubblicazione non è automatica.
nl: Op het einde van een geplande run zal de publicatie van alle door de harvester reeds gepubliceerde datasets ongedaan worden gemaakt maar zullen niet-gepubliceerde datasets of nieuwe datasets niet automatisch worden gepubliceerd.

source: **Update on deletion**: if the source datasets are deleted on the harvested portal, delete them on this OpenDataSoft portal too. Otherwise, you may have datasets that are not available on the external service anymore (e.g: if they are deleted from the external service).
de: **Update bei Löschung**: Wenn die Quelldatensätze auf dem abgefragten Portal gelöscht sind, löschen Sie sie bitte auch von diesem OpenDataSoft-Portal. Ansonsten haben Sie weiterhin Datensätze, die im externen Service nicht mehr verfügbar sind (z. B. wenn sie von dem externen Service gelöscht wurden).
fr: **Mettre à jour à la suppression** : si des jeux de données sources sont supprimés du portail moissonné, le moissonneur les supprimera automatiquement du portail OpenDataSoft. Autrement, vous pourriez garder des jeux de données qui ne sont plus disponibles sur le service externe (si par exemple ils ont été supprimés de ce dernier).
it: **Aggiorna in caso di eliminazione**: se i dataset di origine vengono eliminati sul portale su cui è stato eseguito l'harvesting, questi verranno cancellati anche sul portale OpenDataSoft. Altrimenti, il tuo portale potrebbe includere dataset non più presenti nel servizio esterno.
nl: **Update bij verwijdering**: wanneer de brondatasets worden verwijderd op het geharveste portaal, worden deze ook verwijderd op het OpenDataSoft-portaal. Zo niet is het mogelijk dat u datasets heeft die niet langer beschikbaar zijn op de externe service (bijv. wanneer ze verwijderd zijn uit de externe service).

source: **Download resources**: download resources instead of attaching them via URL. This options allows you to detach your datasets from the remote portal by permanently copying all required data on the OpenDataSoft platform. Otherwise, your datasets will be linked to the external service and will access remote datasets via their URL for every publishing.
de: **Ressourcen herunterladen**: Laden Sie Ressourcen herunter, anstatt Sie über URL anzuhängen. Mit diesen Optionen können Sie Ihre Datensätze vom Remote-Portal entkoppeln, indem Sie sämtliche erforderlichen Daten permanent auf die OpenDataSoft-Plattform kopieren. Ansonsten werden Ihre Datensätze mit dem externen Service verbunden und greifen für jede Veröffentlichung auf Remote-Datensätze über Ihre URL zu.
fr: **Télécharger les ressources** : les ressources seront téléchargées au lieu d'être attachées via leur URL. Cette option permet de détacher vos jeux de données du portail distant en copiant les données nécessaires sur la plateforme OpenDataSoft. Autrement, vos jeux de données seront liées au service externe, et y accèderont via leur URL lors de chaque publication.
it: **Scarica risorse**: scarica le risorse, anziché allegarle tramite un URL. Questa opzione permette di rompere il legame esistente tra i tuoi dataset e il portale remoto, copiando in modo permanente tutti i dati necessari sulla piattaforma OpenDataSoft. In caso contrario, i tuoi dataset resteranno collegati al servizio esterno e, ad ogni pubblicazione, accederanno ai dataset remoti tramite il relativo URL.
nl: **Download bronnen**: download bronnen in plaats van deze via een URL te koppelen. Deze optie laat u toe uw datasets los te koppelen van het portaal op afstand door permanent alle vereiste data te kopiëren op het OpenDataSoft-platform. Zo niet zullen uw datasets gekoppeld zijn aan de externe service en zullen deze voor elke publicatie via hun URL toegang hebben tot datasets op afstand.
