Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesting_a_catalog.po
Languages: de, es, fr, it, nl

source: Harvesting a catalog
de: Harvesten eines Katalog
es: Recolectar un catálogo
fr: Moissonner un catalogue
it: Eseguire l'harvesting di un catalogo
nl: Een catalogus harvesten

source: Harvesters provide a way for administrators to easily create and update an important number of datasets by importing them from an external source such as a CSW catalog or an ArcGIS service, among many others.
de: Mit Harvestern können Administratoren eine große Anzahl an Datensätzen einfach erstellen und aktualisieren, indem sie sie aus einer externen Quelle wie einem CSW-Katalog oder einem ArcGIS-Service importieren, um nur wenige Beispiele zu nennen.
es: Los recolectores permiten a los administradores crear y actualizar fácilmente un número importante de conjuntos de datos importándolos de un origen externo como un catálogo CSW o un servicio ArcGIS, entre muchos otros.
fr: Les moissonneurs permettent aux administrateurs de facilement créer et mettre à jour un grand nombre de jeux de données en les important depuis une source externe telle que, par exemple, un catalogue CSW ou un service ArcGIS.
it: Gli harvester permettono agli amministratori di creare e aggiornare facilmente grandi quantità di dataset, importandoli da origini esterne come un catalogo CSW o un servizio ArcGIS e molto altro.
nl: Harvesters bieden beheerders een manier om op gemakkelijke wijze een groot aantal datasets aan te maken en te updaten door deze vanuit een externe bron te importeren, zoals een CSW catalogus of een ArcGIS service.

source: The two main usages of harvesters are:
de: Die zwei wichtigsten Verwendungsarten für Harvester sind:
es: Los 2 usos principales de los recolectores son:
fr: Les deux principaux usages des moissonneurs sont :
it: Vengono principalmente utilizzati per:
nl: De twee belangrijkste gebruiksvormen van harvesters zijn:

source: Bootstrap your portal with datasets from an existing portal
de: Bootstrap Ihres Portals mit Datensätzen aus einem bestehenden Portal
es: Efectuar un arranque del portal con conjuntos de datos de un portal ya existente
fr: Amorcer votre domaine avec des jeux de données provenant d'un portail existant
it: eseguire il bootstrap del portale con dataset provenienti da un portale esistente;
nl: Bootstrap uw portaal met datasets uit een bestaand portaal

source: Keep your datasets synchronised with an external service
de: Synchronisieren Ihrer Datensätze mit einem externen Service
es: Mantener los conjuntos de datos sincronizados con un servicio externo
fr: Maintenir vos jeux de données synchronisés avec un service externe
it: mantenere i dataset sincronizzati con un servizio esterno.
nl: Houd uw datasets gesynchroniseerd met een externe service

source: The harvester will create datasets, update their metadata and resources, keep them synchronized, and publish them.
de: Der Harvester erstellt Datensätze, aktualisiert ihre Metadaten und Ressourcen, synchronisiert sie und veröffentlicht sie.
es: El recolector creará los conjuntos de datos, actualizará sus metadatos y recursos, los mantendrá sincronizados y los publicará.
fr: Les moissonneurs créent les jeux de données, mettent à jour leurs métadonnées et ressources, les maintiennent à jour, et les publient.
it: L'harvester crea i dataset, ne aggiorna i metadati e le risorse, li mantiene sincronizzati e li pubblica.
nl: De harvester zal datasets aanmaken, hun metadata en bronnen updaten, deze gesynchroniseerd houden en publiceren.

source: Global overview
de: Allgemeine Übersicht
es: Visión general
fr: Vue d'ensemble
it: Panoramica generale
nl: Globaal overzicht

source: Creating a harvester
de: Erstellen eines Harvesters
es: Crear un recolector
fr: Créer un moissonneur
it: Creazione di un harvester
nl: Een harvester aanmaken

source: To get started with harvesters, click on the **harvesters** menu in your backoffice, and then on **Add harvester**. You will be asked to choose the type of the portal you want to harvest, and a name for your harvester.
de: Um mit Harvestern zu arbeiten, klicken Sie auf das **Harvester**-Menü in Ihrem Backoffice und danach auf **Harvester hinzufügen**. Sie werden daraufhin gefragt, welche Art Portal Sie abfragen und welchen Namen Sie Ihrem Harvester geben möchten.
es: Para empezar a trabajar con los recolectores, haga clic en el menú **Recolectores** del back office y, acto seguido, en **Añadir recolector**. Se le pedirá que elija el tipo de portal que desea recolectar y un nombre para el recolector.
fr: Pour commencer à utiliser un moissonneur, cliquez sur le menu **moissonneurs** de votre back-office, puis sur **Ajouter un moissonneur**. Choisissez ensuite le type de portail que vous souhaitez moissonner, et un nom pour votre moissonneur.
it: Per iniziare, nel menu dell'interfaccia di back-office, clicca su **Harvester** e quindi su **Aggiungi harvester**. Ti verrà chiesto di scegliere il tipo di portale su cui eseguire la raccolta e il nome dell'harvester.
nl: Om met harvesters te starten, klik op het menu **harvesters** in uw back-office en vervolgens op **Voeg harvester toe**. Er zal u worden gevraagd om het type portaal te kiezen dat u wil harvesten en een naam voor uw harvester te kiezen.

source: When you are done, click on **Create harvester** and you will be redirected to the configuration form of the harvester. As it depends on the harvester type, please refer to each harvester page below for detailed instructions.
de: Klicken Sie danach auf **Harvester erstellen**, sie werden zum Konfigurationsformular des Harvesters weitergeleitet. Bitte lesen Sie je nach Harvester-Typ die entsprechende Harvester-Seite mit genauen Anweisungen durch.
es: Cuando haya terminado, haga clic en **Crear recolector** y se le redirigirá al formulario de configuración del recolector. Como varía según el tipo de recolector, consulte las instrucciones detalladas en la página de cada uno de los recolectores.
fr: Cliquez ensuite sur **Créer le moissonneur**. Vous serez redirigé vers le formulaire de configuration du moissonneur. Des informations détaillées sur les différentes options spécifiques au type de moissonneur sélectionné sont disponibles ci-dessous.
it: In seguito, clicca su **Crea un harvester** per aprire il modulo di configurazione, il cui aspetto può variare in funzione del tipo di harvester. Per maggiori dettagli, consulta le pagine dei vari harvester riportate nella sezione più in basso.
nl: Wanneer dit gebeurd is, klik op **Maak harvester aan** en u wordt doorgestuurd naar het configuratieformulier van de harvester. Aangezien dit afhangt van het type harvester, verwijzen we naar elke harvesterpagina onderaan voor meer gedetailleerde instructies.

source: Some options are available for every harvester type such as:
de: Manche Optionen sind für jeden Harvester-Typ verfügbar, wie etwa:
es: Algunas opciones están disponibles para todos los tipos de recolectores, como las siguientes:
fr: Certaines options sont disponibles pour tous les moissonneurs :
it: Alcune opzioni sono disponibili per tutti i tipi di harvester. Ad esempio:
nl: Sommige opties zijn beschikbaar voor elke type harvester, zoals:

source: **Update on deletion**: if the source datasets are deleted on the harvested portal, delete them on this Opendatasoft portal too. Otherwise, you may have datasets that are not available on the external service anymore (e.g: if they are deleted from the external service).
es: **Actualizar al suprimir**: Si los conjuntos de datos de origen se suprimen en el portal recolectado, suprimirlos también en este portal Opendatasoft. De lo contrario, usted puede tener conjuntos de datos que ya no estén disponibles en el servicio externo (p. ej. al suprimirse del servicio externo).

source: **Download resources**: download resources instead of attaching them via URL. This options allows you to detach your datasets from the remote portal by permanently copying all required data on the Opendatasoft platform. Otherwise, your datasets will be linked to the external service and will access remote datasets via their URL for every publishing.
es: **Descargar recursos**: Descargar los recursos en lugar de asociarlos mediante la dirección URL. Esta opción permite desasociar los conjuntos de datos del portal remoto copiando de forma permanente todos los datos necesarios en la plataforma Opendatasoft. De lo contrario, los conjuntos de datos estarán vinculados al servicio externo y se accederá a los conjuntos de datos remotos a través de la dirección URL en cada una de las publicaciones.

source: **Restrict visibility**: make the visibility of harvested datasets restricted. Otherwise, they will have the default visibility of your portal.
de: **Sichtbarkeit einschränken**: Schränken Sie die Sichtbarkeit der gesammelten Datensätze ein. Ansonsten behalten Sie die standardmäßig eingestellte Sichtbarkeit Ihres Portals.
es: **Restringir visibilidad**: Establecer la visibilidad de los conjuntos de datos recolectados como restringida. De lo contrario, tendrán la visibilidad predeterminada del portal.
fr: **Limiter la visibilité** : l'accès aux jeux de données moissonnés sera limitée aux utilisateurs et groupes autorisés. Autrement, ils garderont la même visibilité que votre portail.
it: **Limita visibilità**: limita la visibilità dei dataset su cui si esegue l'harvesting. In caso contrario, viene assegnato il livello di visibilità predefinito del portale.
nl: **Beperk zichtbaarheid**: zorgt ervoor dat de zichtbaarheid van geharveste datasets beperkt is. Zo niet zullen ze de standaard zichtbaarheid hebben van uw portaal.

source: **Default metadata**, **inspire metadata**, **DCAT metadata**: allow you to override some metadata in every harvested dataset. Useful if you want to force the theme or publisher instead of using the one used on the external service.
de: **Standard-Metadaten**, **Inspire-Metadaten**, **DCAT-Metadaten**: Diese ermöglichen Ihnen, bestimmte Metadaten in jedem gesammelten Datensatz zu überschreiben. Sie sind sinnvoll, wenn Sie Ihr eigenes Thema oder Ihren Veröffentlicher nutzen möchten, anstatt denjenigen zu verwenden, der im externen Service genutzt wird.
es: **Metadatos predeterminados**, **Metadatos Inspire**, **Metadatos DCAT**: Permiten sobrescribir algunos metadatos en todos los conjuntos de datos recolectados. Esta opción resulta de utilidad si se desea forzar el tema o publicador en lugar de utilizar el del servicio externo.
fr: **Métadonnées par défaut**, **Métadonnées Inspire**, **Métadonnées DCAT** : vous permettent de surcharger certaines métadonnées de tous les jeux de données moissonnés. Cela vous permet par exemple de forcer le thème ou le producteur au lieu de récupérer celui spécifié par le service externe.
it: **Metadati predefiniti**, **Metadati INSPIRE**, **Metadati DCAT**: consentono di ignorare alcuni metadati presenti nei dataset raccolti. Sono utili per imporre il tema o l'entità di pubblicazione, al posto di quelli assegnati dal servizio esterno.
nl: **Standaard metadata**, **Inspireer metadata**, **DCAT metadata**: laten u toe om sommige metadata in elke geharveste dataset op te heffen. Nuttig wanneer u het thema of de uitgever wil forceren in plaats van diegene te gebruiken die gebruikt wordt op de externe dienst.

source: Once you are done configuring the harvester, you can click on the **Preview** button to test run it on a few datasets. If you see some titles and descriptions and they look correct, you are all set. Otherwise, please double check your configuration.
de: Sobald Sie den Harvester fertig konfiguriert haben, können Sie auf die Schaltfläche **Vorschau** klicken, um ihn probeweise an ein paar Datensätzen zu testen. Wenn Sie ein paar Titel und Beschreibungen sehen und diese korrekt aussehen, ist alles richtig eingestellt. Ansonsten prüfen Sie bitte Ihre Konfiguration erneut.
es: Cuando haya terminado de configurar el recolector, puede hacer clic en el botón **Vista previa** para llevar a cabo una ejecución de prueba en algunos conjuntos de datos. Si observa títulos y descripciones con una apariencia correcta, ya ha completado la tarea. De lo contrario, revise la configuración.
fr: Une fois que vous avez terminé de configurer votre moissonneur, vous pouvez cliquer sur le bouton **Aperçu** pour tester le moissonnage sur quelques jeux de données. Si les titres et descriptions qui apparaissent vous paraissent corrects, vous êtes prêt. Autrement, veuillez vérifier les options de configuration du moissonneur.
it: Terminata la configurazione dell'harvester, clicca sul pulsante **Anteprima** per eseguire un test su alcuni dataset. Se i titoli e le descrizioni vengono visualizzati correttamente, la configurazione è andata a buon fine, altrimenti verifica le impostazioni inserite.
nl: Eenmaal u klaar bent met het configureren van de harvester, kan u klikken op de knop **Voorbeeldweergave** om deze op een aantal datasets te testen. Wanneer u enkele titels en omschrijvingen ziet die correct lijken, is alles goed ingesteld. Zo niet, controleer uw configuratie dan nog eens.

source: Running a harvester
de: Harvester ausführen
es: Ejecutar un recolector
fr: Utiliser un moissonneur
it: Esecuzione dell'harvester
nl: Een harvester runnen

source: The harvesting process can be quite long on external services with many datasets or with big ones, so it is split in two phases.
de: Bei mehreren oder großen Datensätzen kann der Harvest-Prozess auf externen Services recht lange dauern, daher ist er in zwei Phasen aufgeteilt.
es: El proceso de recolección puede ser bastante largo en servicios externos con conjuntos de datos numerosos o voluminosos, por lo que se ha dividido en 2 fases.
fr: Le moissonnage est un procédé qui peut être très long sur les services externes qui contiennent de nombreux ou de gros jeux de données. Il est donc séparé en deux phases.
it: Quando i dataset del servizio esterno sono numerosi o di grandi dimensioni, la procedura di harvesting può risultare piuttosto lunga, perciò viene suddivisa in due fasi.
nl: Het harvestingproces kan vrij lang zijn op externe diensten met vele datasets of met grote datasets. Daarom wordt het opgesplitst in twee fasen.

source: First, the harvester will connect to the remote service and discover all the datasets it contains. It will then create an unpublished dataset for each remote dataset it finds. These datasets will contain all available metadata and resources (as URLs or as files depending on the *download resources* option). This happens when you click on the **Start harvester** button.
de: Zunächst verbindet sich der Harvester mit dem Remote-Service und erkennt sämtliche darin enthaltenen Datensätze. Dann erstellt er einen nicht veröffentlichten Datensatz für jeden Remote-Datensatz, den er findet. Diese Datensätze enthalten alle verfügbaren Metadaten und Ressourcen (als URLs oder Dateien, je nach der **Ressourcen herunterladen**-Option). All dies geschieht, sobald Sie auf die Schaltfläche **Harvester starten** klicken.
es: En primer lugar, el recolector conectará con el servicio remoto y descubrirá todos los conjuntos de datos que contiene. A continuación, creará un conjunto de datos con publicación cancelada para cada uno de los conjuntos de datos remotos que encuentre. Estos conjuntos de datos contendrán todos los metadatos y recursos disponibles (como direcciones URL o archivos, según la opción *Descargar recursos*). Esto sucede al hacer clic en el botón **Iniciar recolector**.
fr: Premièrement, le moissonneur se connecte au service externe et découvre tous les jeux de données qu'il contient. Il crée ensuite un jeu de données non publié pour chaque jeu de données distant qu'il trouve. Ces jeux de données contiennent toutes les métadonnées et ressources disponibles (c.f. option *Télécharger les ressources*). Cette opération a lieu lorsque vous cliquez sur le bouton **Démarrer le moissonneur**.
it: Inizialmente, l'harvester si collega al servizio remoto e rileva tutti i dataset presenti. Per ciascuno di essi, crea quindi un dataset non pubblicato contenente tutti i metadati e le risorse disponibili (in formato URL o file, a seconda delle impostazioni definite in *Scarica risorse*). Per avviare questo processo, clicca su **Avvia harvester**.
nl: Allereerst zal de harvester verbinding maken met de service op afstand en alle datasets ontdekken die deze bevat. Vervolgens zal voor elke dataset op afstand die hij vindt een verwijderde dataset worden aangemaakt. Deze datasets zullen alle beschikbare metadata en bronnen bevatten (als URL's of als bestanden, afhankelijk van de optie "download bronnen"). Dit gebeurt wanneer u op de knop **Start harvester** klikt.

source: Next, it will process and publish all the harvested datasets. This step can take a while. This happens when you click on the **Publish** button.
de: Als Nächstes verarbeitet und veröffentlicht er sämtliche gesammelten Datensätze. Dieser Schritt kann etwa länger dauern. Dies geschieht, wenn Sie auf die Schaltfläche **Veröffentlichen** klicken.
es: Después procesará y publicará todos los conjuntos de datos recolectados. Este paso puede tardar bastante tiempo. Esto sucede al hacer clic en el botón **Publicar**.
fr: Ensuite, le moissonneur traite et publie tous les jeux de données moissonnés. Cette étape est la plus longue. Elle a lieu lorsque vous cliquez sur le bouton **Publier**.
it: Successivamente, l'harvester elabora e pubblica tutti i dataset raccolti. Questo passo può richiedere un po' di tempo, e viene avviato cliccando su **Pubblica**.
nl: Vervolgens zal hij alle geharveste datasets verwerken en publiceren. Deze stap kan enige tijd in beslag nemen. Dit gebeurt wanneer u klikt op de knop **Publiceer**.

source: Editing harvested datasets
de: Bearbeiten gesammelter Datensätze
es: Editar conjuntos de datos recolectados
fr: Éditer les jeux de données moissonnés
it: Modifica dei dataset raccolti dall'harvester
nl: Geharveste datasets bewerken

source: Before publishing them, you can change the metadata of the harvested datasets. On the dataset page (information tab), you can manually override metadata by clicking on **Override** and adding your own value. This override will be kept even if you restart your harvester.
de: Bevor Sie die gesammelten Datensätze veröffentlichen, können Sie ihre Metadaten ändern. Auf der Datensatz-Seite (Registerkarte Informationen) können Sie die Metadaten manuell überschreiben, indem Sie auf **Überschreiben** klicken und Ihren eigenen Wert einfügen. Dieser neue Wert bleibt bestehen, selbst wenn Sie Ihren Harvester neu starten.
es: Antes de publicarlos, puede cambiar los metadatos de los conjuntos de datos recolectados. En la página de conjunto de datos (ficha de información), puede sobrescribir manualmente los metadatos haciendo clic en **Sobrescribir** y añadiendo su propio valor. El valor sobrescrito se mantiene incluso si se reinicia el recolector.
fr: Avant de les publier, vous pouvez éditer les métadonnées des jeux de données moissonnés. Sur la page du jeu de données (onglet information), vous pouvez surcharger chaque métadonnée en cliquant sur **Surcharger** et en ajoutant votre valeur. Cette surcharge sera conservée même si vous relancez le moissonneur.
it: Prima di pubblicarli, è possibile modificare i metadati dei dataset raccolti. Nella scheda Informazioni del dataset, puoi ignorare manualmente i metadati cliccando su **Ignora** e aggiungere il valore desiderato. L’impostazione verrà mantenuta anche dopo aver riavviato l'harvester.
nl: Alvorens deze te publiceren, kan u de metadata van de geharveste datasets wijzigen. Op de datasetpagina (informatietabblad) kan u metadata manueel opheffen door te klikken op **Opheffen** en uw eigen waarde toe te voegen. Deze opheffing wordt behouden, zelfs wanneer u uw harvester heropstart.

source: Deleting a harvester
de: Löschen eines Harvesters
es: Suprimir un recolector
fr: Supprimer un moissonneur
it: Eliminazione di un harvester
nl: Een harvester verwijderen

source: When you delete a harvester by clicking the **Delete harvester** button, you can choose between keeping the harvested datasets (they will be kept as regular datasets in your catalog), or by deleting them with the harvester.
de: Beim Löschen eines Harvesters durch Klicken auf die Schaltfläche **Harvester löschen** können Sie wählen, ob Sie die gesammelten Daten behalten möchten (sie werden als reguläre Datensätze in Ihrem Katalog gespeichert), oder ob Sie sie zusammen mit dem Harvester löschen möchten.
es: Al suprimir un recolector haciendo clic en el botón **Suprimir recolector**, puede elegir entre conservar los conjuntos de datos recolectados (se conservarán como conjuntos de datos normales del catálogo) o suprimirlos con el recolector.
fr: Lorsque vous supprimez un moissonneur en cliquant sur le bouton **Effacer le moissonneur**, vous avez le choix entre conserver les jeux de données moissonnés (ils deviendront des jeux de données classiques dans votre catalogue), ou les supprimer avec les moissonneur.
it: Per eliminare un harvester, clicca sul pulsante **Elimina l'harvester** e scegli se mantenere i dataset raccolti, conservandoli tra quelli del tuo catalogo, o eliminarli insieme all'harvester.
nl: Wanneer u een harvester verwijdert door op de knop **Verwijder harvester** te klikken, kan u kiezen tussen het behouden van de geharveste domeinen (deze zullen als regelmatige datasets behouden worden in uw catalogus) of deze te verwijderen met de harvester.

source: If you choose to keep them, please keep in mind that you will have to handle them one by one to unpublish or delete them afterwards, and that they will be duplicated if you recreate another harvester on the same external service.
de: Wenn Sie sich dafür entscheiden, sie zu behalten, denken Sie bitte daran, dass Sie sie danach einzeln bearbeiten müssen, um ihre Veröffentlichung aufzuheben oder sie zu löschen, und dass sie dupliziert werden, falls Sie einen neuen Harvester auf demselben externen Harvester erstellen.
es: Si decide conservarlos, tenga en cuenta que deberá manejarlos de forma individual si más tarde desea cancelar su publicación o suprimirlos, y que se duplicarán si vuelve a crear otro recolector en el mismo servicio externo.
fr: Si vous décidez de les conserver, vous devrez les dépublier ou supprimer un par un si vous le faites plus tard, et ils seront dupliqués si vous recréez un moissonneur pour le même service externe.
it: Se decidi di mantenerli, ricorda che in seguito dovrai intervenire singolarmente su ciascuno di essi per annullarne la pubblicazione o per eliminarli. Inoltre, se creerai un nuovo harvester sullo stesso servizio esterno, essi risulteranno duplicati.
nl: Wanneer u ervoor kiest om deze te behouden, denk er dan aan dat u deze één voor één zal moeten behandelen om daarna de publicatie ervan ongedaan te kunnen maken of te kunnen verwijderen en dat ze zullen worden gedupliceerd wanneer u een andere harvester opnieuw aanmaakt op dezelfde externe service.

source: Harvester types
de: Harvester-Typen
es: Tipos de recolector
fr: Types de moissonneurs
it: Tipi di harvester

source: Portals
de: Portale
es: Portales
fr: Portails
it: Portali
nl: Portalen

source: Services
es: Servicios
it: Servizi
nl: Diensten

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking
