Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/other_resources/accessibility/accessibility.po
Languages: de, es, fr, nl

source: Accessibility
de: Zugänglichkeit
es: Accesibilidad
fr: Accessibilité
nl: Toegankelijkheid

source: Referentials
de: Bezugssysteme
es: Referentes
fr: Référentiels

source: Opendatasoft uses two referentials' guidelines at **AA** levels for Accessibility:
de: Opendatasoft verwendet zwei Referenzrichtlinien der AA-Stufe für die Zugänglichkeit:
es: Opendatasoft sigue 2 pautas referenciales de nivel **AA** en materia de accesibilidad:
fr: Opendatasoft utilise deux référentiels aux niveaux **AA** pour l'accessibilité :
nl: Opendatasoft gebruik de richtsnoeren van twee referentiesystemen met **AA**-niveau voor Toegankelijkheid:

source: Americans with Disabilities Act (ADA)
es: Ley para Estadounidenses con Discapacidades (ADA)

source: We also follow |ADA| Standards for Accessible Design in order to improve access to information for people with disabilities.
de: Wir befolgen außerdem die |ADA| Standards für Barrierefreiheit, um den Zugang zu Informationen für Menschen mit Behinderungen zu verbessern.
es: Seguimos los estándares |ADA| en materia de diseño accesible para mejorar el acceso a la información de las personas con discapacidad.
fr: Nous respectons également les normes énoncées par l'|ADA| en termes de conception accessible, afin d'améliorer l'accès à l'information pour les personnes handicapées.
nl: We volgen ook de |ADA| Standards for Accessible Design om de toegang tot informatie voor personen met een handicap te verbeteren.

source: Since the |IAADA| and doesn't define the regulations, organizations are encouraged to use the **WCAG 2.0 level AA guidelines**.
de: Da die |IAADA| nicht die Vorschriften definiert, werden Unternehmen ermutigt, die **WCAG 2.0 Level AA-Richtlinien** anzuwenden.
es: Dados |IAADA| y las normas no definidas, se insta a las organizaciones a utilizar las **pautas WCAG 2.0 de nivel AA**.
fr: Étant donné que l'|IAADA| ne définit pas les règles en la matière, les organisations sont incitées à utiliser les **Règles pour l'accessibilité des contenus Web (WCAG) 2.0 niveau AA**.
nl: Aangezien de |IAADA| de reguleringen niet definieert, worden organisaties aangemoedigd om de **WCAG 2.0 level AA guidelines** te gebruiken.

source: Therefore, the Opendatasoft public facing content is **ADA compliant because it follows WCAG 2.0 - AA**.
de: Deshalb sind die öffentlich zugänglichen Inhalte von Opendatasoft **ADA-konform, da sie den Richtlinien WCAG 2.0 - AA** entsprechen.
es: El contenido público de Opendatasoft es **compatible con ADA ya que sigue WCAG 2.0 - AA**.
fr: Les contenus Opendatasoft publics sont donc **conformes aux recommandations de l'ADA puisqu'ils respectent les Règles WCAG 2.0 - AA**.

source: We also have a |VPAT| accessible on demand.
de: Auf Anfrage stellen wir auch ein |VPAT| bereit.
es: |VPAT| también es accesible bajo demanda.
fr: Nous disposons également d'un modèle |VPAT| accessible sur demande.
nl: We hebben ook een |VPAT| die op verzoek toegankelijk is.

source: What does Opendatasoft do for accessibility?
de: Wie setzt sich Opendatasoft für eine bessere Zugänglichkeit ein?
es: ¿Qué hace Opendatasoft en materia de accesibilidad?
fr: Que fait Opendatasoft pour améliorer l'accessibilité ?
nl: Wat doet Opendatasoft op het vlak van toegankelijkheid?

source: Here are a few examples of what the Opendatasoft platform implements to improve accessibility:
de: Hier sind einige Beispiele, was zur Verbesserung der Zugänglichkeit in der Opendatasoft-Plattform implementiert wurde:
es: Vea algunos ejemplos de la implementación de la plataforma Opendatasoft en aras de una mejor accesibilidad:
fr: Voici quelques exemples de ce qu'implémente la plate-forme Opendatasoft pour améliorer l'accessibilité :
nl: Hier volgen enkele voorbeelden van wat het Opendatasoft-platform doet om de toegankelijkheid te verbeteren:

source: The decorative elements have WAI-ARIA attributes to avoid text-to-speech triggering
de: Zierelemente haben WAI-ARIA-Attribute, um die Auslösung der Sprachausgabe zu vermeiden
es: Los elementos decorativos tienen atributos WAI-ARIA para evitar el desencadenante de conversión de texto a voz.
fr: Les éléments décoratifs utilisent des attributs WAI-ARIA pour éviter le déclenchement intempestif de la synthèse vocale
nl: De decoratieve elementen hebben WAI-ARIA-attributen om text-to-speech triggering te vermijden

source: The images are tagged with alt attributes and meaningful titles
de: Bilder sind mit ALT-Attributen und aussagekräftigen Titeln versehen
es: Las imágenes incluyen etiquetas con atributos alt y títulos significativos.
fr: Les images sont taguées avec des attributs alt et des titres significatifs.
nl: De afbeeldingen worden getagd met alt-attributen en betekenisvolle titels

source: The links are tagged with a meaningful description
de: Links sind mit aussagekräftigen Beschreibungen versehen
es: Los vínculos incluyen etiquetas con una descripción significativa.
fr: Les liens sont tagués avec des descriptions significatives
nl: De koppelingen worden getagd met een betekenisvolle omschrijving

source: All of the user interface elements are navigable with a keyboard (including tabs and tabular data)
de: Die Navigation zwischen allen Elementen der Benutzeroberfläche (einschließlich Registerkarten und Daten in Tabellenform) ist per Tastatur möglich
es: Todos los elementos de la interfaz de usuario admiten la navegación mediante teclado (fichas y datos tabulares incluidos).
fr: Tous les éléments d'interface utilisateur sont navigables au clavier (y compris les onglets et les tableaux)
nl: Alle interface-elementen van de gebruiker zijn navigeerbaar met een toetsenbord (inclusief tabs en tabulaire data)

source: When using different languages, elements are properly tagged to ensure a better text-to-speech
de: Zur Verbesserung der Sprachausgabe sind bei der Verwendung verschiedener Sprachen alle Elemente sachgemäß markiert
es: Cuando se utilizan varios idiomas, los elementos incluyen etiquetas apropiadas para lograr una mejor conversión de texto a voz.
fr: Lorsque l'interface est en différents languages, les éléments sont tagués en conséquence pour assurer une meilleure synthèse vocale
nl: Wanneer verschillende talen worden gebruikt, worden elementen naar behoren getagd om te zorgen voor een betere text-to-speech

source: The modal windows have appropriate focus and focus cycling
de: Modale Fenster verfügen über einen angemessenen Fokus und Fokuszyklus
es: Las ventanas modales tienen el foco y el ciclo de foco apropiados.
fr: Les fenêtres modales ont le focus et le cycle de focus appropriés
nl: De modale vensters hebben de juiste focus en focus cycling

source: Reporting an issue
de: Ein Problem melden
es: Notificar un problema
fr: Signaler un problème
nl: Een probleem melden

source: Despite our best efforts, if you encounter an accessibility issue on the platform, please let us know by sending a report to accessibility@opendatasoft.com
de: Sollten trotz all unserer Bemühungen Zugänglichkeitsprobleme auf der Plattform auftreten, informieren Sie uns bitte darüber, indem Sie einen Bericht an accessibility@opendatasoft.com senden.
es: Si, a pesar de todos nuestros esfuerzos, detecta algún problema de accesibilidad en la plataforma, envíenos un informe por correo electrónico a accessibility@opendatasoft.com.
fr: Malgré nos efforts, si vous rencontrez un problème d'accessibilité sur la plate-forme, n'hésitez pas à nous transmettre un retour en envoyant un mail à accessibility@opendatasoft.com
nl: Ondanks onze beste inspanningen, wanneer u een probleem met toegankelijkheid ervaart op het platform, gelieve ons dit dan te laten weten door een verslag te sturen naar accessibility@opendatasoft.com

source: When sending a report, please include these information:
de: Ein Bericht sollte folgende Informationen beinhalten:
es: En el informe, incluya esta información:
fr: Lors de l'envoi d'un rapport, merci d'indiquer les informations suivantes :

source: **Your browser**\*
de: **Ihr Browser**\*
es: **Su explorador**\*
fr: **Votre navigateur**\*
nl: **Uw browser**\*

source: **Your operating system**\*
de: **Ihr Betriebssystem**\*
es: **Su sistema operativo**\*
fr: **Votre système d'exploitation**\*
nl: **Uw besturingssysteem**\*

source: **Your screenreader**
de: **Ihre Vorlese-Anwendung (Screenreader)**
es: **Su lector de pantalla**
fr: **Votre système de synthèse vocale**
nl: **Uw schermlezer**

source: **A description of the issues you're encountering**
de: **Eine Beschreibung der aufgetretenen Probleme**
es: **Una descripción de los problemas detectados**
fr: **Une description du problème que vous rencontrez**
nl: **Een omschrijving van de problemen die u ervaart**

source: \*Please include the version numbers, use |thismachine| or |whatismybrowser| to find out easily
de: \*Bitte geben Sie auch auch die Versionsnummern an, die Sie einfach mit |thismachine| oder |whatismybrowser| ermitteln können
es: \*Indique los números de versión; utilice |thismachine| o |whatismybrowser| para averiguarlos fácilmente.
fr: \*Merci d'inclure les numéros de version, vous pouvez utiliser |thismachine| ou |whatismybrowser| pour les trouver

source: We will do our best to fix those issues in the forthcoming releases.
de: Wir werden unser Bestes tun, um solche Probleme in den nächsten Versionen zu beheben.
es: Haremos todo lo posible por resolver esos problemas en lanzamientos posteriores.
fr: Nous ferons de notre mieux pour résoudre ces problèmes dans les versions à venir.
nl: We zullen ons uiterste best doen om deze problemen in de volgende releases op te lossen.

source: Therefore, the Opendatasoft public-facing content is **ADA compliant because it follows WCAG 2.0 - AA**.
nl: Daarom is het publiek van Opendatasoft dat te maken krijgt met content **ADA compliant omdat het WCAG 2.0 - AA** volgt.

source: When sending a report, please include this information:
nl: Wanneer u een verslag stuurt, zorg er dan voor dat de volgende informatie wordt vermeld:

source: \*Please include the version numbers. Use |thismachine| or |whatismybrowser| to find out easily.
nl: \*Gelieve de versienummers te vermelden. Gebruik |thismachine| of |whatismybrowser| om deze gemakkelijk terug te vinden.
