Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/05_defining_dataset_themes/dataset_themes.po
Languages: de, es, fr, nl

source: Managing the dataset themes
de: Verwalten der Datensatz-Themen
es: Gestionar los temas de conjunto de datos
fr: Gérer les thèmes du jeu de données
nl: De datasetthema's beheren

source: All published datasets of an Opendatasoft portal should belong to at least one theme. Dataset themes indeed help categorizing the datasets based on what the data they contain is about. Although each dataset's theme is defined in its edition interface like any other metadata, the list of available dataset themes for the portal is configured from the **Look & feel > Dataset themes** subsection of the back office.
de: Alle auf einem Opendatasoft-Portal veröffentlichten Datensätze sollten zumindest einem Thema zugeordnet sein. Datensatz-Themen helfen bei der Kategorisierung der Datensätze anhand der von ihnen abgedeckten Inhalte. Auch wenn sich das Thema jedes einzelnen Datensatzes wie alle anderen Metadaten in seiner jeweiligen Benutzeroberfläche definieren lässt, wird die Liste der verfügbaren Datensatz-Themen des Portals über den Unterabschnitt **Aussehen & Eindruck > Datensatz-Themen** des Back-Office konfiguriert.
es: Todos los conjuntos de datos publicados de un portal de Opendatasoft deben pertenecer como mínimo a un tema. Los temas de conjunto de datos ayudan a categorizar los conjuntos de datos en función del asunto que tratan los datos que contienen. Aunque cada tema de conjunto de datos se define en su interfaz de edición como cualquier otro metadatos, la lista de temas de conjunto de datos disponibles del portal se configura en la subsección **Apariencia > Temas de conjunto de datos** del back office.
fr: Tous les jeux de données publiés d'un portail Opendatasoft doivent appartenir à au moins un thème. En effet, les thèmes de jeux de données permettent de catégoriser les jeux de données en fonction des données qu'ils contiennent. Même si chaque thème de jeu de données est défini dans son interface d'édition, à l'instar des autres métadonnées, la liste des thèmes de jeux de données disponibles pour le portail est configurée dans la sous-section **Apparence > Thèmes du jeu de données** de l'interface d'administration.

source: Dataset themes are managed from the table which comprises 2 columns:
de: Datensatz-Themen werden über eine Tabelle verwaltet, die zwei Spalten enthält:
es: Los temas de conjunto de datos se gestionan desde la tabla que contiene 2 columnas:
fr: Les thèmes du jeu de données sont gérés depuis le tableau, composé de 2 colonnes :

source: **Label**, to define the label of the dataset theme
de: **Beschriftung**, um die Beschriftungen für die Datensatz-Themen zu definieren
es: **Etiqueta**, para definir la etiqueta del tema de conjunto de datos
fr: **Label**, pour définir le label du thème du jeu de données
nl: **Label**, om het label van het datasetthema te definiëren

source: **Image**, to configure the icon of the dataset theme
de: **Bild**, um das Icon des Datensatz-Themas zu konfigurieren
es: **Imagen**, para configurar el icono del tema de conjunto de datos
fr: **Image**, pour configurer l'icône du thème du jeu de données
nl: **Afbeelding**, om het pictogram van het datasetthema te configureren

source: The dataset themes table also contains 2 options:
de: Die Tabelle der Datensatz-Themen enthält zudem 2 Optionen:
es: La tabla de temas de conjunto de datos también tiene 2 opciones:
fr: Par ailleurs, le tableau des thèmes du jeu de données présente 2 options :

source: a reorder |icon-reorder| button, displayed on the left of the Label column, to change the order of the dataset theme among the others ;
de: Mit dem links von der Beschriftungsspalte angezeigten Button |icon-reorder| zur Neuanordnung kann die Reihenfolge der Datensatz-Themen geändert werden;
es: un botón de reordenar |icon-reorder|, a la izquierda de la columna Etiqueta, para cambiar el orden del tema de conjunto de datos respecto a los demás;
fr: un bouton de réorganisation |icon-reorder|, situé à gauche de la colonne Label, pour modifier l'ordre du thème du jeu de données par rapport aux autres ;
nl: een knop |icon-reorder| die links van de kolom Label staat onder andere om de volgorde van de datasetthema's te wijzigen;

source: a trash |icon-trash| button, displayed on the right of the Image column, to delete a dataset theme.
de: Mit dem rechts von der Bildspalte angezeigten Button |icon-trash| Papierkorb kann ein Datensatz-Thema gelöscht werden.
es: un botón de papelera |icon-trash|, a la derecha de la columna Imagen, para suprimir un tema de conjunto de datos.
fr: un bouton de suppression |icon-trash| , situé à droite de la colonne Image, pour supprimer un thème du jeu de données.
nl: een knop |icon-trash| die rechts van de kolom Afbeelding staat om een datasetthema te wissen.

source: By default, 12 generic dataset themes are configured on a newly created Opendatasoft domain:
de: Standardmäßig sind auf einer neu erstellten Opendatasoft-Domain zwölf allgemeine Datensatz-Themen vorkonfiguriert:
es: Por defecto, se configuran 12 temas de conjunto de datos genéricos en un dominio Opendatasoft recién creado:
fr: Par défaut, 12 thèmes de jeux de données génériques sont configurés sur un domaine Opendatasoft nouvellement créé :
nl: Standaard worden 12 generische datasetthema's geconfigureerd op een nieuw aangemaakt Opendatasoft-domein:

source: Culture, Heritage
de: Kultur, Tradition
es: Cultura y tradición
fr: Culture, Héritage
nl: Cultuur, Erfgoed

source: Education, Training, Research, Teaching
de: Erziehung, Ausbildung, Forschung, Lehre
es: Educación, formación, investigación y enseñanza
fr: Éducation, Formation, Recherche, Enseignement
nl: Onderwijs, Opleiding, Onderzoek, Lesgeven

source: Environment
de: Umwelt
es: Medio ambiente
fr: Environnement
nl: Milieu

source: Transport, Movements
de: Verkehr, Fortbewegung
es: Transporte y desplazamientos
fr: Transport, Déplacements
nl: Transport, Bewegingen

source: Spatial planning, Town planning, Buildings, Equipment, Housing
de: Raum- und Stadtplanung, Bauwerke, Gebäudeausstattung, Wohnen
es: Planificación espacial, planificación urbana, edificios, equipamientos y vivienda
fr: Planification spatiale, Urbanisme, Bâtiments, Équipement, Logement
nl: Ruimtelijke ordening, Stadsplanning, Gebouwen, Voorzieningen, Huisvesting

source: Economy, Business, SME, Economic development, Employment
de: Wirtschaft, Unternehmen, KMU, ökonomische Entwicklung, Arbeitsmarkt
es: Economía, empresa, PYME, desarrollo económico y empleo
fr: Économie, Commerce, PME, Développement économique, Emploi
nl: Economie, Zaken, KMO, Economische ontwikkeling, Tewerkstelling

source: Administration, Government, Public finances, Citizenship
de: Verwaltung, Regierung, öffentlicher Haushalt, Staatsbürgerschaft
es: Administración, gobierno, finanzas públicas y ciudadanía
fr: Administration, Gouvernement, Finances publiques, Citoyenneté
nl: Administratie, Overheid, Overheidsfinanciën, Burgerschap

source: Justice, Safety, Police, Crime
de: Justiz, Sicherheit, Polizei, Kriminalität
es: Justicia, seguridad, policía y criminalidad
fr: Justice, Sécurité, Police, Crime
nl: Justitie, Veiligheid, Politie, Misdaad

source: Sports, Leisure
de: Sport, Freizeit
es: Deporte y ocio
fr: Sports, Loisirs
nl: Sport, Ontspanning

source: Accommodation, Hospitality Industry
de: Hotel- und Gastgewerbe
es: Alojamiento, hostelería
fr: Hébergement, Industrie hôtelière
nl: Onderdak, Gastvrijheidssector

source: Services, Social
de: Dienstleistungen, Soziales
es: Servicios y asuntos sociales
nl: Diensten, Sociaal

source: Defining a new dataset theme
de: Ein neues Datensatz-Thema definieren
es: Definir un tema de conjunto de datos nuevo
fr: Définir un nouveau thème du jeu de données
nl: Een nieuw datasetthema definiëren

source: Click on the + Add custom theme button below the dataset theme table.
de: Klicken Sie unter der Tabelle der Datensätze auf den Button + Benutzerdefiniertes Thema hinzufügen.
es: Haga clic en el botón + Añadir tema personalizado bajo la tabla de temas de conjunto de datos.
fr: Cliquez sur le bouton + Ajouter un thème personnalisé en dessous du tableau de thème du jeu de données.
nl: Klik op de knop "Gepersonaliseerd thema toevoegen" onderaan de tabel met datasetthema's.

source: In the Label column, define the label of the new dataset theme. There must be one label per language available on the portal.
de: Geben Sie in der Beschriftungsspalte eine Bezeichnung für das neue Datensatz-Thema an. Sie müssen für jede auf dem Portal verfügbare Sprache eine Beschriftung angeben.
es: En la columna Etiqueta, defina la etiqueta del nuevo tema de conjunto de datos. Debe haber una etiqueta por idioma disponible en el portal.
fr: Définissez le label du nouveau thème du jeu de données dans la colonne Label. Un label doit être saisi par langue disponible sur le portail.
nl: Definieer in de kolom Label het label van het nieuwe datasetthema. Er moet één label per taal beschikbaar zijn op het portaal.

source: In the Image column, click the Select button.
de: Klicken Sie auf den Auswahl-Button in der Bildspalte.
es: En la columna Imagen, haga clic en el botón Seleccionar.
fr: Dans la colonne Image, cliquez sur le bouton Sélectionner.
nl: Klik in de kolom Afbeelding op de knop Selecteren.

source: Choose one of the 4 available methods to define the icon of the dataset theme:
de: Entscheiden Sie sich für eine der vier verfügbaren Methoden, um das Icon des Datensatz-Themas auszuwählen:
es: Elija uno de los 4 métodos disponibles para definir el icono del tema de conjunto de datos:
fr: Optez pour l'une des 4 méthodes disponibles pour définir l'icône du thème du jeu de données :

source: "Upload an image" allows to choose ones own image using a file picker
de: "Ein Bild hochladen" ermöglicht Ihnen, ein eigenes Bild mit einem Dateimanager auszuwählen
es: "Cargar una imagen" permite elegir una imagen propia por medio de un selector de archivos.
fr: "Charger une image" permet de choisir une de vos images à l'aide d'un sélecteur de fichiers.

source: "Select a pictogram from a list" allows to choose an icon from the Opendatasoft icon library
de: "Ein Piktogramm aus einer Liste auswählen" ermöglicht Ihnen, ein Icon aus der Opendatasoft-Icon-Bibliothek auszuwählen
es: "Seleccionar un pictograma de una lista" permite elegir un icono de la biblioteca de iconos de Opendatasoft.
fr: "Sélectionner un pictogramme dans une liste" permet de choisir une icône dans la bibliothèque d'icônes Opendatasoft

source: "Enter an image URL" allows to add ones own image via a URL
de: "Eine Bild-URL eingeben" ermöglicht Ihnen, ein eigenes Bild über eine URL einzubinden
es: "Especificar una dirección URL de imagen" permite añadir una imagen propia mediante una dirección URL.
fr: "Saisir une URL d'image" permet d'ajouter votre propre image via une URL

source: "No image" (default) allows to leave the dataset theme without any associated icon.
de: "Kein Bild" (Standardeinstellung) ermöglicht es, das Datensatz-Thema ohne zugewiesenes Icon zu belassen.
es: "No hay ninguna imagen" (imagen predeterminada) permite dejar el tema de conjunto de datos sin ningún icono asociado.
fr: "Aucune image" (par défaut) permet de ne pas associer d'icône au thème du jeu de données.

source: (optional) If an icon from the Opendatasoft icon library was chosen, its color can be modified by writing the hexadecimal code of the new color, or by clicking the color button to use either the Nice colors or the Color wheel.
de: (optional) Wenn ein Icon aus der Opendatasoft-Bibliothek ausgewählt wurde, kann dessen Farbe geändert werden; dies geschieht durch die Angabe des Hexadezimalcodes der neuen Farbe oder durch einen Klick auf den Farben-Button, um entweder einen der Farbvorschläge oder das Farbrad zu verwenden.
es: (Opcional) Si se ha seleccionado un icono de la biblioteca de iconos de Opendatasoft, se puede modificar el color del mismo introduciendo el código hexadecimal del nuevo color o haciendo clic en el botón de color para elegirlo en Colores bonitos o con el Selector de color.
fr: (optionnel) Si vous avez choisi une icône de la bibliothèque d'icônes Opendatasoft, sa couleur peut être modifiée en saisissant le code hexadécimal de la nouvelle couleur ou en cliquant sur le bouton Couleur pour utiliser des couleurs jolies ou la roue Couleur.

source: Click the Save button in the top right corner of the page.
de: Klicken Sie oben rechts auf den Button "Speichern".
es: Haga clic en el botón Guardar de la esquina superior derecha de la página.
fr: Cliquez sur le bouton Enregistrer en haut à droite de la page.
nl: Klik op de knop Opslaan in de rechter bovenhoek van de pagina.

source: All published datasets of an Opendatasoft portal should belong to at least one theme. Dataset themes indeed help to categorize the datasets based on what the data they contain is about. Although each dataset's theme is defined in its edition interface like any other metadata, the list of available dataset themes for the portal is configured from the **Look & feel > Dataset themes** subsection of the back office.
nl: Alle gepubliceerde datasets van een Opendatasoftportaal zouden tot ten minste één thema moeten behoren. Het is immers zo dat datasetthema's kunnen helpen om datasets in categorieën onder te brengen op basis van datgene waar de data die ze bevatten om gaan. Hoewel het thema van elke dataset, net zoals bij om het even welke andere metadata, gedefinieerd is in zijn bewerkingsinterface, is de lijst met beschikbare datasetthema's voor het portaal geconfigureerd vanuit de subrubriek **Look & Feel > Datasetthema's** van de back-office.

source: Dataset themes are managed from the table, which comprises two columns
nl: Datasetthema's worden beheerd vanuit de tabel die twee kolommen bevat

source: The dataset themes table also contains two options:
nl: De tabel met datasetthema's bevat ook 2 opties:

source: Choose one of the four available methods to define the icon of the dataset theme:
nl: Kies een van de vier beschikbare methodes om het pictogram van het datasetthema te definiëren:

source: "Upload an image" allows you to choose your own image using a file picker
nl: "Een afbeelding uploaden" laat toe om zijn eigen afbeelding te kiezen met behulp van de bestand picker

source: "Select a pictogram from a list" allows you to choose an icon from the Opendatasoft icon library
nl: "Een pictogram selecteren uit een lijst" laat toe om een pictogram te kiezen uit de pictogrammenbibliotheek van Opendatasoft

source: "Enter an image URL" allows you to add your own image via a URL
nl: "Een URL-afbeelding invoeren" laat toe om zijn eigen afbeelding via een URL toe te voegen

source: "No image" (default) allows you to leave the dataset theme without any associated icon.
nl: "Geen afbeelding" (standaard) laat toe om het datasetthema zonder een pictogram dat er verband mee houdt, te laten.

source: (optional) If an icon from the Opendatasoft icon library was chosen, its color could be modified by writing the hexadecimal code of the new color or by clicking the color button to use either the Nice colors or the Color wheel.
nl: (optioneel) Wanneer een pictogram werd gekozen uit de pictogrammenbibliotheek van Opendatasoft, kan de kleur ervan gewijzigd worden door het schrijven van de hexadecimale code van de nieuwe kleur of door op de kleurknop te klikken door middel van ofwel de Leuke kleuren of de kleur picker.
