Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/map.po
Languages: de, es, fr, it, nl

source: Mapping with the Map Builder
de: Mapping mit dem Kartenersteller
es: Crear mapas con el compilador de mapas
fr: Créer une représentation géographique avec l'éditeur de cartes
it: Creazione di mappe con Map Builder
nl: Kaarten maken met de Map Builder

source: Read how to :doc:`configure visualizations </sourcing_and_processing_data/configuring_visualizations/map>` for a dataset beforehand.
de: Lesen Sie vorher, wie :doc:`Visualisierungen für einen Datensatz konfiguriert werden </sourcing_and_processing_data/configuring_visualizations/map>`.
es: Consulte cómo :doc:`configurar visualizaciones </sourcing_and_processing_data/configuring_visualizations/map>` para un conjunto de datos previamente.
fr: Lisez d'abord comment :doc:`configurer les visualisations </sourcing_and_processing_data/configuring_visualizations/map>` pour un jeu de données.
it: Leggi prima come :doc:`configurare le modalità di visualizzazione </sourcing_and_processing_data/configuring_visualizations/map>` di un dataset.
nl: Lees eerst hoe u :doc:`weergaves moet configureren </sourcing_and_processing_data/configuring_visualizations/map>` voor een dataset.

source: With the Map Builder tool, you can visualize multiple datasets on a single customized map. You can save your map and easily share it or embed it on a third party site.
de: Mit dem Tool Kartenersteller können Sie mehrere Datensätze in einer einzigen benutzerdefinierten Karte visualisieren. Diese Karte können Sie speichern und einfach teilen, einbetten oder auf Websites von Dritten verwenden.
es: Con la herramienta Compilador de mapas, puede visualizar varios conjuntos de datos en un solo mapa personalizado. Puede guardar el mapa y compartirlo fácilmente o incrustarlo en un sitio de terceros.
fr: Grâce à l'éditeur de cartes, vous pouvez visualiser plusieurs jeux de données sur une seule carte personnalisée. Vous pouvez sauvegarder votre carte et la partager ou l'intégrer facilement à un site tiers.
it: Map Builder permette di visualizzare più dataset in una singola mappa personalizzata, che può essere poi salvata, condivisa o integrata in un sito di terze parti.
nl: Met de Map Builder tool kan u meerdere datasets op één enkele aanpasbare kaart weergeven. U kan uw kaart opslaan en deze gemakkelijk delen of deze invoegen op de site van een derde.

source: It is usually made available by the domain administrator in the top menu link under the codename `Cartograph`. The Map Builder can also be accessed using its URL: ``http://<DOMAIN ADDRESS>/map``.
de: Normalerweise wird das Tool vom Administrator einer Domain im oberen Menü-Link unter dem Codenamen `Kartograph` bereitgestellt. Auf den Kartenersteller kann auch über seine URL: ``http://<DOMAIN ADDRESS>/map`` zugegriffen werden.
es: Normalmente, el administrador del dominio lo establece como disponible en el vínculo de menú superior con el nombre en código `Cartografía`. También se puede acceder al compilador de mapas con su dirección URL: ``http://<DIRECCIÓN_DOMINIO>/map``.
fr: En règle générale, cette fonction est intégrée par l'administrateur du domaine dans le lien du menu supérieur sous la catégorie `Cartographe`. L'éditeur de cartes est également accessible via son URL : ``http://<ADRESSE DU DOMAINE>/map``.
it: Questo strumento è solitamente messo a disposizione dall'amministratore del dominio all'interno del menu principale, sotto il nome di `Cartografia`. Puoi accedere a Map Builder anche attraverso l'URL ``http://<INDIRIZZO DEL DOMINIO>/map``.
nl: Deze wordt meestal door de domeinbeheerder beschikbaar gesteld in de menukoppeling bovenaan onder de codenaam `Cartograaf`. De Map Builder is ook toegankelijk via de URL: ``http://<DOMAIN ADDRESS>/map``.

source: You start with an empty map, on which you can add a dataset. The dataset can be filtered beforehand using `Filter data` before selection.
de: Sie starten mit einer leeren Karte, der Sie einen Datensatz hinzufügen können. Der Datensatz kann vor der Auswahl mithilfe von `Daten filtern` gefiltert werden.
es: Empiece utilizando un mapa vacío, al cual puede añadir un conjunto de datos. El conjunto de datos se puede filtrar previamente mediante la opción `Filtrar datos` antes de efectuar la selección.
fr: Vous commencez avec une carte vierge à laquelle vous pouvez ajouter un jeu de données. Le jeu de données peut être filtré grâce à la fonction `Filtrer les données` avant d'être sélectionné.
it: Per iniziare, aggiungi un dataset alla mappa vuota, se necessario dopo averlo filtrato tramite l'opzione `Filtro dati`.
nl: U begint met een lege kaart waarop u een dataset kan toevoegen. De dataset kan voor u deze selecteert, worden gefilterd via `Filter data`.

source: Then you have several options to customize types of points, icons, shapes, or even heat maps.
de: Dann stehen Ihnen verschiedene Optionen zur Anpassung der Typen von Punkten, Symbolen, Formen oder sogar Wärmebildern zur Verfügung.
es: A continuación, dispone de varias opciones para personalizar tipos de puntos, iconos, formas o hasta mapas de situación.
fr: Plusieurs options se présentent à vous pour personnaliser les points, les icônes, les formes et même les cartes thermiques.
it: Hai a disposizione diverse opzioni per personalizzare i punti, le icone, le forme e anche le mappe termiche.
nl: Vervolgens beschikt u over verschillende opties om de soorten punten, pictogramman, vormen of zelfs hittekaarten aan te passen.

source: You can add multiple datasets: each dataset layer can be customized with its own parameters.
de: Sie können mehrere Datensätze hinzufügen und jede Datensatzschicht mit eigenen Parametern anpassen.
es: Puede añadir varios conjuntos de datos: cada una de las capas de conjuntos de datos se puede personalizar con sus propios parámetros.
fr: Vous pouvez également ajouter plusieurs jeux de données : chaque couche de jeu de données peut être personnalisée indépendamment.
it: Puoi aggiungere più di un dataset e definire dei parametri personalizzati per ogni layer.
nl: U kan meerdere datasets toevoegen: elke datasetlaag kan aangepast worden met zijn eigen parameters.

source: With the preview mode you can check the final result.
de: Im Vorschaumodus können Sie das Endergebnis prüfen.
es: Con el modo de vista previa puede comprobar el resultado final.
fr: Grâce à l'aperçu, vous pouvez voir le résultat final.
it: La modalità di anteprima ti permette di controllare il risultato finale.
nl: Via de modus voorbeeldweergave kan u het eindresultaat controleren.

source: At any times you can save your map to continue editing later, or share it when you are finished.
de: Ihre Karte können Sie jederzeit speichern, um sie später weiter zu bearbeiten, oder nach der Fertigstellung teilen.
es: En todo momento puede guardar el mapa para seguir editándolo más tarde o compartirlo una vez terminado.
fr: Vous pouvez enregistrer votre carte à tout moment pour continuer à l'éditer plus tard ou la partager quand elle est achevée.
it: Puoi salvare la mappa in qualsiasi momento per continuarla più tardi e, una volta terminata, hai la possibilità di condividerla.
nl: U kan op elk moment uw kaart opslaan om deze later verder te bewerken of deze te delen wanneer u klaar bent.

source: Let's create a map with some data from the City of Paris as an example.
de: Lassen Sie uns als Beispiel eine Karte mit einigen Daten der Stadt Paris erstellen.
es: Vamos a crear un mapa con algunos datos de la ciudad de París a modo de ejemplo.
fr: Créons par exemple une carte avec des données concernant la ville de Paris.
it: Vediamo ad esempio come crearne una a partire da alcuni dati della città di Parigi.
nl: Laten we als voorbeeld een kaart maken met enkele data van de Stad Parijs.

source: Choose a base map
de: Grundkarte wählen
es: Elegir un mapa de base
fr: Choisir un fond de carte
it: Scegli una mappa
nl: Kies een basiskaart.

source: Using this button |mapbox| you can choose the default base map of your map.
de: Über die Schaltfläche |mapbox| können Sie die Standardgrundkarte für Ihre Karte auswählen.
es: Con este botón |mapbox| puede elegir el mapa de base predeterminado del mapa.
fr: Grâce à ce bouton |mapbox|, vous pouvez choisir le fond de carte par défaut pour votre carte.
it: Tramite questo pulsante |mapbox| puoi scegliere la mappa di base predefinita da utilizzare.
nl: Met de knop |mapbox| kan u de standaard basiskaart van uw kaart kiezen.

source: See the :doc:`Mapbox integration section </customizing_look_and_feel/basemaps>` for more information on base maps.
de: Für weitere Informationen über Grundkarten siehe den Abschnitt über die :doc:`Integration der Kartenauswahl </customizing_look_and_feel/basemaps>`.
es: Consulte la sección :doc:`Integración de Mapbox </customizing_look_and_feel/basemaps>` para obtener más información acerca de los mapas de base.
fr: Reportez-vous à la :doc:`section intégration Mapbox </customizing_look_and_feel/basemaps>` pour plus d'informations sur les fonds de carte.
it: Per maggiori informazioni sulle mappe di base, consulta la :doc:`sezione Integrazione con Mapbox</customizing_look_and_feel/basemaps>`.
nl: Zie het :doc:`Mapbox integration section </customizing_look_and_feel/basemaps>` voor meer informatie over basiskaarten.

source: First layer
de: Erste Schicht
es: Primera capa
fr: Première couche
it: Primo layer
nl: Eerste laag

source: The Map Builder starts with an empty default map in edition mode.
de: Der Kartenersteller startet mit einer leeren Standardkarte im Bearbeitungsmodus.
es: El compilador de mapas empieza con un mapa predeterminado vacío en modo de edición.
fr: L'éditeur de cartes démarre en mode édition avec une carte vierge par défaut.
it: Map Builder si apre in modalità di modifica su una mappa vuota predefinita.
nl: De Map Builder start met een lege standaard kaart in bewerkmodus.

source: Click on ``Add a dataset to this layer`` to start importing some data on your map.
de: Klicken Sie auf ``Datensatz zur Schicht hinzufügen``, um den Import einiger Daten in Ihre Karte zu starten.
es: Haga clic en ``Añadir un conjunto de datos a esta capa`` para empezar a importar datos en el mapa.
fr: Cliquez sur ``Ajouter un jeu de données à cette couche`` pour importer des données sur votre carte.
it: Clicca su ``Aggiungi un dataset a questo layer`` per iniziare l'importazione dei dati sulla tua mappa.
nl: Klik op ``Voeg een dataset toe aan deze laag`` om het importeren van data naar uw kaart op te starten.

source: The list of available datasets is displayed: you can search or browse by category to find your datasets. As usual you can preview and filter a dataset before importing it.
de: Die Liste der verfügbaren Datensätze wird angezeigt: Ihre Datensätze finden Sie anhand einer Suche bzw. Durchsuchen nach Kategorien. Wie immer können Sie einen Datensatz filtern und eine Vorschau anzeigen lassen, bevor Sie ihn importieren.
es: Se visualiza la lista de los conjuntos de datos disponibles: puede buscar o explorar por categoría para encontrar sus conjuntos de datos. Como siempre, puede obtener una vista previa y filtrar un conjunto de datos antes de importarlo.
fr: La liste des jeux de données disponibles est affichée et vous pouvez la filtrer par catégorie pour trouver votre jeu de données. Comme d'habitude, avant de l'importer, vous pouvez avoir un aperçu du jeu de données et le filtrer.
it: Viene visualizzato l'elenco dei dataset disponibili, che puoi esplorare effettuando una ricerca o sfogliando per categoria. Come sempre, prima di importare i dataset è possibile visualizzarne l'anteprima o filtrarli.
nl: De lijst van beschikbare datasets wordt weergegeven: u kan zoeken of doorbladeren per categorie om uw datasets terug te vinden. Zoals gewoonlijk kan u een voorbeeldweergave krijgen en een dataset filteren alvorens deze te importeren.

source: For this example, let's take the public dataset "`Les espaces verts`" from `Open Data Paris`
de: Nehmen wir für dieses Beispiel den öffentlichen Datensatz "`Les espaces verts`" von `Open Data Paris`.
es: En este ejemplo, vamos a tomar el conjunto de datos público "`Les espaces verts`" de `Open Data Paris`.
fr: Pour cet exemple, prenons le jeu de données public "`Les espaces verts`" `d'Open Data Paris`.
it: A titolo di esempio, scegliamo il dataset pubblico "`Les espaces verts`" del dominio `Open Data Paris`.
nl: Laten we voor dit voorbeeld de publieke dataset "`Les espaces verts`" uit `Open Data Paris` nemen.

source: Click on ``Select`` to complete the import and display the data on your map.
de: Klicken Sie auf ``Auswählen``, um den Import abzuschließen und die Daten auf Ihrer Karte anzuzeigen.
es: Haga clic en ``Seleccionar`` para completar la importación y visualizar los datos en el mapa.
fr: Cliquez sur ``Sélectionner`` pour importer et afficher les données sur votre carte.
it: Clicca su ``Seleziona`` per effettuare l'importazione e visualizzare i dati sulla mappa.
nl: Klik op ``Selecteer`` om het importeren te voltooien en de data op uw kaart weer te geven.

source: You can filter after importing using the ``Edit`` button.
de: Nach dem Import können Sie über die Schaltfläche ``Bearbeiten`` filtern.
es: Puede filtrar después de la importación con el botón ``Editar``.
fr: Vous pouvez les filtrer après l'importation grâce au bouton ``Éditer``.
it: Una volta importati, i dati possono essere filtrati tramite il pulsante ``Modifica``.
nl: Na het importeren kan u filteren door middel van de knop ``Bewerk``.

source: Under the dataset title, in the right pane, you can choose between different visualizations types:
de: Unter dem Datensatztitel können Sie im rechten Bereich zwischen verschiedenen Visualisierungstypen wählen:
es: Bajo el título del conjunto de datos, en el panel derecho, puede elegir entre varios tipos de visualizaciones:
fr: Sous le titre du jeu de données, dans le volet de droite, vous pouvez choisir parmi plusieurs types de visualisations :
it: Sotto il titolo del dataset, nel pannello di destra, hai a disposizione diversi tipi di visualizzazioni:
nl: Onder de datasettitel, in het venstertje rechts, kan u kiezen tussen verschillende weergavetypes:

source: ``Display points``: forces the display of geo points and do not clusterize.
de: ``Punkte anzeigen``: erzwingt die Anzeige von Geopunkten ohne Clusterbildung.
es: ``Visualizar puntos``: Fuerza la visualización de puntos geográficos y no en clúster.
fr: ``Afficher les points`` : force l'affichage des points géographiques sans les regrouper en clusters.
it: ``Visualizza i punti``: impone la visualizzazione dei punti geografici senza organizzarli in cluster.
nl: ``Punten weergeven``: forceert de weergave van geografische punten en niet clusteren.

source: Do not choose this display mode if your dataset contains more than 1000 points as this might consume a lot of resources on the client web browser.
de: Diesen Modus sollten Sie nicht wählen, wenn Ihr Datensatz über 1.000 Punkte beinhaltet, da dies viele Ressourcen des Client-Webbrowsers beanspruchen könnte.
es: No elija este modo de visualización si el conjunto de datos contiene más de 1.000 puntos ya que puede consumir una gran cantidad de recursos en el explorador web del cliente.
fr: Ne choisissez pas ce mode si votre jeu de données contient plus de 1 000 points, car cela implique une consommation importante de ressources pour le navigateur Web client.
it: Se il tuo dataset contiene più di 1.000 punti, evita di selezionare questa modalità, perché potrebbe richiedere una grande quantità di risorse da parte del browser lato client.
nl: Kies deze weergavemodus niet wanneer uw dataset meer dan 1000 punten bevat aangezien hierdoor een groot deel van de bronnen op de webbrowser van de klant kunnen worden opgebruikt.

source: ``Display shapes``: forces the display of geo shapes (when relevant).
de: ``Formen anzeigen``: erzwingt die Anzeige von Geoformen (sofern relevant).
es: ``Visualizar formas``: Fuerza la visualización de formas geográficas (cuando corresponda).
fr: ``Afficher des formes`` : force l'affichage de formes géographiques (si pertinent).
it: ``Visualizza le forme``: impone la visualizzazione delle forme geografiche (se presenti).
nl: ``Vormen weergeven``: forceert de weergaven van geografische vormen (wanneer dit relevante is).

source: In this mode, you can choose to have the geo shapes colors depend on the aggregated value of a field. To do so, select an aggregation function and the field it should be applied to.
de: In diesem Modus können Sie die Abhängigkeit der Geoformfarben vom kumulierten Wert eines Felds festlegen. Wählen Sie dazu eine Kumulationsfunktion und das Feld, auf die sie angewendet werden soll.
es: En este modo, puede elegir que los colores de las formas geográficas dependan del valor agregado de un campo. Para ello, seleccione una función de agregación y el campo al cual debe aplicarse.
fr: Dans ce mode, vous pouvez décider d'appliquer des couleurs différentes aux formes géo en fonction de la valeur totale du champ. À cette fin, sélectionnez une fonction d'agglomération et le champ auquel l'appliquer.
it: Con questa modalità, puoi scegliere di applicare colori diversi alle forme geografiche in base al valore totale del campo. Per fare ciò, seleziona una funzione di aggregazione e il campo al quale applicarla.
nl: In deze modus kan u ervoor kiezen om de kleuren van de geografische vormen te laten afhangen van de samengetelde waarde van een veld. Selecteer hiervoor de aggregatiefunctie en het veld waarop deze moet worden toegepast.

source: ``Display polygon clusters``: displays clusters or points depending on the zoom level and the volume of data to display.
de: ``Polygon-Cluster anzeigen``: zeigt je nach Zoomfaktor und dem anzuzeigenden Datenvolumen Cluster oder Punkte an.
es: ``Visualizar clústeres de polígonos``: visualiza clústeres o puntos en función del nivel de zoom y el volumen de los datos que se visualizarán.
fr: ``Afficher des clusters polygonaux`` : affiche des clusters ou des points selon l'échelle et le nombre de données à afficher.
it: ``Visualizza cluster di poligoni``: visualizza i cluster o i punti in base allo zoom selezionato e al volume dei dati da visualizzare.
nl: ``Veelhoekclusters weergeven``: geeft clusters of punten weer, afhankelijk van het inzoomniveau en het volume van data dat moet worden weergegeven.

source: This mode is designed to display smoothly datasets containing a large number of records. This is the mode use by default in the catalog datasets view.
de: Dieser Modus dient zur reibungslosen Anzeige von Datensätzen mit zahlreichen Einträgen und wird standardmäßig in der Katalogansicht der Datensätze verwendet.
es: Este modo está pensado para visualizar sin problemas conjuntos de datos que contienen un gran número de registros. Es el modo utilizado de forma predeterminada en la vista de conjuntos de datos del catálogo.
fr: Ce mode sert à afficher des jeux de données contenant un grand nombre d'enregistrements de manière fluide. Il est utilisé par défaut dans la vue catalogue des jeux de données.
it: Questa è la modalità predefinita all'interno della visualizzazione catalogo ed è pensata per quei dataset che contengono una vasta quantità di record.
nl: Deze modus is speciaal ontworpen om op vlotte wijze datasets weer te geven die een groot aantal records bevatten. Dit is de modus die standaard gebruikt wordt in de catalogusweergave van datasets.

source: ``Heatmap clustering``: builds heatmap clusters filled with a color depending on the number of geo points (or polygon centroids) in an area.
de: ``Wärmebild-Cluster``: erstellt Wärmebild-Cluster, die je nach Anzahl der Geopunkte (oder Polygonschwerpunkte) in einem Bereich mit einer Füllfarbe versehen sind.
es: ``Clúster de mapas de situación``: Crea clústeres de mapas de situación rellenados con un color en función del número de puntos geográficos (o baricentros de polígonos) de una área.
fr: ``Clusters pour cartes thermiques`` : crée des clusters pour cartes thermiques colorés en fonction du nombre de points géographiques (ou de barycentres de polygones) dans une zone.
it: ``Cluster di mappe termiche``: crea cluster di mappe termiche colorati in base alla quantità di punti geografici (o centroidi di poligoni) presenti in un'area.
nl: ``Hittemap clustering``: bouwt clusters met hittemappen die opgevuld zijn met een kleur afhankelijk van het aantal geografische punten (of veelhoek centroids) in een gebied.

source: In this mode, you can choose to have the heatmap cluster colors depend on the aggregated value of a field. To do so, select an aggregation function and the field it should be applied to.
de: In diesem Modus können Sie die Abhängigkeit der Wärmebild-Clusterfarben vom kumulierten Wert eines Feldes festlegen. Wählen Sie dazu eine Kumulationsfunktion und das Feld, auf die sie angewendet werden soll.
es: En este modo, puede elegir que los colores del clúster de mapas de situación dependan del valor agregado de un campo. Para ello, seleccione una función de agregación y el campo al cual debe aplicarse.
fr: Ce mode vous permet d'obtenir des couleurs de cluster pour cartes thermiques attribuées en fonction de la valeur totale du champ. À cette fin, sélectionnez une fonction d'agglomération et le champ auquel l'appliquer.
it: Con questa modalità, puoi scegliere di applicare colori diversi ai cluster di mappe termiche in base al valore totale del campo. Per fare ciò, seleziona una funzione di aggregazione e il campo al quale applicarla.
nl: In deze modus kan u ervoor kiezen om de kleuren van de hittemap cluster te laten afhangen van de samengetelde waarde van een veld. Selecteer hiervoor de aggregatiefunctie en het veld waarop deze moet worden toegepast.

source: By default the selected layer view is `Display polygon clusters`.
de: Standardmäßig ist die Schichtansicht `Polygon-Cluster anzeigen` ausgewählt.
es: De forma predeterminada, la vista de capa seleccionada es `Visualizar clústeres de polígonos`.
fr: Par défaut, la vue de la couche sélectionnée est configurée sur `Afficher des clusters polygonaux`.
it: La modalità predefinita per la visualizzazione dei layer selezionati è `Visualizza cluster di poligoni`.
nl: Standaard is de weergave van de geselecteerde laag `Veelhoek clusters weergeven`.

source: The default icons and colors used for a dataset are configured by the dataset publisher but you can override them from the Map Builder using the corresponding action buttons.
de: Die für einen Datensatz verwendeten Standardsymbole und -farben werden vom Datensatzveröffentlicher konfiguriert, aber Sie können sie im Kartenersteller unter Verwendung der entsprechenden Schaltflächen überschreiben.
es: Los iconos y colores predeterminados que se emplean para un conjunto de datos han sido configurados por el publicador del conjunto de datos, pero se pueden sobrescribir desde el compilador de mapas por medio de los botones de acción correspondientes.
fr: Les couleurs et les icônes par défaut d'un jeu de données sont configurées par le producteur du jeu de données, mais il est possible de les modifier dans l'éditeur de cartes grâce aux boutons correspondants.
it: Le impostazioni predefinite sulle icone e sui colori dei dataset vengono definite dall'editore del dataset, ma possono essere ignorate in Map Builder utilizzando gli appositi pulsanti.
nl: De standaard pictogrammen en kleuren die gebruikt worden voor een dataset worden geconfigureerd door de uitgever van de dataset maar u kan deze vanuit de Map Builder opheffen door gebruikt te maken van de overeenkomstige actieknoppen.

source: Stacking datasets
de: Stapeln von Datensätzen
es: Apilar conjuntos de datos
fr: Superposer des jeux de données
it: Sovrapposizione dei dataset
nl: Datasets op elkaar stapelen
