Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/map.po
Languages: de, es, fr, it, nl

source: You can repeat the previous steps to create new layers of data and produce richer visualizations.
de: Sie können die vorherigen Schritte wiederholen, um neue Datenschichten zu erstellen und reichhaltigere Visualisierungen zu schaffen.
es: Puede repetir los pasos anteriores para crear capas de datos nuevas y producir visualizaciones más ricas.
fr: En répétant les étapes précédentes, vous pouvez créer des couches de données pour enrichir la visualisation.
it: Per realizzare delle visualizzazioni più complesse, puoi creare nuovi layer di dati ripetendo i passaggi descritti finora.
nl: U kan de vorige stappen herhalen om nieuwe lagen met data aan te maken en rijkere weergaves te genereren.
