Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/dashboard/dashboard.po
Languages: de, es, fr, it, nl

source: We will split the screen into two main areas : on the left a navigation bar, on the right the main content. The navigation bar will carry the search bar and filters, the content will carry the table, map and chart.
de: Wir werden den Bildschirm in zwei Hauptbereiche aufteilen: links eine Navigationsleiste und rechts der Hauptinhalt. In der Navigationsleiste befinden sich die Suchleiste und Filter, im Inhalt befinden sich die Tabelle, die Karte und das Diagramm.
es: Dividiremos la pantalla en 2 áreas principales: a la izquierda, una barra de navegación; a la derecha, el contenido principal. La barra de navegación alojará la barra de búsqueda y los filtros; el contenido incluirá la tabla, el mapa o el gráfico.
fr: Nous allons séparer l'écran en deux zones principales : sur la gauche, une barre de navigation, et sur la droite, le contenu principal. La barre de navigation sera composée de la barre de recherche et des filtres, la zone du contenu principal sera quant à elle composée du tableau, de la carte et du graphe.
it: Dividiamo lo schermo in due aree: sulla sinistra abbiamo un menu di navigazione e sulla destra i contenuti principali. Il menu di navigazione conterrà la barra di ricerca e i filtri, mentre il blocco dei contenuti accoglierà la tabella, la mappa e il grafico.
nl: We splitsen het scherm op in twee hoofdgebieden: links een navigatiebalk en rechts de hoofdcontent. In de navigatiebalk staan de zoekbalk en de filters, in de content staan de tabel, kaart en grafiek.

source: It will looks like this :
de: Das Ganze sieht so aus:
es: Tendrá el aspecto siguiente:
fr: La page ressemblera à ceci :
it: Ecco lo schema del nostro layout:
nl: Dit ziet er dan zo uit:

source: Bootsrap (the grid layout managment tool) split the page into 12 columns. We will alloy 3 columns for the navigation bar and 9 for the content. We will split the screen for devices starting from medium size. The CSS class is ``col-md-3`` and ``col-md-9``
de: Bootsrap (das Grid-Layout-Tool) unterteilt die Seite in 12 Spalten. Wir verbinden 3 Spalten für die Navigationsleiste und 9 Spalten für den Inhalt. Wir teilen den Bildschirm für Geräte ab mittlerer Größe auf. Die CSS-Klasse ist "col-md-3" und "col-md-9".
es: Bootsrap (la herramienta de gestión de diseño de cuadrícula) divide la página en 12 columnas. Destinaremos 3 columnas a la barra de navegación y 9 al contenido. Dividiremos la pantalla para los dispositivos a partir de un tamaño medio. Las clases CSS son ``col-md-3`` y ``col-md-9``.
fr: Bootstrap (l'outil de gestion de la disposition en grille) divise la page en 12 colonnes. Nous allons allouer 3 colonnes à la barre de navigation et 9 au contenu. Nous allons diviser l'écran en fonction des dispositifs, en commençant par ceux de taille moyenne. Les classes CSS sont ``col-md-3`` et ``col-md-9``
it: Il layout a griglia Bootstrap di cui si serve la piattaforma divide la pagina in 12 colonne. Di conseguenza, assegneremo 3 colonne alla barra di navigazione e 9 ai contenuti. Attiveremo questa disposizione in due parti solo a partire da schermi di dimensione media. Le classi CSS da utilizzare sono ``col-md-3`` e ``col-md-9``.
nl: Bootsrap (de tool voor het beheren van de rasterlay-out) splitst de pagina op in 12 kolommen. We zullen 3 kolommen gebruiken voor de navigatiebalk en 9 voor de content. We zullen het scherm vullen met toestellen, te beginnen met middelmatige grootte. De CSS-klasse is ``col-md-3`` en ``col-md-9``

source: Concerning the table and chart widget, we will split the area in two equal size, ie. 6 columns each. The CSS class is ``col-md-6``
de: In Bezug auf das Tabellen- und Diagramm-Widget unterteilen wir die Fläche in zwei Bereiche gleicher Größe, d. h. jeweils 6 Spalten. Die CSS-Klasse ist "col-md-6"
es: En cuanto al widget de tabla y gráfico, dividiremos el área en 2 del mismo tamaño, es decir, de 6 columnas cada una. La clase CSS es ``col-md-6``.
fr: En ce qui concerne le widget de tableau et de graphe, nous allons diviser la zone en deux parties égales, c'est-à-dire en 6 colonnes chacune. La classe CSS est ``col-md-6``
it: Per quanto riguarda la tabella e il widget del grafico, divideremo lo spazio in due parti uguali, da 6 colonne ciascuna. La classe CSS sarà quindi ``col-md-6``.
nl: Wat betreft de tabel- en grafiekwidget, splitsen we het gebied op in twee gelijke delen, elk 6 kolommen. De CSS-klasse is ``col-md-6``

source: One last detail: to use ``col-xx-yy`` CSS classes, they always need to be inside a ``row`` element ! So first, you define rows, then you split the rows !
de: Ein letztes Detail: um die CSS-Klassen "col-xx-yy" nutzen zu können, müssen sie sich stets in einem Zeilenelement befinden! Deshalb müssen Sie die Zeilen zunächst definieren und anschließend aufteilen!
es: Un último detalle: para usar las clases CSS ``col-xx-yy``, siempre deben estar dentro de un elemento ``row``. ¡Así que primero defina las filas y después divida las filas!
fr: Une dernière précision : pour pouvoir utiliser les classes CSS ``col-xx-yy``, ces dernières doivent toujours se trouver à l'intérieur d'un élément ``row`` ! Vous devez donc commencer par définir des lignes, puis les diviser !
it: Ultimo dettaglio: le classi CSS del tipo ``col-xx-yy`` devono sempre essere incluse in un elemento ``row``. In altri termini, possiamo suddividere le righe solo se le abbiamo prima definite.
nl: Eén laatste detail: om CSS-klassen ``col-xx-yy`` te gebruiken moeten ze altijd in een ``rij`` element staan! Dus definieer eerst rijen en splits vervolgens de rijen op!

source: The HTML block should then looks like this :
de: Der HTML-Block sollte dann so aussehen:
es: El bloque HTML debería tener el aspecto siguiente:
fr: Le bloc HTML doit alors ressembler à ceci :
it: Ecco come dovrebbe apparire il blocco HTML:
nl: Het HTML-blok zou er dan als volgt moeten uitzien:

source: We now have a real dashboard, last detail will be to give some air of every element, they are still all sticked together. It's a pure CSS aspect, and using ``margin`` and ``padding`` rules will easilly do the job.
de: Nun haben wir ein richtiges Dashboard. Jetzt sollten wir jedem Element noch ein wenig Luft verschaffen, sie hängen alle noch zusammen. Hierbei handelt es sich um einen CSS-Aspekt, und mit den Eigenschaften "margin" und "padding" können wir die Sache erledigen.
es: Ahora tenemos un panel real, y un último detalle será mejorar la nitidez de los elementos, ya que siguen estando todos juntos. Es un aspecto de CSS puro, y el uso de las reglas ``margin`` y ``padding`` cumplirá fácilmente este objetivo.
fr: Nous avons désormais un véritable tableau de bord, il ne reste plus qu'à espacer les éléments, car ils sont encore très proches les uns des autres. Cet aspect est directement traité dans la CSS, l'utilisation des règles ``margin`` et ``padding`` permet de réaliser facilement l'espacement.
it: Ora che abbiamo un vero dashboard, non ci resta che inserire un po' di spazio tra i vari elementi, che al momento sono tutti troppo vicini. Per fare ciò, è sufficiente lavorare direttamente sui CSS utilizzando le regole ``margin`` e ``padding``.
nl: We hebben nu een echt dashboard. Een laatste detail is nu om elk element een beetje lucht te geven aangezien ze allemaal nog samen kleven. Dit is een zuiver CSS-aspect en door de regels ``margin`` en ``padding`` te gebruiken zal deze taak veel eenvoudiger worden.

source: But the platform also provide a CSS class called ``ods-box``. It encapsulate any element into a box with a thin rounded border. We will use it to encapsulate the navigation bar, the map, the table and the chart.
de: Die Plattform bietet außerdem eine CSS-Klasse mit dem Namen "ods-box". Sie verschiebt jedes Element in einen Kasten mit einem dünnen, gerundeten Rand. Wir nutzen sie, um die Navigationsleiste, die Karte, die Tabelle und das Diagramm zu umranden.
es: Pero la plataforma también suministra una clase CSS denominada ``ods-box``. Encapsula cualquier elemento en un cuadro con un borde redondeado fino. La usaremos para encapsular la barra de navegación, el mapa, la tabla y el gráfico.
fr: Cependant, la plateforme dispose également d'une classe CSS appelée ``ods-box``. Elle permet d'encapsuler n'importe quel élément dans un cadre à bord fin et arrondi. Nous allons l'utiliser pour encapsuler la barre de navigation, la carte, le tableau et le graphe.
it: La piattaforma mette però a disposizione anche una classe CSS denominata ``ods-box``, che ingloba gli elementi in una casella con un sottile bordo arrotondato. Ci serviremo allora di questa classe per delimitare il menu di navigazione, la mappa, la tabella e il grafico.
nl: Maar het platform voorziet ook een CSS-klasse met de naam ``ods-box``. Deze omkapselt elk element in een vakje met een dunne afgeronde rand. We gebruiken dit om de navigatiebalk, de kaart, de tabel en de grafiek te omkapselen.

source: The full HTML code is now :
de: Der vollständige HTML-Code ist jetzt:
es: El código HTML completo ahora es:
fr: Le code HTML complet est désormais le suivant :
it: Ecco il codice HTML completo:
nl: De volledige HTML-code is nu:

source: Have a deeper look to the "context"
de: Ein tieferer Einblick in den "Kontext"
es: Examinar con más detalle el "contexto"
fr: Étudier le "contexte" plus en profondeur
it: Approfondisci il concetto di "contesto"
nl: Bekijk de "context" van dichterbij

source: We now know that the context is the key between all widgets and the link between them and the data. Some widgets consume/read it : the odsTable widget will use it to get records and display them. Some widgets act/modify it : the odsTextSearch will query it by applying a search query or filter. Some widgets do both : the odsFacets get filters, display them, and allow to apply a filter on the context.
de: Wir wissen jetzt, dass der Kontext der Schlüssel zwischen allen Widgets und die Verbindung zwischen ihnen und den Daten ist. Manche Widgets nutzen/lesen ihn: Das Widget odsTable nutzt ihn, um Einträge zu erfassen und anzuzeigen. Manche Widgets wenden ihn an/verändern ihn: Das Widget odsTextSearch fragt ihn unter Einsatz einer Suchanfrage oder eines Filter ab. Manche machen beides: Das Widget odsFacets erfasst Filter, zeigt sie an und ermöglicht dann, einen Filter in dem Kontext anzuwenden.
es: Ahora sabemos que el contexto es el pivote clave que existe entre todos los widgets, así como el vínculo entre estos y los datos. Algunos widgets lo consumen o leen: el widget odsTable lo emplea para obtener registros y visualizarlos. Otros widgets lo modifican o actúan en él: odsTextSearch lo consulta aplicando una consulta de búsqueda o un filtro. Hay widgets que hacen ambas tareas: odsFacets obtiene filtros, los visualiza y permite aplicar un filtro en el contexto.
fr: Nous savons désormais que le contexte est ce qui permet de connecter les widgets les uns aux autres et de les lier aux données. Certains widgets consomment/lisent des données : le widget odsTable les utilise pour obtenir et afficher les enregistrements. Certains widgets utilisent/modifient les données : le widget odsTextSearch les interroge en envoyant des requêtes ou en appliquant des filtres. Certains widgets font tout cela à la fois : le widget odsFacets obtient des filtres, les affiche et permet d'appliquer un filtre sur le contexte.
it: Sappiamo che il contesto è un elemento fondamentale per i widget, nonché l'elemento di collegamento tra questi e i dati. Alcuni widget consumano/consultano il contesto: tramite questo "odsTable" ottiene i record e li visualizza. Altri vi effettuano operazioni/lo modificano: "odsTextSearch" lancia una query in base alle richieste di una ricerca o di un filtro. Altri ancora svolgono entrambe le operazioni: "odsFacets" ottiene i filtri, li visualizza e consente di applicare un filtro al contesto.
nl: We weten nu dat de context de sleutel is tussen alle widgets en de koppeling tussen hen en de data. Sommige widgets gebruiken/lezen deze: de odsTable widget gebruikt deze om records te krijgen en deze weer te geven. Sommige widgets handelen/wijzigen deze: de odsTextSearch voert een zoekopdracht uit door een zoekopdracht toe te passen of te filteren. Sommige widgets doen beide: de odsFacets geeft filters, geeft deze weer en laat toe om een filter toe te passen op de context.

source: To go further it's now interresting to see how widget modify the context and what kind of information we can get from it.
de: Um einen Schritt weiterzugehen, ist es interessant zu verstehen, wie ein Widget den Kontext verändert und welche Art von Informationen wir von ihm erhalten können.
es: Para continuar adelante, resulta interesante ver ahora cómo el widget modifica el contexto y qué tipo de información podemos obtener de él.
fr: Pour aller plus loin, découvrons maintenant comment les widgets modifient le contexte et quels types d'informations ils peuvent en retirer.
it: Passando a un approccio più avanzato, è interessante scoprire come i widget modifichino il contesto e quale tipo di informazioni possiamo ricavarne.
nl: Om verder te gaan is het nu interessant om te zien hoe widgets de context wijzigen en welk soort informatie we eruit kunnen bekomen.

source: As OpenDataSoft widgets library rely on **AngularJS** we will use it's syntax to read the **context**.
de: Die Widget-Bibliothek von OpenDataSoft stützt sich auf **AngularJS**, weshalb wir dessen Syntax verwenden, um den **Kontext** zu lesen.
es: Como la biblioteca de widgets de OpenDataSoft se basa en **AngularJS** utilizaremos su sintaxis para leer el **contexto**.
fr: Étant donné que la bibliothèque des widgets OpenDataSoft repose sur **AngularJS**, nous allons utiliser sa syntaxe pour lire le **contexte**.
it: Dato che la libreria di widget OpenDataSoft si basa su **AngularJS**, utilizzeremo questo tipo di sintassi per leggere il **contesto**.
nl: Aangezien de widgetsbibliotheek van OpenDataSoft gebaseerd is op **AngularJS** zullen we de syntax ervan gebruiken om de **context** te lezen.

source: The **context** is an **AngularJS variable**.
de: Der **Kontext** ist eine **AngularJS-Variable**.
es: El **contexto** es una **variable AngularJS**.
fr: Le **contexte** est une **variable AngularJS**.
it: Il **contesto** è una **variabile AngularJS**.
nl: De **context** is een **AngularJS variabele**.

source: The **context** can be seen like a simple **JSON object**, with brackets, key values lists etc...
de: Der **Kontext** kann wie ein einfaches **JSON-Objekt** betrachtet werden, mit Klammern, Schlüsselwertlisten usw.
es: El **contexto** puede entenderse como un **objeto JSON** simple, con corchetes, listas de valores claves, etc.
fr: Le **contexte** peut être envisagé comme un simple **objet JSON**, avec des accolades, des listes de valeurs de clés, etc.
it: Il **contesto** può essere considerato come un semplice **oggetto JSON**, con parentesi, elenchi di valori chiave, ecc.
nl: De **context** kan gezien worden als een gewoon **JSON-voorwerp** met haakjes, lijsten met sleutelwaarden, enz.

source: To evaluate an expression in AngularJS we use this syntax : ``{{ action1 or variable1 }}``
de: Um einen AngularJS-Ausdruck zu evaluieren, verwenden wir diese Syntax: "{{ action1 or variable1 }}"
es: Para evaluar una expresión en AngularJS utilizamos esta sintaxis: ``{{ acción1 o variable1 }}``
fr: Pour évaluer une expression AngularJS, la syntaxe suivante est utilisée : ``{{ action1 or variable1 }}``
it: Per valutare un'espressione in AngularJS utilizziamo questa sintassi: ``{{ action1 or variable1 }}``
nl: Om een uitdrukking in AngularJS te evalueren, gebruiken we de syntax: ``{{ action1 or variable1 }}``

source: To conclude this note, to read the context, simply add this bunch of code in an empty space :
de: Und schließlich, um den Kontext zu lesen, fügen Sie einfach diese Codes an einer leeren Stelle ein:
es: Por último, para leer el contexto, basta con añadir este código en un espacio vacío:
fr: En conclusion, pour lire le contexte, ajoutez simplement le bout de code suivant dans un espace vide :
it: Per leggere il contesto, aggiungi semplicemente il seguente codice in uno spazio vuoto:
nl: Om deze toelichting af te sluiten, om de context te lezen, voeg deze bundel code gewoon toe in een lege ruimte:

source: Save, refresh : you should see an ugly json at the top of your page, by pretty printing it in your favorite dev. environment (or with an online json pretty printer like the one from `CuriousConcept <https://jsonformatter.curiousconcept.com/>`_ ) you should see something like this :
de: Nach dem Speichern und Aktualisieren sollten Sie einen unansehnlichen Json oben auf Ihrer Seite sehen. Mit der Ansicht-Optimierung für die bevorzugte Geräteumgebung (oder unter Einsatz eines JSON Pretty Printers, wie derjenige von `CuriousConcept <https://jsonformatter.curiousconcept.com/>`_) sollte etwas derartiges herauskommen:
es: Guarde los cambios y actualice. Observará un bloque json sin formato bonito en la parte superior de la página; con una impresión en formato bonito en su entorno de desarrollo preferido (o con una bonita impresora json en línea como la de `CuriousConcept <https://jsonformatter.curiousconcept.com/>`_ ), debería ver algo parecido a esto:
fr: Enregistrez et actualisez la page : vous devriez voir un objet JSON en impression brute en haut de votre page, en le transformant en impression élégante dans votre environnement de développement favori (ou avec un outil de formatage JSON en ligne, tel que `CuriousConcept <https://jsonformatter.curiousconcept.com/>`_ ), votre code devrait ressembler à ceci :
it: Dopo aver salvato e aggiornato, comparirà nella parte alta della pagina un oggetto JSON in formato grezzo. Effettua un pretty print nell'ambiente di sviluppo di tua scelta (in alternativa puoi ricorrere a una stampante JSON online, come quella di `CuriousConcept <https://jsonformatter.curiousconcept.com/>`_ ) e il risultato dovrebbe essere il seguente:
nl: Sla op, hernieuw: u zou een lelijke json bovenaan uw pagina moeten zien, door middel van pretty printing in uw favoriete dev. omgeving (of met een online json pretty printing zoals diegene uit `CuriousConcept <https://jsonformatter.curiousconcept.com/>`_ ) zou u iets moeten zien zoals dit:

source: As it's a json, we can with AngularJS expression navigate into it's structure go get the value of any key. For exemple, to get the dataset title, we go from the context, to the ``dataset`` list, then to the ``metas`` list, then we can reach the title value. Encapsulated in a big header (h1 HTML tag), it looks like this :
de: Da es sich um ein JSON handelt, können wir mit dem AngularJS-Audruck in seiner Struktur navigieren, um den Wert eines Schlüssels zu erhalten. Um beispielsweise den Datensatz-Titel zu erhalten, wechseln wir vom Kontext zur Liste "Datensatz", dann zu der Liste "Metas", wo wir den Titelwert finden. Gekapselt von einem großen Header (h1 HTML tag), sieht das Ganze so aus:
es: Como es json, con la expresión AngularJS podemos navegar en su estructura para obtener el valor de cualquier clave. Por ejemplo, para obtener el título de juego de datos, vamos del contexto a la lista ``dataset`` y después a la lista ``metas``, y ya podemos conseguir el valor de título. Encapsulado en un gran encabezado (etiqueta HTML h1), tiene este aspecto:
fr: Étant donné qu'il s'agit d'un objet JSON, nous pouvons utiliser une expression AngularJS pour naviguer dans sa structure, afin d'obtenir la valeur de n'importe quelle clé. Par exemple, pour obtenir le titre du jeu de données, accédez au contexte, puis à la liste ``dataset``, puis à la liste ``metas``, pour enfin atteindre la valeur du titre. Encapsulée dans un gros en-tête (tag HTML h1), l'expression devrait ressembler à ceci :
it: Trattandosi di un oggetto JSON, possiamo utilizzare un'espressione AngularJS per navigare nella sua struttura e ottenere il valore di qualsiasi chiave. Ad esempio, per recuperare il titolo del dataset, dal contesto dobbiamo accedere all'elenco ``dataset`` e poi andare in ``metas``, dove infine troveremo il valore attribuito al titolo. Dopo aver inglobato l'espressione in un header di grandi dimensioni (tag HTML "h1"), il codice apparirà come segue:
nl: Aangezien het een jason is, kunnen we met de AngularJS uitdrukking navigeren in de structuur ervan om de waarde van elke sleutel te krijgen. Bijvoorbeeld: om de datasettitel te bekomen, gaan we vanuit de context naar de "dataset" lijst, vervolgens naar de "metas" lijst. Zo komen we terecht op de waarde van de titel. Ingekapseld in een grote header (h1 HTML tag), ziet dit er zo uit:

source: Now that we saw what the context is, we must have a look to it's creation. The `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ is used to create a context, based on a datasetid and, optionnaly other parameters.
de: Nachdem wir jetzt festgestellt haben, was ein Kontext ist, sollten wir einen Blick auf seine Erstellung werfen. Das `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ wird verwendet, um einen Kontext zu erstellen, basierend auf einer Datensatz-ID und ggf. anderen Parametern.
es: Ahora que hemos visto qué es el contexto, debemos examinar su creación. Se utiliza `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ para crear un contexto, a partir de un ID de juego de datos y opcionalmente otros parámetros.
fr: Maintenant que nous avons vu ce qu'est le contexte, nous devons nous intéresser à sa création. `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ est utilisé pour créer un contexte, en se basant sur un id de jeu de données, et éventuellement sur d'autres paramètres.
it: Dopo aver visto cos'è il contesto, occupiamoci della sua creazione. Il widget `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ permette di creare un contesto in base all'ID del dataset ed eventualmente altri parametri.
nl: Nu we gezien hebben wat de context is, moeten we bekijken hoe deze wordt aangemaakt. De `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ wordt gebruikt om een context aan te maken op basis van een dataset-ID en optioneel andere parameters.
