Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/dashboard/dashboard.po
Languages: de, es, fr, it, nl

source: ng-if to display only one tab at a time, depending on the value of the variable
de: ng-if zur Anzeige eines einzigen Tabs zur gleichen Zeit, je nach Wert der Variable
es: ng-if para visualizar una sola ficha cada vez, según el valor de la variable
fr: ng-if pour afficher uniquement un onglet à la fois, en fonction de la valeur de la variable
it: ng-if per visualizzare una sola scheda alla volta, in base al valore della variabile;
nl: ng-if om slechts één tabblad tegelijkertijd weer te geven, afhankelijk van de waarde van de variabele

source: ng-click to change de value of the variable to switch from a tab to another
de: ng-click, um den Wert der Variable zu ändern und von einem Tab zum nächsten zu wechseln
es: ng-click para cambiar el valor de la variable a fin de cambiar de una ficha a otra
fr: ng-click pour modifier la valeur de la variable, afin de passer d'un onglet à un autre
it: ng-click per modificare il valore della variabile, in modo da passare da una scheda all'altra;
nl: ng-click om de waarde van de variabele te wijzigen om over te schakelen van een tabblad naar een ander

source: ng-class to change the color of the tab to show witch tab is selected
de: ng-class, um die Farbe des Tabs zu ändern und anzuzeigen, welcher Tab ausgewählt wurde
es: ng-class para cambiar color de la ficha con objeto de mostrar qué ficha está seleccionada
fr: ng-class pour changer la couleur de l'onglet, afin d'indiquer quel onglet est actuellement sélectionné
it: ng-class per modificare il colore della scheda, in modo da indicare qual è la scheda selezionata.
nl: ng-class om de kleur van het tabblad te wijzigen om te tonen welk tabblad wordt geselecteerd

source: So first, the HTML structure :
de: Zunächst die HTML-Struktur:
es: Así que, en primer lugar, la estructura HTML:
fr: Commençons par la structure HTML :
it: Impostiamo prima la struttura HTML:
nl: Dus eerst, de HTML-structuur:

source: Initialise a variable called ``tab`` with ``ng-init`` :
de: Initialisieren Sie eine Variable mit der Bezeichnung "Tab" mit "ng-init":
es: Inicialice una variable denominada ``tab`` con ``ng-init``:
fr: Initialisez une variable appelée ``tab`` avec ``ng-init`` :
it: Inizializziamo poi una variabile chiamata "tab" con ``ng-init``:
nl: Initialiseer een variabele met de naam ``tab`` met ``ng-init``:

source: On each tab button, add a ``ng-click`` to set the ``tab`` value :
de: Fügen Sie jeder Tab-Schaltfläche "ng-click" hinzu, um den Wert "Tab" einzurichten:
es: En cada uno de los botones de la ficha, añada un ``ng-click`` para configurar el valor de ``tab``:
fr: Sur les boutons de chaque onglet, ajoutez une directive ``ng-click`` pour définir la valeur ``tab`` :
it: Per ogni pulsante della scheda, aggiungiamo ``ng-click`` e impostiamo il valore di ``tab``:
nl: Op elke knop in het tabblad, voeg een ``ng-click`` toe om de ``tab``-waarde in te stellen:

source: Then, on each content block, add a ``ng-if`` condition to display it :
de: Fügen Sie anschließend in jedem Inhaltsblock eine "ng-if" Bedingung zur Anzeige hinzu:
es: A continuación, en cada uno de los bloques de contenido, añada una condición ``ng-if`` para su visualización:
fr: Ensuite, sur chaque bloc de contenu, ajoutez une condition ``ng-if`` pour l'afficher :
it: In ogni blocco di contenuto, aggiungiamo poi una condizione ``ng-if`` per la sua visualizzazione:
nl: Voeg vervolgens op elke contentblok een ``ng-if``-voorwaarde toe om deze weer te geven:

source: Save, refresh, and test, you should now see that, by clicking on the tab button, the content is changing !
de: Nachdem Sie gespeichert und aktualisiert haben, sehen Sie sich das Ganze an: Bei einem Klick auf die Tab-Schaltfläche sollte sich der Inhalt jetzt ändern!
es: Guarde los cambios, actualice y pruebe; observará que, si hace clic en el botón de ficha, ¡el contenido cambia!
fr: Enregistrez, actualisez la page et effectuez des tests. Vous devriez constater qu'en cliquant sur le bouton de l'onglet, le contenu est modifié !
it: Salva, aggiorna ed effettua un test: noterai che cliccando sul pulsante della scheda, il contenuto cambia!
nl: Sla op, hernieuw en test. u zou nu moeten kunnen zien dat, door op de tabknop te drukken, de content wijzigt!

source: Now, it needs some CSS to have a real button style, we already used it : ``ods-button ods-button--primary``. Let's also add a ``items`` and ``item`` class.
de: Mit ein wenig CSS wird der Stil der Schaltfläche jetzt angepasst: "ods-button ods-button--primary". Außerdem fügen wir eine "items"- sowie eine "item"-Klasse hinzu.
es: Ahora necesita algo de código CSS para tener un estilo de botón real, como ya hemos visto: ``ods-button ods-button--primary``. Vamos a añadir también una clase ``items`` e ``item``.
fr: Nous devons maintenant utiliser un bout de code CSS pour donner au bouton un beau style, nous l'avons déjà utilisé : ``ods-button ods-button--primary``. Ajoutons également les classes `items`` et ``item``.
it: Ora manca solo un po' di codice CSS per avere un vero pulsante. Ce ne siamo già serviti: ``ods-button ods-button--primary``. Aggiungiamo inoltre le classi ``items`` e ``item``.
nl: Nu is er een beetje CSS nodig om een echte knopstijl te krijgen. We hebben deze al gebruikt: ``ods-button ods-button--primary``. Laten we ook een klasse ``items`` en ``item`` toevoegen.

source: This looks like :
de: Das Ganze sieht so aus:
es: Tiene este aspecto:
fr: Le code ressemble à ceci :
it: Ecco il nostro codice:
nl: Dit ziet er als volgt uit:

source: Add in the CSS block this :
de: Fügen Sie Folgendes im CSS-Block hinzu:
es: Añada esto en el bloque CSS:
fr: Et ajoutez cela au bloc CSS :
it: Aggiungiamo poi i CSS:
nl: Voeg in het CSS-blok dit toe:

source: Last thing, still with CSS, we want to highlight with a different color witch tab is selected. We will use a predefined button also : ``ods-button--danger`` (in red) This CSS class must be set only for a specific condition with ``ng-class``. The pattern is : ``ng-class="{'css-class': variable == value}"``
de: Abschließend möchten wir - immer noch mit CSS - den ausgewählten Tab farblich hervorheben. Wir nutzen ebenfalls eine vordefinierte Schaltfläche: "ods-button--danger" (rot). Diese CSS-Klasse darf nur für eine bestimmte Bedingung mit "ng-class" gesetzt werden. Das Muster ist: "ng-class="{'css-class': variable == value}""
es: Por último, todavía con CSS, queremos resaltar con otro color la ficha que está seleccionada. Utilizaremos también un botón predefinido: ``ods-button--danger`` (en rojo) Esta clase CSS solo debe establecerse para una condición específica con ``ng-class``. El patrón es: ``ng-class="{'clase-css': variable == valor}"``.
fr: Enfin, toujours avec le code CSS, nous voulons mettre en valeur l'onglet sélectionné en l'affichant avec une couleur différente. Nous allons également utiliser un bouton prédéfini : ``ods-button--danger`` (en rouge). Cette classe CSS doit uniquement être définie pour une condition spécifique avec ``ng-class``. La syntaxe est la suivante : `ng-class="{'css-class': variable == value}"``
it: Infine, sempre ricorrendo ai CSS, vogliamo mettere in risalto la scheda selezionata con un colore differente. Ci serviremo di un pulsante predefinito: ``ods-button--danger`` (in rosso). Questa classe CSS deve essere impostata solo per una condizione specifica con ``ng-class``. Il modello è il seguente: ``ng-class="{'css-class': variable == value}"``.
nl: Nog een laatste ding: nog steeds met CSS willen we met een andere kleur beklemtonen welk tabblad is geselecteerd. We gebruiken ook een vooraf gedefinieerde knop: ``ods-button--danger`` (in het rood). Deze CSS-klasse moet voor een specifieke voorwaarde enkel ingesteld worden met ``ng-class``. Het patroon is: ``ng-class="{'css-class': variable == value}"``

source: The final HTML looks like this :
de: Die HTML sieht dann letztendlich so aus:
es: El código HTML final tiene este aspecto:
fr: Le code HTML final ressemble à ceci :
it: Ecco il codice HTML finale:
nl: De definitieve HTML ziet er als volgt uit:

source: Save, refresh, and try to switch tabs !
de: Nachdem Sie gespeichert und aktualisiert haben, können Sie zwischen den Tabs wechseln!
es: ¡Guarde los cambios, actualice y pruebe a cambiar entre fichas!
fr: Enregistrez, actualisez la page et passez d'un onglet à un autre !
it: Salva, aggiorna e prova a passare da una scheda all'altra!
nl: Sla op, hernieuw en probeer tussen tabs over te schakelen!

source: Then we can include it in our dashboard to add extra dataviz without having a too heavy dashboard (too heavy to load or to read). To give some space to the table and the chart that are too small we will include them in a tab, we will also add a third chart, based on another axis (the date for exemple). The second row will become the tabulated row, and each widget (table, charts) will be the content of each tab.
de: Dann können wir es in unser Dashboard einbinden, um eine zusätzliche Datenvisualisierung zu erzeugen, ohne das Dashboard damit zu überladen (und somit Lade- und Lesezugriffe zu erschweren). Um der Tabelle und dem Diagramm (die zu klein sind) Platz zu verschaffen, werden wir sie in einen Tab aufnehmen. Außerdem fügen wir ein drittes Diagramm auf Grundlage einer anderen Achse (z. B. Datum) hinzu. Die zweite Zeile wird zur tabellierten Zeile und jedes Widget (Tabelle, Diagramme) wird zum Inhalt der einzelnen Tabs.
es: A continuación, podemos incluir esto en el panel para añadir visualizaciones adicionales sin tener un panel demasiado pesado (de cargar o leer). Para dar espacio a la tabla y el gráfico, demasiado pequeños, los incluiremos en una ficha; también añadiremos un tercer gráfico, a partir de otro eje (la fecha, por ejemplo). La segunda fila pasará a ser la fila tabulada, y cada uno de los widgets (tabla y gráficos) será el contenido de cada una de las fichas.
fr: Nous pouvons ensuite l'inclure à notre tableau de bord pour ajouter des visualisations de données supplémentaires sans alourdir excessivement le tableau de bord (trop long à charger ou difficile à lire). Pour agrandir un peu le tableau et le graphe, nous pouvons les inclure dans un onglet, nous allons également ajouter un troisième graphe, basé sur un autre axe (la date, par exemple). La seconde ligne deviendra la ligne du tableau, et chaque widget (tableau, graphique) deviendra le contenu de chaque onglet.
it: Ora possiamo includerlo nel nostro dashboard per aggiungere altre visualizzazioni, senza per questo appesantirne il caricamento e la lettura. Per aumentare un po' le dimensioni della tabella e del grafico, inseriremo queste ultime in una scheda. Aggiungeremo inoltre un terzo grafico basato su un'altra variabile, ad esempio la data. La seconda riga verrà trasformata nella riga di una tabella, mentre i widget della tabella e dei grafici diventeranno il contenuto di ogni scheda.
nl: Vervolgens kunnen we deze opnemen in ons dashboard om extra dataweergaves toe te voegen zonder een al te zwaar dashboard te krijgen (te zwaar om te laden of te lezen). Om de tabel en de grafiek, die ook te klein zijn, te geven, zullen we deze opnemen in het tabblad. We zullen ook een derde grafiek toevoegen, gebaseerd op een andere as (bijvoorbeeld de datum). De tweede rij zal de getabuleerde rij worden en elke widget (tabel, grafieken) zal de content van elk tabblad zijn.

source: The main content looks like this :
de: Der Hauptinhalt sieht dann so aus:
es: El contenido principal tiene este aspecto:
fr: Le contenu principal ressemble à ceci :
it: Ecco il codice relativo ai contenuti:
nl: De hoofdcontent ziet er als volgt uit:

source: to center tab buttons, edit the CSS code with :
de: um die Tab-Schaltfläche zu zentrieren, bearbeiten Sie den CSS-Code mit:
es: Para centrar los botones de ficha, edite el código CSS con:
fr: Pour centrer les boutons des onglets, éditez le code CSS comme suit :
it: Per centrare i pulsanti delle schede, modifica i CSS in questo modo:
nl: om tabknoppen te centreren, bewerk de CSS-code met:

source: And finally, save, refresh :
de: Anschließend brauchen Sie nur noch zu speichern und zu aktualisieren:
es: Y por último, guarde los cambios y actualice:
fr: Pour terminer, enregistrez et actualisez la page :
it: E per finire, salva e aggiorna:
nl: En tot slot, sla op, hernieuw:
