Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/dashboard/dashboard.po
Languages: de, es, fr, it, nl

source: As the documentation say, 2 parameters are mandatory : the context name, and the datasetid. In our case, 1 additionnal parameter has been copied. ``mycontext-parameters`` is used to defined specific filters or query to the context. Here, several disjunctive mode are set to true for 5 fields, and the last parameter is a sort on date_d_immatriculation.
de: Wie in der Dokumentation erwähnt, sind 2 Parameter obligatorisch: der Kontextname und die Datensatz-ID. In unserem Fall wurde ein weiterer Parameter kopiert. "mycontext-parameters" wird verwendet, um bestimmte Filter zu definieren oder den Kontext abzufragen. Hier wurden mehrere disjunkte Modi auf "TRUE" für 5 Felder gesetzt und der letzte Parameter ist eine Sortierung für date_d_immatriculation.
es: Como señala la documentación, hay 2 parámetros obligatorios: el nombre de contexto y el ID de juego de datos. En este caso, se ha copiado 1 parámetro adicional. ``mycontext-parameters`` permite definir filtros específicos o una consulta al contexto. Aquí, se ha establecido el modo disyuntivo en true para 5 campos, y el último parámetro establece una ordenación para date_d_immatriculation.
fr: Comme indiqué dans la documentation, 2 paramètres sont obligatoires : le nom du contexte et l'id du jeu de données. 1 paramètre supplémentaire a été copié. ``mycontext-parameters`` est utilisé pour définir des filtres spécifiques ou effectuer des requêtes sur le contexte. Ici, le mode disjonctif est défini sur true pour 5 champs, et le dernier paramètre est un tri en fonction de la valeur du champ date_d_immatriculation.
it: Come spiega la relativa documentazione, i parametri obbligatori sono 2: il nome del contesto e l'ID del dataset. Nel nostro caso, abbiamo copiato un parametro aggiuntivo: ``mycontext-parameters`` ci consente infatti di definire singolarmente i filtri o le query per il contesto. Cinque campi sono impostati su "true" tramite la forma disgiuntiva, mentre l'ultimo parametro esegue l'ordinamento in base a "date_d_immatriculation".
nl: Zoals in de documentatie vermeld staat, zijn er 2 parameters verplicht: de naam van de context en het dataset-ID. In onze geval kan 1 extra parameter worden gekopieerd. ``mycontext-parameters`` wordt gebruikt om specifieke filters of zoekopdracht op de context te definiëren. Hier worden verschillende disjunctieve wijzen ingesteld als waar voor 5 velden en is de laatste parameter een sortering op date_d_immatriculation.

source: Disjunctive mode set to ``true`` on a facet field activate the multiple choise filter mode. It allows the user to apply a filter, and still be able to see and/or select other values
de: Ist der disjunkte Modus für ein Facet-Feld auf "TRUE" gesetzt, wird der Multiple-Choice-Filter-Modus aktiviert. Er bietet dem Nutzer die Möglichkeit, einen Filter anzuwenden und noch immer andere Werte sehen und/oder wählen zu können
es: El modo disyuntivo establecido como ``true`` en un campo de faceta activa el modo de filtro de opción múltiple. Permite al usuario aplicar un filtro, y aún así poder ver y/o seleccionar otros valores.
fr: Lorsque le mode disjonctif est défini sur ``true`` pour le champ d'une facette, cela active le mode de filtrage à choix multiples. L'utilisateur peut ainsi appliquer un filtre tout en pouvant voir et/ou sélectionner d'autres valeurs.
it: Quando impostiamo la forma disgiuntiva sul valore ``true`` per un campo facet, viene attivata la modalità di filtro a scelta multipla, lasciando all'utente la possibilità di visualizzare e/o selezionare altri valori anche dopo l'applicazione di un determinato filtro.
nl: Door het instellen van de disjunctieve wijze op "waar" voor een facetveld activeert de meervoudige keuzefiltermodus. Deze laat de gebruiker toe om een filter toe te passen en nog steeds andere waarden te kunnen zien en/of selecteren.

source: We will remove this optional attribute and observe changes.
de: Wir werden dieses optionale Attribut entfernen und die Änderungen beobachten.
es: Eliminaremos este atributo opcional y observaremos los cambios.
fr: Nous allons à présent supprimer cet attribut facultatif et voir ce que cela change.
it: Eliminiamo questo attributo facoltativo e osserviamo il risultato:
nl: We zullen dit optionele attribuut verwijderen en wijzigingen waarnemen.

source: First the context, if we display it, the json parameters block is now much smaller :
de: Zunächst den Kontext, wenn wir ihn anzeigen, sehen wir, dass der JSON-Parameterblock jetzt viel kleiner ist:
es: Primero el contexto; si lo visualizamos, el bloque de parámetros json ahora es mucho más pequeño:
fr: Tout d'abord, le contexte, si nous l'affichons, le bloc des paramètres JSON est désormais bien plus petit :
it: Visualizzando il contesto, notiamo che il blocco di parametri JSON è stato ridotto:
nl: Allereerst de context. Wanneer we deze weergeven, is het json-parameterblok nu veel kleiner:

source: In your code add :
de: Fügen Sie Ihrem Code Folgendes hinzu:
es: En el código, añada:
fr: Ajoutez ce qui suit dans votre code :
it: Aggiungi nel codice la seguente espressione:
nl: Voeg in uw code het volgende toe:

source: Save, refresh, and see :
de: Nachdem Sie gespeichert und aktualisiert haben, sehen Sie sich das Ganze an:
es: Guarde los cambios, actualice y observe:
fr: Enregistrez, actualisez la page et observez le résultat :
it: Salva e aggiorna:
nl: Sla op, hernieuw en zie:

source: We still have a sort parameter, even if we deleted it from the context creation widget (odsDatasetContext), it's due to the dataset sort setting in the table view.
de: Es gibt noch immer einen Sortierparameter, selbst wenn wir ihn aus dem Kontext-Erstellungs-Widget (odsDatasetContext) entfernt haben. Dies liegt an der Sortiereinstellung des Datensatzes in der Tabellenansicht.
es: Todavía tenemos un parámetro de ordenación, aunque lo hayamos suprimido del widget de creación de contexto (odsDatasetContext), debido a la configuración del orden del juego de datos en la vista de tabla.
fr: Nous avons toujours un paramètre de tri, même si nous l'avons effacé dans le widget de création de contexte (odsDatasetContext), en raison du paramètre de tri du jeu de données dans la vue tableau.
it: È ancora presente il parametro di ordinamento che avevamo eliminato dal widget di creazione del contesto (odsDatasetContext): la sua ricomparsa è dovuta alle impostazioni di ordinamento attive nella visualizzazione Tabella del dataset.
nl: We hebben nog steeds een sorteerparameter, zelfs wanneer we deze verwijderen uit de widget voor het aanmaken van context (odsDatasetContext). Dit is te danken aan het feit dat de datasetsortering wordt ingesteld in de tabelweergave.

source: Last test : apply a filter on any facet and observe how the ``context.parameters`` object is updated.
de: Letzter Test: Wenden Sie einen Filter für jedes Facet an und beobachten Sie, wie das Objekt "context.parameters" aktualisiert wird.
es: Última prueba: aplique un filtro en cualquier faceta y observe cómo se actualiza el objeto ``context.parameters``.
fr: Dernier test : appliquez un filtre sur n'importe quelle facette et observez comment l'objet ``context.parameters`` est mis à jour.
it: Effettuiamo un ultimo test: applica un filtro a un facet qualsiasi e osserva come viene aggiornato l'oggetto ``context.parameters``.
nl: Laatste test: pas een filter toe op elke facet en neem waar hoe het ``context.parameters``-voorwerp up-to-date wordt gebracht.

source: Also observe the 'standard' behavior of facets : when a value is selected, all others are hidden.
de: Beobachten Sie außerdem das "Standardverhalten" der Facets: Wenn Sie einen Wert auswählen, werden alle anderen verborgen.
es: Observe también el comportamiento 'estándar' de las facetas: cuando se selecciona un valor, todos los demás se ocultan.
fr: Observez également le comportement 'normal' des facettes : lorsqu'une valeur est sélectionnée, toutes les autres sont masquées.
it: Nota anche il 'normale' comportamento dei facet: quando viene selezionato un valore, gli altri non sono più visibili.
nl: Neem ook het 'standaard' gedrag van facetten waar: wanneer een waarde wordt geselecteerd, worden alle andere verborgen.

source: Add a record counter and last processing date
de: Fügen Sie einen Eintragszähler und ein Datum der letzten Bearbeitung hinzu
es: Añadir un contador de registros y la última fecha de procesamiento
fr: Ajouter un compteur d'enregistrements et la date de dernier traitement
it: Aggiungi un contatore di record e la data dell'ultima elaborazione
nl: Voeg een recordteller en laatste verwerkingsdatum toe

source: It's time to get more interresting pieces of information from this context :
de: Es ist an der Zeit, weitere interessantere Informationen aus diesem Kontext zu erhalten:
es: Es el momento de obtener más datos interesantes de este contexto:
fr: Il est temps d'obtenir des informations plus intéressantes à partir de ce contexte :
it: È il momento di ottenere informazioni più interessanti da questo contesto:
nl: Het is nu tijd om meer interessante informatie-elementen uit deze context te halen:

source: the total amount of records
de: die Gesamtanzahl der Einträge
es: La cantidad total de registros
fr: le nombre total d'enregistrements
it: il numero totale dei record;
nl: het totale aantal records

source: the total number of hits matching the user query and/or filters
de: die Gesamtzahl der Treffer, die mit der Abfrage und/oder den Filtern übereinstimmen
es: El número total de coincidencias para la consulta del usuario y/o los filtros
fr: le nombre total d'enregistrements correspondant à la requête et/ou aux filtres de l'utilisateur
it: il numero totale di occorrenze corrispondenti alla query e/o ai filtri applicati dall'utente;
nl: het totale aantal hits dat overeenstemt met de zoekopdracht en/of filters van de gebruiker

source: the last processing date of the dataset
de: das Datum der letzten Bearbeitung des Datensatzes
es: La última fecha de procesamiento del juego de datos
fr: la date de dernier traitement du jeu de données
it: la data dell'ultima elaborazione del dataset.
nl: de laatste verwerkingsdatum van de dataset

source: Then :
de: Anschließend:
es: A continuación:
fr: Puis :
it: Tali informazioni saranno accessibili tramite le seguenti espressioni:
nl: Vervolgens:

source: the total amount of records will be accessible by : ``{{ entreprisesimmatriculeesen2016.dataset.metas.records_count }}``
de: die Gesamtanzahl der Einträge ist zugänglich über: ``{{ entreprisesimmatriculeesen2016.dataset.metas.records_count }}``
es: El acceso a la cantidad total de registros se realizará mediante: ``{{ entreprisesimmatriculeesen2016.dataset.metas.records_count }}``
fr: le nombre total d'enregistrements sera accessible à l'aide de l'expression : ``{{ entreprisesimmatriculeesen2016.dataset.metas.records_count }}``
it: numero totale dei record: ``{{ entreprisesimmatriculeesen2016.dataset.metas.records_count }}``;
nl: zal het totale aantal records geraadpleegd kunnen worden via: ``{{ entreprisesimmatriculeesen2016.dataset.metas.records_count }}``

source: the total number of hits : ``{{ entreprisesimmatriculeesen2016.nhits }}``
de: die Gesamtanzahl der Treffer: ``{{ entreprisesimmatriculeesen2016.nhits }}``
es: El número total de coincidencias: ``{{ entreprisesimmatriculeesen2016.nhits }}``
fr: le nombre total de correspondances : ``{{ entreprisesimmatriculeesen2016.nhits }}``
it: numero totale delle occorrenze: ``{{ entreprisesimmatriculeesen2016.nhits }}``;
nl: het totale aantal hits: ``{{ entreprisesimmatriculeesen2016.nhits }}``

source: the last processing date : ``{{ entreprisesimmatriculeesen2016.dataset.metas.data_processed }}``
de: das Datum der letzten Bearbeitung: ``{{ entreprisesimmatriculeesen2016.dataset.metas.data_processed }}``
es: La última fecha de procesamiento: ``{{ entreprisesimmatriculeesen2016.dataset.metas.data_processed }}``
fr: la date de dernier traitement : ``{{ entreprisesimmatriculeesen2016.dataset.metas.data_processed }}``
it: data dell'ultima elaborazione: ``{{ entreprisesimmatriculeesen2016.dataset.metas.data_processed }}``.
nl: de laatste verwerkingsdatum: ``{{ entreprisesimmatriculeesen2016.dataset.metas.data_processed }}``

source: To finish, we include these blocs into our HTML code, surrounded by HTML and CSS code to have a nice rendering.
de: Abschließend binden wir diese Blöcke in unseren HTML-Code ein, umgeben von HTML- und CSS-Code für ein schönes Rendering.
es: Para terminar incluimos estos bloques en el código HTML, delimitados por código HTML y CSS para una bonita presentación.
fr: Pour terminer, nous allons inclure les blocs suivants dans notre code HTML, entourés de code HTML et CSS permettant d'obtenir une mise en forme soignée.
it: Per concludere, inseriamo questi blocchi all'interno del nostro lavoro accompagnandoli con un codice HTML e CSS che dia loro un aspetto piacevole.
nl: Om te eindigen nemen we deze blokken op in onze HTML-code, omringd door HTML en CSS-code om een mooi resultaat te krijgen.

source: Records and nhits on the top of the navigation bar, processing date at the bottom :
de: Einträge und Treffer oben in der Navigationsleiste, das Verarbeitungsdatum unten:
es: Los registros y las coincidencias (nhits) figuran en la parte superior de la barra de navegación; y la fecha de procesamiento, en la parte inferior:
fr: Enregistrements et nhits en haut de la barre de navigation, date de traitement en bas :
it: I record e le occorrenze nella parte superiore del menu di navigazione e la data di elaborazione in quella inferiore:
nl: Records en aantal hits bovenaan de navigatiebalk, verwerkingsdatum onderaan:

source: It's nice but, the numerical and date format is a bit harsh. To fix that, we will introduce a pure **AngularJS** concept called **filters**. `Full documentation of AngularJS Filters here <https://docs.angularjs.org/api/ng/filter>`_
de: Das sieht gut aus, aber das Zahlen- und Datumsformat ist etwas zu grell. Um das zu beheben, setzen wir ein reines **AngularJS** Konzept mit der Bezeichnung **Filter** ein. `Eine vollständige Dokumentation der AngularJS Filter finden Sie hier <https://docs.angularjs.org/api/ng/filter>`_
es: Está bien, pero el formato numérico y de fecha es algo adusto. Para corregirlo, introduciremos un concepto **AngularJS** puro denominado **filtros**. `La documentación completa de los filtros AngularJS se encuentra aquí <https://docs.angularjs.org/api/ng/filter>`_.
fr: C'est bien, mais le format des chiffres et de la date est un peu indigeste. Pour améliorer cela, nous allons introduire un concept **AngularJS** pur, à savoir les **filtres**. `Cliquez ici pour consulter la documentation complète sur les filtres AngularJS <https://docs.angularjs.org/api/ng/filter>`_
it: Il risultato non è male, ma il formato dei numeri e della data non è ancora soddisfacente. Per migliorarlo, ricorreremo al concetto **AngularJS** di **filtro**. Clicca qui per consultare la `documentazione completa sui filtri AngularJS <https://docs.angularjs.org/api/ng/filter>`_.
nl: Het is mooi, maar het numerieke en datumformaat is een beetje hard. Om dat op te lossen zullen we een zuiver **AngularJS** concept introduceren met de naam **filters**. `Volledige documentatie over AngularJS Filters hier <https://docs.angularjs.org/api/ng/filter>`_

source: A filter is a function or operation that can be applied on a variable or value in an AngularJS expression.
de: Bei einem Filter handelt es sich um eine Funktion oder einen Vorgang, der für eine Variable oder einen Wert in einem AngularJS-Ausdruck angewendet werden kann.
es: Un filtro es una función u operación que se puede aplicar a una variable o valor de una expresión AngularJS.
fr: Un filtre est une fonction ou une opération pouvant être appliquée sur une variable ou sur une valeur dans une expression AngularJS.
it: Un filtro è una funzione o un'operazione che può essere applicata a una variabile o un valore in un'espressione AngularJS.
nl: Een filter is een functie of operatie die toegepast kan worden op een variabele of waarde in een AngularJS-uitdrukking.

source: In our case, we will use the ``number`` filter to pretty print numerical values (add a space or a comma every 3 digits depending on the country), and a ``date`` to transform the ISO technical format into an human readable format.
de: In unserem Fall verwenden wir den Filter "Nummer", um für eine schönere Darstellung numerischer Werte zu sorgen (je nach Land wird alle 3 Ziffern ein Leerzeichen oder ein Komma hinzugefügt) und den Filter "Datum", um das technische ISO-Format in ein lesbares Format zu verwandeln.
es: En este caso, utilizaremos el filtro ``number`` para imprimir en un formato bonito los valores numéricos (cada 3 dígitos añada un espacio o una coma, según el país) y el filtro ``date`` para transformar el formato técnico ISO en un formato natural.
fr: Dans notre cas, nous allons utiliser le filtre ``number`` pour obtenir une impression élégante des valeurs numériques (ajouter une espace ou une virgule tous les 3 chiffres en fonction du pays), et le filtre ``date`` pour transformer le format technique ISO en un format lisible facilement.
it: Nel nostro caso, utilizzeremo il filtro ``number`` per effettuare un pretty print dei valori numerici (a seconda del paese, aggiungi uno spazio o una virgola ogni tre caratteri) e un filtro ``date`` per rendere comprensibile il formato tecnico ISO.
nl: In ons geval gebruiken we de filter ``aantal`` om numerieke waarde te pretty printen (een spatie of komma toevoegen om de 3 karakters afhankelijk van het land), en een ``datum`` om het technische ISO-formaat om te zetten in een formaat dat door mensen kan worden gelezen.

source: To "call" a filter, use pipe '|' at the end of the expression. Some filters accept specific parameters, date filter accept a date format or pattern. Example: ``expr. | date : 'M/d/yy'`` ``expr. | date : 'medium'``
de: Um einen Filter "abzurufen", nutzen Sie den senkrechten Strich '|' am Ende des Ausdrucks. Einige Filter akzeptieren spezielle Parameter, Datumsfilter akzeptieren Datumsformate oder -muster. Beispiel: "expr. | date : 'M/d/yy'" "expr. | date : 'medium'"
es: Para "invocar" un filtro, escriba la barra vertical '|' al final de la expresión. Algunos filtros aceptan parámetros específicos; el filtro de fecha admite un patrón o formato de fecha. Ejemplo: ``expr. | date : 'M/d/yy'`` ``expr. | date : 'medium'``.
fr: Pour "appeler" un filtre, utilisez une barre verticale '|' à la fin de l'expression. Certains filtres acceptent des paramètres spécifiques, le filtre de date accepte un format ou un modèle de date. Exemple : ``expr. | date : 'M/d/yy'`` ``expr. | date : 'medium'``
nl: Om een filter te "callen", gebruik '|' op het einde van de uitdrukking. Sommige filters aanvaarden specifieke parameters. Een datumfilter aanvaardt een datumformaat of -patroon. Voorbeeld: ``expr. | date : 'M/d/yy'`` ``expr. | date : 'medium'``

source: Save, refresh, see :
de: Nachdem Sie gespeichert und aktualisiert haben, sehen Sie sich das Ganze an:
es: Guarde los cambios, actualice y observe:
fr: Enregistrez, actualisez la page et observez le résultat :
it: Salva e aggiorna:
nl: Sla op, hernieuw, zie:

source: Add a download link
de: Einen Download-Link hinzufügen
es: Añadir un vínculo de descarga
fr: Ajouter un lien de téléchargement
it: Aggiungi un link di download
nl: Voeg een downloadkoppeling toe

source: As the export tab of each datasets in OpenDataSoft platform, we can export only filtered records, it's interresting to have a link or button to do the same (for offline use of the data for exemple).
de: Da über den Export-Tab jedes Datensatzes auf der OpenDataSoft-Plattform nur gefilterte Einträge heruntergeladen werden können, ist die Bereitstellung eines entsprechenden Links oder einer Schaltfläche sinnvoll (beispielsweise um die Daten offline zu nutzen).
es: En la ficha de exportación de cada uno de los juegos de datos de la plataforma OpenDataSoft podemos exportar únicamente los registros filtrados, y es interesante tener un vínculo o botón para hacer lo mismo (por ejemplo, para usar los datos sin conexión en línea).
fr: Depuis l'onglet export de tout jeu de données de la plateforme OpenDataSoft, il est possible d'exporter uniquement des enregistrements sur lesquels des filtres ont été appliqués. Il serait intéressant de disposer d'un bouton ou d'un lien permettant d'obtenir le même résultat (afin d'utiliser les données hors connexion par exemple).
it: Nella scheda Esporta di ogni dataset della piattaforma OpenDataSoft è possibile esportare solo i record filtrati. Sarebbe utile disporre qui della stessa funzionalità tramite un link o un pulsante, ad esempio per poter utilizzare i dati offline.
nl: Als exporttablad van elke dataset in het OpenDataSoft-platform, kunnen we enkel gefilterde records exporteren. Het is interessant om een koppeling of knop te hebben die hetzelfde doet (voor offline gebruik van de data bijvoorbeeld).
