Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/dashboard/dashboard.po
Languages: de, es, fr, it, nl

source: Building a dynamic dashboard - step by step !
de: Aufbau eines dynamischen Dashboards - Schritt für Schritt!
es: Crear un panel dinámico paso a paso
fr: Créer un tableau de bord dynamique - pas à pas !
it: Creazione di un dashboard dinamico... passo dopo passo!
nl: Een dynamisch dashboard maken - stap voor stap!

source: The aim of this tutorial is to create very easily a dashboard by using widgets, AngularJS and CSS tools provided by OpenDataSoft platform.
de: Das Ziel dieses Tutorials ist es, mithilfe von Widgets, AngularJS und den CSS-Tools der OpenDataSoft-Plattform problemlos ein Dashboard zu erstellen.
es: Este tutorial tiene como finalidad crear un panel muy fácilmente utilizando widgets, herramientas CSS y AngularJS facilitadas por la plataforma OpenDataSoft.
fr: L'objectif de ce tutoriel est de créer très facilement un tableau de bord en utilisant les outils CSS, AngularJS et les widgets fournis par la plateforme OpenDataSoft.
it: Durante questo tutorial creeremo in modo molto semplice un dashboard utilizzando gli strumenti forniti dalla piattaforma OpenDataSoft, come i widget, AngularJS e i CSS.
nl: Het doel van deze handleiding is om op zeer eenvoudige manier een dashboard te maken met behulp van widgets, AngularJS en CSS-tools die voorzien worden door het OpenDataSoft-platform.

source: Basics
de: Grundlagen
es: Conceptos básicos
fr: Concepts de base
it: Concetti di base
nl: Basiselementen

source: pick up a dataset
de: einen Datensatz erfassen
es: Seleccionar un juego de datos
fr: choisir un jeu de données
it: Scegli un dataset
nl: pik een dataset op

source: Create a page
de: Eine Seite erstellen
es: Crear una página
fr: créer une page
it: Crea una pagina
nl: Maak een pagina aan

source: add a map view
de: eine Kartenansicht hinzufügen
es: Añadir una vista de mapa
fr: ajouter une vue carte
it: Aggiungi una visualizzazione su mappa
nl: voeg een kaartweergave toe

source: add a table view
de: eine Tabellenansicht hinzufügen
es: Añadir una vista de tabla
fr: ajouter une vue tableau
it: Aggiungi una visualizzazione su tabella
nl: voeg een tabelweergave toe

source: add a chart
de: ein Diagramm hinzufügen
es: Añadir un gráfico
fr: ajouter un graphe
it: Aggiungi un grafico
nl: voeg een grafiek toe

source: link them all together !
de: alle miteinander verknüpfen!
es: Vincularlo todo
fr: lier tous ces éléments ensemble !
it: Collegali tra loro!
nl: koppel alles aan elkaar!

source: add a text search form
de: eine Textsuche hinzufügen
es: Añadir un formulario de búsqueda de texto
fr: ajouter un formulaire de recherche textuelle
it: Aggiungi un modulo di ricerca testuale
nl: voeg een tekstzoekformulier toe

source: add some filters
de: einige Filter hinzufügen
es: Añadir filtros
fr: ajouter des filtres
it: Aggiungi alcuni filtri
nl: voeg enkele filters toe

source: discover CSS classes for easy responsive development
de: CSS-Klassen kennenlernen - für einfaches responsives Entwickeln
es: Descubrir las clases CSS para desarrollar fácilmente un diseño con capacidad de respuesta
fr: découvrir les classes CSS pour un développement responsive en toute facilité
it: Scopri le classi CSS per uno sviluppo semplice e responsivo
nl: ontdek CSS-klassen voor eenvoudige responsieve ontwikkeling

source: have a deeper look to the "context"
de: ein tieferer Einblick in den "Kontext"
es: Examinar con más detalle el "contexto"
fr: étudier le "contexte" plus en profondeur
it: Approfondisci il concetto di "contesto"
nl: neem een diepere kijk in de "context"

source: add a record counter
de: einen Eintragszähler hinzufügen
es: Añadir un contador de registros
fr: ajouter un compteur d'enregistrements
it: Aggiungi un contatore di record
nl: voeg een recordteller toe

source: add a download link
de: einen Download-Link hinzufügen
es: Añadir un vínculo de descarga
fr: ajouter un lien de téléchargement
it: Aggiungi un link per il download
nl: voeg een downloadkoppeling toe

source: create some KPIs
de: einige KPIs erstellen
es: Crear indicadores KPI
fr: créer des KPI
it: Crea alcuni KPI
nl: maak enkele KPI's aan

source: Going further
de: Gehen Sie einen Schritt weiter
es: Ir más lejos
fr: Aller plus loin
it: Un approccio più avanzato
nl: Verder gaan

source: AngularJS and advanced used of Widgets
de: AngularJS und die erweiterte Nutzung von Widgets
es: AngularJS y uso avanzado de los widgets
fr: AngularJS et utilisation avancée des widgets
it: AngularJS e l'utilizzo avanzato dei widget
nl: AngularJS en geavanceerd gebruik van Widgets

source: discover angular JS directives
de: die Richtlinien von AngularJS kennenlernen
es: Descubrir las directivas AngularJS
fr: découvrir les directives AngularJS
it: Scopri le direttive AngularJS
nl: ontdek AngularJS-richtlijnen

source: Play with them by creating dynamic view - ng-if
de: Probieren Sie sie aus und erzeugen Sie eine dynamische Ansicht - ng-if
es: Jugar con ellos creando una vista dinámica - ng-if
fr: jouer avec en créant une vue dynamique - ng-if
it: Prova a utilizzarle creando visualizzazioni dinamiche - ng-if
nl: Speel ermee door dynamische weergave aan te maken - ng-if

source: Colorize your KPI - ng-class
de: Verleihen Sie Ihren KPI Farbe - ng-class
es: Colorear el KPI - ng-class
fr: intégrer un code couleur à la directive ng-class de vos KPI
it: Come colorare i KPI con la direttiva ng-class
nl: Geef uw KPI - ng-klasse kleur

source: Refine-on-click widgets
de: Verfeinern-per-Klick-Widgets
es: Refinar los widgets al hacer clic
fr: widgets d'affinage par clic
it: Utilizza i widget per affinare con un clic

source: Pick up a datasets
de: Datensätze erfassen
es: Seleccionar un juego de datos
fr: Choisir un jeu de données
it: Scegli un dataset
nl: Pik een dataset op

source: This tutorial is based on the company registrations dataset in France (year 2016).
de: Dieses Tutorial basiert auf dem Firmenregistrierungsdatensatz in Frankreich (Jahr 2016).
es: Este tutorial se basa en el juego de datos de registros de compañías de Francia (año 2016).
fr: Ce tutoriel se base sur le jeu de données contenant les entreprises immatriculées en France (au cours de l'année 2016).
it: Questo tutorial è incentrato sul dataset contenente le iscrizioni al registro francese delle imprese nell'anno 2016.
nl: Deze handleiding is gebaseerd op de dataset bedrijfsregistraties in Frankrijk (jaar 2016).

source: First you need to add this dataset on your domain:
de: Zunächst müssen Sie Ihrer Domain diesen Datensatz hinzufügen:
es: Primero tiene que añadir este juego de datos en el dominio:
fr: Vous devez tout d'abord ajouter le jeu de données suivant sur votre domaine :
it: Per prima cosa devi aggiungere il dataset al tuo dominio:
nl: Eerst moet u deze dataset toevoegen aan uw domein:

source: You can simply use the `Add a dataset from the OpenDataSoft network` button when you add a new source of data in your dataset.
de: Dafür können Sie die Schaltfläche "Datensatz aus dem OpenDataSoft-Netzwerk hinzufügen" nutzen, wenn Sie eine neue Datenquelle zu Ihrem Datensatz hinzufügen.
es: Puede usar simplemente el botón `Añadir un juego de datos de la red OpenDataSoft` cuando añada un juego de datos nuevo en el juego de datos.
fr: Vous pouvez simplement utiliser le bouton `Ajouter un jeu de données depuis le réseau OpenDataSoft` lorsque vous ajoutez une nouvelle source de données dans votre jeu de données.
it: Per fare ciò, clicca semplicemente sul pulsante `Aggiungi un dataset dalla rete OpenDataSoft`.
nl: U kan gewoon de knop `Voeg een dataset uit het OpenDataSet-netwerk toe` gebruiken wanneer u een nieuwe databron in uw dataset wil toevoegen.

source: Go to **Backoffice -> Pages -> New page**
de: Öffnen Sie **Back-Office -> Seiten -> Neue Seite**
es: Vaya a **Back office -> Páginas -> Página nueva**.
fr: Accédez à **Back office -> Pages -> Nouvelle page**
it: Accedi alla sezione **Back-office -> Pagine -> Nuova pagina**.
nl: Ga naar **Back-office > Pagina's > Nieuwe pagina**

source: Enter a **page url** suffix, optionnaly a **Title** and **description**, then **Save**
de: Geben Sie ein Suffix der **Seiten-URL**, gegebenenfalls einen **Titel** und eine **Beschreibung** ein und wählen Sie **Speichern**
es: Especifique un sufijo de **dirección URL de la página** (y, de forma opcional, un valor de **Título** y **Descripción**) y haga clic en **Guardar**.
fr: Saisissez un suffixe d'**URL de page**, et si vous le souhaitez un **titre** et une **description**, puis cliquez sur **Enregistrer**.
it: Inserisci il suffisso che dovrà apparire nell'**URL della pagina**, aggiungi se vuoi un **titolo** e una **descrizione** e poi **Salva**.
nl: Voer een suffix **pagina URL** en optioneel een **Titel** en **Omschrijving** in. Sla vervolgens op

source: Click on ``Edit in expert mode`` to directly have access to CSS/HTML code of the page.
de: Klicken Sie auf "Im Expertenmodus bearbeiten", um direkt auf den CSS/HTML-Code der Seite zuzugreifen.
es: Haga clic en ``Editar en modo experto`` para acceder directamente al código CSS/HTML de la página.
fr: Cliquez sur ``Éditer en mode expert`` pour accéder directement au code CSS/HTML de la page.
it: Clicca su ``Modifica in modalità Esperto`` per avere accesso diretto al codice CSS/HTML della pagina.
nl: Klik op ``Bewerk in expert modus`` om rechtstreeks toegang te hebben tot CSS/HTML-code van de pagina.

source: You should now view this HTML code in your page :
de: Jetzt sollten Sie diesen HTML-Code auf Ihrer Seite sehen:
es: Ahora debería ver este código HTML en la página:
fr: Le code HTML suivant doit désormais s'afficher sur votre page :
it: Verrà visualizzato il seguente codice HTML:
nl: U zou deze HTML-code nu in uw pagina moeten kunnen zien:

source: From now, all the code will be added in the ``ods-box div``, like this :
de: Von nun an wird jeglicher Code in "ods-box div" auf diese Weise hinzugefügt:
es: A partir de ahora, todo el código se añadirá en ``ods-box div``, de este modo:
fr: Désormais, tout le code sera ajouté entre des tags ``div`` avec la classe ``ods-box``, comme illustré dans l'exemple ci-dessous :
it: Da questo punto in poi, il codice verrà aggiunto in ``ods-box div``, come segue:
nl: Vanaf nu zal alle code toegevoegd worden in het ``ods-box div``, zoals dit:

source: Save and open your page.
de: Speichern und öffnen Sie Ihre Seite.
es: Guarde los cambios y abra la página.
fr: Enregistrez et ouvrez votre page.
it: Salva e apri la pagina.
nl: Sla uw pagina op en open ze.

source: If you don't see the **Open page** button in the top right part of the screen, refresh your page.
de: Aktualisieren Sie Ihre Seite, wenn Sie die Schaltfläche **Seite öffnen** oben rechts nicht sehen können
es: Si no ve el botón **Abrir página** en la parte superior derecha de la pantalla, actualice la página.
fr: Si vous ne voyez pas le bouton **Ouvrir la page** dans le coin supérieur droit de l'écran, actualisez la page.
it: Se non riesci a vedere il pulsante **Apri pagina** in alto a destra sullo schermo, aggiorna la pagina.
nl: Hernieuw uw pagina wanneer u de knop **Open pagina** bovenaan rechts het scherm niet ziet.

source: You can also go back to the **Pages** menu in the navigation bar, to see the list of pages and click on the eye to go directly to it.
de: Sie können auch über die Navigationsleiste zum Menü **Seiten** zurückkehren, um die Liste der Seiten zu sehen und auf das Auge zu klicken, um direkt dorthin zu gelangen.
es: También puede volver al menú **Páginas** de la barra de navegación para ver la lista de páginas y hacer clic en el ojo para acceder a ella directamente.
fr: Vous pouvez également revenir au menu **Pages** depuis la barre de navigation, afin d'afficher la liste des pages. Cliquez ensuite sur l'icône en forme d'œil pour accéder directement à cette liste.
it: In alternativa, puoi tornare alla sezione **Pagine** del menu di navigazione, consultare l'elenco delle pagine create e cliccare sull'icona dell'occhio corrispondente per accedervi.
nl: U kan ook terugkeren naar het menu **Pagina's** in de navigatiebalk om de lijst met pagina's te zien en op het oog te klikken om er rechtstreeks naar toe te gaan.

source: Add a map view
de: Eine Kartenansicht hinzufügen
es: Añadir una vista de mapa
fr: Ajouter une vue carte
it: Aggiungi una visualizzazione su mappa
nl: Voeg een kaartweergave toe

source: The simplest way to begin is to use share links and code bellow each data visualisation.
de: Am einfachsten beginnen Sie damit, Teilen-Links und Code unter jede Datenvisualisierung zu setzen.
es: La manera más fácil de empezar es utilizar vínculos de compartir y el código bajo cada una de las visualizaciones de datos.
fr: Pour commencer, la méthode la plus simple consiste à utiliser les liens de partage et le code affichés sous chaque visualisation de données.
it: Il modo più semplice per iniziare è utilizzare i link di condivisione e il codice messi a disposizione sotto ogni visualizzazione di dati.
nl: De eenvoudigste manier om te starten is door deel-koppelingen code onder elke dataweergave te gebruiken.

source: Go to your dataset, go to the map tab, then, below your map, click on ``widget`` and simply copy and paste the code in the custom page.
de: Wechseln Sie zu Ihrem Datensatz, öffnen Sie den Karten-Tab und klicken Sie unter Ihrer Karte auf "Widget". Jetzt können Sie den Code einfach kopieren und in die benutzerdefinierte Seite einfügen.
es: Vaya al juego de datos, acceda a la ficha de mapa y, a continuación, bajo el mapa, haga clic en ``widget`` y simplemente copie y pegue el código en la página personalizada.
fr: Accédez à votre jeu de données, cliquez sur l'onglet carte, puis, sous la carte, cliquez sur ``widget`` et copiez/collez simplement le code dans la page personnalisée.
it: Entra nel dataset, accedi alla scheda Mappa e clicca sul pannello ``widget`` presente sotto la mappa. Copia il codice e incollalo nella pagina personalizzata.
nl: Ga naar uw dataset, ga naar het tabblad kaart. Klik vervolgens onder uw kaart op ``widget`` en kopieer en plak de code in de aanpasbare pagina.

source: Each block will be explained later, for the moment, just preview your page by clicking on the **Preview** button on the center right part of your browser.
de: Jeder Block wird später erklärt, sehen Sie sich an dieser Stelle zunächst einmal die Vorschau Ihrer Seite an, indem Sie auf die Schaltfläche **Vorschau** klicken (rechts in der Mitte in Ihrem Browser).
es: Cada uno de los bloques se describe más adelante; por ahora, simplemente obtenga una vista previa de la página haciendo clic en el botón **Vista previa** de la parte central derecha del explorador.
fr: Chaque bloc sera expliqué plus tard. Pour l'instant, contentez-vous de prévisualiser votre page en cliquant sur le bouton **Aperçu** situé au centre de votre navigateur.
it: I singoli blocchi verranno illustrati più avanti. Per il momento, apri l'anteprima della pagina cliccando sul pulsante **Anteprima**, situato al centro del browser, sulla destra.
nl: Elk blok wordt later uitgelegd. Bekijk voorlopig enkel de voorbeeldweergave van uw pagina door op de knop **Voorbeeldweergave** rechts in het midden van uw browser te klikken.

source: We advise you to open your page in a new tab of your browser for a faster loading (and refresh this tab any time you want to check see your new version).
de: Damit sie schneller geladen wird, empfehlen wir Ihnen, Ihre Seite in einem neuen Tab Ihres Browsers zu öffnen (und diesen Tab jedes Mal zu aktualisieren, wenn Sie Ihre neueste Version sehen möchten).
es: Le recomendamos que abra la página en una ficha nueva del explorador para que la carga sea más rápida (actualice esta ficha siempre que desee observar la versión nueva).
fr: Nous vous conseillons d'ouvrir votre page dans un nouvel onglet du navigateur pour accélérer son chargement (actualisez cet onglet à chaque fois que vous souhaitez voir les modifications apportées à la page).
it: Per accelerare i tempi, è meglio aprire la pagina in una nuova scheda del browser e, di volta in volta, aggiornare la scheda per visualizzare le nuove modifiche apportate.
nl: We raden u aan om uw pagina in een nieuw tabblad van uw browser te openen zodat u sneller kan laden (en hernieuw dit tabblad wanneer u maar wil om uw nieuwe versie te controleren).

source: It should looks like this (the map basemap should be different depending on your domain settings) :
de: Sie sollte so aussehen (die Grundkarte sollte je nach Domain-Einstellungen unterschiedlich sein):
es: Debería tener este aspecto (el mapa de base del mapa variará según la configuración del dominio):
fr: Votre carte devrait ressembler à ceci (le fond de carte peut varier en fonction des paramètres de votre domaine) :
it: Comparirà la seguente mappa (la mappa di base potrebbe essere diversa a seconda delle impostazioni attivate nel tuo dominio):
nl: Deze zou er zo moeten uitzien (de basiskaart zou verschillend moeten zijn afhankelijk van uw domeininstellingen):

source: Add a table view
de: Eine Tabellenansicht hinzufügen
es: Añadir una vista de tabla
fr: Ajouter une vue tableau
it: Aggiungi una visualizzazione su tabella
nl: Voeg een tabelweergave toe

source: Now, still on the dataset explore screen, go to the table view (**Table** tab), ``widget`` share link, and simply copy and paste the code below the map.
de: Noch immer im Datensatz-Bildschirm wechseln Sie in der Tabellenansicht (Tab **Tabelle**) zum "Widget"-Teilen-Link, kopieren Sie den Code und fügen Sie ihn unter der Karte ein.
es: Ahora, siguiendo en la pantalla de exploración del juego de datos, vaya a la vista de tabla (ficha **Tabla**) y, en el vínculo de compartir de ``widget``, simplemente copie y pegue el código bajo el mapa.
fr: À présent, toujours sur l'écran d'exploration du jeu de données, accédez à la vue tableau (onglet **Tableau**), cliquez sur le lien de partage ``widget`` et copiez/collez simplement le code sous la carte.
it: Sempre dalla schermata di esplorazione del dataset, accedi alla visualizzazione su tabella (nella scheda **Tabella**) e clicca sul link di condivisione``widget``. Copia il codice e incollalo sotto quello della mappa.
nl: Ga, nog steeds in het datasetexplorescherm, naar de tabelweergave (tabblad **Tabel**), ``widget`` deel-koppeling en kopieer en plak de code onder de kaart.

source: Save, refresh, and see that the dashboard now have two data-vizualisation :
de: Nachdem Sie gespeichert und aktualisiert haben, werden Sie sehen, dass das Dashboard jetzt über zwei Datenvisualisierungen verfügt:
es: Guarde los cambios, actualice y observe que el panel ahora tiene 2 data-vizualisation:
fr: Enregistrez, actualisez la page et découvrez que le tableau de bord comporte désormais deux visualisations de données :
it: Salva, aggiorna e vedrai comparire nel dashboard due tipi di visualizzazione dei dati:
nl: Sla op, hernieuw en u zal zien dat het dashboard nu twee dataweergaves heeft:

source: Add a chart
de: Ein Diagramm hinzufügen
es: Añadir un gráfico
fr: Ajouter un graphe
it: Aggiungi un grafico
nl: Voeg een grafiek toe

source: In the dataset again, go to the chart view, select an X axis and Y axis, get the widget code, copy and paste.
de: Erneut im Datensatz öffnen Sie die Diagramm-Ansicht, wählen Sie eine X- und Y-Achse, kopieren Sie den Widget-Code und fügen Sie ihn ein.
es: Nuevamente en el juego de datos, vaya a la vista de gráfico, seleccione un eje X y un eje Y, obtenga el código del widget, y realice una tarea de copiar y pegar.
fr: De retour dans le jeu de données, accédez à la vue graphe, sélectionnez un axe X et un axe Y, obtenez le code du widget et copiez/collez-le.
it: Sempre nel dataset, accedi alla visualizzazione su grafico, seleziona l'asse delle X e l'asse delle Y, copia il codice del widget risultante e incollalo.
nl: Ga nog steeds in de dataset naar de grafiekweergave, selecteer een X- en een Y-as, neem de widget-code, kopieer en plak.

source: An exemple of interesting chart for this documentation is to display the number of company by region.
de: Ein Beispiel für ein interessantes Diagramm in dieser Dokumentation ist die Anzeige der Anzahl der Unternehmen nach Region.
es: Un ejemplo de gráfico interesante para esta documentación consiste en visualizar el número de empresas por región.
fr: Afin d'illustrer cette documentation avec un graphe intéressant, nous allons afficher le nombre d'entreprises par région.
it: Un esempio interessante potrebbe essere il grafico del numero di aziende suddivise per regione.
nl: Een voorbeeld van een interessante grafiek voor deze documentatie is om het aantal ondernemingen per regio weer te geven.

source: X axis : ``Région`` (administrative area) Y axis : ``count``
de: X-Achse: "Region" (Verwaltungsgebiet) Y-Achse: "Zähler"
es: Eje X: ``Région`` (área administrativa) Eje Y: ``count`` (recuento)
fr: Axe X : ``Région`` Axe Y : ``Compte``
it: Asse X: ``Région`` (area amministrativa), asse Y: ``Count``.
nl: X-as: ``Région`` (administratief gebied) Y-as: ``count``

source: Save, refresh, it should looks like this :
de: Nachdem Sie gespeichert und aktualisiert haben, sollte das Ganze so aussehen:
es: Guarde los cambios, actualice y observe cómo debería tener este aspecto:
fr: Enregistrez, actualisez la page, le code devrait ressembler à ceci :
it: Salva, aggiorna e dovresti avere la seguente pagina:
nl: Sla op, hernieuw en het zou er zo moeten uitzien:

source: Link them all together !
de: Verbinden Sie alle miteinander!
es: Vincularlo todo
fr: Lier tous ces éléments ensemble !
it: Collegali tra loro
nl: Koppel alles aan elkaar!

source: If we draw a circle, or polygon on the map, we can filter the list of displayed items, we unfortunatly see that only the map reacts and the table or chart just **ignores** our filter !
de: Wenn wir einen Kreis oder ein Polygon auf der Karte zeichnen, können wir die Liste der angezeigten Elemente filtern. Wir müssen leider feststellen, dass nur die Karte reagiert und die Tabelle oder das Diagramm unseren Filter einfach **ignoriert**!
es: Si dibujamos un círculo o polígono en el mapa, podemos filtrar la lista de elementos visualizados; no obstante, vemos que solo reacciona el mapa, ¡y tanto la tabla como el gráfico se limitan a **omitir** el filtro!
fr: Si nous dessinons un cercle ou un polygone sur la carte, nous pouvons filtrer la liste des éléments affichés. Nous voyons malheureusement que seule la carte est dynamique, le tableau ou le graphique **ignore** tout simplement notre filtre !
it: Se disegniamo un cerchio o un poligono sulla mappa, possiamo filtrare l'elenco degli elementi visualizzati, ma sfortunatamente questa azione avrà effetto solo sulla mappa, mentre la tabella e il grafico la **ignoreranno**!
nl: Wanneer we een cirkel of een veelhoek op de kaart tekenen, kunnen we de lijst met weergegeven items filteren. Jammer genoeg zien we dat alleen de kaart reageert en dat de tabel of de grafiek onze filter gewoon **negeert**!
