Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/dashboard/dashboard.po
Languages: de, es, fr, it, nl

source: The `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ documentation describes some function that can be directly called on the context. ``getdownloadURL`` accepts 2 parameters, the first one is the format extension, the second one the list of specific fields. In our case, we will add a button (a link with a CSS class that gives any element a nice button style) to export records in CSV format.
de: Die Dokumentation `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ beschreibt eine Funktion, die unmittelbar im Kontext aufgerufen werden kann. "getdownloadURL" akzeptiert 2 Parameter, bei dem ersten handelt es sich um die Format-Erweiterung, beim zweiten um die Liste der spezifischen Felder. In unserem Fall werden wir eine Schaltfläche hinzufügen (eine Verknüpfung mit einer CSS-Klasse, die jedem Element einen schönen Button-Stil verleiht), um Datensätze im CSV-Format zu exportieren.
es: En la documentación de `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ se describen algunas funciones que se pueden invocar directamente en el contexto. ``getdownloadURL`` admite 2 parámetros: el primero es la extensión de formato y el segundo es la lista de campos específicos. En este caso, añadiremos un botón (un vínculo con una clase CSS que da a cualquier elemento un bonito estilo de botón) para exportar los registros en formato CSV.
fr: La documentation du widget `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ décrit certaines fonctions pouvant être directement appelées sur le contexte. ``getdownloadURL`` accepte 2 paramètres, le premier correspond à l'extension de format et le second à la liste des champs spécifiques. Dans notre cas, nous allons ajouter un bouton (un lien avec une classe CSS permettant de transformer n'importe quel élément en un joli bouton) pour exporter les enregistrements au format CSV.
it: La documentazione sul widget `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ illustra alcune funzioni che possono essere chiamate direttamente nel contesto. ``getdownloadURL`` accetta 2 parametri: il primo è l'estensione del formato, il secondo l'elenco di campi specifici. Nel nostro caso, aggiungeremo un pulsante per esportare i record in formato CSV (un link con una classe CSS, che consente sempre ottimi risultati in termini di stile).
nl: In de documentatie `odsDatasetContext <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`_ staat een functie beschreven die rechtstreeks gecalled kan worden op de context. ``getdownloadURL`` aanvaardt 2 parameters. De eerste is de formaatextensie, de tweede is de lijst met specifieke velden. In ons geval zullen we een knop toevoegen (een koppeling naar een CSS-klasse die elk elementen een mooie knopstijl geeft) om records in CSV-formaat te exporteren.

source: Save, refresh, test to apply some filters, then download the CSV export :
de: Speichern und aktualisieren Sie, führen Sie Tests durch, um einige Filter anzuwenden und laden Sie anschließend den CSV-Export herunter:
es: Guarde los cambios, actualice y pruebe para aplicar algunos filtros, y después descargue la exportación CSV:
fr: Enregistrez, actualisez la page et faites un test en appliquant des filtres, puis téléchargez l'export au format CSV :
it: Salva, aggiorna ed effettua un test applicando alcuni filtri. In seguito, scarica i dati in formato CSV:
nl: Sla op, hernieuw, test om sommige filters toe te passen, download vervolgens de CSV-export:

source: Going further - AngularJS
de: Gehen Sie einen Schritt weiter - AngularJS
es: Conceptos avanzados: AngularJS
fr: Aller plus loin : AngularJS
it: Un approccio più avanzato - AngularJS
nl: Verder gaan - AngularJS

source: Discover angular JS directives
de: Die Richtlinien von AngularJS kennenlernen
es: Descubrir las directivas AngularJS
fr: Découvrir les directives AngularJS
it: Scoprire le direttive AngularJS
nl: Ontdek AngularJS-richtlijnen

source: And `AngularJS directive <https://docs.angularjs.org/guide/directive>`_ can be seen as an HTML attribute that can be added to any HTML elements. Lot's of them are available in the platform and can be used to add dynamic behavior to dashboards.
de: Eine `AngularJS-Richtlinie <https://docs.angularjs.org/guide/directive>`_ kann als HTML-Attribut verstanden werden, das allen HTML-Elementen hinzugefügt werden kann. Viele Richtlinien sind auf der Plattform verfügbar und können verwendet werden, um Dashboards ein dynamisches Verhalten zu verleihen.
es: Una `directiva AngularJS <https://docs.angularjs.org/guide/directive>`_ puede entenderse como un atributo HTML que se puede añadir a cualquier elemento HTML. Muchas están disponibles en la plataforma y se pueden emplear para añadir un comportamiento dinámico a los paneles.
fr: Une `directive AngularJS <https://docs.angularjs.org/guide/directive>`_ peut être considérée comme un attribut HTML pouvant être ajouté à n'importe quel élément HTML. De nombreuses directives sont disponibles sur la plateforme et peuvent être utilisées pour rendre les tableaux de bord dynamiques.
it: Le `direttive AngularJS <https://docs.angularjs.org/guide/directive>`_ possono essere considerate come attributi HTML da aggiungere agli elementi HTML. Molte di esse sono disponibili sulla piattaforma e possono essere impiegate per inserire comportamenti dinamici nei dashboard.
nl: En `AngularJS-richtlijn <https://docs.angularjs.org/guide/directive>`_ kan beschouwd worden als elk HTML-element. Vele ervan zijn beschikbaar in het platform en kunnen gebruikt worden om dynamisch gedrag aan dashboards toe te voegen.

source: Here is a subset of most used directives :
de: Eine Zusammenfassung der am meisten verwendeten Richtlinien:
es: A continuación se muestra un subconjunto de las directivas más utilizadas:
fr: Voici une liste comprenant quelques-unes des directives les plus couramment utilisées :
it: Ecco una selezione delle direttive più utilizzate:
nl: Hier volgt een subreeks van de meest gebruikte richtlijnen:

source: ``ng-init`` : initialise a variable
de: "ng-init": initialisiert eine Variable
es: ``ng-init``: inicializar una variable
fr: ``ng-init`` : initialiser une variable
it: ``ng-init``: inizializza una variabile;
nl: ``ng-init``: initialiseert een variabele

source: ``ng-click`` : evalute an expression when the user click on the element
de: "ng-click": evaluiert einen Ausdruck, wenn der Benutzer auf das Element klickt
es: ``ng-click``: evaluar una expresión cuando el usuario haga clic en el elemento
fr: ``ng-click`` : évaluer une expression lorsqu'un utilisateur clique sur un élément
it: ``ng-click``: valuta un'espressione quando l'utente clicca sul relativo elemento;
nl: ``ng-click``: evalueert een uitdrukking wanneer de gebruiker op het element klikt

source: ``ng-class`` : apply a CSS class depending on a variable or condition
de: "ng-class": wendet eine CSS-Klasse abhängig von einer Variable oder Bedingung an
es: ``ng-class``: aplicar una clase CSS en función de una variable o condición
fr: ``ng-class`` : appliquer une classe CSS en fonction d'une variable ou d'une condition
it: ``ng-class``: applica una classe CSS in base a una variabile o a una condizione;
nl: ``ng-class``: past een CSS-klasse toe afhankelijk van een variabele of voorwaarde

source: ``ng-if`` : show or hide an element depending on a condition
de: "ng-if": zeigt oder verbirgt ein Element abhängig von einer Bedingung
es: ``ng-if``: mostrar u ocultar un elemento en función de una condición
fr: ``ng-if`` : afficher ou masquer un élément en fonction d'une condition
it: ``ng-if``: mostra o nasconde un elemento in base a una condizione;
nl: ``ng-if``: toont of verbergt een element afhankelijk van een voorwaarde

source: ``ng-repeat`` : iterate over a list or an array, repeat the HTML element for each iteration
de: "ng-repeat": iteriert über eine Liste oder einen Array, wiederholt das HTML-Element für jede Iteration
es: ``ng-repeat``: iterar en una lista o matriz y repetir el elemento HTML para cada una de las iteraciones
fr: ``ng-repeat`` : effectuer une itération sur une liste ou un tableau, répéter l'élément HTML pour chaque itération
it: ``ng-repeat``: effettua un'iterazione su un elenco o un array, ripete l'elemento HTML a ogni iterazione;
nl: ``ng-repeat``: herhaalt over een lijst of een array, herhaalt het HTML-element voor elke herhaling

source: ``ng-change`` : evalute an expression when the user change the value in an HTML Select element
de: "ng-change": evaluiert einen Ausdruck, wenn der Benutzer den Wert in ein HTML Select-Element ändert
es: ``ng-change``: evaluar una expresión cuando el usuario cambie el valor de un elemento HTML Select
fr: ``ng-change`` : évaluer une expression lorsque l'utilisateur modifie la valeur d'un élément HTML Select
it: ``ng-change``: valuta un'espressione quando l'utente modifica il valore in un elemento HTML "select".
nl: ``ng-change``: evalueert een uitdrukking wanneer de gebruiker de waarden in een HTML Select-element wijzigt

source: ng-if : Show or Hide a widget depending on the user filter choice
de: ng-if: zeigt oder verbirgt ein Widget abhängig von der Filterauswahl des Benutzers
es: ng-if: mostrar u ocultar un widget en función de la selección de filtro del usuario
fr: ng-if : afficher ou masquer un widget en fonction des filtres sélectionnés par l'utilisateur
it: ng-if: mostra o nasconde un widget in base al filtro scelto dall'utente
nl: ng-if : toont of verbergt een widget afhankelijk van de filterkeuze van de gebruiker

source: In our dashboard we have the region line chart, and also the city filter ! When the user select a city to filter on it, the chart become useless as it only have one value to display.
de: In unserem Dashboard haben wir das Liniendiagramm für Regionen sowie den Städte-Filter. Wählt der Benutzer eine Stadt für die Filterung aus, wird das Diagramm nutzlos, da es nur einen darzustellenden Wert gibt.
es: ¡En el panel tenemos el gráfico de líneas de región, y también el filtro de ciudad! Cuando el usuario seleccione una ciudad como filtro, el gráfico no tendrá ninguna utilidad ya que solo tiene un valor para visualizar.
fr: Dans notre tableau de bord, nous avons le graphe linéaire des régions, mais également un filtre par ville ! Lorsque l'utilisateur sélectionne une ville pour filtrer les résultats, le graphe devient inutile car il n'affiche qu'une seule valeur.
it: Il nostro dashboard offre un grafico a linee con i dati visualizzati per regione, ma dispone anche di un filtro sulle città. Quando un utente filtra i dati per città, la presenza del grafico diventa inutile, poiché include una sola variabile.
nl: In ons dashboard hebben we de regiolijngrafiek en ook de stadsfilter! Wanneer de gebruiker een stad selecteert om op te filteren, wordt de grafiek nutteloos aangezien deze slechts één waarde kan weergeven.

source: What could be interesting is to hide the region widget when an activity is selected, and show another chart instead !
de: Es könnte interessant sein, das Regionen-Widget zu verbergen, wenn eine Aktivität ausgewählt wurde, und stattdessen ein anderes Diagramm anzuzeigen!
es: Podría ser interesante ocultar el widget de región cuando se seleccione una actividad, y mostrar otro gráfico en su lugar.
fr: Il pourrait donc être intéressant de masquer le widget de région lorsqu'une activité est sélectionnée, et d'afficher un autre graphe à la place.
it: Per questo motivo, quando viene selezionata un'attività, sarebbe più utile nascondere il widget sulle regioni e mostrare al suo posto un altro grafico.
nl: Wat interessant zou kunnen zijn is om de regiowidget te verbergen wanneer een activiteit wordt geselecteerd en in plaats daarvan een andere grafiek te tonen!

source: Let's go back to the explore dataset view, go to the analyse tab, and set-up a new chart, for exemple :
de: Wechseln wir zurück zur Ansicht zur Untersuchung eines Datensatzes. Öffnen Sie den Analyse-Tab und richten Sie ein neues Diagramm ein, zum Beispiel:
es: Volvamos a la vista Explorar del juego de datos; vaya a la ficha de análisis y configure un gráfico nuevo, por ejemplo:
fr: Retournez à la vue d'exploration du jeu de données, accédez à l'onglet analyse et configurez un nouveau graphe, par exemple :
it: Torniamo allora alla pagina di esplorazione del dataset, entriamo nella scheda Analizza e creiamone uno nuovo. Ad esempio:
nl: Laten we terugkeren naar de exploredatasetweergave, ga naar het analysetabblad en maak een nieuwe grafiek, bijvoorbeeld:

source: A pie chart with the number of recorded companies for each month of the year, sorted.
de: Ein Kreisdiagramm mit der sortierten Anzahl der verzeichneten Unternehmen für jeden Monat des Jahres.
es: Un gráfico circular con el número de empresas registradas para cada uno de los meses del año, en orden.
fr: Un camembert indiquant le nombre d'entreprises immatriculées chaque mois de l'année, avec un tri.
it: Un grafico a torta con il numero di aziende iscritte al registro ordinate per ogni mese dell'anno:
nl: Een taartgrafiek met het aantal geregistreerde ondernemingen voor elke maand van het jaar gesorteerd.

source: X axis : immatriculation date, month level
de: X-Achse: Immatrikulationsdatum, Monatsebene
es: Eje X: fecha de registro, por mes
fr: Axe X : date d'immatriculation, tri par mois
it: asse X: data di iscrizione, livello: mese
nl: X-as: inschrijvingsdatum, maandniveau

source: Y : pie chart, Y axis : count
de: Y: Kreisdiagramm, Y-Achse: Zähler
es: Y: gráfico circular, eje Y: recuento
fr: Y : camembert, Axe Y : compte
it: Y: grafico a torta, asse Y: numero
nl: Y: taartgrafiek, Y-as: telling

source: Copy and paste the widget code below the chart.
de: Kopieren Sie den Widget-Code und fügen Sie ihn unterhalb des Diagramms ein.
es: Copie y pegue el código del widget bajo el gráfico.
fr: Copiez et collez le code du widget sous le graphe.
it: Copia il codice del widget e incollalo sotto il grafico.
nl: Kopieer en plak de widgetcode onder de grafiek.

source: Remove the pasted context declaration
de: Entfernen Sie die eingefügte Kontextdeklaration
es: Elimine la declaración de contexto pegada.
fr: Supprimez la déclaration de contexte collée
it: Rimuovi la parte incollata in cui si esplicita il contesto.
nl: Verwijder de geplakte contextverklaring

source: Change the context name used in this new chart (if needed).
de: Ändern Sie den Kontextnamen, der in diesem neuen Diagramm verwendet wird (falls erforderlich).
es: Cambie el nombre de contexto empleado en este gráfico nuevo (si es necesario).
fr: Changez le nom du contexte utilisé dans ce nouveau graphe (si nécessaire).
it: Modifica eventualmente il nome del contesto utilizzato in questo nuovo grafico.
nl: Wijzig (indien nodig) de naam van de context die gebruikt wordt in deze nieuwe grafiek.

source: We can now use the ``ng-if`` directive on each widget to display one or the other.
de: Jetzt können wir die Richtlinie "ng-if" für jedes Widget verwenden, um das eine oder das andere anzuzeigen.
es: Ahora podemos utilizar la directiva ``ng-if`` en cada uno de los widgets para visualizar uno u otro.
fr: Nous pouvons maintenant utiliser la directive ``ng-if`` sur chaque widget afin d'afficher l'un ou l'autre widget.
it: Ora possiamo utilizzare la direttiva ``ng-if`` nei widget presenti per visualizzare uno dei due grafici in base alla situazione.
nl: Nu kunnen we de ``ng-if``-richtlijn voor elke widget gebruiken om één of de andere weer te geven.

source: The condition will be, `if a refine is applied on the context`, show or hide. We saw that the refine list is available in ``context.parameters``. As parameters is a key value dictionnary, to get the ``myfield`` refine parameter, we try to access : ``mycontext.parameters['refine.myfield']``
de: Die Bedingung lautet "wird eine Verfeinerung im Kontext angewendet" anzeigen oder verbergen. Die Verfeinerungsliste ist unter "context.parameters" verfügbar. Da es sich bei den Parametern um ein Schlüsselwert-Wörterbuch handelt, versuchen wir es mit folgendem Zugriff, um den Verfeinerungsparameter "myfield" zu erhalten: "mycontext.parameters['refine.myfield']"
es: La condición será: `si se aplica o no un refinamiento en el contexto`, mostrar u ocultar. Hemos visto que la lista de refinamientos está disponible en ``context.parameters``. Como los parámetros son un diccionario de valores clave, para obtener el parámetro de refinamiento ``myfield``, intentamos acceder a: ``mycontext.parameters['refine.myfield']``.
fr: La condition sera, `si le contexte est affiné`, afficher ou masquer. Nous avons vu que la liste des affinages est disponible dans ``context.parameters``. Étant donné que les paramètres sont un dictionnaire de valeurs de clés, pour obtenir le paramètre d'affinage ``myfield``, nous tentons d'accéder à : ``mycontext.parameters['refine.myfield']``
it: La condizione sarà: `se viene applicato il parametro "refine" sul contesto`, mostra o nascondi. Abbiamo visto che l'elenco "refine" è disponibile in ``context.parameters``. Poiché i parametri sono un dizionario di valori chiave, per ottenere un "refine" sul campo ``myfield`` proviamo ad accedere in questo modo: ``mycontext.parameters['refine.myfield']``.
nl: De voorwaarde zal zijn, `wanneer een verfijning wordt toegepast op de context`, toon of verberg. We hebben gezien dat de verfijningslijst beschikbaar is in ``context.parameters``. Aangezien parameters een belangrijke waardewoordenboek is, om de ``myfield`` verfijningsparameter te krijgen, proberen we toegang te krijgen tot : ``mycontext.parameters['refine.myfield']``

source: Applied to our dataset it's looks like this :
de: Angewendet auf unseren Datensatz sieht das Ganze dann so aus:
es: Una vez aplicado al juego de datos, tiene este aspecto:
fr: Appliqué à notre jeu de données, le code ressemble à ceci :
it: Applicato sul nostro dataset, il codice sarà:
nl: Toegepast op onze dataset ziet dit er zo uit:

source: The region chart ng-if condition can be translated to `Show the chart if there is a refine on the **ville** facet`
de: Die ng-if-Bedingung (Regionen-Diagramm) kann übersetzt werden in "Diagramm anzeigen, wenn eine Verfeinerung für das Facet **ville** vorliegt"
es: La condición ng-if del gráfico de región se puede traducir como `Mostrar el gráfico si hay un refinamiento en la faceta de ciudad **ville**`.
fr: La condition ng-if du graphe des régions peut être traduite par `Afficher le graphique si un paramètre d'affinage est appliqué sur la facette **ville**`.
it: La condizione ng-if inserita nel grafico sulle regioni può essere tradotta in questo modo: `Mostra il grafico se viene applicato un "refine" sul facet **ville**`.
nl: De regiografiek ng-if voorwaarde kan vertaald worden naar `Toon de grafiek wanneer er een verfijning is op het facet **ville**`

source: ``!`` character is to get the opposite, the condition can be translated to `Show the chart if their is NO refine on the **ville** facet`
de: Mit dem Zeichen "!" kann das Gegenteil erreicht werden, die Bedingung kann übersetzt werden in "Diagramm anzeigen, wenn KEINE Verfeinerung für das Facet **ville** vorliegt"
es: El carácter ``!`` permite obtener lo contrario, y la condición se puede traducir como `Mostrar el gráfico si NO hay ningún refinamiento en la faceta de ciudad **ville**`
fr: Le caractère ``!`` permet d'obtenir le résultat opposé, la condition peut alors être traduite par `Afficher le graphe si AUCUN paramètre d'affinage n'est appliqué sur la facette **ville**`.
it: Il carattere ``!`` definisce la condizione contraria: `Mostra il grafico se NON c'è un "refine" sul facet **ville**`.
nl: Het ``!`` karakter wordt gebruikt om het tegenovergestelde te krijgen. De voorwaarde kan vertaald worden naar `Toon de grafiek wanneer er GEEN verfijning is op het facet **ville**`

source: To easily understand how it works, do not hesitate to display the ``context.parameters`` value in your dashboard each time you use it !
de: Um zu verstehen, wie das Ganze funktioniert, können Sie den Wert ``context.parameters`` jedes Mal in ihrem Dashboard anzeigen lassen, wenn Sie ihn verwenden!
es: Para entender fácilmente su funcionamiento, no dude en visualizar el valor ``context.parameters`` en el panel cada vez que lo utilice.
fr: Afin de comprendre comment cela fonctionne, n'hésitez pas à afficher la valeur ``context.parameters`` dans votre tableau de bord à chaque fois que vous l'utilisez !
it: Per capire come funziona, non esitare a visualizzare il valore ``context.parameters`` nel tuo dashboard ogni volta che lo utilizzi!
nl: Om gemakkelijk te begrijpen hoe dit werkt, aarzel niet om de waarde ``context.parameters`` weer te geven in uw dashboard telkens wanneer u dit gebruikt!

source: ng-if : display the download link only if the dashboard is filtered
de: ng-if: Anzeige des Download-Links nur dann, wenn das Dashboard gefiltert ist
es: ng-if: visualizar el vínculo de descarga solo si el panel está filtrado
fr: ng-if : afficher le lien de téléchargement uniquement si des filtres sont appliqués sur le tableau de bord
it: ng-if: visualizza il link per il download solo se il dashboard è stato filtrato
nl: ng-if: geeft de downloadkoppeling weer, maar enkel wanneer het dashboard is gefilterd

source: Same technique, if ``context.q`` or ``context.parameters['refine.myfilter']`` exists, show the download link.
de: Die gleiche Technik, wenn "context.q" oder "context.parameters['refine.myfilter']" vorhanden ist, Download-Link anzeigen.
es: Siguiendo la misma técnica, si existe ``context.q`` o ``context.parameters['refine.myfilter']``, mostrar el vínculo de descarga.
fr: La même technique est utilisée, si ``context.q`` ou ``context.parameters['refine.myfilter']`` existe, afficher le lien de téléchargement.
it: La tecnica è sempre la stessa: se ``context.q`` o ``context.parameters['refine.myfilter']`` esiste, mostra il link di download.
nl: Zelfde techniek, wanneer ``context.q`` of ``context.parameters['refine.myfilter']`` bestaat, toon de downloadkoppeling.

source: ng-init / ng-click / ng-if /ng-class : Create tabs to switch views
de: ng-init / ng-click / ng-if /ng-class: Erstellen Sie Tabs, um Ansichten zu wechseln
es: ng-init / ng-click / ng-if /ng-class: crear fichas para cambiar entre vistas
fr: ng-init / ng-click / ng-if /ng-class : créer des onglets pour passer d'une vue à une autre
it: ng-init / ng-click / ng-if /ng-class: crea le schede per passare da una visualizzazione all'altra
nl: ng-init / ng-click / ng-if /ng-class : Maakt tabbladen aan om weergaves te switchen

source: This exemple will use 4 differents directives.
de: Für dieses Beispiel verwenden wir 4 unterschiedliche Richtlinien.
es: En este ejemplo se utilizan 4 directivas.
fr: Cet exemple utilise 4 directives différentes.
it: In questo esempio utilizzeremo 4 direttive differenti:
nl: In dit voorbeeld zullen 4 verschillende richtlijnen worden gebruikt.

source: ng-init to declare a variable to keep track of witch tab to display !
de: ng-init zur Deklaration einer Variable, um nachzuverfolgen, welcher Tab angezeigt wird!
es: ng-init para declarar una variable para el seguimiento de la ficha que se visualiza
fr: ng-init pour déclarer une variable, afin de savoir quel onglet afficher
it: ng-init per dichiarare una variabile, in modo da sapere quale scheda visualizzare;
nl: ng-init om een variabele aan te geven om bij te houden welk tabblad moet worden weergegeven!
