Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/dashboard/dashboard.po
Languages: de, es, fr, it, nl

source: Most of the time, we want all widgets to be connected each others. To do this, the secret is to use the same **context**. The **context** is the pivot between each elements of your pages, all the widgets that should interact together must use the same **context**.
de: Meistens ist gewünscht, dass alle Widgets miteinander verbunden sind. Der Trick dabei ist, den gleichen **Kontext** zu verwenden. Der **Kontext** ist das Verbindungsstück zwischen allen Elementen Ihrer Seiten, alle Widgets, die miteinander kommunizieren sollen, müssen den gleichen **Kontext** nutzen.
es: Normalmente queremos que todos los widgets estén conectados entre sí. Para ello, el secreto reside en usar el mismo **contexto**. Dado que el **contexto** es el pivote clave que existe entre cada uno de los elementos de las páginas, todos los widgets que requieran una interacción mutua deberán usar el mismo **contexto**.
fr: La plupart du temps, il est préférable que tous les widgets soient connectés les uns aux autres. Le secret pour cela consiste à utiliser le même **contexte**. Le **contexte** est ce qui permet de faire le lien entre chacun des éléments de vos pages. Tous les widgets qui doivent pouvoir interagir entre eux doivent utiliser le même **contexte**.
it: In generale, è consigliabile avere tutti i widget collegati tra loro. Per fare ciò, il segreto consiste nell'utilizzare lo stesso **contesto**. Il **contesto** è il fulcro attorno cui ruotano tutti gli elementi delle tue pagine, perciò tutti quei widget che devono interagire tra loro devono appartenere allo stesso **contesto**.
nl: Meestal willen we dat alle widgets met elkaar verbonden zijn. Om dit te doen, bestaat het geheim erin om dezelfde **context** te gebruiken. De **context** is het scharnierpunt tussen alle elementen van uw pagina's. Alle widgets die met elkaar zouden moeten interageren, moeten dezelfde **context** gebruiken.

source: On the other hand, it's also the link between your widgets and the **dataset**, it's the way to define on witch dataset your widgets should work (queries, filters and display records)
de: Daneben ist er die Verbindung zwischen Ihren Widgets und dem **Datensatz**. Auf diese Weise wird bestimmt, für welchen Datensatz die Widgets eingesetzt werden sollen (Anfragen, Filter und Anzeige von Einträgen).
es: Además, también es el vínculo que existe entre los widgets y el **juego de datos**; es la manera de definir en qué juego de datos deben trabajar los widgets (consultas, filtros y registros de visualización).
fr: Il s'agit également du lien entre vos widgets et le **jeu de données**, c'est-à-dire la méthode permettant de définir sur quel jeu de données vos widgets doivent fonctionner (requêtes, filtres et affichage des enregistrements).
it: Al contempo, il contesto è anche l'elemento di collegamento tra i tuoi widget e il **dataset**: è un modo per definire su quali dataset devono funzionare i vari widget (query, filtri e visualizzazione dei record).
nl: Anderzijds is het ook de koppeling tussen uw widgets en de **dataset**. Het is de manier om te definiëren op welke dataset uw widgets zouden moeten werken (zoekopdrachten, filters en weergave van records).

source: Let's have a look to our code, each time we copied and pasted a bloc, we got too main elements, an ``ods-dataset-context`` first, and a widget : ``ods-map``, ``ods-table`` and ``ods-chart``.
de: Sehen wir uns unseren Code an: Jedes Mal, wenn wir einen Block kopieren und einfügen, haben wir 2 Hauptelemente, zunächst einen Kontext ``ods-dataset-context`` und dann ein Widget ``ods-map``, ``ods-table`` und ``ods-chart``.
es: Veamos el código. Cada vez que hemos copiado y pegado un bloque, también hemos obtenido elementos principales, un ``ods-dataset-context`` primero y un widget: ``ods-map``, ``ods-table`` y ``ods-chart``.
fr: Observons notre code, à chaque fois que nous avons copié/collé un bloc, nous avons ajouté deux éléments principaux, tout d'abord ``ods-dataset-context``, puis un widget : ``ods-map``, ``ods-table`` et ``ods-chart``.
it: Diamo un'occhiata al nostro codice. Ogni volta che abbiamo incollato un blocco abbiamo aggiunto troppi elementi: prima ``ods-dataset-context``, poi i widget ``ods-map``, ``ods-table`` e ``ods-chart``.
nl: Laten we nu een kijkje nemen naar onze code. We hebben telkens een blok gekopieerd en geplakt. We hebben te veel elementen gekregen, eerst een ``ods-dataset-context` en een widget: ``ods-map``, ``ods-table`` en ``ods-chart``.

source: This cleaned version of code highlight that the 3 widgets have, each time, their own context ! 3 contexts, for 3 widgets.
de: In dieser bereinigten Code-Version wird deutlich, dass die 3 Widgets jedes Mal ihren eigenen Kontext haben! 3 Kontexte für 3 Widgets.
es: ¡Esta versión limpia del código hace patente que los 3 widgets tienen, cada vez, su propio contexto! 3 contextos para 3 widgets.
fr: Cette version nettoyée du code met en évidence que les 3 widgets présentent, à chaque fois, leur propre contexte ! 3 contextes, pour 3 widgets.
it: Grazie a questa versione ripulita del codice, possiamo notare come ognuno dei 3 widget possieda un proprio contesto: 3 contesti per 3 widget.
nl: Deze gekuiste codeversie beklemtoont dat de 3 widgets telkens hun eigen context hebben! 3 contexten voor 3 widgets.

source: A simple thing to do then is to keep only one, and move our widgets below this **unique** context !
de: Eine einfache Vorgehensweise besteht darin, einen einzigen zu bewahren und unsere Widgets unter diesen **einzigen** Kontext zu verschieben!
es: ¡Se puede hacer algo tan sencillo como mantener uno solo, y mover los widgets bajo este contexto **único**!
fr: Le plus simple consiste alors à n'en conserver qu'**un seul** et d'y déplacer nos widgets.
it: La soluzione più semplice consiste nel mantenerne solo uno, spostando i widget all'interno di un **unico** contesto.
nl: Het eenvoudigste is dan om slechts één te behouden en onze widget onder deze **unieke** context te plaatsen!

source: Here is the result :
de: Das Ergebnis sieht so aus:
es: Este es el resultado:
fr: Voici le résultat :
it: Ecco il risultato:
nl: Dit is het resultaat:

source: Now, any circle, rectangle or polygon drawn on the map will apply the a filter on the **context**, **shared** by all widgets, we then expect that the table and chart **dynamically reload** their display with the filtered results.
de: Jetzt wird für jeden auf der Karte gezeichneten Kreis, jedes Polygon oder Rechteck ein Filter in dem **Kontext** angewandt, der von allen Widgets **geteilt** wird. So erwarten wir, dass die Tabelle und das Diagramm ihre Anzeige mit den gefilterten Ergebnissen **dynamisch neu laden**.
es: Ahora, cualquier círculo, rectángulo o polígono que se dibuje en el mapa aplicará un filtro en el **contexto**, **compartido** por todos los widgets, y tanto la tabla como el gráfico deberán **cargar dinámicamente** su visualización con los resultados filtrados.
fr: Désormais, tout cercle, rectangle ou polygone dessiné sur la carte appliquera le filtre sur le **contexte**, qui est **partagé** par tous les widgets. L'affichage du tableau et du graphe doit désormais se **recharger dynamiquement** pour afficher les résultats filtrés.
it: Da questo momento, qualsiasi cerchio, rettangolo o poligono disegnato sulla mappa attiverà un filtro in un **contesto condiviso** da tutti i widget. Di conseguenza, la tabella e il grafico verranno **aggiornati in maniera dinamica** in base ai risultati filtrati.
nl: Nu zal elke cirkel, rechthoek of veelhoek die op de kaart wordt getekend, een filter toepassen op de **context** die **gedeeld** wordt door alle widgets. Vervolgens verwachten we dat de tabel en grafiek hun weergave **dynamisch herladen** met de gefilterde resultaten.

source: Add a text search form
de: Eine Textsuche hinzufügen
es: Añadir un formulario de búsqueda de texto
fr: Ajouter un formulaire de recherche textuelle
it: Aggiungi un modulo di ricerca testuale
nl: Voeg een tekstzoekformulier toe

source: Now that we have an unique context to work on, and all our widgets are linked together, we can add other advanced widget. Let's start with a search bar !
de: Nachdem wir einen einzigen Kontext haben und alle Widgets miteinander verbunden sind, können wir weitere Widgets hinzufügen. Beginnen wir mit einer Suchleiste!
es: Ahora que tenemos un contexto único para trabajar y todos los widgets están vinculados entre sí, podemos añadir otro widget avanzado. ¡Empecemos con una barra de búsqueda!
fr: Maintenant que nous travaillons sur un seul contexte, et que tous nos widgets sont liés les uns aux autres, nous pouvons ajouter de nouveaux widgets plus complexes. Commençons par une barre de recherche !
it: Ora che abbiamo un unico contesto su cui lavorare e che tutti i widget sono collegati tra loro, possiamo aggiungere altri widget avanzati. Iniziamo da una barra di ricerca.
nl: Nu we een unieke context hebben om op te werken en al onze widgets aan elkaar gekoppeld zijn, kunnen we een andere geavanceerde widget toevoegen. Laten we beginnen met een zoekbalk!

source: Open a new tab with the full `widget documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ to see the list of available widgets.
de: Öffnen Sie einen neuen Tab mit der vollständigen `Widget-Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_, um eine Liste mit verfügbaren Widgets zu sehen.
es: Abra una ficha nueva con la `documentación de widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ completa para ver la lista de widgets disponibles.
fr: Ouvrez la `documentation complète sur les widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ dans un nouvel onglet pour consulter la liste des widgets disponibles.
it: Apri una nuova scheda per visualizzare la `documentazione completa sui widget <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ e consultare così la lista di quelli disponibili.
nl: Open een nieuw tabblad met de volledige `widget-documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ om de lijst met beschikbare widgets te zien.

source: The search bar is called `odsTextSearch <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`_. It has several optionnal parameters and only one mandatory : the context !
de: Die Bezeichnung für die Suchleiste lautet `odsTextSearch <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`_. Sie hat mehrere optionale Parameter und nur eine zwingende Voraussetzung: den Kontext!
es: La barra de búsqueda se denomina `odsTextSearch <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`_. Tiene varios parámetros opcionales y solo uno obligatorio: ¡el contexto!
fr: Le widget de la barre de recherche est appelé `odsTextSearch <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`_. Il présente plusieurs paramètres, dont un seul doit obligatoirement être renseigné : le contexte !
it: La barra di ricerca è denominata `odsTextSearch <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`_. Tra i parametri disponibili, ce ne sono diversi facoltativi e solo uno obbligatorio: il contesto.
nl: De zoekbalk draagt de naam `odsTextSearch <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`_. Hij heeft verschillende optionele parameters en slechts één verplichte: de context!

source: Let's keep it simple for the moment and use it like this :
de: Für den Augenblick halten wir die Sache einfach und gehen wie folgt vor:
es: Para empezar iremos a lo sencillo y utilizaremos esta sintaxis:
fr: Ne compliquons pas les choses pour le moment, et utilisons le code ci-dessous :
it: Per il momento, scegliamo la soluzione più semplice e utilizziamo il widget in questa forma:
nl: Laten we het voorlopig eenvoudig houden en deze als volgt gebruiken:

source: where
de: wo
es: donde
fr: où
it: dove
nl: waarbij

source: ``mycontext`` is the name of my context in my custom page.
de: "mycontext" der Name meines Kontext auf meiner Kontextseite ist.
es: ``mycontext`` es el nombre de mi contexto en mi página personalizada.
fr: ``mycontext`` est le nom de votre contexte sur votre page personnalisée.
it: ``mycontext`` è il nome del contesto scelto per questa pagina personalizzata.
nl: ``mycontext`` de naam is van mijn context in mijn aanpasbare pagina.

source: Now, add a search bar at the top of the dashboard :
de: Fügen Sie nun eine Suchleiste im oberen Bereich des Dashboards hinzu:
es: Ahora, añada una barra de búsqueda en la parte superior del panel:
fr: Ajoutons maintenant une barre de recherche en haut du tableau de bord :
it: Ora aggiungiamo una barra di ricerca nella parte alta del dashboard:
nl: Voeg nu een zoekbalk toe bovenaan het dashboard:

source: Save, refresh, search !
de: Nachdem Sie gespeichert und aktualisiert haben, können Sie Ihre Suche starten!
es: ¡Guarde los cambios, actualice y haga una búsqueda!
fr: Enregistrez, actualisez la page et vous pouvez effectuer des recherches !
it: Salva, aggiorna e inizia a effettuare le tue ricerche!
nl: Sla op, hernieuw, zoek!

source: For exemple, search for 'sport club' in the south of France :
de: Suchen Sie beispielsweise nach einem "Sportverein" in Südfrankreich:
es: Por ejemplo, busque 'sport club' en el sur de Francia:
fr: Par exemple, recherchez 'club de sport' dans le sud de la France :
it: Ad esempio, cerchiamo i termini 'sport club' nel sud della Francia:
nl: Bijvoorbeeld: zoek naar "sportclub" in het zuiden van Frankrijk:

source: Add some filters
de: Fügen Sie einige Filter hinzu
es: Añadir filtros
fr: Ajouter des filtres
it: Aggiungi alcuni filtri
nl: Voeg enkele filters toe

source: Like in the explore view, it's very interresting to have dataset filters to narrow your search. Ods filters widget is called `ods-facets <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`_
de: Ebenso wie in der Explore-Ansicht ist es interessant, die Suche mit Datensatzfiltern einzuschränken. Das Filter-Widget von ODS nennt sich `ods-facets <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`_
es: Como en la vista Explorar, es muy interesante tener filtros de juegos de datos para acotar la búsqueda. El widget de filtros de ODS se denomina `ods-facets <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`_.
fr: Tout comme dans la vue d'exploration, il est très intéressant de disposer de filtres pour les jeux de données, afin d'affiner vos recherches. Le widget des filtres ods est appelé `ods-facets <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`_
it: Come nella modalità di visualizzazione Esplora, è molto utile disporre di filtri per i dataset per affinare le tue ricerche. Il widget dei filtri OpenDataSoft è denominato `ods-facets <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`_.
nl: Net zoals in de exploreweergave is het zeer interessant om datasetfilters te hebben om uw zoekopdracht te vernauwen. De widget voor Ods-filters draagt de naam `ods-facets <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`_

source: The simplest way is to display all facets :
de: Der einfachste Weg ist es, alle Facets anzuzeigen:
es: La manera más sencilla es visualizar todas las facetas:
fr: La méthode la plus simple consiste à afficher toutes les facettes :
it: Il modo più semplice per utilizzarlo consiste nel visualizzare tutti i facet:
nl: De eenvoudigste manier is om alle facetten weer te geven:

source: A smarter way is to pick only needed facets by specifying the field id (not the name !) :
de: Klüger ist es, nur die benötigten Facets auszuwählen, indem die Feld-ID angegeben wird (nicht der Name!):
es: Una forma más avanzada consiste en seleccionar únicamente las facetas necesarias especificando el ID de campo (no el nombre):
fr: Il peut être plus intelligent de sélectionner uniquement les facettes requises en spécifiant l'id du champ (et pas son nom !) :
it: Un'alternativa più precisa consiste nell'utilizzare solo i facet necessari, specificando l'ID del campo (non il nome) :
nl: Een slimmere manier is om alleen de facetten te nemen die nodig zijn door het veld-ID te specificeren (niet de naam!):

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: To get the field id you need to be aware of the dataset schema. It's available in the information tab of the dataset. The dataset schema shows every information on each field : name, description, id, type, and a value exemple. It's often convenient to know the type and the id of each field when using advanced widget parameters.
de: Um die Feld-ID zu erhalten, müssen Sie das Schema des Datensatzes kennen. Sie finden es im Informations-Tab des Datensatzes. Das Schema des Datensatzes bietet alle Informationen zu allen Feldern: Name, Beschreibung, ID, Typ und ein Wertbeispiel. Es ist oft angebracht, den Typ und die ID jedes Feldes zu kennen, wenn Sie mit erweiterten Widget-Parametern arbeiten.
es: Para obtener el ID de campo, tiene que conocer el esquema del juego de datos. Está disponible en la ficha de información del juego de datos. El esquema del juego de datos muestra toda la información de cada uno de los campos: nombre, descripción, ID, tipo y un ejemplo de valor. Suele ser útil conocer el tipo y el ID de cada uno de los campos al usar parámetros de widgets avanzados.
fr: Pour obtenir l'id d'un champ, vous devez connaître le schéma du jeu de données. Il est disponible dans l'onglet informations du jeu de données. Le schéma du jeu de données indique toutes les informations relatives à chaque champ : nom, description, id, type et un exemple de valeur. Il est généralement recommandé de connaître le type et l'id de chaque champ lorsque vous utilisez des paramètres de widgets avancés.
it: Per ottenere l'ID di un campo devi accedere allo schema del dataset, che è disponibile nella scheda Informazioni. Lo schema del dataset mostra le informazioni relative a ogni singolo campo: nome, descrizione, ID, tipo e valore di esempio. Quando si utilizzano i parametri dei widget avanzati, conoscere il tipo e l'ID di ogni campo si rivela spesso molto utile.
nl: Om het veld-ID te bekomen, moet u zich bewust zijn van het datasetschema. Dit is terug te vinden in het informatietabblad van de dataset. Het datasetschema bevat alle informatie over elk veld: naam, omschrijving, ID, type en een waardevoorbeeld. Het is vaak gemakkelijk om het type en het ID van elk veld te kennen wanneer geavanceerde widgetparameters worden gebruikt.

source: In this dashboard exemple, we will use 2 filters : the company activity sector, and the city ! Add this code near the search bar :
de: In diesem Dashboard-Beispiel verwenden wir 2 Filter: den Tätigkeitsbereich der Firma und die Stadt! Fügen Sie diesen Code neben der Suchleiste ein:
es: En este ejemplo de panel, utilizaremos 2 filtros: el sector de actividad de la empresa y la ciudad. Añada este código cerca de la barra de búsqueda:
fr: Dans cet exemple de tableau de bord, nous utiliserons 2 filtres : le secteur d'activité de l'entreprise et la ville. Ajoutez ce code à côté de la barre de recherche :
it: In questo dashboard di esempio, utilizzeremo 2 filtri: il settore di attività delle aziende e la città. Aggiungi questo codice dopo quello della barra di ricerca:
nl: In het dashboardvoorbeeld zullen we 2 filters gebruiken: de sector waarin de onderneming actief is en de stad! Voeg deze code toe in de buurt van de zoekbalk:

source: It's now much simpler to search for sport club in Paris !
de: Jetzt ist es viel einfacher, nach einem Sportverein in Paris zu suchen!
es: ¡Ahora es mucho más sencillo buscar un club deportivo en París!
fr: Il est désormais bien plus facile de rechercher un club de sport à Paris !
it: Ora sarà molto più semplice effettuare la ricerca sui centri sportivi di Parigi!
nl: Het is nu veel eenvoudiger om sportclubs in Parijs te zoeken!

source: Discover CSS classes for easy responsive development
de: Lernen Sie CSS-Klassen für einfaches responsives Entwickeln kennen
es: Descubrir las clases CSS para desarrollar fácilmente un diseño con capacidad de respuesta
fr: Découvrir les classes CSS pour un développement responsive en toute facilité
it: Scopri le classi CSS per uno sviluppo semplice e responsivo
nl: Ontdek CSS-klassen voor eenvoudige responsieve ontwikkeling

source: This dashboard starts to be nice but every widgets are in the same column, one after another without any style tuning.
de: Dieses Dashboard nimmt langsam Form an, doch befinden sich alle Widgets in der gleichen Spalte, eines nach dem anderen und ohne Anpassung des Stils.
es: Este panel empieza a tener un buen aspecto, pero los widgets están en la misma columna, todos seguidos y sin un estilo personalizado.
fr: Notre tableau de bord commence à prendre forme, mais tous les widgets sont actuellement dans la même colonne, les uns à la suite des autres sans aucune modification esthétique.
it: Il nostro dashboard comincia ad essere interessante, ma al momento i widget sono incolonnati uno dopo l'altro e richiedono un lavoro sullo stile.
nl: Dit dashboard begint er goed uit te zien, maar elke widget staat in dezelfde kolom, de ene na de andere zonder enige style tuning.

source: At this point you need to be aware of the platform possibilities about CSS and HTML Style. Please read carrefully the :doc:`responsive grid layout management </customizing_look_and_feel/07_designing_responsive_portal/responsive>` documentation.
de: An dieser Stelle ist es wichtig, die Möglichkeiten der Plattform in Sachen CSS- und HTML-Stil zu kennen. Bitte lesen Sie aufmerksam die Dokumentation :doc:`Verwaltung der responsiven Rasteranordnung </customizing_look_and_feel/07_designing_responsive_portal/responsive>`.
es: En este punto, debe conocer las posibilidades de estilo de la plataforma en relación con CSS y HTML. Lea atentamente la documentación acerca de la :doc:`gestión del diseño de cuadrícula con capacidad de respuesta </customizing_look_and_feel/07_designing_responsive_portal/responsive>`.
fr: À ce stade du tutoriel, vous devez avoir connaissance des capacités de mise en forme CSS et HTML dont dispose la plateforme. Veuillez lire attentivement la documentation sur la :doc:`gestion des dispositions en grille responsive </customizing_look_and_feel/07_designing_responsive_portal/responsive>`.
nl: Op dit punt moet u zich bewust zijn van de mogelijkheden van het platform wat betreft CSS en HTML Style. Gelieve de documentatie :doc:`responsief beheer van de lay-out van het rooster </customizing_look_and_feel/07_designing_responsive_portal/responsive>` zorgvuldig te lezen.
