Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/01_managing_users_and_groups/groups.po
Languages: de, es, fr, it, nl

source: Organizing groups
de: Organisieren von Gruppen
es: Organizar los grupos
fr: Organiser des groupes
it: Organizzazione dei gruppi
nl: Groepen organiseren

source: Setting permissions and quotas at the user level provides the most control over security but can also become tedious for large amount of users. In this case, you'll probably want to set up groups.
de: Berechtigungen und Quoten auf der Benutzerebene festzulegen, bietet die größte Kontrolle über die Sicherheit, kann bei einer großen Zahl von Benutzern aber auch mühsam sein. In diesem Fall sollten Sie Gruppen einrichten.
es: Establecer permisos y cuotas a nivel de usuario aporta el máximo control de la seguridad, pero también puede resultar tedioso si existe un gran número de usuarios. En ese caso, probablemente desee configurar grupos.
fr: La définition de permissions et de quotas au niveau de l'utilisateur permet de mieux gérer la sécurité, mais peut également devenir fastidieuse avec une quantité importante d'utilisateurs. Dans ce cas, vous souhaiterez probablement créer des groupes.
it: La definizione dei permessi e delle quote a livello dei singoli utenti consente di avere il massimo controllo sulla sicurezza, ma può diventare un’operazione troppo lunga se effettuata su una grande quantità di utenti. In questo caso, puoi ricorrere alla creazione di gruppi.
nl: Het instellen van toestemmingen en quota's op gebruikersniveau biedt de meeste controle over veiligheid maar kan ook vervelend worden voor grote aantallen gebruikers. In dit geval zal u waarschijnlijk groepen willen instellen.

source: The groups index page
de: Die Seite Gruppenindex
es: Página de índice de grupos
fr: La page d'index des groupes
it: Pagina di indice dei gruppi
nl: De indexpagina van groepen

source: Granting permissions and quotas
de: Einräumen von Berechtigungen und Quoten
es: Conceder permisos y cuotas
fr: Accorder des permissions et des quotas
it: Assegnazione di quote e permessi
nl: Toestemmingen en quota's verlenen

source: Groups are a simple way to share security settings between users. As for a user, a group can have permissions and quotas. Group members then inherit from the group's settings:
de: Gruppen sind ein einfaches Mittel zum Teilen von Sicherheitseinstellungen zwischen Benutzern. Eine Gruppe kann wie ein Benutzer über Berechtigungen und Quoten verfügen. Die Mitglieder der Gruppe erben dann die Einstellungen der Gruppe:
es: Los grupos son una manera sencilla de compartir la configuración de seguridad entre los usuarios. Igual que un usuario, un grupo puede tener permisos y cuotas. De este modo, los miembros del grupo heredan estos elementos de la configuración del grupo:
fr: Les groupes permettent de partager de façon simple les paramètres de sécurité entre les utilisateurs. À l'instar d'un utilisateur, les groupes peuvent avoir des permissions et des quotas. Les membres du groupe héritent alors des paramètres du groupe :
it: Tramite i gruppi puoi condividere le stesse impostazioni di sicurezza tra più utenti. Come per questi ultimi, anche i gruppi hanno quote e permessi propri e le loro impostazioni vengono ereditate dai membri:
nl: Groepen zijn een eenvoudige manier om veiligheidsinstellingen tussen gebruikers te delen. Net zoals voor een gebruiker kan een groep toestemmingen en quota's hebben. Groepsleden erven vervolgens van de instellingen van de groep:

source: A user's **permissions** is therefore defined as the union of its own permissions and of all permissions granted through the groups he/she is a member of.
de: Die **Berechtigungen** eines Benutzers werden daher als die Kombination der ihm eigenen Berechtigungen mit allen durch die Gruppen gewährten Berechtigungen definiert, in denen er Mitglied ist.
es: Los **permisos** de un usuario se definen como la unión de sus propios permisos y de todos los permisos concedidos por medio de los grupos a los cuales pertenece como miembro.
fr: Les **permissions** d'un utilisateur sont donc définies comme la combinaison de ses propres permissions et de toutes les permissions accordées via les groupes auxquels il appartient.
it: I **permessi** di un utente saranno quindi il risultato dell'unione tra i permessi individuali e quelli assegnati ai gruppi di cui l'utente è membro.
nl: De **toestemmingen** van een gebruiker worden daarom gedefinieerd als de samenvoeging van zijn eigen toestemmingen en van alle toestemmingen die verleend werden via de groepen waarvan hij/zij lid is.

source: A user's **quotas** (if he/she doesn't have his/her own settings) is the maximum of all of his/her groups values.
de: Die **Quoten** eines Benutzers bezeichnen das Maximum all seiner Gruppenwerte (sofern er keine eigenen Einstellungen hat).
es: Las **cuotas** de un usuario (si no tiene su propia configuración) es el máximo de todos sus valores de grupo.
fr: Les **quotas** d'un utilisateur (s'il n'a pas ses propres paramètres) correspondent à la valeur maximale des valeurs des groupes auxquels il appartient.
it: Le **quote** di un utente coincidono con i valori massimi assegnati ai suoi gruppi, a meno che l'utente non disponga di impostazioni specifiche.
nl: De **quota's** van een gebruiker (indien hij/zij zijn/haar eigen instellingen niet heeft) is het maximum van alle waarden van zijn/haar groep.

source: Managing members
de: Verwalten von Mitgliedern
es: Administrar los miembros
fr: Gérer des membres
it: Gestione dei membri
nl: Leden beheren

source: There are three ways to add or remove members to a group.
de: Mitglieder können auf dreierlei Weise zu einer Gruppe hinzugefügt bzw. daraus entfernt werden.
es: Hay 3 maneras de añadir o eliminar miembros a/de un grupo.
fr: Trois options s'offrent à vous pour ajouter des membres à un groupe ou en supprimer.
it: Esistono tre modi per aggiungere o rimuovere i membri di un gruppo.
nl: Er zijn drie manieren om leden aan een groep toe te voegen of uit een groep te verwijderen.

source: In the case of a single user, you can look him/her up on :doc:`the users index page <users>` and directly from there add him/her to any group. Just click on the *add group* button and select the group within the dropdown list.
de: Im Falle eines einzelnen Benutzers können Sie ihn auf :doc:`der Seite Benutzerindex <users>` suchen und dort direkt zu einer beliebigen Gruppe hinzufügen. Klicken Sie dazu einfach auf die Schaltfläche *Gruppe hinzufügen* und wählen Sie die Gruppe in der Dropdown-Liste aus.
es: En el caso de un único usuario, puede consultarlo en la :doc:`página de índice de usuarios <users>` y, directamente desde ahí, añadirlo al grupo que desee. Basta con hacer clic en el botón *Añadir grupo* y seleccionar el grupo en la lista desplegable.
fr: Si vous souhaitez ajouter un seul utilisateur, vous pouvez le rechercher sur :doc:`la page d'index des utilisateurs <users>` et l'ajouter à un groupe depuis cette même page. Il vous suffit de cliquer sur le bouton *ajouter au groupe* et de sélectionner le groupe dans le menu déroulant.
it: Nel caso di un singolo utente, puoi effettuare una ricerca nella :doc:`pagina di indice degli utenti <users>` e da qui aggiungere direttamente l'utente desiderato a qualunque gruppo. Per fare ciò, clicca sul pulsante *Aggiungi gruppo* e seleziona il gruppo nell'elenco a discesa.
nl: In het geval van een enkele gebruiker, kan u hem/haar opzoeken op :doc:`de indexpagina van gebruikers <users>` en hem/haar van daaruit rechtstreeks toevoegen aan een groep. Klik gewoon op de knop *voeg groep toe* en selecteer de groep in de dropdown-lijst.

source: Add a user to a group from the users index
de: Einen Benutzer vom Benutzerindex zu einer Gruppe hinzufügen
es: Añadir un usuario a un grupo desde el índice de usuarios
fr: Ajouter un utilisateur à un groupe depuis l'index des utilisateurs
it: Aggiunta di un utente a un gruppo dall'indice degli utenti
nl: Voeg een gebruiker uit de gebruikersindex toe aan een groep

source: This is of course a handy shortcut and you can also access the user's page directly and from there add him/her to any group.
de: Das ist natürlich eine praktische Abkürzung. Sie können auch auf die Seite des Benutzers zugreifen und ihn dort einer beliebigen Gruppe hinzufügen.
es: Se trata de un atajo realmente práctico, y también puede acceder a la página del usuario directamente y desde ahí añadirlo al grupo que desee.
fr: Il s'agit bien entendu d'un raccourci utile et vous pouvez également accéder à la page des utilisateurs directement et ajouter l'utilisateur à un groupe depuis cette page.
it: Questa è certamente una pratica scorciatoia, anche se per aggiungere l'utente a un gruppo puoi sempre farlo direttamente dalla sua pagina personale.
nl: Dit is natuurlijk een handige shortcut en u kan ook rechtstreeks naar de pagina van de gebruiker gaan en hem/haar van daaruit toevoegen aan een groep.

source: If you want to add multiple users at once to a group though, you should go to the group's page and from there click the *add user* button.
de: Möchten Sie jedoch mehrere Benutzer auf einmal zu einer Gruppe hinzufügen, sollten Sie zur Seite der Gruppe wechseln und dort auf die Schaltfläche *Benutzer hinzufügen* klicken.
es: Sin embargo, si quiere añadir varios usuarios a la vez a un grupo, deberá acceder a la página del grupo y desde ahí hacer clic en el botón *Añadir usuario*.
fr: Toutefois, si vous souhaitez ajouter plusieurs utilisateurs à un groupe en une seule fois, vous devez vous rendre sur la page du groupe et cliquer sur le bouton *ajouter un utilisateur*.
it: Se invece desideri aggiungere più di un utente contemporaneamente, apri la pagina del gruppo e clicca sul pulsante *Aggiungi utente*.
nl: Wanneer u evenwel meerdere gebruikers tezelfdertijd wil toevoegen aan een groep, dient u naar de pagina van de groep te gaan en van daaruit klikken op de knop *voeg gebruiker toe*.

source: The group page
de: Die Seite Gruppe
es: Página de grupo
fr: La page du groupe
it: La pagina del gruppo
nl: De pagina van de groep

source: This will bring up a list of all of your portal's users. Select the ones you're interested in, click the *add users to the group* button and you're done!
de: Dies zeigt eine Liste aller Benutzer Ihres Portals an. Sie brauchen nur die entsprechenden Benutzer auszuwählen und auf die Schaltfläche *Benutzer zur Gruppe hinzufügen* zu klicken, fertig!
es: Acto seguido aparecerá una lista de todos los usuarios del portal. Seleccione los que desee, haga clic en el botón *Añadir usuarios al grupo*, ¡y ya ha terminado!
fr: Une liste de tous les utilisateurs de votre portail s'affichera alors. Sélectionnez ceux qui vous intéressent, cliquez sur le bouton *ajouter des utilisateurs au groupe* et c'est terminé !
it: Verrà visualizzato un elenco con tutti gli utenti del tuo portale: seleziona quelli che ti interessano, clicca su **Aggiungi utenti al gruppo** e l'operazione è completata.
nl: Dit geeft een lijst met alle gebruikers van uw portaal. Selecteer diegene waarin u ge√Ønteresseerd bent, klik op de knop *voeg gebruikers toe aan de groep* en klaar is Kees!

source: The *add members* popup window
de: Das Popupfenster *Mitglieder hinzufügen*
es: Ventana emergente para *añadir miembros*
fr: La fenêtre contextuelle **ajouter des membres**
it: Finestra popup di *aggiunta dei membri*
nl: Het popup-venster *voeg leden toe*

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Adding members to a group from the group's page is a direct action that doesn't require a save. When the modal window closes, the selected users will have become group members.
de: Das Hinzufügen von Mitgliedern zu einer Gruppe von der Seite der Gruppe aus ist eine direkte Aktion, die kein Speichern erfordert. Beim Schließen des Modus-Fensters werden die ausgewählten Benutzer zu Gruppenmitgliedern geworden sein.
es: Añadir miembros a un grupo desde la página del grupo es una acción directa que no solicita la confirmación para guardar los cambios. Cuando se cierre la ventana modal, los usuarios seleccionados se habrán convertido en miembros del grupo.
fr: L'ajout de membres à un groupe depuis la page du groupe est une action directe ne nécessitant pas d'enregistrement. Lorsque la fenêtre modale se ferme, les utilisateurs sélectionnés seront membres du groupe.
it: L'aggiunta dei membri effettuata dalla pagina del gruppo è un'azione diretta che non richiede il salvataggio. Alla chiusura della finestra modale, gli utenti selezionati saranno a tutti gli effetti membri del gruppo.
nl: Het toevoegen van leden aan een groep vanuit de pagina van de groep is een rechtstreekse actie die niet moet worden opgeslagen. Wanneer het modaal venster sluit, zullen de geselecteerde gebruikers leden van de groep geworden zijn.
