Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/01_managing_users_and_groups/users.po
Languages: de, es, fr, nl

source: Managing users
de: Verwalten von Benutzern
es: Administrar los usuarios
fr: Gérer les utilisateurs
nl: Gebruikers beheren

source: Now that you've set up your :doc:`portal's security policy </configuring_domain/01_managing_security/portal>`, people are registering and becoming full-fledged users. Unless your portal is closed to anonymous users, this new status is not changing anything for them. They can still see the same data and a subject to the same quotas as before.
de: Nachdem Sie die :doc:`Sicherheitsrichtlinie für das Portal </configuring_domain/01_managing_security/portal>` eingerichtet haben, registrieren sich Personen und werden vollwertige Benutzer. Sofern Ihr Portal anonymen Benutzern nicht verwehrt bleibt, ändert dieser neue Status nichts für sie. Sie sehen nach wie vor die gleichen Daten und unterliegen den gleichen Quoten wie zuvor.
es: Una vez configurada la :doc:`directiva de seguridad del portal </configuring_domain/01_managing_security/portal>`, los visitantes se registran y pasan a ser realmente usuarios. Salvo que el portal se cierre a los usuarios anónimos, este nuevo estatus no les supone ningún cambio. Pueden seguir viendo los mismos datos y están sujetos a las mismas cuotas que antes.
fr: Maintenant que vous avez configuré la :doc:`politique de sécurité du portail </configuring_domain/01_managing_security/portal>`, des visiteurs commencent à s'enregistrer et deviennent des utilisateurs à part entière. À moins d'avoir fermé votre portail aux utilisateurs non authentifiés, ce nouveau statut ne change rien pour eux. Ils peuvent toujours consulter les mêmes données et sont soumis aux mêmes quotas qu'auparavant.
nl: Nu u uw :doc:`veiligheidsbeleid voor het portaal </configuring_domain/01_managing_security/portal>` heeft ingesteld, registeren mensen zich en worden ze doorwinterde gebruikers. Tenzij uw portaal afgesloten is voor anonieme gebruikers, verandert deze nieuwe status voor hen niets. Ze kunnen nog steeds dezelfde data zien en zijn onderworpen aan dezelfde quota's als daarvoor.

source: Inviting users to the portal
de: Benutzer zum Portal einladen
es: Invitar usuarios al portal

source: You can invite users to your portal using their email addresses.
de: Sie können Benutzer über ihre E-Mail-Adressen zu Ihrem Portal einladen.
es: Puede invitar usuarios al portal utilizando sus direcciones de correo electrónico.

source: Note
de: Hinweis
es: Nota

source: Only domain administrators or users with the *Edit domain properties* permission can invite users.
de: Nur Domain-Administratoren oder Benutzer mit der Berechtigung *Domain-Eigenschaften bearbeiten* können Benutzer einladen.
es: Solo los administradores del dominio o los usuarios con el permiso *Editar propiedades de dominio* pueden invitar usuarios.

source: From the back office, go to **Users & groups > Users**.
de: Öffnen Sie im Backoffice den Bereich **Benutzer und Gruppen > Benutzer**.
es: En el back office, vaya a **Usuarios y grupos > Usuarios**.

source: Click **Invite users**.
de: Klicken Sie auf **Benutzer einladen**.
es: Haga clic en **Invitar usuarios**.

source: From tha dialog box that opens, enter the email addresses of the new users in the **Email addresses** text box.
de: Geben Sie in dem sich öffnenden Dialogfeld die E-Mail-Adressen der neuen Benutzer in das Textfeld **E-Mail-Adressen** ein.
es: En el cuadro de diálogo que se abre, Especifique las direcciones de correo electrónico de los nuevos usuarios en el cuadro de texto **Direcciones de correo electrónico**.

source: The users are added to your portal. They will receive an email to create or validate their account. You can now give them the desired permissions and add them to groups.
de: Die Benutzer werden zu Ihrem Portal hinzugefügt. Sie erhalten eine E-Mail, um ihr Konto zu erstellen oder zu bestätigen. Sie können ihnen nun die gewünschten Berechtigungen erteilen und sie zu Gruppen hinzufügen.
es: Los usuarios se añaden al portal. Recibirán un correo electrónico para crear o validar la cuenta. A continuación, ya puede darles los permisos deseados y añadirlos a los grupos.

source: Permissions
de: Berechtigungen
es: Permisos
nl: Toelatingen

source: You can now give users permissions to extend what they can do. You can do so either on the users' index page or directly on the single user management page, both accessible through the **Users & groups > Users** section in your back office.
de: Sie können nun Benutzern Berechtigungen erteilen, um ihre Möglichkeiten zu erweitern. Dies können Sie entweder auf der Benutzerindexseite oder direkt auf der Verwaltungsseite des einzelnen Benutzers vornehmen. Auf beide greifen Sie in Ihrem Backoffice über den Bereich **Benutzer + Gruppen / Benutzer** zu.
es: Ahora puede dar permisos a los usuarios para ampliar las tareas que pueden llevar a cabo. Puede hacerlo en la página de índice de usuarios o directamente en la página de administración de usuarios, a las cuales se accede a través de la sección **Usuarios y grupos > Usuarios** del back office.

source: Permissions each affect an independent part of your portal so that by looking at a user's permissions list, you know what they can do. Each permission has its own category, symbolized by an icon and a tag color.
de: Berechtigungen wirken sich jeweils auf einen unabhängigen Teil Ihres Portals aus. So können Sie durch die Einsicht in die Liste der Benutzerberechtigungen genau ermitteln, was ein Benutzer tun kann. Jede Berechtigung hat eine eigene Kategorie, die durch ein Symbol und eine Tag-Farbe dargestellt wird.
es: Los permisos afectan a partes independientes del portal, de modo que al ver la lista de permisos de un usuario sabrá qué tareas puede realizar. Cada uno de los permisos tiene su propia categoría, simbolizada mediante un icono y una etiqueta de color.

source: Important
de: Wichtig
es: Importante

source: Authenticated users can manage and generate their own API keys. API keys inherit all permissions granted to the user for which it has been created. That's why administrators should be cautious with the permissions they grant to users.
de: Authentifizierte Benutzer können ihre eigenen API-Schlüssel verwalten und generieren. API-Schlüssel übernehmen alle Berechtigungen des Benutzers, für den sie erstellt wurden. Deshalb sollten Administratoren vorsichtig mit den Berechtigungen sein, die sie Benutzern gewähren.
es: Los usuarios autenticados pueden gestionar y generar sus propias claves de API. Las claves de API heredan todos los permisos concedidos al usuario para el cual se han creado. Por eso los administradores deben tener cuidado con los permisos que conceden a los usuarios.

source: Administrators cannot revoke users' API keys at the moment. If you observe unauthorized usage of an API key or if an API key gets exposed, it is recommended to contact Opendatasoft support to get help identifying and revoking the leaked API key.
de: Administratoren können die API-Schlüssel von Benutzern derzeit nicht widerrufen. Falls Sie eine unberechtigte Verwendung eines API-Schlüssels feststellen oder ein API-Schlüssel ungewollt preisgegeben wird, sollten Sie den Support von Opendatasoft kontaktieren, um Hilfe bei der Ermittlung und dem Widerruf des entsprechenden API-Schlüssels zu erhalten.
es: Los administradores pueden revocar las claves de API de los usuarios al instante. SI observa un uso no autorizado de una clave de API o una clave de API queda expuesta a algún riesgo, es recomendable contactar con el soporte de Opendatasoft para ayudar a identificar y revocar la clave de API en cuestión.

source: Dataset permissions
de: Datensatzberechtigungen
es: Permisos de conjunto de datos
fr: Permissions relatives aux jeux de données
nl: Datasettoelatingen

source: Permission
de: Berechtigung
es: Permiso
nl: Toelating

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Browse all datasets
de: Alle Datensätze durchsuchen
es: Explorar todos los conjuntos de datos
fr: Consulter tous les jeux de données
nl: Alle datasets doorbladeren

source: The user may access all data on all published datasets, regardless of any security parameters set for this user or the datasets (for example, the user can access all restricted datasets). This permission on its own doesn't grant access to the back office.
de: Der Benutzer kann ungeachtet etwaiger Sicherheitsparameter auf sämtliche Daten aller veröffentlichter Datensätze zugreifen (z. B. kann der Benutzer auf alle eingeschränkten Datensätze zugreifen). Diese Berechtigung allein gewährt keinen Zugang zum Backoffice.
es: El usuario puede acceder a todos los datos de todos los conjuntos de datos publicados, independientemente de los parámetros de seguridad establecidos para ese usuario o los conjuntos de datos (por ejemplo, el usuario puede acceder a todos los conjuntos de datos restringidos). Este permiso por sí solo no concede acceso al back office.
fr: L'utilisateur peut accéder à tous les jeux de données publiés, quels que soient les paramètres de sécurité définis pour cet utilisateur ou les jeux de données (par exemple, l'utilisateur peut accéder à tous les jeux de données restreints). La permission en elle-même n'accorde pas l'accès au backoffice.
nl: De gebruiker kan toegang hebben tot alle data op alle gepubliceerde datasets, ongeacht de veiligheidsparameters die voor deze gebruiker of de datasets zijn ingesteld (bijvoorbeeld, de gebruiker heeft toegang tot alle beperkte datasets). Deze toelating op zich verleent geen toegang tot de back office.

source: Create new datasets
de: Neue Datensätze erstellen
es: Crear conjuntos de datos nuevos
fr: Créer des jeux de données
nl: Nieuwe datasets aanmaken

source: The user may create new datasets (but not publish them, to do so, the Publish own datasets permission is required), within limits defined by the quotas. **This permission grants access to the Catalog section of the back office.**
de: Der Benutzer kann innerhalb der durch die Quoten festgelegten Grenzen neue Datensätze erstellen (aber nicht veröffentlichen, hierzu ist die Berechtigung "Eigene Datensätze veröffentlichen" erforderlich). **Diese Berechtigung gewährt Zugriff auf den Katalogbereich des Backoffice.**
es: El usuario puede crear nuevos conjuntos de datos (pero no publicarlos, para lo cual se necesita el permiso Publicar conjuntos de datos propios), dentro de los límites definidos por las cuotas. **Este permiso concede acceso a la sección Catálogo del back office.**

source: Edit all datasets
de: Alle Datensätze bearbeiten
es: Editar todos los conjuntos de datos
fr: Éditer tous les jeux de données
nl: Alle datasets bewerken

source: The user may edit all existing datasets. **This permission grants access to the Catalog section of the back office.**
de: Der Benutzer kann alle vorhandenen Datensätze bearbeiten. **Diese Berechtigung gewährt Zugriff auf den Katalogbereich des Backoffice.**
es: El usuario puede editar todos los conjuntos de datos existentes. **Este permiso concede acceso a la sección Catálogo del back office.**
fr: L'utilisateur peut modifier tous les jeux de données existants. **Cette permission accorde l'accès à la section Catalogue du backoffice.**
nl: De gebruiker kan alle bestaande datasets bewerken. **Deze toelating verleent toegang tot de rubriek Catalogus van de back office.**

source: Manage own datasets' security
de: Sicherheit eigener Datensätze verwalten
es: Administrar la seguridad del conjunto de datos propio
fr: Gérer la sécurité de ses propres jeux de données
nl: De veiligheid van eigen datasets beheren

source: The user may manage security options and parameters (users able to access the datasets, visible records, etc.) for the datasets they have permission to edit. This permission on its own doesn't grant access to the back office.
de: Der Benutzer kann die Sicherheitsoptionen/-parameter (Benutzer, die auf Datensätze zugreifen dürfen, sichtbare Datensätze usw.) für die Datensätze verwalten, zu deren Bearbeitung sie berechtigt sind. Diese Berechtigung allein gewährt keinen Zugang zum Backoffice.
es: El usuario puede gestionar las opciones y los parámetros de seguridad (usuarios con acceso a conjuntos de datos, registros visibles, etc.) para los conjuntos de datos que tiene permiso para editar. Este permiso por sí solo no concede acceso al back office.

source: Publish own datasets
de: Eigene Datensätze veröffentlichen
es: Publicar conjuntos de datos propios
fr: Publier ses propres jeux de données
nl: Eigen datasets publiceren

source: The user can publish or republish the datasets they have permission to edit. This permission on its own doesn't grant access to the back office.
de: Der Benutzer kann Datensätze, zu deren Bearbeitung er berechtigt ist, veröffentlichen oder erneut veröffentlichen. Diese Berechtigung allein gewährt keinen Zugang zum Backoffice.
es: El usuario puede publicar o volver a publicar los conjuntos de datos que tiene permiso para editar. Este permiso por sí solo no concede acceso al back office.

source: These are general permissions that apply to a user with regard to the portal, but a user can also get :doc:`permissions for individual datasets </publishing_data/09_managing_dataset_security/security>`.
de: Dies sind allgemeine Berechtigungen, die für einen Benutzer im Hinblick auf das Portal gelten. Einem Benutzer können jedoch auch :doc:`Berechtigungen für einzelne Datensätze </publishing_data/09_managing_dataset_security/security>` erteilt werden.
es: Son permisos generales que se aplican a un usuario en relación con el portal, pero un usuario también puede obtener :doc:`permisos para conjuntos de datos individuales </publishing_data/09_managing_dataset_security/security>`.

source: Page permissions
de: Seitenberechtigungen
es: Permisos de página
fr: Permissions associées à une page
nl: Paginatoelatingen

source: Create new pages
de: Neue Seiten erstellen
es: Crear páginas nuevas
fr: Créer des pages
nl: Nieuwe pagina's aanmaken

source: The user may create new pages.
de: Der Benutzer kann neue Seiten erstellen.
es: El usuario puede crear páginas nuevas.
fr: L'utilisateur peut créer des pages.
nl: De gebruiker kan nieuwe pagina's aanmaken.

source: **This permission grants access to the Pages section of the back office.** It also allows managing assets.
de: **Diese Berechtigung gewährt Zugriff auf den Seitenbereich des Backoffice.** Sie ermöglicht außerdem die Verwaltung von Assets.
es: **Este permiso concede acceso a la sección Páginas del back office.** También permite gestionar activos.

source: Edit all pages
de: Alle Seiten bearbeiten
es: Editar todas las páginas
fr: Éditer toutes les pages
nl: Alle pagina's bewerken

source: The user may edit and delete all existing pages.
de: Der Benutzer kann alle vorhandenen Seiten bearbeiten und löschen.
es: El usuario puede editar y suprimir todas las páginas existentes.
fr: L'utilisateur peut modifier et supprimer toutes les pages existantes.
nl: Deze gebruiker kan alle bestaande pagina's bewerken en verwijderen.

source: Browse all pages
de: Alle Seiten durchsuchen
es: Explorar todas las páginas
fr: Consulter toutes les pages
nl: Alle pagina's doorlopen

source: The user may access all pages, regardless of any security parameters set for this user or the pages (for example, the user can access all private pages). This permission on its own doesn't grant access to the back office.
de: Der Benutzer kann ungeachtet etwaiger Sicherheitsparameter für diesen Benutzer oder die Seiten auf alle Seiten zugreifen (so kann der Benutzer auf alle privaten Seiten zugreifen). Diese Berechtigung allein gewährt keinen Zugang zum Backoffice.
es: El usuario puede acceder a todas las páginas, independientemente de los parámetros de seguridad establecidos para ese usuario o las páginas (por ejemplo, el usuario puede acceder a todas las páginas privadas). Este permiso por sí solo no concede acceso al back office.
fr: L'utilisateur peut accéder à toutes les pages, quels que soient les paramètres de sécurité définis pour cet utilisateur ou les pages (par exemple, l'utilisateur peut accéder à toutes les pages privées). La permission en elle-même n'accorde pas l'accès au backoffice.
nl: De gebruiker kan toegang hebben tot alle pagina's, ongeacht de eventuele veiligheidsparameters die voor deze gebruiker of deze pagina's zijn ingesteld (bijvoorbeeld, de gebruiker kan toegang hebben tot alle privépagina's). Deze toelating op zich verleent geen toegang tot de back office.

source: Manage own page's security
de: Sicherheit eigener Seiten verwalten
es: Administrar la seguridad de la página propia
fr: Gérer la sécurité de sa propre page
nl: De veiligheid van zijn eigen pagina's beheren

source: The user may manage security options and parameters (:doc:`access policy, page-level permissions on defined users and groups</creating_content/02_managing_page_security/managing_page_security>`) for the pages they have the permission to edit. This permission on its own doesn't grant access to the back office.
de: Der Benutzer kann die Sicherheitsoptionen/-parameter (:doc:`Zugriffsrichtlinien, Berechtigungen auf Seitenebene für festgelegte Benutzer und Gruppen</creating_content/02_managing_page_security/managing_page_security>`) für die Datensätze verwalten, zu deren Bearbeitung er berechtigt ist. Diese Berechtigung allein gewährt keinen Zugang zum Back-Office.
es: El usuario puede gestionar las opciones y los parámetros de seguridad (:doc:`directiva de acceso, permisos a nivel de página sobre usuarios y grupos definidos</creating_content/02_managing_page_security/managing_page_security>`) para las páginas que tiene permiso para editar. Este permiso por sí solo no concede acceso al back office.

source: Other permissions
de: Sonstige Berechtigungen
es: Otros permisos
fr: Autres permissions
nl: Andere toelatingen

source: Edit domain properties
de: Domaineigenschaften bearbeiten
es: Editar propiedades de dominio
fr: Éditer les propriétés du domaine
nl: Domeineigenschappen bewerken

source: The user may configure all options and parameters in the Assets, Look & feel (except for the Theme subsection), Users & groups, and Configuration sections of the back office.
de: Der Benutzer kann alle Optionen und Parameter in den Backoffice-Bereichen "Objekte", "Aussehen + Eindruck" (mit Ausnahme des Unterabschnitts "Thema"), "Benutzer + Gruppen" sowie "Konfiguration" einstellen.
es: El usuario puede configurar todas las opciones y los parámetros de las secciones Activos, Apariencia (excepto la subsección Tema), Usuarios y grupos, y Configuración del back office.

source: **This permission grants access to the Assets, Look & feel (Branding, Data visualizations, Navigation and Dataset themes), Users & groups, Configuration and License sections of the back office.**
de: **Diese Berechtigung verleiht Zugriff auf die Backoffice-Bereiche "Objekte", "Aussehen + Eindruck" (Branding, Datenvisualisierungen, Navigation und Datensatz-Themen) "Benutzer + Gruppen", "Konfiguration" und "Lizenz".**
es: **Este permiso concede acceso a las secciones Activos, Apariencia (Personalización de marca, Visualizaciones de datos, Navegación y Temas de conjunto de datos), Usuarios y grupos, Configuración y Licencia del back office.**
fr: **Cette permission accorde l'accès aux sections Ressources, Apparence (Personnalisation, Visualisations de données, Navigation et Thèmes de jeu de données), Utilisateurs et groupes, Configuration et Licence du backoffice.**
nl: **Deze toelating verleent toegang tot de rubrieken Activa, Look & Feel (thema's Branding, Dataweergaves, Navigatie en Dataset), Gebruikers & Groepen, Configuratie en Licentie van de back office.**

source: Manage the domain theme
de: Verwalten des Domain-Themas
es: Administrar el tema del dominio
fr: Gérer le thème du domaine
nl: Het domeinthema beheren

source: The user may configure all options and parameters in the Theme and Dataset themes subsections of the Look & feel section of the back office. To access the other subsections (Branding, Data visualizations, and Navigation), the Edit domain properties permission is required.
de: Der Benutzer kann alle Optionen und Parameter der Unterbereiche "Thema" und "Datensatz-Themen" im Backoffice-Bereich "Aussehen + Eindruck" konfigurieren. Zum Zugriff auf andere Unterbereiche (Branding, Datenvisualisierung und Navigation) ist die Berechtigung "Domaineigenschaften bearbeiten" erforderlich.
es: El usuario puede configurar todas las opciones y los parámetros de las subsecciones Tema y Temas de conjunto de datos de la sección Apariencia del back office. Para acceder a las demás subsecciones (Personalización de marca, Visualizaciones de datos y Navegación), se necesita el permiso Editar propiedades de dominio.

source: **This permission grants access to the Look & feel (Theme) section of the back office.** It also allows managing assets.
de: **Diese Berechtigung gewährt Zugriff auf den Backoffice-Bereich "Aussehen + Eindruck" (Thema).** Sie ermöglicht auch die Verwaltung von Assets.
es: **Este permiso concede acceso a la sección Apariencia (Tema) del back office.** También permite gestionar activos.

source: Browse analytics
de: Analysen durchsuchen
es: Explorar análisis
fr: Consulter les statistiques
nl: Doorblader analytische gegevens

source: The user may access all analytics dashboards, both at the domain level and at the dataset level.
de: Der Benutzer kann auf alle Analyse-Dashboards zugreifen, sowohl auf Domain- als auch auf Datensatzebene.
es: El usuario puede acceder a todos los paneles de análisis, tanto a nivel de dominio como a nivel de conjunto de datos.

source: **This permission grants access to the Analytics section of the back office.**
de: **Diese Berechtigung gewährt Zugriff auf den Analysebereich des Back-Office.**
es: **Este permiso concede acceso a la sección Análisis del back office.**
fr: **Cette permission accorde l'accès à la section Statistiques du backoffice.**
nl: **Deze toelating verleent toegang tot de rubriek Analyses van de back office.**

source: Manage all reuses
de: Alle Weiterverwendungen verwalten
es: Administrar todas las reutilizaciones
fr: Gérer toutes les réutilisations
nl: Alle hergebruiken beheren

source: The user may see, approve, reject, and delete all reuse submissions on the portal.
de: Der Benutzer kann alle Weiterverwendungsübermittlungen anzeigen, genehmigen, ablehnen oder löschen.
es: El usuario puede consultar, aprobar, rechazar y suprimir todos los envíos de reutilización del portal.

source: **This permission grants access to the Reuses section of the back office.**
de: **Diese Berechtigung gewährt Zugriff auf die Weiterverwendungsfunktion des Back-Office.**
es: **Este permiso concede acceso a la sección Reutilizaciones del back office.**
fr: **Cette permission accorde l'accès à la section Réutilisation du backoffice.**
nl: **Deze toelating verleent toegang tot de rubriek Hergebruiken van de back office.**

source: Manage all subdomains
de: Alle Subdomains verwalten
es: Administrar todos los subdominios
fr: Gérer tous les sous-domaines
nl: Alle subdomeinen beheren

source: The user may edit, create, and delete all subdomains (:doc:`if subdomains are enabled on the portal </managing_domain/02_managing_subdomains/index>`).
de: Der Benutzer kann Subdomains erstellen sowie alle Subdomains bearbeiten und löschen (:doc:`wenn Subdomains für das Portal aktiviert sind </managing_domain/02_managing_subdomains/index>`).
es: El usuario puede editar, crear y suprimir todos los subdominios (:doc:`si los subdominios está activados en el portal </managing_domain/02_managing_subdomains/index>`).
