Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/01_managing_users_and_groups/users.po
Languages: de, es, fr, nl

source: **This permission grants access to the Subdomain section of the back office.**
de: **Diese Berechtigung gewährt Zugriff auf den Subdomain-Bereich des Back-Office.**
es: **Este permiso concede acceso a la sección Subdominio del back office.**
fr: **Cette permission accorde l'accès à la section Sous-domaine du backoffice.**
nl: **Deze toelating verleent toegang tot de rubriek Subdomein van de back office.**

source: Quotas
de: Quoten
es: Cuotas

source: To avoid having a user use up all of your license usage quotas, you can :doc:`set up default quotas for users </managing_domain/04_monitoring_license_and_quotas/quotas>`. However, you can override the general quotas given to everybody with specific values tailored to a single profile for each of the 3 quota types.
de: Um zu vermeiden, dass ein Benutzer all Ihre Lizenznutzungsquoten beansprucht, können Sie :doc:`Standardquoten für Benutzer einrichten </managing_domain/04_monitoring_license_and_quotas/quotas>`. Diese allen zugeordneten allgemeinen Quoten können Sie jedoch auch mit bestimmten, auf das jeweilige Profil zugeschnittenen Werten für jeden der drei Quotentypen überschreiben.
es: Para evitar que un usuario utilice todas las cuotas de uso de su licencia, puede :doc:`configurar cuotas predeterminadas para los usuarios </managing_domain/04_monitoring_license_and_quotas/quotas>`. No obstante, puede sobrescribir las cuotas generales concedidas a todos con valores específicos ajustados a un perfil determinado para cada uno de los 3 tipos de cuotas.

source: Since quotas can also be defined at the group level, users are inheriting from 3 settings.
de: Da Quoten auch auf der Gruppenebene definiert werden können, erben Benutzer von 3 Einstellungen.
es: Puesto que las cuotas también se pueden definir a nivel de grupo, los usuarios las heredan de una triple configuración.
fr: Étant donné que les quotas peuvent également être définis au niveau du groupe, les utilisateurs héritent de 3 paramètres.
nl: Aangezien quota's ook gedefinieerd kunnen worden op groepsniveau, erven gebruikers uit 3 instellingen.

source: license quotas (for the whole portal)
de: Lizenzquoten (für das gesamte Portal)
es: Cuotas de licencia (para todo el portal)
fr: quotas de la licence (pour l'ensemble du portail)
nl: licentiequota's (voor het volledige portaal)

source: default quotas (for each user indifferently)
de: Standardquoten (für alle Benutzer gleich)
es: Cuotas predeterminadas (para cada uno de los usuarios indiferentemente)
fr: quotas par défaut (pour chaque utilisateur sans distinction)
nl: standaard quota's (voor elke gebruiker afzonderlijk)

source: group quotas (for each member)
de: Gruppenquoten (für jedes Mitglied)
es: Cuotas de grupo (para cada uno de los miembros)
fr: quotas du groupe (pour chaque membre)
nl: groepsquota's (voor elk lid)

source: The value that applies to the given is calculated as such:
de: Der Wert, der für das Gegebene gilt, wird als solcher berechnet:
es: El valor que se aplica a un usuario determinado se calcula así:
fr: La valeur appliquée est calculée comme suit :
nl: De waarde die toegepast wordt op het welbepaalde quotum wordt als dusdanig berekend:

source: If there is a specific value for the user, this value applies.
de: Gibt es einen spezifischen Wert für den Benutzer, gilt dieser.
es: Si hay un valor específico para el usuario, se aplica este valor.
fr: Si une valeur spécifique est définie pour l'utilisateur, elle est appliquée.
nl: Indien er een specifieke waarde is voor de gebruiker, is deze waarde van toepassing.

source: If there is no specific value for the user, but the user is a member of at least one group with a specific value, then the maximum of all group values applies.
de: Gibt es keinen spezifischen Wert für den Benutzer, der jedoch Mitglied mindestens einer Gruppe mit einem spezifischen Wert ist, gilt der höchste aller Gruppenwerte.
es: Si no hay un valor específico para el usuario pero el usuario es miembro de como mínimo un grupo con un valor específico, se aplica el máximo de todos los valores de grupo.

source: If there no specific value and no group value, then the default security value for non-anonymous users applies.
de: Gibt es weder einen spezifischen Wert noch einen Gruppenwert, gilt der Standardsicherheitswert für nicht anonyme Benutzer.
es: Si no hay un valor específico ni un valor de grupo, se aplica el valor de seguridad predeterminado para los usuarios no anónimos.
fr: Si aucune valeur spécifique ni aucune valeur de groupe n'est définie, alors la valeur de sécurité par défaut pour les utilisateurs non authentifiés est appliquée.
nl: Indien er geen specifieke waarde en geen groepswaarde is, dan is de standaard veiligheidswaarde voor niet-anonieme gebruikers van toepassing.

source: The applied values are then capped at the license value.
de: Die geltenden Werte erhalten dann den Lizenzwert als Obergrenze.
es: A continuación, los valores aplicados se limitan como máximo al valor de la licencia.

source: Since this is a bit difficult to remember, the interface includes a calculator showing you the license, default, and group values and dynamically computes the effective quota depending on the specific value you're setting up.
de: Da dies etwas schwierig zu behalten ist, bietet die Benutzeroberfläche einen Rechner, der die Lizenz-, Standard- und Gruppenwerte anzeigt und die effektive Quote je nach dem spezifischen Wert, den Sie einrichten, dynamisch berechnet.
es: Como es un poco difícil de recordar, la interfaz incluye una calculadora que muestra los valores de licencia, predeterminado y grupo, y calcula dinámicamente la cuota real según el valor específico configurado.

source: What is changing is that you can now give them permissions extending what they can do. You can do so either on the users' index page or directly on the single user management page, both accessible through the **Users & groups / Users** section in your backoffice.
fr: Ce qui change pour vous, c'est que vous pouvez désormais octroyer aux utilisateurs des permissions qui leur permettent d'effectuer davantage d'actions. Vous pouvez octroyer les permissions soit depuis la page d'index des utilisateurs, soit directement depuis la page de gestion d'un utilisateur en particulier. Ces deux pages sont accessibles depuis la section **Utilisateurs et groupes / Utilisateurs** de votre backoffice.
nl: Wat wel wijzigt, is dat u hen nu toelatingen kan geven, waardoor datgene wat ze kunnen doen wordt uitgebreid. U kan dit doen ofwel op de indexpagina van de gebruikers of rechtstreeks op de beheerpagina van één enkele gebruiker, die beide toegankelijk zijn via de sectie **Gebruikers & groepen / Gebruikers** in uw back-office.

source: Permissions each affect an independent part of your portal so that by looking at a user's permissions list you know exactly what he/she can do. Each permission has its own category, symbolized by an icon and a tag color.
fr: Chaque permission affecte une partie différente de votre portail. Ainsi, en examinant la liste des permissions d'un utilisateur, vous savez exactement ce qu'il est autorisé à faire. Chaque permission dispose de sa propre catégorie, représentée par une icône et une couleur de tag.
nl: Toelatingen hebben elk een impact op het onafhankelijke deel van uw portaal zodat, wanneer u naar de lijst met toelatingen van een gebruiker kijkt, u precies weet wat hij/zij kan doen. Elke toelating heeft zijn eigen categorie, die gesymboliseerd wordt door een pictogram en een tag-kleur.

source: The user may create new datasets (but not publish them, to do so the Publish own datasets permission is required), within the limits defined by the quotas. **This permission grants access to the Catalog section of the back office.**
fr: L'utilisateur peut créer des jeux de données (mais pas les publier ; pour ce faire, la permission Publier ses propres jeux de données est nécessaire), dans les limites définies par les quotas. **Cette permission accorde l'accès à la section Catalogue du backoffice.**
nl: De gebruiker kan nieuwe datasets aanmaken (maar ze niet publiceren. Daarvoor is de toelating "Publiceer eigen datasets" nodig), binnen de limieten zoals die bepaald zijn door de quota's. **Deze toelating verleent toegang tot de rubriek Catalogus van de back office.**

source: The user may manage security options and parameters (users able to access the datasets, visible records etc.) for the datasets they have to permission to edit. This permission on its own doesn't grant access to the back office.
fr: L'utilisateur peut gérer les paramètres et les options de sécurité (utilisateurs capables d'accéder aux jeux de données, enregistrements visibles, etc.) des jeux de données qu'il peut modifier. La permission en elle-même n'accorde pas l'accès au backoffice.
nl: De gebruiker kan veiligheidsopties en parameters beheren (gebruikers die toegang hebben tot de datasets, zichtbare records, enz.) voor de datasets waarvoor ze de toelating hebben ze te bewerken. Deze toelating op zich verleent geen toegang tot de back office.

source: The user can publish or republish the datasets they have the permission to edit. This permission on its own doesn't grant access to the back office.
fr: L'utilisateur peut publier ou republier les jeux de données qu'il peut modifier. La permission en elle-même n'accorde pas l'accès au backoffice.
nl: De gebruiker kan de datasets waarvoor hij toelating heeft deze te bewerken, publiceren of opnieuw publiceren. Deze toelating op zich verleent geen toegang tot de back office.

source: These are general permissions that apply to a user with regard to the portal, but user can also get :doc:`permissions for individual datasets </publishing_data/09_managing_dataset_security/security>`.
fr: Il s'agit de permissions générales qui s'appliquent à un utilisateur sur le portail, mais il est également possible d'octroyer à l'utilisateur des :doc:`permissions pour des jeux de données spécifiques </publishing_data/09_managing_dataset_security/security>`.
nl: Dit zijn algemene toelatingen die van toepassing zijn op een gebruiker met betrekking tot het portaal, maar de gebruiker kan ook :doc:`toelatingen voor individuele datasets </publishing_data/09_managing_dataset_security/security>` krijgen.

source: **This permission grants access to the Pages section of the back office.** It also allows to manage assets.
fr: **Cette permission accorde l'accès à la section Pages du backoffice.** Elle offre également la possibilité de gérer des ressources.
nl: **Deze toelating verleent toegang tot de rubriek Pagina's van de back office.** Hij laat ook toe activa te beheren.

source: The user may manage security options and parameters (:doc:`access policy, page-level permissions on defined users and groups</creating_content/01_creating_content_page/managing_page_security>`) for the pages they have the permission to edit. This permission on its own doesn't grant access to the back office.
fr: L'utilisateur peut gérer les paramètres et les options de sécurité (:doc:`stratégie d'accès, permissions au niveau de la page sur les groupes et utilisateurs définis</creating_content/01_creating_content_page/managing_page_security>`) des pages qu'il peut modifier. La permission en elle-même n'accorde pas l'accès au backoffice.
nl: De gebruiker kan veiligheidsopties en parameters beheren (:doc:`toegangsbeleid, toelatingen op paginaniveau voor welbepaalde gebruikers en groepen</creating_content/01_creating_content_page/managing_page_security>`) voor de pagina's waarvoor hij toegang heeft deze te bewerken. Deze toelating op zich verleent geen toegang tot de back office.

source: The user may configure all options and parameters in the Assets, Look & feel (except for the Theme subsection), Users & groups and Configuration sections of the back office.
fr: L'utilisateur peut configurer tous les paramètres et options des sections Ressources, Apparence (sauf la sous-section Thème), Utilisateurs et groupe et Configuration du backoffice.
nl: De gebruiker kan alle opties en parameters in de rubrieken Activa, Look & Feel (behalve voor de subrubriek Thema), Gebruikers & Groepen en Configuratie van de back office configureren.

source: The user may configure all options and parameters in the Theme and Dataset themes subsections of the Look & feel section of the back office. To access the other subsections (Branding, Data visualizations and Navigation), the Edit domain properties permission is required.
fr: L'utilisateur peut configurer tous les paramètres et options dans les sous-sections Thème et Thèmes du jeu de données de la section Apparence du backoffice. Pour accéder aux autres sous-sections (Personnalisation, Visualisations de données et Navigation), la permission Éditer les propriétés du domaine est obligatoire.
nl: De gebruiker kan alle opties en parameters in de subrubrieken van de thema's Thema en Dataset van de rubriek Look & Feel van de back office configureren. Om toegang te hebben tot de andere subrubrieken (Branding, Dataweergaves en Navigatie), is toelating tot de eigenschappen van het domein Bewerken vereist.

source: **This permission grants access to the Look & feel (Theme and Dataset themes) section of the back office.** It also allows to manage assets.
fr: **Cette permission accorde l'accès à la section Apparence (Thème et Thèmes du jeu de données) du backoffice.** Elle offre également la possibilité de gérer des ressources.
nl: **Deze toelating verleent toegang tot de rubriek Look & Feel (thema's Thema en Dataset) van de back office.** Hij laat ook toe activa te beheren.

source: The user may access all analytics dashboards, both at the `domain level </monitoring_audience>`_ and at the dataset level.
fr: L'utilisateur peut accéder à tous les tableaux de bord de statistiques, tant au `niveau du domaine </monitoring_audience>`_ qu'au niveau du jeu de données.
nl: De gebruiker heeft toegang tot alle dashboards met analytische gegevens, zowel op `domeinniveau </monitoring_audience>`_ als op datasetniveau.

source: The user may see, approve, reject and delete all reuse submissions on the portal.
fr: L'utilisateur peut afficher, approuver, rejeter et supprimer toutes les réutilisations soumises sur le portail.
nl: De gebruiker kan alle ingediende hergebruiken op het portaal zien, goedkeuren, verwerpen en verwijderen.

source: The user may edit, create and delete all subdomains (:doc:`if subdomains are enabled on the portal </managing_domain/02_managing_subdomains/index>`).
fr: L'utilisateur peut modifier, créer et supprimer tous les sous-domaines (:doc:`si des sous-domaines sont disponibles sur le portail</managing_domain/02_managing_subdomains/index>`).
nl: De gebruiker kan alle subdomeinen bewerken, aanmaken en verwijderen (:doc:`indien subdomeinen geactiveerd zijn op het portaal </managing_domain/02_managing_subdomains/index>`).

source: In order to avoid having a user use up all of your license usage quotas, you can :doc:`set up default quotas for users </managing_domain/04_monitoring_license_and_quotas/quotas>`. However you can override the general quotas given to everybody with specific values tailored to a single profile for each of the 3 quota types.
fr: Afin d'éviter qu'un utilisateur ne consomme la totalité des quotas d'utilisation de votre licence, vous pouvez :doc:`configurer des quotas par défaut pour les utilisateurs </managing_domain/04_monitoring_license_and_quotas/quotas>`. Vous pouvez toutefois déroger aux quotas généraux appliqués à tous les utilisateurs en définissant des valeurs spécifiques adaptées à un profil en particulier pour chacun des 3 types de quotas.
nl: Om te vermijden dat een gebruiker al uw licentiegebruikquota's opgebruikt, kunt u :doc:`standaard quota's voor gebruikers instellen </managing_domain/04_monitoring_license_and_quotas/quotas>`. Wel kunt u de algemene quota's die gegeven zijn aan iedereen met specifieke waarden voor een enkel profiel voor elk van de 3 quotatypes overrulen.

source: If there is no specific value for the user, but the user is member of at least one group with a specific value, then the maximum of all group values apply.
fr: Si aucune valeur spécifique n'est définie pour l'utilisateur, mais si l'utilisateur est membre d'au moins un groupe auquel est appliquée une valeur spécifique, alors la plus haute de toutes les valeurs de groupe est appliquée.
nl: Indien er geen specifieke waarde is voor de gebruiker, maar de gebruiker lid is van minstens één groep met een specifieke waarde, dan is het maximum van alle groepswaarden van toepassing.

source: The applied values is then of course capped at the license value.
fr: Les valeurs appliquées sont bien entendu limitées par la valeur de la licence.
nl: De toegepaste waarden worden dan vanzelfsprekend begrensd tot de licentiewaarde.

source: Since this is a bit difficult to remember, the interface includes a calculator showing you the license, default and group values and dynamically computes the effective quota depending on the specific value you're setting up.
fr: Étant donné qu'il peut être difficile de se souvenir de ces règles, l'interface comprend un calculateur qui affiche la valeur de la licence, la valeur par défaut et la valeur du groupe. Il calcule de manière dynamique le quota appliqué en fonction de la valeur spécifique que vous êtes en train de configurer.
nl: Aangezien dit een beetje moeilijk is om te herinneren, omvat de interface een calculator die u de licentie-, standaard en groepswaarden toont en dynamisch het daadwerkelijke quotum berekend afhankelijk van de specifieke waarde die u instelt.
