Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/04_sharing_reusing_communicating/engaging.po
Languages: de, es, fr, it, nl

source: As the publisher of the dataset, you can access the list of all the feedback sent by your users. This is available in the "Feedback" tab of the back-office dataset page. From there, for each feedback sent, you can see the message, the suggested values, and you can archive it once you consider it handled.
de: Als Veröffentlicher des Datensatzes haben Sie Zugriff auf die Liste aller Feedbacks, die von Benutzern gesendet wurden. Sie werden auf der Back-Office-Datensatzseite im Register "Feedback" bereitgestellt. Hier können Sie für jedes gesendete Feedback die Nachricht sowie die vorgeschlagenen Werte anzeigen und archivieren, was Sie als erledigt betrachten.
es: Como publicador del conjunto de datos, usted puede acceder a la lista de todos los comentarios enviados por sus usuarios. Esta función está disponible en la ficha "Comentarios" de la página de conjunto de datos del back office. Desde ahí, para cada uno de los comentarios enviados, puede ver el mensaje y los valores sugeridos, y archivarlo cuando dé por finalizada su administración.
fr: En tant que producteur du jeu de données, vous aurez accès à la liste des contributions envoyées par vos utilisateurs dans l'onglet "Contributions" de la page back office du jeu de données. Cet onglet vous permet de consulter les messages et les valeurs suggérées, ainsi que d'archiver les messages une fois traités.
it: In quanto entità di pubblicazione del dataset, puoi consultare l'elenco di tutti i feedback inviati dagli utenti sull'interfaccia di back-office, nella scheda "Feedback" della pagina del dataset. Qui hai la possibilità di visualizzare tutti i messaggi e i valori suggeriti, oltre a poter archiviare i feedback che hai già letto.
nl: Als uitgever van de dataset heeft u toegang tot de lijst met alle feedback die door uw gebruikers is gestuurd. Deze is beschikbaar in het tabblad "Feedback" op de back-office datasetpagina. Van daaruit kan u voor elke gestuurde feedback het bericht, de gesuggereerde waarden zien en kan u deze archiveren eenmaal u van oordeel bent dat deze behandeld werd.

source: This is not a crowdsourcing feature; the suggestions are not automatically applied or added to the dataset. It is up to the dataset's publisher to make sure the relevant feedback is applied to the source.
de: Dies ist keine Crowdsourcing-Funktion. Die Vorschläge werden nicht automatisch angewendet oder zum Datensatz hinzugefügt. Es obliegt dem Datensatzveröffentlicher, die Anwendung des jeweiligen Feedbacks auf die Quelle sicherzustellen.
es: No se trata de una función de colaboración abierta distribuida; las sugerencias no se aplican o añaden automáticamente al conjunto de datos. El publicador del conjunto de datos es quien debe asegurarse de que se apliquen los comentarios relevantes en el conjunto de origen.
fr: Cette fonction n'est en aucun cas une fonction participative. Les suggestions ne sont pas appliquées ou ajoutées automatiquement au jeu de données, mais c'est bien le producteur du jeu de données qui s'assure de l'intégration des contributions pertinentes dans la source.
it: Questa funzionalità non è uno strumento di crowdsourcing: i suggerimenti non vengono applicati o aggiunti automaticamente al dataset e spetta all'entità di pubblicazione assicurarsi che i feedback ritenuti utili vengano integrati nell'origine.
nl: Dit is geen crowdsourcing-functie; de suggesties worden niet automatisch toegepast of toegevoegd aan de dataset. Het is de taak van de uitgever van de dataset om ervoor te zorgen dat de relevante feedback wordt toegepast op de bron.

source: The users can be allowed to comment on datasets. When activated, an additional tab "Comments" will be displayed in the dataset page.
es: Se puede permitir a los usuarios que comenten los conjuntos de datos. Si se activa esta función, se visualizará una ficha "Comentarios" adicional en la página de conjunto de datos.
it: È possibile autorizzare gli utenti a inserire commenti sui dataset. Una volta attivata questa opzione, nella pagina del dataset verrà visualizzata la scheda "Commenti".

source: To activate this feature, you need to configure a Disqus account to associate with the portal. Disqus is an external comment management system. You will need to set your account shortname and public key in the ``Configure`` menu, in the ``Social networks & sharing`` section.
es: Para activar esta función, tiene que configurar una cuenta Disqus asociada al portal. Disqus es un sistema de administración de comentarios externo. Tendrá que establecer el nombre corto y la clave pública de la cuenta en el menú ``Configurar``, dentro de la sección ``Redes sociales y uso compartido``.
it: Per attivare questa funzionalità, è necessario configurare un account Disqus da associare al portale. Disqus è un sistema esterno di gestione dei commenti. Vai nella sezione ``Social network e condivisione`` del menu ``Configura`` e inserisci lo shortname e la chiave pubblica del tuo account Disqus.

source: If you're unsure about how to get your Disqus credentials, you can follow the detailed steps detailed in the page.
es: Si no está seguro de cómo obtener las credenciales de Disqus, puede seguir los pasos detallados de la página.
it: Se hai bisogno di aiuto per ottenere le credenziali di accesso Disqus, segui i passaggi indicati nella pagina.

source: Enabling the reuse feature on your portal will display a new Reuses section at the bottom of the information tab on each dataset page. Additionally, this section will provide a form through which users can submit their reuses and will list all approved reuses.
es: Al activar la función de reutilización en el portal, se visualizará una sección Reutilizaciones nueva en la parte inferior de la ficha de información en cada una de las páginas de conjunto de datos. Esta sección contiene un formulario a través del cual los usuarios pueden enviar reutilizaciones, así como una lista de todas las reutilizaciones aprobadas.
it: Con l'attivazione della funzione di riutilizzo sul tuo portale, comparirà una sezione Riutilizzi in fondo alla scheda Informazioni di ogni dataset. Tale sezione permette agli utenti di inviare le loro proposte di riutilizzo e mostra l'elenco di quelle già approvate.

source: By default the portal will send a notification to the administrators for every reuse submission. You can add additional recipients email adresses in the form "New reuses notifications recipients".
es: De forma predeterminada, el portal enviará una notificación a los administradores para cada una de las reutilizaciones enviadas. Puede añadir direcciones de correo electrónico de destinatarios adicionales en el formulario "Destinatarios de notificaciones de reutilizaciones nuevas".
it: Per ogni richiesta di riutilizzo, il portale invierà automaticamente una notifica agli amministratori. Utilizzando il modulo "Destinatari delle notifiche sui nuovi riutilizzi", puoi inserire indirizzi e-mail aggiuntivi.

source: If you want to send these notifications only to one specific address, specify it in the form and check "Send notifications exclusively to these addresses". For example if you want to send these notifications only to opendata@yourdomain.com :
es: Si desea enviar estas notificaciones a una sola dirección específica, indíquela en el formulario y seleccione "Enviar notificaciones únicamente a estas direcciones". Por ejemplo, si tan solo desea enviar estas notificaciones a opendata@yourdominio.com:
it: Per inviare le notifiche a un unico indirizzo, inseriscilo nel modulo e seleziona la casella "Invia le notifiche esclusivamente a questi indirizzi". Ad esempio, se desideri inviare le notifiche solo a opendata@tuodominio.com:

source: Within the pages you create you can include a contact form that allows users to send a message to domain administrators. You can add recipients to these messages in the ``Social networks & sharing`` section, in the ``Configure`` menu.
es: En las páginas que cree puede incluir un formulario de contacto que permita a los usuarios enviar un mensaje a los administradores del dominio. Puede añadir destinatarios a estos mensajes en la sección ``Redes sociales y uso compartido``, dentro del menú ``Configurar``.
it: Nelle pagine create puoi includere un modulo di contatto che consenta agli utenti di inviare un messaggio agli amministratori del dominio. Puoi inserire i destinatari di questi messaggi nella sezione ``Social network e condivisione`` del menu ``Configura``.

source: Users on your portal can subscribe to any dataset they can access; by doing so, they opt-in to receive notifications that the dataset publisher can decide to send at any time, for example an information about a future schema change, or to indicate that the data has been updated recently.
es: Los usuarios del portal pueden suscribirse a cualquier conjunto de datos al cual tengan acceso; de este modo, optan por recibir las notificaciones que el publicador del conjunto de datos decida enviar en cualquier momento, por ejemplo, para informar de un cambio de esquema futuro o una actualización reciente de los datos.
it: Gli utenti del tuo portale possono iscriversi a qualunque dataset a cui hanno accesso e ricevere così le notifiche inviate dalla sua entità di pubblicazione, ad esempio per segnalare la futura modifica di uno schema o il recente aggiornamento dei dati.

source: The button is only available to users who are logged on the portal using an account. If you want to use this feature on an open data portal for example, you may want to allow users to sign up on your portal.
es: El botón solo está disponible para los usuarios que han iniciado la sesión en el portal utilizando una cuenta. Si desea utilizar esta función en un portal de datos abiertos, por ejemplo, puede que le interese permitir a los usuarios registrarse en el portal.
it: Il pulsante di iscrizione è disponibile solo per gli utenti che hanno effettuato l'accesso al portale tramite il proprio account. Se desideri utilizzare questa funzionalità in un portale open data, dovrai autorizzare gli utenti a registrarsi sul tuo portale.

source: As a dataset publisher, you can see the list of users subscribed to your dataset from its back-office configuration page, using the "Subscribers" tab which appears if you have at least one subscriber on the dataset. From there, you can also send a message to all the users who subscribed to this dataset.
es: Como publicador de un conjunto de datos, usted puede ver la lista de usuarios suscritos al conjunto de datos desde la página de configuración del back office, por medio de la ficha "Suscriptores" que le aparece si tiene al menos un suscriptor en el conjunto de datos. Desde ahí, también puede enviar un mensaje a todos los usuarios suscritos a este conjunto de datos.
it: In quanto entità di pubblicazione di un dataset, puoi consultare l'elenco degli utenti iscritti nella pagina di configurazione dell'interfaccia di back-office, nella scheda "Iscritti" che viene visualizzata quando il dataset possiede almeno un iscritto. Qui hai anche la possibilità di inviare un messaggio a tutti gli utenti che hanno aderito.

source: It is advised to warn your subscribers in advance for any change that may impact any of their reuse, such as a change in the schema (renaming an existing field, removing a field) that may cause issues with existing reuses, or an update of the data itself, if it is not updated very frequently.
es: Se recomienda avisar previamente a los suscriptores acerca de cualquier cambio que pueda afectar a sus reutilizaciones, como un cambio en el esquema (cambio de nombre de un campo existente o eliminación de un campo) que pueda ocasionar problemas con las reutilizaciones existentes, o una actualización de los datos en sí, si no se actualizan con mucha frecuencia.
it: Ti consigliamo di avvisare sempre in anticipo gli iscritti in caso di modifiche che potrebbero avere un impatto sul loro riutilizzo. Operazioni come la modifica dello schema, ad esempio se rinomini o rimuovi un campo esistente, o l'aggiornamento sporadico dei dati potrebbero creare problemi ai riutilizzi di un dataset.

source: This feature is currently in beta, and is not available by default. Please contact us if you would like to try this feature on your own portal.
es: Esta función se encuentra en fase beta y no está disponible de forma predeterminada. Póngase en contacto con nosotros si desea probar esta función en su portal.
it: Questa funzionalità è ancora in versione beta e non è disponibile in modo predefinito. Se desideri provarla sul tuo portale, non esitare a contattarci.

source: Once the option is active and the dataset is published again, your users will be able to send feedback on your dataset, either for a specific record, or to suggest a new record, by clicking on the little chat bubble in the table view.
es: Una vez que la opción esté activa y el conjunto de datos vuelva a publicarse, los usuarios podrán enviar comentarios en el conjunto de datos, acerca de un registro específico o también para sugerir un registro nuevo, haciendo clic en la burbuja de chat de la vista de tabla.
it: Una volta attivata questa opzione e ripubblicato il dataset in questione, i tuoi utenti potranno inviare feedback sui singoli record o suggerire nuovi record cliccando sulle nuvolette disponibili nella visualizzazione Tabella.

source: Doing so will open a form where the user can write a message, and optionally suggest new values.
es: Al realizar esta acción, se abrirá un formulario en que el usuario puede escribir un mensaje y, si lo desea, sugerir valores nuevos.
it: Verrà visualizzato un modulo tramite il quale l'utente potrà inviare un messaggio ed eventualmente suggerire nuovi valori.
