Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/04_sharing_reusing_communicating/engaging.po
Languages: de, es, fr, it, nl

source: Engaging users
de: Benutzer einbeziehen
es: Participación de los usuarios
fr: Faire participer les utilisateurs
it: Partecipazione degli utenti
nl: Gebruikers engageren

source: Comments
de: Kommentare
es: Comentarios
fr: Commentaires
it: Commenti
nl: Commentaren

source: The users can be allowed to comment on datasets. When activated, an additional "Comments" tab will be displayed on the dataset page.
de: Benutzer können die Möglichkeit erhalten, Datensätze zu kommentieren. Bei Aktivierung wird auf der Datensatzseite die zusätzliche Registerkarte "Kommentare" angezeigt.
fr: Les utilisateurs ont la possibilité de commenter les jeux de données. Si l'option est activée, un onglet "Commentaires" supplémentaire apparaît sur la page du jeu de données.
nl: Gebruikers kunnen opmerkingen formuleren over datasets. Wanneer deze is geactiveerd wordt een extra tabblad "Commentaren" weergegeven in de datasetpagina.

source: To activate this feature, you need to configure a Disqus account to associate with the portal. Disqus is an external comment management system. You will need to set your account's short name and public key in the ``Configure`` menu, in the ``Social networks & sharing`` section.
de: Zur Aktivierung dieser Funktion müssen Sie zunächst ein dem Portal zuzuordnendes Disqus-Konto konfigurieren. Disqus ist ein externes Verwaltungssystem für Kommentare. Sie müssen den Kurznamen Ihres Kontos und den öffentlichen Schlüssel im Bereich ``Soziale Netzwerke + Teilen`` im Menü ``Konfigurieren`` eingeben.
fr: Pour activer cette fonctionnalité, vous devez configurer un compte Disqus à associer au portail. Disqus est un système externe de gestion des commentaires. Vous devrez définir le pseudo et la clé publique de votre compte dans la section ``Réseaux sociaux et partage`` du menu ``Configurer``.
nl: Om deze functie te activeren, moet u een Disqus-account configureren dat gekoppeld is aan het portaal. Disqus is een extern commentaarbeheersysteem. U moet de verkorte naam van uw account en de publieke sleutel instellen in het menu ``Configureren``, in de rubriek ``Sociale netwerken & delen``.

source: If you're unsure about how to get your Disqus credentials, you can follow the detailed steps detailed on the page.
de: Sollten Sie nicht genau wissen, wie Sie Ihre Disqus-Anmeldeinformationen erhalten, können Sie den auf der Seite angegeben detaillierten Schritten folgen.
fr: Si vous ne savez pas comment obtenir vos identifiants Disqus, vous pouvez suivre la procédure détaillée présente sur la page.
nl: Wanneer u er niet zeker van bent hoe u uw Disqus-gegevens kan bekomen, kan u de stappen volgen die gedetailleerd beschreven staan op de pagina.

source: Encouraging reuses
de: Weiterverwendungen fördern
es: Fomentar las reutilizaciones
fr: Favoriser la réutilisation
it: Come incoraggiare i riutilizzi
nl: Hergebruiken aanmoedigen

source: One of the main goals of Open Data is to have your data reused, thus producing new analyses or new services. Listing these reuses on the related datasets' pages will help promote both the reuse itself and your data.
de: Eines der Hauptziele von Open Data ist die Weiterverwendung Ihrer Daten und somit die Erstellung neuer Analysen oder neuer Dienste. Wenn Sie die Weiterverwendungen auf den entsprechenden Datensatzseiten auflisten, bewirbt dies die Weiterverwendung an sich sowie Ihre Daten.
es: Uno de los objetivos principales de los datos abiertos es la reutilización de la información para producir análisis o servicios nuevos. El hecho de mostrar una lista de estas reutilizaciones en las páginas de los conjuntos de datos relacionados ayudará a promover tanto la reutilización en sí como los datos.
fr: L'un des objectifs principaux d'Open Data est que vos données soient réutilisées, créant ainsi de nouvelles analyses ou de nouveaux services. Indiquer ces réutilisations sur les pages des jeux de données concernés permet de promouvoir la réutilisation, mais aussi vos données.
it: Uno dei principali obiettivi dell'Open Data è il riutilizzo dei dati per consentire altre analisi o creare nuovi servizi. Pubblicando sulla pagina di ogni dataset l'elenco dei riutilizzi contribuirai a promuovere sia i tuoi dati che il loro riutilizzo.
nl: Een van de belangrijkste doelstellingen van Open Data is om er voor te zorgen dat uw data hergebruikt worden en zo nieuwe analyses of nieuwe diensten worden gegenereerd. Het in een lijst onderbrengen van deze hergebruiken op de pagina's van de aanverwante datasets zal helpen om zowel het hergebruik zelf als uw data te promoten.

source: You can access the configuration for reuses in the ``Configuration`` menu section, under ``Reuses``.
de: Auf die Konfiguration der Weiterverwendungen greifen Sie über den Menübereich ``Konfiguration`` unter ``Weiterverwendungen`` zu.
es: Puede acceder a la configuración de las reutilizaciones en la sección de menú ``Configuración``, debajo de ``Reutilizaciones``.
fr: Vous pouvez configurer la réutilisation dans la section ``Réutilisation`` du menu ``Configuration``.
it: Per configurare i riutilizzi, vai alla sezione ``Riutilizzi`` del menu ``Configurazione``.
nl: U kan de hergebruiken configureren in de menurubriek ``Configuratie`` onder ``Hergebruiken``.

source: Enabling the reuse feature on your portal will display a new Reuses section at the bottom of the information tab on each dataset page. Additionally, this section will provide a form through which users can :doc:`submit their reuses </exploring_catalog_and_datasets/04_getting_involved/discovering_submitting_reuses>` and will list all approved reuses.
de: Wenn Sie die Weiterverwendungsfunktion für Ihr Portal aktivieren, wird auf jeder Datensatzseite unten im Informationen-Tab ein neuer Weiterverwendungsabschnitt angezeigt. In diesem Abschnitt wird außerdem ein Formular bereitgestellt, über das Benutzer ihre :doc:`Weiterverwendungen übermitteln</exploring_catalog_and_datasets/04_getting_involved/discovering_submitting_reuses>` können, und alle genehmigten Weiterverwendungen werden aufgelistet.
fr: Activer la fonction de réutilisation sur votre portail affichera une nouvelle section Réutilisation en bas de l'onglet Informations de chaque page de jeu de données. En outre, cette section contient un formulaire via lequel les utilisateurs peuvent :doc:`soumettre leurs réutilisations </exploring_catalog_and_datasets/04_getting_involved/discovering_submitting_reuses>` et répertorier toutes les réutilisations approuvées.
nl: Wanneer de hergebruikfunctie op uw portaal wordt geactiveerd, wordt een nieuwe rubriek Hergebruiken weergegeven onderaan het informatietabblad op elke pagina van de dataset. Daarnaast zal in deze rubriek een formulier beschikbaar worden gesteld dat gebruikers kunnen gebruiken om :doc:`hun hergebruiken in te dienen </exploring_catalog_and_datasets/04_getting_involved/discovering_submitting_reuses>` en zal een lijst van alle goedgekeurde hergebruiken worden opgemaakt.

source: In order to be displayed on a dataset's page, new reuses must be reviewed and approved by an administrator.
de: Um auf einer Datensatzseite angezeigt zu werden, müssen neue Weiterverwendungen von einem Administrator geprüft und genehmigt werden.
es: Para que se visualicen en la página de un conjunto de datos, las reutilizaciones nuevas deben estar revisadas y aprobadas por un administrador.
fr: Pour que les nouvelles réutilisations soient affichées sur la page du jeu de données, elles doivent être vérifiées et approuvées par un administrateur.
it: Per poter comparire sulla pagina di un dataset, le proposte di riutilizzo devono essere prima esaminate e approvate da un amministratore.
nl: Opdat nieuwe hergebruiken worden weergegeven op de pagina van een dataset, moeten deze gecontroleerd en goedgekeurd worden door een beheerder.

source: When the reuse feature is enabled, you can additionally allow anonymous users (users without an account) to submit reuses. This is recommended on Open Data portals or portals which do not allow external users to create an account.
de: Ist die Weiterverwendungsfunktion aktiviert, können Sie zudem anonymen Benutzern (ohne ein Konto) die Übermittlung von Weiterverwendungen erlauben. Wir empfehlen dies für Open-Data-Portale oder Portale, bei denen externe Benutzer kein Konto erstellen können.
es: Si la función de reutilización está activada, también puede permitir que los usuarios anónimos (sin cuenta) envíen reutilizaciones. Esta es la opción recomendada en los portales de datos abiertos o los portales que no permiten a los usuarios externos crear una cuenta.
fr: Lorsque la fonction de réutilisation est activée, vous pouvez également permettre aux utilisateurs non authentifiés (qui n'ont pas de compte) de soumettre des réutilisations. Nous vous recommandons d'utiliser cette fonction sur les portails Open Data ou les portails n'autorisant pas les utilisateurs externes à créer un compte.
it: Una volta attivata questa funzione, puoi scegliere di consentire o meno agli utenti anonimi (che cioè non hanno eseguito l'accesso al portale) di proporre i loro riutilizzi. Questa possibilità è particolarmente indicata per i portali Open Data o per quelli che non permettono agli utenti di creare un account.
nl: Wanneer de hergebruikfunctie is geactiveerd, kan u daarnaast anonieme gebruikers (gebruikers zonder een account) toelaten om hergebruiken in te dienen. Dit is aanbevolen op Open Data-portalen of portalen die niet toelaten dat externe gebruikers een account aanmaken.

source: **Notifications**
de: **Benachrichtigungen**
es: **Notificaciones**
it: **Notifiche**
nl: **Kennisgevingen**

source: By default, the portal will send a notification to the administrators for every reuse submission. You can add additional recipients email addresses in the form "New reuses notifications recipients".
de: Das Portal sendet standardmäßig für jede Weiterverwendungsübermittlung eine Benachrichtigung an die Administratoren. Im Formular "Neue Empfänger von Weiterverwendungsbenachrichtigungen" können Sie E-Mail-Adressen weiterer Empfänger hinzufügen.
fr: Par défaut, le portail envoie une notification aux administrateurs pour chaque nouvelle proposition de réutilisation. Vous pouvez ajouter d'autres adresses e-mail destinataires dans le formulaire "Destinataires des notifications de nouvelles réutilisations".
nl: Standaard stuurt het portaal een kennisgeving naar de beheerders voor elk hergebruik dat wordt ingediend. U kan de e-mailadressen van bijkomende ontvangers toevoegen in het formulier "Kennisgevingen ontvangers nieuwe hergebruiken".

source: If you want to send these notifications only to one specific address, specify it in the form and check "Send notifications exclusively to these addresses". For example, if you want to send these notifications only to opendata@yourdomain.com :
de: Möchten Sie diese Benachrichtigungen an nur eine bestimmte Adresse senden, geben Sie diese im Formular an und aktivieren Sie "Benachrichtigungen nur an diese Adressen senden". Wenn Sie diese Benachrichtigungen beispielsweise nur an opendata@yourdomain.com senden möchten:
fr: Si vous souhaitez envoyer ces notifications à une seule adresse, indiquez-la dans le formulaire et cochez "Envoyer les notifications uniquement à ces adresses". Par exemple, si vous souhaitez envoyer ces notifications uniquement à opendata@votredomaine.com :
nl: Indien u deze kennisgevingen enkel wil sturen naar één specifiek adres, kan u dit specificeren in het formulier en het vakje "Kennisgevingen uitsluitend naar deze adressen sturen" aanvinken. Bijvoorbeeld: indien u deze kennisgevingen enkel naar opendata@yourdomain.com wil sturen:

source: Contact form recipients
de: Kontakt von Empfängern
es: Destinatarios de formulario de contacto
fr: Destinataires du formulaire de contact
it: Destinatari del modulo di contatto
nl: Contactformulier ontvangers

source: Within the pages you create, you can include a contact form that allows users to send a message to domain administrators. You can add recipients to these messages in the ``Social networks & sharing`` section from the ``Configure`` menu.
de: Auf den von Ihnen erstellten Seiten können Sie ein Kontaktformular einfügen, über das Benutzer eine Nachricht an Domain-Administratoren senden können. Empfänger solcher Nachrichten können Sie im Bereich ``Soziale Netzwerke + Teilen`` im Menü ``Konfigurieren`` hinzufügen.
fr: Vous pouvez inclure un formulaire de contact sur les pages que vous créez pour permettre aux utilisateurs d'envoyer un message aux administrateurs du domaine. Vous pouvez ajouter des destinataires à ces messages dans la section ``Réseaux sociaux et partage`` du menu ``Configurer``.
nl: Op de pagina's die u aanmaakt, kan u een contactformulier opnemen waarmee gebruikers een bericht naar de domeinbeheerders kunnen sturen. U kan ontvangers aan deze berichten toevoegen in de rubriek ``Sociale netwerken & delen`` in het menu ``Configureren``.

source: Dataset subscriptions
de: Datensatz-Abonnements
es: Suscripciones de conjuntos de datos
fr: Abonnements à un jeu de données
it: Iscrizioni al dataset
nl: Datasetinschrijvingen

source: Users on your portal can subscribe to any dataset they can access; by doing so, they opt-in to receive notifications that the dataset publisher can decide to send at any time, for example, information about a future schema change or to indicate that the data has been updated recently.
de: Benutzer Ihres Portals können einen beliebigen Datensatz abonnieren, auf den Sie Zugriff haben. Damit entscheiden Sie sich, Benachrichtigungen zu erhalten, die der Datensatzveröffentlicher jederzeit senden kann, wie z. B. Informationen über eine anstehende Schemaänderung oder Hinweise auf jüngste Datenaktualisierungen.
fr: Les utilisateurs de votre portail peuvent s'abonner aux jeux de données auxquels ils ont accès. Ce faisant, ils recevront les notifications envoyées par le producteur du jeu de données. Ce dernier peut décider d'envoyer des notifications à tout moment pour, par exemple, informer l'utilisateur qu'une modification sera apportée au schéma ou pour lui indiquer que des données ont été mises à jour récemment.
nl: Gebruikers op uw portaal kunnen inschrijven op elke dataset waar ze toegang toe hebben. Hierdoor kiezen ze ervoor om kennisgevingen te ontvangen die de uitgever van de dataset kan beslissen om op elk moment te sturen. Bijvoorbeeld informatie over een toekomstige schemawijziging of om aan te geven dat de data onlangs werd bijgewerkt.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: The button is only available to users who are logged on the portal using an account. If you want to use this feature on an open data portal, for example, you may want to allow users to sign up on your portal.
de: Die Schaltfläche steht nur Benutzern zur Verfügung, die mit einem Konto beim Portal angemeldet sind. Möchten Sie diese Funktion beispielsweise für ein Open-Data-Portal verwenden, sollten sich Benutzer eventuell bei Ihrem Portal anmelden können.
fr: Le bouton est uniquement accessible aux utilisateurs qui sont connectés au portail via un compte. Si vous souhaitez utiliser cette fonctionnalité sur un portail Open Data par exemple, vous devrez autoriser les utilisateurs à s'inscrire sur votre portail.
nl: De knop is enkel beschikbaar voor gebruikers die ingelogd zijn op het portaal en die een account gebruiken. Indien u deze functie bijvoorbeeld wil gebruiken op een open data-portaal, is het mogelijk dat u gebruikers de mogelijkheid wil bieden om zich in te schrijven op uw portaal.

source: As a dataset publisher, you can see the list of users subscribed to your dataset from its back-office configuration page, using the "Subscribers" tab, which appears if you have at least one subscriber on the dataset. From there, you can also send a message to all the users who subscribed to this dataset.
de: Als Veröffentlicher eines Datensatzes können Sie von der Konfigurationsseite im Backoffice über die Registerkarte "Abonnenten" (diese ist sichtbar, wenn es mindestens einen Abonnenten des Datensatzes gibt) die Liste der Benutzer sehen, die ihn abonniert haben. Hier können Sie auch eine Nachricht an alle Abonnenten dieses Datensatzes senden.
fr: En tant que producteur du jeu de données, vous pouvez voir la liste des utilisateurs qui se sont abonnés à celui-ci sur sa page de configuration d'interface d'administration dans l'onglet "Abonnés", qui apparaît à partir du moment où une personne s'est abonnée au jeu de données. Ce même onglet permet d'envoyer des messages à tous les abonnés du jeu de données.
nl: Als uitgever van de dataset kan u de lijst met gebruikers zien die vanuit de back-office configuratiepagina ervan ingeschreven hebben op uw dataset via het tabblad "Abonnees" dat verschijnt wanneer u minstens één abonnee op de dataset heeft. Van daaruit kan u ook een bericht sturen naar alle gebruikers die ingeschreven hebben op deze dataset.

source: It is advised to warn your subscribers in advance of any change that may impact any of their reuse, such as a change in the schema (renaming an existing field, removing a field) that may cause issues with existing reuses or an update of the data itself if it is not updated very frequently.
de: Wir empfehlen, dass Sie Ihre Abonnenten im Voraus über sämtliche Änderungen informieren, die sich auf die Weiterverwendung auswirken könnten. Dies betrifft z. B. Änderungen des Schemas (Umbenennen eines bestehenden Feldes, Löschen eines Feldes), was zu Problemen bei bestehenden Weiterverwendungen führen könnte, oder eine Aktualisierung von nicht allzu oft aktualisierten Daten.
fr: Il est conseillé de prévenir vos abonnés des modifications à venir qui pourraient avoir une influence sur leurs réutilisations, comme une modification du schéma (modification du nom d'un champ existant, suppression d'un champ) qui peut générer des problèmes pour les réutilisations existantes ou une mise à jour des données, surtout si elles ne sont pas mises à jour très souvent.
nl: Het is aangeraden om uw abonnees vooraf te waarschuwen voor elke wijziging die een impact heeft op welke ook van hun hergebruiken, zoals een wijziging in het schema (waarbij een bestaand veld een andere naam krijgt, waarbij een veld wordt verwijderd) wat problemen met bestaande hergebruiken kan veroorzaken of een update van de dataset zelf, wanneer deze niet zeer frequent up-to-date wordt gebracht.

source: User feedback on datasets
de: Benutzerfeedback zu Datensätzen
es: Comentarios de usuarios en conjuntos de datos
fr: Contributions des utilisateurs sur les jeux de données
it: Feedback degli utenti sui dataset
nl: Feedback van gebruikers over datasets

source: This feature is currently in beta and is not available by default. Please contact us if you would like to try this feature on your own portal.
de: Diese Funktion läuft gegenwärtig in der Beta-Version und steht nicht standardmäßig zur Verfügung. Kontaktieren Sie uns, wenn Sie diese Funktion auf Ihrem eigenen Portal ausprobieren möchten.
fr: Cette fonctionnalité est actuellement en version bêta et n'est pas disponible par défaut. Vous pouvez nous contacter si vous souhaitez essayer cette fonctionnalité sur votre portail.
nl: Deze functie is momenteel beschikbaar in de bètaversie en niet standaard. Gelieve met ons contact op te nemen wanneer u deze functie op uw eigen portaal zou willen proberen.

source: If you wish to gather feedback on the content of a specific dataset, you can activate "User feedback" from its back-office configuration page.
de: Möchten Sie Feedback über den Inhalt eines bestimmten Datensatzes erhalten, können Sie auf der Konfigurationsseite in seinem Back-Office "Benutzerfeedback" aktivieren.
es: Si desea recopilar comentarios sobre el contenido de un conjunto de datos específico, puede activar "Comentarios de usuarios" en la página de configuración del back office.
fr: Si vous voulez recevoir des contributions sur le contenu d'un jeu de données spécifique, vous pouvez activer l'option "Contributions d'utilisateurs" sur sa page de configuration back office.
it: Per ricevere feedback sul contenuto di un dataset specifico, puoi attivare l'opzione "Feedback utenti" dalla pagina di configurazione dell'interfaccia di back-office.
nl: Wanneer u feedback wenst in te zamelen over de content van een specifieke dataset, kan u "Feedback van gebruikers" activeren vanuit de back-office configuratiepagina ervan.

source: Once the option is active and the dataset is published again, your users will be able to send feedback on your dataset, either for a specific record or to suggest a new record, by clicking on the little chat bubble in the table view.
de: Nach Aktivierung der Option und Neuveröffentlichung des Datensatzes können Ihre Benutzer Feedback zu Ihrem Datensatz geben, zu einem bestimmten Eintrag bzw. einen neuen Eintrag vorschlagen, indem sie in der Tabellenansicht auf die kleine Sprechblase klicken.
fr: Une fois l'option activée et le jeu de données publié de nouveau, vos utilisateurs seront en mesure d'envoyer leurs contributions en cliquant sur la petite bulle dans la vue tableau, que ce soit à propos d'un enregistrement spécifique ou pour proposer un nouvel enregistrement.
nl: Eenmaal de optie actief is en de dataset opnieuw gepubliceerd is, zullen uw gebruikers feedback over uw dataset kunnen sturen, ofwel voor een specifiek record, ofwel om een nieuw record te suggereren, en dit door te klikken op de kleine chat bubbel in de tabelweergave.

source: Doing so will open a form where the user can write a message and optionally suggest new values.
de: Dadurch wird ein Formular geöffnet, in dem der Benutzer eine Nachricht verfassen und optional neue Werte vorschlagen kann.
fr: En cliquant, l'utilisateur accédera à un formulaire lui permettant d'écrire un message et de proposer de nouvelles valeurs s'il le souhaite.
nl: Hierdoor wordt een formulier geopend waarop de gebruiker een bericht kan schrijven en ook nieuwe waarden kan suggereren.
