Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/04_sharing_reusing_communicating/links.po
Languages: de, es, fr, it, nl

source: Improving user sharing
de: Verbessern des Teilens zwischen Benutzern
es: Mejorar el uso compartido
fr: Améliorer le partage par les utilisateurs
it: Miglioramento della condivisione da parte dell'utente
nl: Het delen door gebruikers verbeteren

source: Integrating social medias
de: Integrieren sozialer Medien
es: Integrar las redes sociales
fr: Intégrer les réseaux sociaux
it: Integrazione dei social media
nl: Sociale media intergreren

source: **Share on social medias buttons**
de: **Teilen auf Schaltflächen sozialer Medien**
es: **Botones de compartir en redes sociales**
fr: **Boutons partager sur les réseaux sociaux**
it: **Pulsanti di condivisione sui social media**
nl: **Knoppen voor het delen op sociale media**

source: You can choose to display share buttons that will provide users with quick access to their favorite social networks (Twitter, Facebook, LinkedIn and email).
es: Puede elegir visualizar botones de compartir que permitan a los usuarios acceder rápidamente a sus redes sociales favoritas (Twitter, Facebook, LinkedIn y correo electrónico).

source: You can enable these share buttons in the ``Social networks & sharing`` section, in the ``Configuration`` menu
de: Aktivieren können Sie diese Teilen-Schaltflächen im Bereich ``Soziale Netzwerke + Teilen`` über das Menü ``Konfiguration``.
es: Puede activar estos botones de compartir en la sección ``Redes sociales y uso compartido``, dentro del menú ``Configuración``.
fr: L'activation de ces boutons de partage se fait dans la section ``Réseaux sociaux et partage`` du menu ``Configuration``.
it: Per attivare questi pulsanti, fai clic su ``Social network e condivisione``, nel menu ``Configurazione``:
nl: U kan deze deel-knoppen activeren in de rubriek ``Sociale netwerken & delen``, in het menu ``Configuratie``

source: **Twitter cards**
es: **Tarjetas de Twitter**
fr: **Fiches Twitter**
it: **Twitter card**
nl: **Twitter-kaarten**

source: If a user tweets a link to a dataset on your portal, a summary can be displayed (the title and description of your dataset), associated with a Twitter account of your choice.
de: Twittert ein Benutzer einen Link zu einem Datensatz auf Ihrem Portal, kann eine Übersicht (Titel und Beschreibung Ihres Datensatzes) in Verbindung mit einem Twitte-Account Ihrer Wahl angezeigt werden.
es: Si un usuario incluye en un tweet un vínculo a un conjunto de datos de su portal, se puede visualizar un resumen (el título y la descripción del conjunto de datos) asociado a la cuenta Twitter que desee.
fr: Si un utilisateur tweete un lien vers un jeu de données de votre portail, il est possible d'en afficher un résumé (le titre et la description de votre jeu de données) associé au compte Twitter de votre choix.
it: Ogni volta che un utente twitta un link a un dataset del tuo portale, comparirà un riepilogo contenente il titolo e la descrizione del dataset, associato a un account Twitter di tua scelta.
nl: Wanneer een gebruiker een koppeling naar een dataset op uw portaal tweet, kan een samenvatting worden weergegeven (de titel en omschrijving van uw dataset), die gekoppeld is aan een Twitter-account van uw keuze.

source: This is a feature provided by Twitter itself. It should work by default without additional configuration, except if your domain is not **whitelisted for summary card** by twitter.
de: Diese Funktion wird von Twitter bereitgestellt, sie sollte standardmäßig ohne zusätzliches Konfigurieren funktionieren, es sei denn, Ihre Domain steht nicht auf der **weißen Liste für Übersichtskarten** von Twitter.
es: Esta es una función facilitada por Twitter. En principio se ejecuta de forma predeterminada sin ninguna configuración adicional, salvo si el dominio no figura como **permitido para las tarjetas de resumen** de Twitter.
fr: Cette fonctionnalité est proposée par Twitter. Elle devrait fonctionner sans configuration supplémentaire, sauf si votre domaine n'est pas **jugé conforme par Twitter pour afficher une fiche de résumé**.
it: Questa funzionalità è fornita direttamente da Twitter e dovrebbe essere disponibile in modo predefinito senza configurazioni aggiuntive, a meno che il tuo dominio non sia ancora stato incluso nella **whitelist di Twitter per le Summary card**.
nl: Dit is een functionaliteit die door Twitter zelf wordt voorzien. Deze zou standaard moeten werken zonder bijkomende configuratie, behalve wanneer uw domein niet **whitelisted voor summary card** is door Twitter.

source: You can check this by previewing a summary on the `Twitter Card page <https://cards-dev.twitter.com/validator>`_. Simply put the URL of one of your public dataset in the Card URL field on this page.
de: Prüfen können Sie das, indem Sie die Vorschau einer Übersicht auf der `Twitter Card-Seite <https://cards-dev.twitter.com/validator>`_ anzeigen. Geben Sie auf dieser Seite einfach die URL eines Ihrer öffentlichen Datensätze in das Feld Card URL ein.
es: Puede comprobarlo obteniendo una vista previa de un resumen en la `página de las tarjetas de Twitter <https://cards-dev.twitter.com/validator>`_. Simplemente especifique la dirección URL de un conjunto de datos público en el campo de dirección URL de tarjeta de esta página.
fr: Vous pouvez vérifier cela en générant un aperçu du résumé sur la page `Twitter Card (Fiche Twitter) <https://cards-dev.twitter.com/validator>_`. Entrez simplement l'URL de l'un de vos jeux de données publics dans le champ Card URL (Url de fiche) de la page.
it: Per verificare questo aspetto, visualizza un'anteprima di riepilogo nella `pagina di creazione delle Twitter card <https://cards-dev.twitter.com/validator>`_ inserendo l'URL di uno dei tuoi dataset pubblici nel campo "Card URL".
nl: U kan dit controleren door een voorbeeldweergave te vragen van een samenvatting op de `Twitter Card-pagina <https://cards-dev.twitter.com/validator>`_. Voer gewoon de URL van één van uw publieke datasets in het veld Card URL in op deze pagina.

source: If after clicking on *Preview*, your domain does not appear as **whitelisted for summary card**, you have to request approvals, by clicking on the *Request Approval* button. You also have to input your ``Twitter handle`` to associate your portal with these approved Twitter Cards, in the ``Social networks & sharing`` in the ``Configuration`` menu.
de: Erscheint Ihre Domain nach einem Klick auf *Vorschau* nicht in der **weißen Liste für Übersichtskarten** müssen Sie Genehmigungen einholen, indem Sie auf die Schaltfläche *Genehmigung anfordern* klicken. Um Ihr Portal mit diesen genehmigten Twitter Cards zu verbinden, müssen Sie auch im Bereich ``Soziale Netzwerke + Teilen`` über das Menü ``Konfiguration`` Ihren ``Twitter-Handle`` eingeben.
es: Si al hacer clic en *Previsualizar tarjeta*, el dominio no figura como **permitido para las tarjetas de resumen**, tiene que solicitar la aprobación haciendo clic en el botón *Solicitud de aprobación*. Además, tiene que especificar su ``usuario de Twitter`` para asociar el portal a estas tarjetas de Twitter aprobadas, en ``Redes sociales y uso compartido`` dentro del menú ``Configuración``.
fr: Si votre domaine n'est pas **jugé conforme par Twitter pour afficher une fiche de résumé** après avoir cliqué sur *Preview card* (Aperçu de la fiche), vous devrez demander une validation en cliquant sur le bouton *Request Approval* (Demande d'approbation). Vous devrez également indiquer votre ``pseudo Twitter`` dans la section ``Réseaux sociaux et partage`` du menu ``Configuration`` pour associer votre portail à ces fiches Twitter approuvées.
it: Se dopo aver cliccato su *Preview* non compare il messaggio **whitelisted for summary card**, sarà necessario inviare una richiesta di approvazione tramite il pulsante *Request Approval*. In seguito, dovrai associare il tuo portale alle Twitter card approvate: per fare ciò, inserisci il tuo ``username su Twitter`` nella sezione ``Social network e condivisione`` del menu ``Configurazione``.
nl: Nadat u heeft geklikt op *Voorbeeldweergave* en uw domein niet verschijnt als **op de witte lijst geplaatst voor samenvattingskaart** moet u goedkeuringen aanvragen door te klikken op de knop *Aanvraag goedkeuring*. U moet ook uw ``Twitter handle`` invoeren om uw portaal te koppelen aan deze goedgekeurde Twitter Cards, in de rubriek ``Sociale netwerken & delen`` in het menu ``Configuratie``.

source: Dataset information cards
de: Datensatzinformationskarten
es: Tarjetas de información de conjuntos de datos
fr: Fiches d'information du jeu de données
it: Schede informative dei dataset
nl: Dataset informatiekaarten

source: When embedding visualizations, users have the option to display an additional information card on top of the embed.
de: Beim Einbetten von Darstellungen haben Benutzer die Option, eine zusätzliche Informationskarte über der Einbettung anzuzeigen.
es: Al incrustar visualizaciones, los usuarios tienen la opción de visualizar una tarjeta de información adicional en la parte superior de la incrustación.
fr: Lors de l'intégration des visualisations, les utilisateurs peuvent afficher une fiche d'information supplémentaire au-dessus de l'intégration.
it: Al momento di integrare una visualizzazione, gli utenti posso scegliere di posizionare una scheda di informazioni aggiuntiva nella parte superiore dell'embed.
nl: Wanneer weergaves worden ingevoegd, hebben gebruikers de mogelijkheid om een extra informatiekaart weer te geven bovenop de embed.

source: In the ``Embeds`` section in the ``Configuration`` menu, you can configure the position of this information card (top or bottom).
de: Im Bereich ``Einbettungen`` des Menüs ``Konfiguration`` können Sie die Position dieser Informationskarte festlegen (oben oder unten).
es: En la sección ``Incrustaciones`` del menú ``Configuración``, puede configurar la posición de esta tarjeta de información (parte superior o inferior).
fr: Vous pouvez configurer l'emplacement de cette fiche d'information (haut ou bas) dans la section ``Intégrations`` du menu ``Configuration``.
it: Nella sezione ``Embed`` del menu ``Configurazione``, puoi definire la posizione della scheda, in alto o in basso.
nl: In de rubriek ``Embeds`` in het menu ``Configuratid`` menu kan u de positie van deze informatiekaart configureren (bovenaan of onderaan).

source: You can also force the display of the information card on every embed using the checkbox *Force embeds to have a dataset information card displayed at all times*
de: Sie können die Anzeige der Informationskarte auch mithilfe des Kontrollkästchens *Anzeige einer Datensatzinformationskarte für Einbettungen immer erzwingen* erreichen.
es: También puede forzar la visualización de la tarjeta de información en todas las incrustaciones mediante la casilla *Forzar que las incrustaciones visualicen en todo momento una tarjeta de información de conjunto de datos*.
fr: Vous pouvez également imposer l'affichage de la fiche d'information sur toutes les intégrations en cochant la case *Toujours afficher la fiche d'information du jeu de données sur les intégrations*.
it: Per imporre la presenza della scheda informativa su tutti gli embed, seleziona la casella *Visualizza sempre una scheda informativa del dataset per gli embed*.
nl: Ook kan u de weergave van de informatiekaart forceren op elke embed door gebruik te maken van het aanvinkvakje *Embeds forceren om een dataset informatiekaart altijd te laten weergeven*

source: You can choose to display share buttons that will provide users with quick access to their favorite social networks (Twitter, Facebook, Google+, LinkedIn and email).
de: Sie können Schaltflächen zum Teilen anzeigen, die Benutzern einen Schnellzugriff auf ihre bevorzugten sozialen Netzwerke bieten (Twitter, Facebook, Google+, LinkedIn sowie E-Mail).
fr: Vous pouvez décider d'afficher des boutons de partage pour offrir aux utilisateurs un accès rapide à leurs réseaux sociaux préférés (Twitter, Facebook, Google+, LinkedIn et messagerie).
it: Puoi scegliere di visualizzare i pulsanti di condivisione per offrire agli utenti un accesso rapido ai loro social network preferiti (Twitter, Facebook, Google+, LinkedIn ed e-mail).
nl: U kan ervoor kiezen om deel-knoppen weer te geven die gebruikers een snelle toegang zullen bieden tot hun favoriete sociale netwerken (Twitter, Facebook, Google+, LinkedIn en e-mail).
