Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_account/02_managing_api_keys/managing_api_keys.po
Languages: de, es, fr, nl

source: Managing API keys
de: API-Schlüssel verwalten
es: Gestión de claves de API
fr: Gérer les clés d'API
nl: API-sleutels beheren

source: After authenticating to a portal, you can generate API keys and manage them from the API keys tab of your account.
de: Nachdem Sie sich bei einem Portal authentifiziert haben, können Sie API-Schlüssel generieren und diese unter der Registerkarte "API-Schlüssel" in Ihrem Konto verwalten.
es: Tras autenticarse en un portal, puede generar claves de API y gestionarlas desde la ficha Claves de API de su cuenta.
fr: Après vous être authentifié sur un portail, vous pouvez générer des clés d'API et les gérer depuis l'onglet Clés d'API de votre compte.
nl: Na identificatie voor een portaal, kunt u API-sleutels aanmaken en deze beheren vanuit het tabblad API-sleutels van uw account.

source: API keys are bound to a specific domain. They only work on the domain on which they were created.
de: API-Schlüssel sind an eine bestimmte Domain gebunden. Sie funktionieren nur auf der Domain, auf der sie erstellt wurden.
es: Las claves de API están vinculadas a un dominio específico. Solo funcionan en el dominio en el que se han creado.
fr: Les clés d'API sont reliées à un domaine spécifique, c'est-à-dire qu'elles ne fonctionnent que sur le domaine où elles ont été créées.
nl: API-sleutels zijn gekoppeld aan een specifiek domein. Ze werken enkel op het domein waarop ze werden aangemaakt.

source: These API keys allow you to use the following APIs: ODS Search API v1 and v2, OData, WFS, and CSW. For more info, see :doc:`Using APIs </exploring_catalog_and_datasets/04_getting_involved/using_api>`.
de: Diese API-Schlüssel ermöglichen die Verwendung der folgenden APIs: ODS Search API v1 und v2, OData, WFS, und CSW. Weitere Informationen finden Sie in der Dokumentation :doc:`APIs verwenden </exploring_catalog_and_datasets/04_getting_involved/using_api>`.
es: Estas claves de API permiten utilizar las API siguientes: ODS Search API v1 y v2, OData, WFS y CSW. Para más información, consulte :doc:`Utilización de las API </exploring_catalog_and_datasets/04_getting_involved/using_api>`.
fr: Ces clés d'API vous permettent d'utiliser les API suivantes : ODS Search API v1 et v2, OData, WFS et CSW. Pour plus d'informations, consultez :doc:`Utiliser les API </exploring_catalog_and_datasets/04_getting_involved/using_api>`.
nl: Met deze API-sleutels kunt u de volgend API's gebruiken: ODS Search API v1 en v2, OData, WFS, en CSW. Voor meer informatie, zie :doc:`API's gebruiken</exploring_catalog_and_datasets/04_getting_involved/using_api>`.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: API keys inherit all permissions granted to the user for which it has been created. That's why you should be cautious with how they use API keys.
de: API-Schlüssel übernehmen alle Berechtigungen des Benutzers, für den sie erstellt wurden. Deshalb sollten Sie bei deren Verwendung der API-Schlüssel aufpassen.
es: Las claves de API heredan todos los permisos concedidos al usuario para el cual se han creado. De ahí que sea conveniente tener cuidado al usar las claves de API.
fr: Les clés d'API héritent de toutes les permissions accordées à l'utilisateur pour lequel elles ont été créées. C'est pour cette raison que vous devez rester attentif à la façon dont les utilisateurs se servent des clés d'API.
nl: API-sleutels erven alle toelatingen die verleend zijn aan de gebruiker waarvoor deze werd aangemaakt. Daarom zou u voorzichtig moeten zijn wat betreft hoe ze API-sleutels gebruiken.

source: If you observe unauthorized usage of your API key, if your API key gets exposed or is unused, it is recommended to revoke it and create a new one.
de: Wenn Sie eine unbefugte Nutzung Ihres API-Schlüssels feststellen, wenn Ihr API-Schlüssel preisgegeben wird oder unbenutzt ist, sollten Sie ihn widerrufen und einen neuen Schlüssel erstellen.
es: Si observa un uso no autorizado de su clave de API, si su clave de API está expuesta o está inutilizada, es recomendable revocarla y crear otra nueva.
fr: Si vous constatez des utilisations non autorisées de votre clé d'API, si celle-ci est exposée ou non utilisée, nous vous recommandons de la retirer et d'en créer une nouvelle.
nl: Wanneer u een ongeoorloofd gebruik van uw API-sleutel waarneemt, wanneer uw API-sleutel blootgesteld raakt of ongebruikt is, is het aanbevolen deze te herroepen en een nieuwe aan te maken.

source: Generating an API key
de: Einen API-Schlüssel generieren
es: Generar una clave de API
fr: Générer une clé d'API
nl: Een API-sleutel genereren

source: Generate an API key to make authenticated API calls.
de: Generieren Sie einen API-Schlüssel, um authentifizierte API-Aufrufe zu tätigen.
es: Genere una clave de API para hacer llamadas de API autenticadas.
fr: Générez une clé d'API pour effectuer des appels d'API authentifiés.
nl: Een API-sleutel genereren om geauthentificeerde API calls te maken.

source: Log in to the portal.
de: Melden Sie sich beim Portal an.
es: Inicie sesión en el portal.
fr: Connectez-vous au portail.
nl: Log in op het portaal.

source: In the top right corner, click your user name.
de: Klicken Sie in der oben rechts auf Ihren Benutzernamen.
es: En la esquina superior derecha, haga clic en el nombre de usuario.
fr: Cliquez sur votre nom d'utilisateur, en haut à droite.
nl: Klik in de rechter bovenhoek op uw gebruikersnaam.

source: From the **Your account** page, click the **API keys** tab.
de: Klicken Sie auf der Seite **Ihr Konto** auf die Registerkarte **API-Schlüssel**.
es: En la página **Su cuenta**, haga clic en la ficha **Claves de API**.
fr: Sur la page **Votre compte**, cliquez sur l'onglet **Clés d'API**.
nl: Klik in de pagina **Uw account** op het tabblad **API-sleutels**;

source: Click on the **Generate new key** button. An API key card appears on the tab.
de: Klicken Sie auf den Button **Neuen Schlüssel generieren**. In der Registerkarte erscheint eine API-Schlüsselkarte.
es: Haga clic en el botón **Generar clave nueva**. Aparecerá una tarjeta de clave de API en la ficha.
fr: Cliquez sur le bouton **Générer une nouvelle clé** pour faire apparaître une carte de clé d'API dans l'onglet.
nl: Klik op de knop **Nieuwe sleutel aanmaken**. Er verschijnt een API-sleutelkaart op het tabblad.

source: Enter a name for the API key in the **Label** field. It should indicate the purpose of the API key.
de: Geben Sie einen Namen für den API-Schlüssel in das Feld "Beschriftung" ein. Dieser sollte den Zweck des API-Schlüssels angeben.
es: Escriba un nombre para la clave de API en el cuadro de texto **Etiqueta**. Debe indicar la finalidad de la clave de API.
fr: Donnez un nom à la clé d'API dans le champ **Label** ; il doit décrire la fonction de cette clé d'API.
nl: Voer een naam in voor de API-sleutel in het veld **Label**. Dit zou het doel van een API-sleutel moeten aangeven.

source: The API key is created. You can click |icon-copypaste| to copy it.
de: Der API-Schlüssel ist erstellt. Sie können auf |icon-copypaste| klicken, um ihn zu kopieren.
es: Se crea la clave de API. Puede hacer clic en |icon-copypaste| para copiarla.
fr: La clé d'API est créée ; vous pouvez cliquer sur |icon-copypaste| pour la copier.
nl: De API-sleutel is aangemaakt. U kan klikken op |icon-copypaste| om hem te kopiÃ«ren

source: Revoking an existing API key
de: Einen vorhandenen API-Schlüssel widerrufen
es: Revocar una clave de API existente
fr: Retirer une clé d'API existante
nl: Een bestaande API-sleutel herroepen

source: Revoke compromised or unused API keys.
de: Widerrufen Sie missbräuchlich verwendete oder unbenutzte API-Schlüssel.
es: Revoque las claves de API expuestas a algún riesgo o inutilizadas.
fr: Retirez les clés d'API compromises ou inutilisées.
nl: Gecompromitteerde of ongebruikte API-sleutels herroepen.

source: Click on the **Revoke key** button at the bottom of the desired API key card.
de: Klicken Sie auf den Button **Schlüssel widerrufen**, der sich im unteren Bereich der API-Schlüsselkarte befindet.
es: Haga clic en el botón **Revocar clave** en la parte inferior de la tarjeta de clave de API en cuestión.
fr: Cliquez sur le bouton **Retirer la clé** en bas de la carte de clé d'API choisie.
nl: Klik op de knop **Sleutel herroepen** onderaan de gekozen API-sleutelkaart.

source: In the dialog box that appears, click on the **Revoke key** button to confirm the revocation of the API key.
de: Klicken Sie in dem Bestätigungsfenster auf den Button **Schlüssel widerrufe**, um den Vorgang zu bestätigen.
es: En el cuadro de diálogo que aparezca, haga clic en el botón **Revocar clave** para confirmar la revocación de la clave de API.
fr: Une fenêtre s'ouvre alors ; cliquez sur le bouton **Retirer la clé** pour confirmer le retrait de la clé d'API.
nl: Klik in het dialoogvenster dat verschijnt op de knop **Sleutel herroepen** om de herroeping van de API-sleutel te bevestigen.
