Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/manage_domain/disqus_configuration.po
Languages: fr

source: Configuring Disqus
fr: Configurer Disqus

source: If you have a custom domain name for accessing the OpenDataSoft platform, replace in the below \<YOURDOMAIN\>.opendatasoft.com with your custom domain name.
fr: Si vous possédez un nom de domaine personnalisé pour votre domaine OpenDataSoft, remplacez les références à \<VOTREDOMAINE\>.opendatasoft.com par votre nom de domaine.

source: To connect your Disqus account to the ODS Platform, follow the steps below:
fr: Les étapes suivantes sont nécessaires pour connecter votre compte Disqus à votre domaine OpenDataSoft :

source: Create a Disqus account at: `<https://disqus.com/admin/signup/>`_.
fr: Créez un compte Disqus : `<https://disqus.com/admin/signup/>`_

source: Create a new site profile here: `<http://disqus.com/admin/create/>`_.
fr: Créez un nouveau profil de site ici : `<http://disqus.com/admin/create/>`_

source: Enter a site name (as you want)
fr: Entrez un nom de site (celui de votre choix)

source: Choose your Disqus URL (please keep in mind that this is your **shortname**)
fr: Choisissez votre URL Disqus (notez la, celle-ci sera votre **shortname**)

source: Select the right category
fr: Choisissez la bonne catégorie

source: Register a new application here: `<http://disqus.com/api/applications/register/>`_.
fr: Enregistrez une nouvelle application ici : `<http://disqus.com/api/applications/register/>`_

source: Go to your application Dashboard: `<http://disqus.com/api/applications/>`_. Please note that the "Public Key" is your **Disqus API key**. For security reasons, never share and never use the "Secret Key".
fr: Allez sur le Dashboard de votre application : `<http://disqus.com/api/applications/>`_. Notez la "Public Key" qui sera votre **Clé publique Disqus**. Pour des raisons de sécurité, ne communiquez jamais votre "Secret key".

source: Go to your application details:
fr: Allez sur les détails de votre application :

source: Now the URL looks like: http://disqus.com/api/applications/XXXX/ (XXXX is your application ID)
fr: L'adresse de la page devrait ressembler à http://disqus.com/api/applications/\<XXXX\>/ (où XXXX est votre ID d'application)

source: Click on the "settings" link (http://disqus.com/api/applications/XXXX/update/)
fr: Cliquez sur le lien "settings" (http://disqus.com/api/applications/\<XXXX\>/update/)

source: Add *\<YOURDOMAIN\>.opendatasoft.com* to the allowed domains
fr: Ajoutez *\<VOTREDOMAINE\>.opendatasoft.com* dans la liste des "allowed domains"

source: Once done, you can connect to the ODS Platform and look at the domain configuration: http://XXXX.opendatasoft.com/domain/. In the Disqus integration section, copy and paste your disqus shortname and the API key. Don't forget to check "Enable Disqus in Explore".
fr: Une fois cela fait, vous pouvez vous connecter sur votre domaine OpenDataSoft et aller dans la page "Domaine", puis dans l'onglet "Intégrations". Vous pouvez ensuite activer Disqus et renseigner le **shortname** et la **clé publique**.

source: Now, people can comments in the Disqus tab and you can manage all comments at this page: http://SHORTNAME.disqus.com/.
fr: Désormais, vos utilisateurs peuvent commenter les jeux de données dans un nouvel onglet Disqus, et vous pouvez modérer ces commentaires depuis la page http://\<SHORTNAME\>.disqus.com
