Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/12_translating_dataset/translating_dataset.po
Languages: de, es, fr, nl

source: Translating a dataset
de: Einen Datensatz übersetzen
es: Traducir un conjunto de datos
fr: Traduire un jeu de données
nl: Een dataset vertalen

source: For domains with more than one language activated in the front office, Opendatasoft allows the translation of specific elements of the datasets, as well as their metadata. When translated, this information appear in the language the user selected to navigate the portal. It should help them understand the dataset as best as possible, even though the data itself is not in their preferred language.
es: Para los dominios con más de un idioma activado en el front office, Opendatasoft permite traducir una serie de elementos específicos de los conjuntos de datos, así como sus metadatos. Una vez traducida, esta información aparece en el idioma de navegación del portal seleccionado por el usuario. Esto le ayudará a entender mejor el conjunto de datos, aunque los datos en sí no estén en su idioma de preferencia.

source: In the Opendatasoft platform, these translations are done in the Translations tab of the edition interface of each dataset.
de: Auf der Opendatasoft-Plattform werden diese Übersetzungen in der Registerkarte "Übersetzungen" der Bearbeitungsoberfläche eines Datensatzes durchgeführt.
es: En la plataforma Opendatasoft, estas traducciones se llevan a cabo en la ficha Traducciones de la interfaz de edición de cada uno de los conjuntos de datos.
fr: Dans la plateforme Opendatasoft, ces traductions peuvent être activées dans l'onglet Traductions de l'interface d'édition pour chaque jeu de données.
nl: Op het Opendatasoft-portaal gebeuren deze vertalingen in het tabblad Vertalingen van de bewerkingsinterface van elke dataset.

source: Choosing elements for translation
de: Elemente zur Übersetzung auswählen
es: Elegir elementos para traducir
fr: Choisir les éléments à traduire
nl: Elementen kiezen voor vertaling

source: For each available language displayed in the Translations tab, it is possible to translate various elements that have been originally configured in 2 other configuration tabs of the dataset.
de: Für jede verfügbare Sprache, die in der Registerkarte "Übersetzungen" angezeigt wird, können verschiedene Elemente übersetzt werden, die zunächst in 2 anderen Registerkarten des Datensatzes konfiguriert wurden.
es: Para cada uno de los idiomas disponibles que aparecen en la ficha Traducciones, se pueden traducir diversos elementos que inicialmente se han configurado en otras 2 fichas de configuración del conjunto de datos.
fr: Pour chaque langue disponible dans l'onglet Traductions, il est possible de traduire divers éléments ayant été initialement configurés dans 2 autres onglets de configuration du jeu de données.
nl: Voor elke beschikbare taal die weergegeven staat in het tabblad Vertalingen, is het mogelijk om verschillende elementen te vertalen die oorspronkelijk geconfigureerd werden in 2 andere configuratietabbladen van de dataset.

source: The :doc:`Information tab</publishing_data/06_configuring_metadata/configuring_metadata>`, which contains 4 standard metadata that can be translated: Title, Description, Keywords and Publisher.
de: In der :doc:`Registerkarte Informationen</publishing_data/06_configuring_metadata/configuring_metadata>`, die 4 Standard-Metadaten enthält, die übersetzt werden können: Titel, Beschreibung, Schlüsselworte und Veröffentlicher.
es: La :doc:`ficha Información</publishing_data/06_configuring_metadata/configuring_metadata>`, que contiene 4 metadatos estándar traducibles: Título, Descripción, Palabras claves y Publicador.
nl: Het :doc:`Informatietabblad</publishing_data/06_configuring_metadata/configuring_metadata>`, dat 4 standaard metadata bevat die vertaald kunnen worden: Titel, Beschrijving, Kernwoorden en Publisher.

source: The :doc:`Processing tab</publishing_data/05_processing_data/processing_data>`, which contains the dataset fields labels and descriptions, that can also be translated.
es: La :doc:`ficha Procesadores</publishing_data/05_processing_data/processing_data>`, que contiene las etiquetas y las descripciones de los campos del conjunto de datos, también traducibles.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: For each language, for both Information and Processing, a progress bar is displayed to indicate how much of the elements have already been translated.
de: Für jede Sprache und sowohl für "Informationen" als auch für "Verarbeitung" wird ein Fortschrittsbalken angezeigt, um darüber Auskunft zu geben, wie viele der Elemente bereits übersetzt wurden.
es: Para cada idioma, en ambas fichas Información y Procesadores, una barra de progreso indica qué parte de los elementos ya se ha traducido.
fr: Pour chaque langue, une barre de progression permet d'indiquer la proportion d'éléments ayant déjà été traduits dans les onglets Informations et Traitement.
nl: Voor elke taal, zowel voor Informatie als Verwerking, wordt een vooruitgangsbalk weergegeven om aan te geven hoeveel van de elementen al werden vertaald.

source: To start translating chosen elements from the dataset:
de: Um die Übersetzung der ausgewählten Elemente des Datensatzes zu beginnen:
es: Para empezar a traducir los elementos elegidos del conjunto de datos:
fr: Pour commencer à traduire les éléments choisis du jeu de données :
nl: Om de gekozen elementen uit de dataset te beginnen vertalen:

source: Choose an available language.
de: Wählen Sie eine verfügbare Sprache aus.
es: Elija un idioma disponible.
fr: Choisir une langue parmi celles disponibles.
nl: Kies een beschikbare taal.

source: For the chosen language, choose whether to translate elements from the Information or the Processing tab.
de: Wählen Sie für die jeweilige Sprache aus, ob Sie Elemente aus der Registerkarte "Informationen" oder "Verarbeitung" übersetzen wollen.
es: Para el idioma elegido, elija si desea traducir elementos de la ficha Información o Procesadores.
fr: Pour la langue sélectionnée, choisissez si vous préférez traduire les éléments de l'onglet Informations ou de l'onglet Traitement.
nl: Kies voor de gekozen taal of u de elementen uit het Informatie- of het Verwerkingstabblad wilt vertalen.

source: For the chosen tab, click on the related Edit link. A translation interface appears.
es: Para la ficha elegida, haga clic en el vínculo de edición relacionado. Aparece una interfaz de traducción.
fr: Pour l'onglet choisi, cliquez sur le lien Modifier correspondant à l'élément à traduire. Une interface de traduction s'affiche alors.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: The translation interface only enables the translation of elements that have already been configured in the original language. For example, if the Publisher metadata has not been configured in the Information tab, it will not be possible to translate it.
es: La interfaz de traducción solo permite traducir elementos configurados previamente en el idioma original. Por ejemplo, si los metadatos de Publicador no se han configurado en la ficha Información, no se podrán traducir.
fr: L'interface de traduction ne permet de traduire que les éléments ayant déjà été configurés dans la langue d'origine. Par exemple, si les métadonnées du producteur n'ont pas été configurées dans l'onglet Informations, il ne sera pas possible de les traduire.

source: The left side of the translation interface displays the elements that can be translated, along with their value in the original language.
es: A la izquierda de la interfaz de traducción se visualizan los elementos que se pueden traducir, junto con su valor en el idioma original.
fr: Le côté gauche de l'interface de traduction contient les éléments pouvant être traduits, avec leur valeur dans la langue d'origine.

source: Untranslated elements are preceded by a grey |icon-cross| icon.
de: Vor unübersetzten Elementen steht ein graues Symbol |icon-cross|.
es: Los elementos sin traducir van precedidos de un icono |icon-cross| gris.
fr: Les éléments non traduits sont précédés d'une icône |icon-cross| grise.
nl: Onvertaalde elementen worden voorafgegaan door een grijs icoon |icon-cross|.

source: Translated elements are preceded by a green |icon-check| icon.
de: Vor übersetzten Elemente steht ein grünes Symbol |icon-check|.
es: Los elementos traducidos van precedidos de un icono |icon-check| verde.
fr: Les éléments traduits sont précédés d'une icône |icon-check| verte.
nl: Vertaalde elementen worden voorafgegaan door een groen icoon |icon-check|.

source: The right side displays the textboxes where the translations should be written. The translations can either be:
es: A la derecha se muestran los cuadros de texto donde deben escribirse las traducciones. Las traducciones pueden ser:

source: suggestions proposed by the platform,
de: Vorschläge von der Plattform
es: o bien propuestas realizadas por la plataforma
nl: suggesties zijn die voorgesteld worden door het platform,

source: or, new translations.
de: oder neue Übersetzungen sein.
es: o bien traducciones nuevas.
nl: of nieuwe vertalingen zijn.

source: If an element is not translated, it will appear in the portal in its original value, no matter the language selected by the user.
de: Wenn ein Element nicht übersetzt wurde, taucht es im Portal in seiner Ausgangssprache auf, unabhängig von der ausgewählten Sprache des Benutzers.
es: Si un elemento no se traduce, aparecerá en el portal con su valor original, independientemente del idioma seleccionado por el usuario.
fr: Si un élément n'est pas traduit, sa valeur originale apparaît dans le portail, quelle que soit la langue sélectionnée par l'utilisateur.
nl: Wanneer een element niet wordt vertaald, verschijnt het in het portaal in zijn oorspronkelijke waarde, ongeacht de taal die geselecteerd is door de gebruiker.

source: If an original element is modified after it has been translated, a notification will be displayed in the Translation tab, as well as in the translation interface. In the latter, one can choose to keep the current translation or modify it. Until this has been done, the original non-translated value will be displayed in the published dataset.
es: Si se modifica un elemento original después de traducirse, se mostrará una notificación en la ficha Traducciones, así como en la interfaz de traducción. En este caso, se puede elegir mantener la traducción actual o modificarla. Hasta que se lleve a cabo esa acción, en el conjunto de datos publicado aparecerá el valor original sin traducir.
fr: Si un élément original est modifié après avoir été traduit, une notification apparaîtra dans l'onglet Traductions et dans l'interface de traduction. C'est depuis cette dernière que vous pouvez choisir de conserver la traduction actuelle ou de la modifier. Dans l'attente de cette opération, la valeur non traduite originale sera affichée dans le jeu de données publié.

source: Managing translations in the translation interface
es: Gestionar las traducciones en la interfaz de traducción
fr: Gérer les traductions dans l'interface de traduction

source: Approving or rejecting translation suggestions
de: Übersetzungsvorschläge annehmen oder verwerfen
es: Aprobar o rechazar propuestas de traducción
fr: Approuver ou rejeter les suggestions de traduction
nl: Vertaalsuggesties goedkeuren of verwerpen

source: If a value has already been translated in any dataset of the domain, the platform will automatically suggest that translation for the same value. In that case, the suggested translation is automatically written in the translation textbox, as a proposition that can either be validated of rejected.
es: Si un valor ya se ha traducido en algún conjunto de datos del dominio, la plataforma automáticamente propondrá esa traducción para el mismo valor. En ese caso, la traducción propuesta se escribe automáticamente en el cuadro de texto de traducción como una sugerencia que se puede validar o rechazar.

source: Click *Yes* to validate the suggestion, or, click *No* to reject the suggestion.
es: Haga clic en *Sí* para validar la propuesta, o en *No* para rechazarla.

source: Click the Submit button to save the translations.
de: Klicken Sie auf den Button "Einreichen", um die Übersetzungen zu speichern.
es: Haga clic en el botón Enviar para guardar las traducciones.
fr: Cliquez sur le bouton Envoyer pour enregistrer les traductions.
nl: Klik op de knop Indienen om de vertalingen op te slaan.

source: To validate all translations suggestions, click the Validate all suggestions button in the top right hand corner of the translation interface.
es: Para validar todas las propuestas de traducción, haga clic en el botón Validar todas las sugerencias de la esquina superior derecha de la interfaz de traducción.

source: Adding new translations
de: Neue Übersetzungen hinzufügen
es: Añadir traducciones nuevas
fr: Ajouter de nouvelles traductions
nl: Nieuwe vertalingen toevoegen

source: If a value has never been translated, or if the translation suggestion was rejected, a new translation should be added.
de: Wenn eine Formulierung noch nie übersetzt wurde, oder wenn der Übersetzungsvorschlag verworfen wurde, sollte eine neue Übersetzung hinzugefügt werden.
es: Si un valor no se ha traducido nunca, o se ha rechazado la propuesta de traducción, debe añadirse una traducción nueva.
fr: Si une valeur n'a jamais été traduite ou si la suggestion de traduction a été rejetée, l'utilisateur doit ajouter une nouvelle traduction.
nl: Wanneer een waarde nooit vertaald geweest is of wanneer de vertaalsuggestie verworpen geweest is, dient een nieuwe vertaling te worden toegevoegd.

source: Add new translations in the right textboxes.
de: Ergänzen Sie neue Übersetzungen in den richtigen Textfeldern.
es: Añada las traducciones nuevas en los cuadros de texto de la derecha.
nl: Nieuwe vertalingen toevoegen in de juiste tekstvakken.

source: If the original value should be kept as is (e.g. a producer name), click the |icon-copy-value| button to fill up the translation textbox with that same value.
es: Si el valor original debe conservarse tal cual (p. ej. un nombre de productor), haga clic en el botón |icon-copy-value| para completar el cuadro de texto de traducción con ese mismo valor.

source: For domains with more than one language activated in the front office, Opendatasoft allows the translation of specific elements of the datasets and their metadata. When translated, this information appears in the language the user selected to navigate the portal. It should help them understand the dataset as best as possible, even though the data itself is not in their preferred language.
fr: Pour les domaines pour lesquels plus d'une langue a été activée dans l'interface de navigation, Opendatasoft permet de traduire certains éléments des jeux de données, ainsi que leurs métadonnées. Une fois traduites, ces informations sont écrites dans la langue sélectionnée par l'utilisateur naviguant sur le portail. Cette option devrait lui permettre de comprendre au mieux le jeu de données, même si les données ne sont pas dans sa langue de prédilection.

source: The :doc:`Information tab</publishing_data/06_configuring_metadata/configuring_metadata>`, which contains 4 standard metadata that can be translated: Title, Description, Keywords, and Publisher.
fr: L':doc:`onglet Informations</publishing_data/06_configuring_metadata/configuring_metadata>`, qui contient 4 métadonnées standard pouvant être traduites : le titre, la description, les mots-clés et le producteur du jeu de données.

source: The :doc:`Processing tab</publishing_data/05_processing_data/processing_data>`, which contains the dataset fields labels and descriptions that can also be translated.
fr: L':doc:`onglet Traitement</publishing_data/05_processing_data/processing_data>`, qui contient les labels et descriptions des champs du jeu de données, qui peuvent aussi être traduits.

source: The right side displays the text boxes where the translations should be written. The translations can be:
fr: Le côté droit affiche les zones de texte où les traductions devraient être saisies. Les traductions peuvent au choix :

source: suggestions proposed by the platform, or
fr: être suggérées par la plateforme,

source: new translations.
fr: ou être de nouvelles traductions.

source: If a value has already been translated in any dataset of the domain, the platform will automatically suggest that translation for the same value. In that case, the suggested translation is automatically written in the translation text box as a proposition that can either be validated or rejected.
fr: Si une valeur a déjà été traduite dans l'un des jeux de données du domaine, la plateforme suggérera automatiquement cette traduction pour les valeurs identiques. Dans ce cas, la traduction suggérée est écrite automatiquement dans la zone de texte de traduction, sous forme d'une proposition pouvant être validée ou rejetée.

source: Click *Yes* to validate the suggestion or *No* to reject the suggestion.
fr: Cliquez sur *Oui* pour valider la suggestion ou sur *Non* pour la rejeter.

source: To validate all translation suggestions, click the Validate all suggestions button in the top-right hand corner of the translation interface.
fr: Pour valider toutes les suggestions de traduction, cliquez sur le bouton Valider toutes les suggestions en haut à droite de l'interface de traduction.

source: Add new translations in the right text boxes.
fr: Ajoutez les nouvelles traductions dans les zones de texte correspondantes.

source: If the original value should be kept as is (for example, a producer name), click the |icon-copy-value| button to fill up the translation text box with that same value.
fr: Si la valeur d'origine doit être conservée (par exemple, nom du producteur), cliquez sur le bouton |icon-copy-value| pour copier cette même valeur dans la zone de texte de traduction.
