Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/03_managing_tracking/third_party_analytics.po
Languages: de, es, fr, nl

source: Third-party analytics
de: Drittanbieter-Analyse
es: Análisis de terceros
fr: Analyses tierces
nl: Analyse van derden

source: The monitoring tools provided by Opendatasoft focus on API calls and usages. They are useful to gather precise information on :doc:`how data is consumed </managing_domain/03_analyzing_domain_usage/index>`. But, they can be limiting when trying to measure more broadly the audience of a portal.
de: Die von Opendatasoft bereitgestellten Monitoring-Tools basieren auf API-Aufrufen und Nutzungen. Sie sind nützlich, um präzise Informationen darüber zu erhalten, :doc:`wie Daten verwendet werden</managing_domain/03_analyzing_domain_usage/index>`. Sie sind jedoch eingeschränkt, wenn Sie die Besucher Ihres Portals allgemeiner analysieren möchten
es: Las herramientas de supervisión proporcionadas por Opendatasoft se centran en llamadas de API y usos. Estos son útiles para recopilar información precisa acerca de cómo :doc:`cómo se consumen los datos </managing_domain/03_analyzing_domain_usage/index>`. Pero pueden suponer una limitación al intentar medir la audiencia de un portal de forma más general.
fr: Les outils de monitoring fournis par Opendatasoft sont centrés sur les utilisations et les appels d'API. Ils sont utiles pour recueillir des informations précises sur :doc:`la façon dont les données sont consommées </managing_domain/03_analyzing_domain_usage/index>`. Toutefois, ils peuvent être limitants si vous mesurez l'audience d'un portail d'une manière plus large.
nl: De monitoring tools die door Opendatasoft worden aangeboden, zijn vooral gericht op API calls en gebruikswijzen. Ze zijn nuttig om nauwkeurige informatie te verzamelen over :doc:`hoe data worden gebruik </managing_domain/03_analyzing_domain_usage/index>`. Maar het kan beperkend zijn wanneer wordt geprobeerd het publiek van een portaal in ruimere mate te meten.

source: Third-party services, specialized in measuring audience, can give additional analytics such as referral sources, visitors' geographical origin, or time spent on the portal.
de: Drittanbieter-Dienste, die auf die Messung der Besucherzahlen spezialisiert sind, können zusätzliche Analysen liefern, wie etwa Verweisquellen, die geografische Herkunft der Besucher oder die auf dem Portal verbrachte Zeit.
es: Los servicios de terceros especializados en medir la audiencia pueden proporcionarle análisis adicionales tales como las fuentes de referencia, el origen geográfico de los visitantes o el tiempo que pasan en el portal.
fr: Les services tiers, spécialisés dans la mesure de l'audience, peuvent fournir des statistiques supplémentaires, telles que les sources de référencement, l'origine géographique des visiteurs ou le temps passé sur le portail.
nl: Diensten van derden, die gespecialiseerd zijn in het meten van het publiek, kunnen bijkomende analyses verschaffen zoals verwijzingsbronnen, geografische herkomst van bezoekers of tijd die wordt doorgebracht op het portaal.

source: Opendatasoft supports integration with Google Analytics, XiTi, SmartTag by AT Internet, and Matomo. Once configured and running, they allow audience tracking on the front office of a domain.
de: Opendatasoft unterstützt die Integration mit Google Analytics, XiTi, SmartTag by AT Internet und Matomo. Sobald diese konfiguriert und in Betrieb sind, ermöglichen sie das Besucher-Tracking im Frontoffice einer Domain.
es: Opendatasoft admite la integración con Google Analytics, XiTi, SmartTag de AT Internet y Matomo. Una vez que se han configurado y ejecutado, permiten hacer un seguimiento del público en el front office de un dominio.
fr: Opendatasoft prend en charge les intégrations avec Google Analytics, XiTi, SmartTag by AT Internet et Matomo. Une fois configurées et exécutées, elles permettent de suivre l'audience sur l'interface de navigation d'un domaine.
nl: Opendatasoft ondersteunt de integratie met Google Analytics, XiTi, SmartTag via AT Internet en Matomo. Eenmaal ze geconfigureerd zijn en runnen, laten ze toe publiek op te volgen op de front office van een domein.

source: Configuring Google Analytics
de: Google Analytics konfigurieren
es: Configuración de Google Analytics
fr: Configurer Google Analytics
nl: Google Analytics configureren.

source: Google Analytics is an analytics solution edited by Google. Currently, only "Universal Analytics" properties are supported.
de: Google Analytics ist eine von Google entwickelte Analyselösung. Derzeit wird lediglich die Property "Universal Analytics" unterstützt.
es: Google Analytics es una solución de análisis editada por Google. Actualmente, solo se admiten las propiedades "Universal Analytics".
fr: Google Analytics est une solution d'analyse éditée par Google. À ce jour, seules les propriétés "Universal Analytics" sont prises en charge.
nl: Google Analytics is een analyseoplossing die geboden wordt door Google. Momenteel worden enkel "Universele Analyses"-eigenschappen ondersteund.

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: Retrieve the Google Analytics ID for your domain. It should start with ``UA-``.
de: Rufen Sie die Google Analytics-ID für Ihre Domain ab. Diese sollte mit ``UA-`` beginnen.
es: Recupere el ID de Google Analytics para su dominio. Debe empezar por ``UA-``.
fr: Récupérez l'identifiant Google Analytics pour votre domaine. Il doit commencer par ``UA-``.
nl: Vul het ID van Google Analytics in het desbetreffende tekstvak in. Dit zou moeten beginnen met ``UA-``.

source: In the **Configuration** > **Tracking** section of the back office, go to the Google Analytics area.
de: Rufen Sie die Seite **Konfiguration** > **Tracking** im Back-Office auf und öffnen Sie anschließend den Bereich Google Analytics.
es: En la sección **Configuración** > **Seguimiento** del back office, vaya al área de Google Analytics.
fr: Dans la section **Configuration** > **Suivi** de l'interface d'administration, accédez à la zone Google Analytics.
nl: Ga in de rubriek **Configuratie** > **Opvolging** van de back office naar de ruimte Google Analytics.

source: Enter your Google Analytics ID in the corresponding field.
de: Geben Sie Ihre Google Analytics ID in das entsprechende Feld ein.
es: Especifique su ID de Google Analytics en el campo correspondiente.
fr: Entrez votre identifiant Google Analytics dans le champ correspondant.
nl: Voer uw Google Analytics ID in in het overeenkomstige veld.

source: Click on the **Save** button in the top right corner.
de: Klicken Sie oben rechts auf den Button **Speichern**.
es: Haga clic en el botón **Guardar** en la esquina superior derecha.
fr: Cliquez sur le bouton **Enregistrer** en haut à droite.
nl: Klik op de knop **Opslaan** in de rechter bovenhoek.

source: Google Analytics is now activated on the domain.
de: Google Analytics ist nun auf der Domain aktiviert.
es: Google Analytics ahora está activado en el dominio.
fr: Google Analytics est désormais activé sur le domaine.
nl: Google Analytics is nu geactiveerd op het domein.

source: Using Google Analytics on your portal involves obtaining visitors' consent to comply with certain privacy laws such as the EU General Data Protection Regulation (GDPR). For more information, see :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
de: Die Nutzung von Google Analytics auf Ihrem Portal erfordert die Einholung der Zustimmung der Besucher, um bestimmte Datenschutzgesetze wie die EU-Datenschutzgrundverordnung (DSGVO) einzuhalten. Weitere Informationen finden Sie unter :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
es: El uso de Google Analytics en su portal implican obtener el consentimiento de los visitantes en cumplimiento de determinadas normativas de privacidad como el Reglamento General de Protección de Datos de la Unión Europea (RGPD). Para obtener más información, consulte :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
fr: Utiliser Google Analytics sur votre portail implique d'obtenir le consentement des visiteurs pour respecter certaines lois en matière de confidentialité, telles que le Règlement général sur la protection des données (RGPD) de l'UE. Pour plus d'informations, consultez :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
nl: Het gebruik van Google Analytics op uw portaal houdt in dat u de toestemming van gebruikers moet krijgen om in overeenstemming te zijn met bepaalde privacywetten, zoals de Algemene Verordening Gegevensbescherming (AVG) van de EU. Voor meer informatie, zie :doc:`../../../configuring_domain/02_managing_legal_information/legals`.

source: Configuring XiTi Analyzer NX
de: XiTi Analyzer NX konfigurieren
es: Configuración de XiTi Analyzer NX
fr: Configurer XiTi Analyzer NX
nl: XiTi Analyzer NX configureren

source: XiTi is an analytics solution edited by AT Internet.
de: XiTi ist eine von AT Internet herausgegebene Analyselösung.
es: XiTi es una solución de análisis editada por AT Internet.
fr: XiTi est une solution d'analyse éditée par AT Internet.
nl: XiTi is een analyseoplossing die geboden wordt door AT Internet.

source: The activation of XiTi on an Opendatasoft domain involves the Opendatasoft team.
de: Die Aktivierung von XiTi auf einer Opendatasoft-Domain erfolgt durch das Opendatasoft-Team.
es: En la activación de XiTi en un dominio Opendatasoft interviene el equipo de Opendatasoft.
fr: L'activation de XiTi sur un domaine Opendatasoft nécessite de faire appel à l'équipe Opendatasoft.
nl: Bij de activering van XiTi op een Opendatasoft-domein wordt het Opendatasoft-team betrokken.

source: Contact support@opendatasoft.com and send an ``xtcore.js`` file and your XiTi identifiers, both provided by XiTi.
de: Schreiben Sie an support@opendatasoft.com und senden Sie eine ``xtcore.js`` Datei sowie Ihre XiTi-Kennungen. Beides wird von XiTi bereitgestellt.
es: Póngase en contacto con support@opendatasoft.com y envíe un archivo ``xtcore.js``, así como sus identificadores XiTi, ambos facilitados por XiTi.
fr: Envoyez un e-mail à l'adresse support@opendatasoft.com en joignant un fichier ``xtcore.js`` et vos identifiants XiTi, fournis par XiTi.
nl: Contacteer support@opendatasoft.com en stuur een ``xtcore.js`` -bestand, alsook uw XiTi-identificatiegegevens die beide verschaft worden door XiTi.

source: After verification and approval of the JavaScript file by Opendatasoft, XiTi is available on the Opendatasoft domain.
de: Nach der Überprüfung und Freigabe der JavaScript-Datei durch Opendatasoft, ist XiTi in der Opendatasoft-Domain verfügbar.
es: Tras la verificación y la aprobación del archivo JavaScript por parte de Opendatasoft, XiTi está disponible en el dominio Opendatasoft.
fr: Après vérification et validation du fichier JavaScript par Opendatasoft, XiTi sera disponible dans le domaine Opendatasoft.
nl: Na controle en goedkeuring van het JavaScript-bestand door Opendatasoft is XiTi beschikbaar op het Opendatasoft-domein.

source: In the **Configuration** > **Tracking** section of the back office, go to the **XiTi** area.
de: Rufen Sie die Seite **Konfiguration** > **Tracking** im Back-Office auf und öffnen Sie anschließend den Bereich **XiTi**.
es: En la sección **Configuración** > **Seguimiento** del back office, vaya al área **XiTi**.
fr: Dans la section **Configuration** > **Suivi** de l'interface d'administration, accédez à la zone **XiTi**.
nl: Ga in de rubriek **Configuratie** > **Opvolging** van de back office naar de ruimte **XiTi**.

source: Enter in the following values in the related fields: XTSD Code (mandatory), XTSITE Code (mandatory), Level 2 Site ID, and Root used in page names.
de: Geben Sie die folgenden Werte in die entsprechenden Felder ein: XTSD Code (erforderlich), XTSITE Code (erforderlich), Level 2 Site ID und Root, die in Seitennamen verwendet werden.
es: Especifique los siguientes valores en los campos correspondientes: Código XTSD (obligatorio), Código XTSITE (obligatorio), ID de sitio de nivel 2 y Raíz utilizada en nombres de página.
fr: Entrez les valeurs suivantes dans les champs correspondants : Code XTSD (obligatoire), Code XTSITE (obligatoire), Identifiant site niveau 2 et Racine, qui se trouvent dans le nom des pages.
nl: Vul de volgende waarden in in de desbetreffende velden: XTSD Code (verplicht), XTSITE Code (verplicht), Level 2 Site ID en Root die gebruikt worden in de paginanamen.

source: Depending on your tracker configuration, toggle on **Require user consent** to allow visitors to enable or disable cookies in a cookie banner. In case of doubt, you may contact the relevant people in your organization. For more information, see :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
de: Aktivieren Sie abhängig von Ihrer Tracker-Konfiguration die Option **Einverständnis des Benutzers einholen**. So erlauben Sie Ihren Besuchern, Cookies in einem Cookie-Banner zu aktivieren oder zu deaktivieren. Im Zweifelsfall können Sie sich an die zuständigen Personen in Ihrer Organisation wenden. Für weitere Informationen, siehe :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
es: En función de la configuración de su rastreador, active el botón de alternancia **Requerir consentimiento de usuario** para que los visitantes puedan habilitar o inhabilitar las cookies en un báner de cookies. En caso de duda, puede contactar con las personas pertinentes dentro de su organización. Para obtener más detalles, consulte :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
fr: En fonction de votre configuration des traceurs, activez l'option **Demander le consentement des utilisateurs** pour permettre aux visiteurs d'activer ou de désactiver les cookies dans une bannière de cookies. En cas de doute, vous pouvez contacter les experts de ce domaine au sein de votre organisation. Pour plus d'informations, consultez :doc:`../../../configuring_domain/02_managing_legal_information/legals`.
nl: Toggle, afhankelijk van uw trackerconfiguratie op **Vereis toestemming van de gebruiker** om bezoekers toe te laten cookies in een cookie banner te activeren of te deactiveren. Bij twijfel kunt u contact opnemen met de desbetreffende mensen binnen uw organisatie. Voor meer informatie, zie :doc:`../../../configuring_domain/02_managing_legal_information/legals`.

source: XiTi is now activated on the domain.
de: XiTi ist jetzt auf der Domain aktiviert.
es: XiTi ahora está activado en el dominio.
fr: XiTi est désormais activé sur le domaine.
nl: XiTi is nu geactiveerd op het domein.

source: Activating SmartTag
de: SmartTag aktivieren
es: Activación de SmartTag
fr: Activer SmartTag
nl: SmartTag activeren

source: SmartTag is an analytics solution edited by AT Internet.
de: SmartTag ist eine von AT Internet herausgegebene Analyselösung.
es: SmartTag es una solución de análisis editada por AT Internet.
fr: SmartTag est une solution d'analyse éditée par AT Internet.
nl: SmartTag is een analyseoplossing die geboden wordt door AT Internet.

source: The activation of SmartTag on an Opendatasoft domain involves the Opendatasoft team.
de: Die Aktivierung von SmartTag auf einer Opendatasoft-Domain erfolgt durch das Opendatasoft-Team.
es: En la activación de SmartTag en un dominio Opendatasoft interviene el equipo de Opendatasoft.
fr: L'activation de SmartTag sur un domaine Opendatasoft nécessite de faire appel à l'équipe Opendatasoft.
nl: Bij de activering van SmartTag op een Opendatasoft-domein wordt het Opendatasoft-team betrokken.

source: Contact support@opendatasoft.com and send a ``smarttag.js`` file provided by SmartTag.
de: Schreiben Sie an support@opendatasoft.com und senden Sie eine ``smarttag.js`` Datei, die von SmartTag bereitgestellt wird.
es: Póngase en contacto con support@opendatasoft.com y envíe un archivo ``smarttag.js`` suministrado por SmartTag.
fr: Envoyez un e-mail à l'adresse support@opendatasoft.com en joignant un fichier ``smarttag.js`` fourni par SmartTag.
nl: Contacteer support@opendatasoft.com en stuur een ``smarttag.js``-bestand dat verschaft wordt door SmartTag.

source: After verification and approval of the JavaScript file by Opendatasoft, SmartTag is available on the Opendatasoft domain.
de: Nach der Überprüfung und Freigabe der JavaScript-Datei durch Opendatasoft, ist SmartTag auf der Opendatasoft-Domain verfügbar.
es: Tras la verificación y la aprobación del archivo JavaScript por parte de Opendatasoft, SmartTag está disponible en el dominio Opendatasoft.
fr: Après vérification et validation du fichier JavaScript par Opendatasoft, SmartTag sera disponible dans le domaine Opendatasoft.
nl: Na controle en goedkeuring van het JavaScript-bestand door Opendatasoft, is SmartTag beschikbaar op het Opendatasoft-domein.

source: In the **Configuration** > **Tracking** section of the back office, go to the **SmartTag** area.
de: Öffnen Sie im Back-Office unter **Konfiguration** > **Tracking** den Bereich **SmartTag**.
es: En la sección **Configuración** > **Seguimiento** del back office, vaya al área **SmartTag**.
fr: Dans la section **Configuration** > **Suivi** de l'interface d'administration, accédez à la zone **SmartTag**.
nl: Ga in de rubriek **Configuratie** > **Opvolging** van de back office naar de ruimte **SmartTag**.

source: Click the **Enable SmartTag** toggle button.
de: Klicken Sie auf die Schaltfläche **SmartTag aktivieren**.
es: Haga clic en el botón de alternancia **Activar SmartTag**.
fr: Cliquez sur le bouton **Activer SmartTag**.
nl: Klik op de toggle-knop **SmartTag activeren**.

source: SmartTag is now activated on the domain.
de: SmartTag ist nun auf der Domain aktiviert.
es: SmartTag ahora está activado en el dominio.
fr: SmartTag est désormais activé sur le domaine.
nl: SmartTag is nu geactiveerd op het domein.

source: Configuring Matomo
de: Matomo konfifurieren
es: Configuración de Matomo
fr: Configurer Matomo
nl: Matomo configureren

source: Matomo is an open-source analytics platform. Matomo Tag Manager is not supported by Opendatasoft.
de: Matomo ist eine Open-Source-Webanalytik-Plattform. Der Matomo Tag Manager wird von Opendatasoft nicht unterstützt.
es: Matomo es una plataforma de análisis de código abierto. Matomo Tag Manager no está permitido en Opendatasoft.
fr: Matomo est une plateforme d'analyse open source. Matomo Tag Manager n'est pas pris en charge par Opendatasoft.
nl: Matomo is een open-source analyseplatform. Matomo Tag Manager wordt niet ondersteund door Opendatasoft.

source: Retrieve the site URL and site ID for your domain from Matomo's administration portal.
de: Rufen Sie die Website-URL und Website-ID für Ihre Domain vom Matomo-Administrationsportal ab.
es: Recupere la dirección URL de sitio y el ID de sitio para su dominio del portal de administración de Matomo.
fr: Récupérez l'URL et l'identifiant du site pour votre domaine à partir du portail d'administration de Matomo.
nl: Haal de URL-site en ID-site voor uw domein op vanuit het beheerportaal van Matomo.

source: In the **Configuration** > **Tracking** section of the back office, go to the **Matomo** area.
de: Öffnen Sie im Back-Office unter **Konfiguration** > **Tracking** den Bereich **Matomo**.
es: En la sección **Configuración** > **Seguimiento** del back office, vaya al área **Matomo**.
fr: Dans la section **Configuration** > **Suivi** de l'interface d'administration, accédez à la zone **Matomo**.
nl: Ga in de rubriek **Configuratie** > **Opvolging** van de back office naar de ruimte **Matomo**.

source: Enter your site URL and site ID in the corresponding fields.
de: Geben Sie Ihre Website-URL und Website-ID in die entsprechenden Felder ein.
es: Especifique su dirección URL de sitio y su ID de sitio en los campos correspondientes.
fr: Entrez l'URL et l'ID de votre site dans les champs correspondants.
nl: Voer uw website URL en website ID in in de overeenkomstige velden.

source: Matomo is now activated on the domain.
de: Matomo ist nun auf der Domain aktiviert.
es: Matomo ahora está activado en el dominio.
fr: Matomo est désormais activé sur le domaine.
nl: Matomo is nu geactiveerd op het domein.
