Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/getting_started/domains_and_datasets.po
Languages: fr

source: Domains and Datasets
fr: Domaines et Jeux de Données

source: This article aims at introducing the basic concepts you need to understand when using the OpenDataSoft platform:
fr: Cet article a pour objectif d'introduire les principaux concepts nécessaires à la compréhension du fonctionnement de la plateforme OpenDataSoft.

source: **Domain**
fr: **Domaine**

source: **Dataset**
fr: **Jeu de données**

source: **Metadata**
fr: **Métadonnées**

source: **Record**
fr: **Enregistrement**

source: When you subscribe to a given OpenDataSoft plan, you actually become the administrator of an OpenDataSoft **domain**.
fr: Quand vous faites l'acquisition d'une licence OpenDataSoft, vous devenez dans les faits administrateur d'un (ou plusieurs) **domaines** OpenDataSoft.

source: A domain is accessible through its fully qualified DNS name, for instance: **mydomain.opendatasoft.com**. A domain can of course be given alternate name and you can even use CNAME aliases to have you owned domain refer to an OpenDataSoft domain.
fr: Un domaine est accessible à partir de son nom DNS, par exemple **mydomain.opendatasoft.com**. Un domaine peut bien sûr se voir attribuer un alias, permettant d'y accéder en utilisant une adresse complètement spécifique, par exemple **data.mydomain.com**.

source: A domain contains datasets. The set of datasets belonging to a domain is often called the **datasets catalog**.
fr: Un domaine contient des **jeux de données**. L'ensemble des jeux de données appartenant à un domaine est également souvent appelé le **catalogue de jeux de données**.

source: A dataset is described by a set of metadata, such as its title, publishing date, license, etc.
fr: Un jeu de données est décrit par un ensemble de **métadonnées** (par exemple, son titre, sa date de publication, sa licence ...).

source: A dataset itself contains structured records. The structure of the records contained within a dataset are defined by the **dataset schema** (think of it as a RDBMS table schema).
fr: Un jeu de données contient lui même des **enregistrements**. La structure des enregistrements contenus dans un jeu de données est définie par le **schéma** du jeu de données.
