Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/concatenate_text.po
Languages: fr, nl

source: Concatenate text processor
fr: Processeur Concaténer du texte

source: This processor allows to concatenate 2 fields using a separator.
fr: Ce processeur permet de concaténer 2 champs à l'aide d'un séparateur.
nl: Deze processor laat toe om 2 velden samen te voegen door gebruik te maken van een scheidingsteken.

source: This processor is usually used after creating a dataset with images, when these images are sourced via a URL (e.g. images stored in a remote server).
fr: Ce processeur est généralement utilisé après la création d'un jeu de données avec des images, quand celles-ci proviennent d'une URL (par ex. des images stockées sur un serveur distant).
nl: Deze processor wordt meestal gebruik na het aanmaken van een dataset met afbeeldingen, wanneer deze afbeeldingen gesourced worden via een URL (bijv. afbeeldingen opgeslagen in een server op afstand).

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Concatenate text processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Concaténer du texte, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire
nl: Verplicht

source: Separator
fr: Séparateur
nl: Scheidingsteken

source: Separator used between the values of the concatenated fields
fr: Séparateur utilisé entre les valeurs des champs concaténés
nl: Scheidingsteken dat gebruikt wordt tussen de waarden van de samengevoegde velden

source: no
fr: non
nl: nee

source: Left value
fr: Valeur gauche
nl: Waarde links

source: Field which value will appear on the left side of the separator
fr: Champ dont la valeur s'affichera à gauche du séparateur
nl: Veld waarvan de waarde aan de linkerzijde van het scheidingsteken zal verschijnen

source: yes
fr: oui
nl: ja

source: Right value
fr: Valeur droite
nl: Waarde rechts

source: Field which value will appear on the right side of the separator
fr: Champ dont la valeur s'affichera à droite du séparateur
nl: Veld waarvan de waarde aan de rechterzijde van het scheidingsteken zal verschijnen

source: Output field
fr: Champ de sortie
nl: Outputveld

source: Field where the concatenated values will be displayed. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ dans lequel les valeurs concaténées seront affichées. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
nl: Veld waarin de samengevoegde waarden worden weergegeven. Dit kan een bestaand veld zijn dat gekozen wordt uit de lijst of een nieuw veld dat hiervoor is aangemaakt (in dat geval, kies **Invoer tekst** uit de lijst en noteer de naam van het nieuwe veld in de tekstruimte eronder).

source: To set the parameters of the Concatenate Text processor, follow the indications from the table below.
nl: Om de parameters van de Concatenate Text processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Description
nl: Omschrijving
