Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/copy_field.po
Languages: fr, nl

source: Copy a field processor
fr: Processeur Copier un Champ

source: This processor copies a field value into another field.
fr: Ce processeur copie la valeur d'un champ dans un autre champ.
nl: Deze processor kopieert een veldwaarde in een ander veld.

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Copy a field processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Copier un Champ, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Copy a field processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Mandatory
fr: Obligatoire
nl: Verplicht

source: Field to copy
fr: Champ à copier
nl: Veld om te kopiÃ«ren

source: Field which value will be copied
fr: Champ dont la valeur sera copiée
nl: Veld waarvan de waarde zal worden gekopieerd

source: yes
fr: oui
nl: ja

source: New field
fr: Nouveau champ
nl: Nieuw veld

source: Field where the copied field will be pasted. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ dans lequel le champ copié sera collé. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
nl: Veld waarin het gekopieerde veld zal worden geplakt. Dit kan een bestaand veld zijn dat gekozen wordt uit de lijst of een nieuw veld dat hiervoor is aangemaakt (in dat geval, kies **Invoer tekst** uit de lijst en noteer de naam van het nieuwe veld in de tekstruimte eronder).

source: Description
nl: Omschrijving
