Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/create_geopoint.po
Languages: fr, it

source: Create GeoPoint processor
fr: Processeur Créer un GeoPoint
it: Processore Crea geopoint

source: This processor creates a geopoint field from a latitude field and a longitude field.
fr: Ce processeur crée un champ point géo à partir d'un champ latitude et d'un champ longitude.
it: Questo processore permette di creare un campo punto geografico a partire da un campo latitudine e un campo longitudine.

source: Setting the processor
fr: Configurer le processeur
it: Configurazione del processore

source: To set the parameters of the Create GeoPoint processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Créer un GeoPoint, suivez les indications du tableau ci-dessous.
it: Per configurare i parametri del processore Crea geopoint, procedi come descritto nella tabella sottostante.

source: Label
it: Etichetta

source: Description
it: Descrizione

source: Mandatory
fr: Obligatoire
it: Obbligatorio

source: Default Value
fr: Valeur par défaut
it: Valore predefinito

source: Latitude
it: Latitudine

source: Field which contains the latitude to create the geopoint
fr: Champ contenant la latitude pour créer le point géo
it: Campo contenente la latitudine per la creazione del punto geografico

source: yes
fr: oui
it: sì

source: Longitude
it: Longitudine

source: Field which contains the longitude to create the geopoint
fr: Champ contenant la longitude pour créer le point géo
it: Campo contenente la longitudine per la creazione del punto geografico

source: Source EPSG Code
it: Codice EPSG sorgente

source: Represents the `EPSG <http://spatialreference.org/ref/epsg/>`_ (spacial reference) code of the geographical data
fr: Représente le code `EPSG <http://spatialreference.org/ref/epsg/>`_ (référence dans l'espace) des données géographiques
it: Rappresenta il codice `EPSG <http://spatialreference.org/ref/epsg/>`_ (riferimento spaziale) del dato geografico

source: Output Field
fr: Champ de sortie
it: Campo di uscita

source: Field that will contain the produced geopoint. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ qui contiendra le point géo généré. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
it: Campo che conterrà il punto geografico ottenuto. Può essere un campo esistente all'interno dell'elenco o un nuovo campo creato appositamente allo scopo. In tal caso, seleziona **Inserisci testo** nell'elenco e digita il nome del nuovo campo nell'area di testo sottostante.
