Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/decode_google_polyline.po
Languages: fr

source: Decode a Google polyline processor
fr: Processeur Décoder un polyline Google

source: This processor is not available by default. Please contact Opendatasoft support team if you want this processor to be activated in your domain.
fr: Ce processeur n'est pas disponible par défaut. Veuillez contacter l'équipe support Opendatasoft si vous souhaitez l'activer dans votre domaine.

source: This processor allows to decode a Google polyline to transform it into a GeoJSON LineString.
fr: Ce processeur permet de décoder un polyline Google, afin de le transformer en LineString GeoJSON.

source: Setting the processor
fr: Configurer le processeur

source: To set the parameters of the Decode a Google polyline processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Décoder un polyline Google, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire

source: Default value
fr: Valeur par défaut

source: Encoded polyline
fr: Polyline encodé

source: Field which contains the Google polyline
fr: Champ contenant le polyline Google

source: yes
fr: oui

source: Reverse Lng/Lat
fr: Inverser Long/Lat

source: If checked: reverses the geographic coordinates
fr: Si la case de cette option est cochée : inverse les coordonnées géographiques

source: no
fr: non

source: Output field
fr: Champ de sortie

source: Field that will contain the GeoJSON LineString. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ qui contiendra la LineString GeoJSON. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
