Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/deduplicate_multivalued_fields.po
Languages: fr, nl

source: Deduplicate multivalued fields processor
fr: Processeur Dédupliquer des champs multivalués
nl: Processor voor velden met meerdere waarden dedupliceren

source: This processor allows to remove duplicates in multivalued fields.
fr: Ce processeur permet de supprimer les doublons des champs multivalués.
nl: Met deze processor kunnen duplicaten in velden met meerdere waarden worden verwijderd.

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Deduplicate multivalued fields processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Dédupliquer les champs multivalués, suivez les indications du tableau ci-dessous.
nl: Volg de aanwijzingen in onderstaande tabel om de parameters in te stellen om de processor voor velden met meerdere waarden te dedupliceren.

source: Description
nl: Omschrijving

source: Mandatory
fr: Obligatoire
nl: Verplicht

source: Duplicated field
fr: Champ dupliqué
nl: Gedupliceerd veld

source: Field which contains the multivalues
fr: Champ contenant plusieurs valeurs
nl: Veld dat de meerdere waarden bevat

source: yes
fr: oui
nl: ja

source: Output field
fr: Champ de sortie
nl: Outputveld

source: Field that will contain the multivalues without duplicates. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ qui contiendra plusieurs valeurs sans doublons. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
nl: Veld dat de meerdere waarden zonder duplicaten bevat. Dit kan een bestaand veld zijn dat gekozen wordt uit de lijst of een nieuw veld dat hiervoor is aangemaakt (in dat geval, kies **Invoer tekst** uit de lijst en noteer de naam van het nieuwe veld in de tekstruimte eronder).

source: Separator
fr: Séparateur
nl: Scheidingsteken

source: Character or string used to separate the different values
fr: Caractère ou chaîne de caractères utilisé pour séparer les différentes valeurs
nl: Karakter of string die gebruikt wordt om de verschillende waarden van elkaar te scheiden
