Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/delete_record_by_*.po
Languages: id

source: Delete record by ID processor
id: Processore Elimina record per ID

source: This processor sends a delete order to remove an existing record of a dataset, based on the unique ID. It implies that the existing record will be deleted in both the current version of the dataset and its history. This processors indeed aims regularly updated datasets.
id: Questo processore invia un ordine di cancellazione per rimuovere da un dataset un record esistente, in base al suo ID univoco. In tal modo, il record verrà eliminato sia nella versione corrente del dataset che nella sua cronologia. Questo processore si applica ai dataset aggiornati periodicamente.

source: Example: if a dataset contains a list of companies (with information such as status, number of employees, sector of activity etc.), it is regularly updated to make sure that all information about these companies are still valid. With the Delete record by ID processor, it is possible to delete records concerning companies that are now closed. It will not only delete the record from the most recent source from the last update, but also the records (concerning the closed company) from all previous sources of the dataset.
id: Esempio: un dataset contenente un elenco di aziende (con informazioni relative a stato, numero di dipendenti, settore di attività e così via) viene aggiornato periodicamente per fare in modo che tutte le informazioni siano sempre valide. Con il processore Elimina record per ID, è possibile eliminare i record riguardanti le aziende non più in attività. In tal modo, non viene semplicemente eliminato il record contenuto nell'origine più aggiornata, ma anche i record dell'azienda presenti nelle precedenti origini del dataset.

source: The changes applied to the dataset with this processor are not visible in the dataset preview of the Processing tab. Save, publish and explore the dataset in the front office to see the changes.
id: Le modifiche applicate al dataset con questo processore non sono visibili nell'anteprima della scheda Elaborazione. Per renderle visibili è necessario salvare, pubblicare ed esplorare il dataset nell'interfaccia di front-office.

source: Setting the processor
id: Configurazione del processore

source: To set the parameters of the Delete record by ID processor, follow the indications from the table below.
id: Per configurare i parametri del processore Elimina record per ID, procedi come descritto nella tabella sottostante.

source: Label
id: Etichetta

source: Description
id: Descrizione

source: Mandatory
id: Obbligatorio

source: Field
id: Campo

source: Field containing the record value to delete
id: Campo contenente il valore del record da eliminare

source: yes
id: sì

source: Value to skip
id: Valore da ignorare

source: Value to delete from the field's records
id: Valore da eliminare nei record del campo

source: Exact match
id: Corrispondenza esatta

source: If checked: the field must contain the exact value written in the **Value to skip** parameter. If unchecked: the field must at least contain what was written in the **Value to skip** parameter.
id: Se si seleziona questa opzione: il campo deve contenere l'esatto valore inserito nel parametro **Valore da ignorare**. Se non si seleziona questa opzione: il campo deve contenere almeno il valore inserito nel parametro **Valore da ignorare**.

source: Note
id: Remarque

source: no
id: non
