Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/delete_record.po
Languages: de, es, fr, nl

source: Delete record processor
de: Prozessor "Eintrag löschen"
es: Procesador Suprimir registro
fr: Processeur Supprimer un enregistrement
nl: Record processor verwijderen

source: The **Delete record** processor deletes existing records from a dataset based on field values or a condition. Records are deleted from the dataset's current version and the previous versions in the history. This processor aims at regularly updated datasets.
de: Der Prozessor **Eintrag löschen** löscht vorhandene Einträge aus einem Datensatz basierend auf Feldwerten oder einer Bedingung. Die Einträge werden aus der aktuellen Version des Datensatzes und den vorherigen Versionen in der Historie gelöscht. Das Ziel dieses Prozessors sind regelmäßig aktualisierte Datensätze.
es: El procesador **Suprimir registro** suprime los registros existentes de un conjunto de datos en función de los valores de campo o una condición. Los registros se suprimen tanto de la versión actual del conjunto de datos como de las versiones anteriores. Este procesador está pensado para los conjuntos de datos que se actualizan periódicamente.
fr: Le processeur **Supprimer un enregistrement** supprime les enregistrements existant d'un jeu de données en fonction des valeurs des champs ou d'une condition. Les enregistrements sont supprimés de la version actuelle du jeu de données et des versions précédentes dans l'historique. Ce processeur vise les jeux de données régulièrement mis à jour.
nl: De processor **Record verwijderen** verwijdert bestaande records uit een dataset op basis van veldwaarden of een voorwaarde. Records worden verwijderd uit de huidige versie van de dataset en de vorige versies in de historiek. Deze processor streeft naar regelmatig geüpdatete datasets.

source: For example, suppose a dataset contains a list of companies with information such as the company name, status, number of employees, etc. In that case, this dataset is regularly updated to make sure that all information about these companies is still valid. You can configure the **Delete record** processor to delete records concerning companies that are now closed:
de: Nehmen wir beispielsweise einen Datensatz, der eine Liste von Unternehmen mit Informationen wie Status, Anzahl der Mitarbeiter, Tätigkeitsbereich usw. enthält. In diesem Fall wird der Datensatz regelmäßig aktualisiert, um sicherzustellen, dass alle Informationen über diese Unternehmen noch immer gültig sind. Sie können den Prozessor **Eintrag löschen** so konfigurieren, dass er Datensätze zu Unternehmen löscht, die nun geschlossen sind:
es: Por ejemplo, suponga que un conjunto de datos contiene una lista de empresas con información como nombre de empresa, estatus, número de empleados, etc. En este caso, este conjunto de datos se actualiza periódicamente para asegurarse de que toda la información de estas empresas siga siendo válida. Puede configurar el procesador **Suprimir registro** para suprimir registros sobre empresas que ya estén cerradas.
fr: Par exemple, si un jeu de données contient une liste de sociétés (avec des informations telles que le nom de la société, le statut, le nombre d'employés, etc.), il est régulièrement mis à jour pour garantir la validité de l'ensemble des informations associées à ces sociétés. Vous pouvez configurer le processeur **Supprimer un enregistrement** pour effacer les enregistrements relatifs à des sociétés qui n'existent plus :
nl: Voorbeeld: veronderstel dat een dataset een lijst met ondernemingen bevat met informatie zoals de firmanaam, de status, het aantal werknemers, enz. In dat geval wordt de dataset regelmatig geüpdatet om er zeker van te zijn dat de informatie over deze ondernemingen nog altijd geldig is. U kunt de processor **Record verwijderen** om records over ondernemingen die nu gesloten zijn, te verwijderen:

source: Select the field containing the company name in the processor parameters.
de: Wählen Sie in den Prozessor-Parametern das Feld mit dem Namen des Unternehmens.
es: Seleccione el campo que contiene el nombre de empresa en los parámetros del procesador.
fr: Dans les paramètres du processeur, sélectionnez le champ contenant le nom de la société.
nl: Select het veld met de firmanaam in de parameters van de processor.

source: Enter the name of the closed company in the **Value to skip** field.
de: Geben Sie den Namen des geschlossenen Unternehmens in das Feld **Zu überspringender Wert** ein.
es: Introduzca el nombre de la empresa cerrada en el campo **Valor para omitir**.
fr: Saisissez le nom de la société qui n'existe plus dans le champ **Valeur à ignorer**.
nl: Voer de naam van de gesloten onderneming in het veld **Waarde om over te slaan** in.

source: The processor will delete the following records that contain the name of the closed company in the specified field:
de: Der Prozessor wird die folgenden Einträge löschen, die den Namen des geschlossenen Unternehmens im angegebenen Feld enthalten:
es: El procesador suprimirá los siguientes registros que contengan el nombre de la empresa cerrada en el campo especificado:
fr: Le processeur supprimera les enregistrements suivants, qui contiennent le nom de l'entreprise qui n'existe plus dans le champ spécifié :
nl: De processor zal de volgende records verwijderen die de naam van de gesloten onderneming in het gespecificeerde veld bevat verwijderen.

source: The record from the most recent source from the last update
de: Der Eintrag aus der aktuellsten Quelle des letzten Updates
es: El registro del origen más reciente de la última actualización
fr: L'enregistrement de la source la plus récente de la dernière mise à jour.
nl: Het record uit de meest recente bron uit de laatst geüpdatete

source: The records from all previous sources of the dataset
de: Die Einträge aus allen bisherigen Quellen des Datensatzes
es: Los registros de todos los orígenes anteriores del conjunto de datos
fr: Les enregistrements de toutes les sources précédentes du jeu de données.
nl: De records uit alle vorige bronnen van de dataset

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: You cannot preview the changes made by the processor in the **Processing** tab.
de: Die vom Prozessor vorgenommenen Änderungen in der Registerkarte **Verarbeitung** können nicht in der Vorschau angezeigt werden.
es: No puede obtener una vista previa de los cambios efectuados por el procesador en la ficha **Procesadores**.
fr: Vous ne pouvez pas prévisualiser les modifications effectuées par le processeur dans l'onglet **Traitement**.
nl: U kan de wijzigingen die door de processor aangebracht zijn niet vooraf bekijken in het tabblad **Verwerken**.

source: To see the changes made by the processor to the dataset, save, publish, and explore the dataset in the front office.
de: Um die vom Prozessor vorgenommenen Änderungen am Datensatz zu sehen, müssen Sie ihn speichern und veröffentlichen. Anschließend können Sie ihn im Front-Office ansehen.
es: Para ver los cambios realizados por el procesador en el conjunto de datos, guarde, publique y explore el conjunto de datos en el front office.
fr: Pour afficher les modifications effectuées par le processeur sur le jeu de données, enregistrez, publiez et explorez le jeu de données dans l'interface de navigation.
nl: Om de wijzigingen die door de processor aan de dataset aangebracht zijn, te zien, te bewaren, te publiceren en de dataset in de front office te onderzoeken.

source: Delete record processor parameters
de: Parameter des Prozessors "Eintrag löschen"
es: Parámetros del procesador Suprimir registro
fr: Paramètres du processeur Supprimer un enregistrement
nl: De parameters van de record processor verwijderen

source: The following table lists the **Delete record** processor parameters:
de: In der folgenden Tabelle sind die Parameter des Prozessors **Eintrag löschen** aufgeführt:
es: La siguiente tabla muestra los parámetros del procesador **Suprimir registro**:
fr: Le tableau suivant répertorie les paramètres du processeur **Supprimer un enregistrement** :
nl: In de volgende tabel staan de parameters van de processor **Record verwijderen** opgelijst:

source: Label
de: Beschriftung
es: Etiqueta

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Field
de: Feld
es: Campo
fr: Champ
nl: Veld

source: Field containing the value on which record deletion is to be based.
de: Feld mit dem Wert, auf dessen Grundlage der Eintrag gelöscht werden soll.
es: Campo que contiene el valor en que se basa la supresión de registros.
fr: Champ contenant la valeur sur laquelle la suppression des enregistrements est basée.
nl: Veld met de waarde waarop de verwijdering van het record moet worden gebaseerd.

source: If you enter a boolean expression as the **Value to skip** parameter, the **Field** parameter is not used.
de: Wenn Sie für den Parameter **Zu überspringender Wert** einen einen booleschen Ausdruck eingeben, wird der Parameter **Feld** nicht verwendet.
es: Si introduce una expresión booleana en el parámetro **Valor para omitir**, el parámetro **Campo** no se utiliza.
fr: Si vous saisissez une expression booléenne en tant que paramètre **Valeur à ignorer**, le paramètre **Champ** n'est pas utilisé.
nl: Wanneer u een booleaanse uitdrukking invoert als de parameter **Waarde om over te slaan**, wordt de parameter **Veld** niet gebruikt.

source: Value to skip
de: Zu überspringender Wert
es: Valor para omitir
fr: Valeur à ignorer
nl: Waarde om over te slaan

source: Boolean expression or value on which record deletion is to be based.
de: Boolescher Ausdruck oder Wert, auf dessen Grundlage der Eintrag gelöscht werden soll.
es: Expresión booleana o valor en que se basa la supresión de registros.
fr: Expression booléenne ou valeur sur laquelle la suppression des enregistrements est basée.
nl: Booleaanse uitdrukking of waarde waarop de verwijdering van het record moet worden gebaseerd.

source: If you enter a boolean expression, only records for which the expression is true are deleted.
de: Wenn Sie einen booleschen Ausdruck eingeben, werden nur Einträge gelöscht, für die der Ausdruck zutreffend ist.
es: Si introduce una expresión booleana, solo se suprimen los registros para los cuales la expresión es verdadera.
fr: Si vous saisissez une expression booléenne, seuls les enregistrements pour lesquels l'expression est vraie sont supprimés.
nl: Wanneer u een booleaanse uitdrukking invoert, worden enkel records waarvoor de uitdrukking waar is, verwijderd.

source: Exact match
de: Genaue Übereinstimmung
es: Coincidencia exacta
fr: Correspondance exacte
nl: Exacte match

source: When selected, the processor will only delete records that contain an exact match for the value to skip in the specified field.
de: Wird diese Option ausgewählt, löscht der Prozessor nur Einträge, die eine exakte Übereinstimmung mit dem zu überspringenden Wert im angegebenen Feld enthalten.
es: Si se selecciona, el procesador solo suprimirá los registros que contengan una coincidencia exacta del valor para omitir en el campo especificado.
fr: Quand cette option est sélectionnée, le processeur supprimera uniquement les enregistrements qui contiennent une correspondance exacte de la valeur à ignorer dans le champ spécifié.
nl: Wanneer deze wordt geselecteerd, zal de processor enkel records verwijderen die een exacte match bevatten voor de waarde die moet worden overgeslagen in het gespecificeerde veld.

source: When cleared, the processor will delete records that contain the value to skip anywhere within the selected field. For example, suppose you enter ``Company`` as the value to skip and select the ``name`` field in the parameters. In that case, the processor will delete all records that contain values such as `Company` or `My Company` in their ``name`` field.
de: Ist diese Option nicht ausgewählt, löscht der Prozessor Einträge, die den zu überspringenden Wert an einer beliebigen Stelle im ausgewählten Feld enthalten. Nehmen wir zum Beispiel an, Sie geben ``Unternehmen`` als zu überspringenden Wert ein und wählen das Feld ``Name`` in den Parametern. In diesem Fall löscht der Prozessor alle Einträge, die Werte wie "Unternehmen" oder "Mein Unternehmen" in dem Feld "Name" enthalten.
es: Si no se selecciona, el procesador suprimirá los registros que contengan el valor para omitir en cualquier lugar dentro del campo seleccionado. Por ejemplo, suponga que introduce ``Company`` como valor para omitir y selecciona el campo ``name`` en los parámetros. En ese caso, el procesador suprimirá todos los registros que contengan valores como `Company` o `My Company` en el campo ``name``.
fr: Quand cette option n'est pas sélectionnée, le processeur supprimera les enregistrements qui contiennent la valeur à ignorer, quel que soit l'endroit où elle se trouve dans le champ spécifié. Par exemple, si vous saisissez ``Société`` en tant que valeur à ignorer et que vous sélectionnez le champ ``nom`` dans les paramètres, le processeur supprimera tous les enregistrements qui contiennent des valeurs telles que `Société` ou `Ma Société` dans leur champ ``nom``.
nl: Wanneer deze wordt leeggemaakt, zal de processor records verwijderen die de waarde om over te slaan bevatten waar ook in het geselecteerde veld. Bijvoorbeeld, veronderstel dat u ``Onderneming`` invoert als de waarde die moet worden overgeslagen en het veld ``naam`` selecteert in de parameters. In dat geval zal de processor alle records verwijderen die waarden bevatten zoals `Onderneming` of `Mijn onderneming` in hun veld ``naam``.
