Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/expand_multivalued_field.po
Languages: de, es, fr, nl

source: Expand multivalued field
de: Mehrwertiges Feld erweitern
es: Expandir el campo multivalor
fr: Agrandir un champ multi-valué

source: This processor splits the values in a multivalued field into several records.
de: Dieser Prozessor teilt die Werte aus einem mehrwertigen Feld in separate Eintr채ge auf.
es: Este procesador divide los valores dentro de un campo multivalor en varios registros.
fr: Ce processeur transforme les valeurs d'un champ multi-valué en plusieurs enregistrements.
nl: Deze processor splitst de waarden in een veld met meerdere waarden in verschillende records.

source: Setting the processor
de: Den Prozessor einrichten
es: Establecer el procesador
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Expand multivalued field processor, follow the indications from the table below.
de: Befolgen Sie die Anweisungen der unten stehenden Tabelle, um die Parameter des Prozessors "Mehrwertiges Feld erweitern" einzurichten.
es: Para establecer los parámetros del procesador Expandir el campo multivalor, siga las indicaciones de esta tabla.
fr: Pour définir les paramètres du processeur Agrandir un champ multi-valué, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Expand multivalued field-processor in te stellen, volg de aanwijzingen uit onderstaande tabel.

source: Label
de: Beschriftung
es: Etiqueta

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Mandatory
de: Obligatorisch
es: Obligatorio
fr: Obligatoire
nl: Verplicht

source: Multivalued field
de: Mehrwertiges Feld
es: Campo multivalor
fr: Champ multi-valué
nl: Veld met meerdere waarden

source: Multivalued field to split into several records
de: Mehrwertiges Feld, das in separate Eintr채ge aufgeteilt werden soll
es: Campo multivalor para dividir en varios registros.
fr: Champ multi-valué diviser en plusieurs enregistrements
nl: Veld met meerdere waarden om op te splitsen in verschillende records

source: Yes
de: Ja
es: Sí
fr: Oui
nl: Ja

source: Separator
de: Trennzeichen
es: Separador
fr: Séparateur
nl: Scheidingsteken

source: Character(s) separating the values in the multivalued field
de: Zur Trennung der verschiedenen Werte innerhalb eines mehrwertigen Feldes verwendete(s) Zeichen
es: Carácter(es) de separación de los valores del campo multivalor.
fr: Caractère(s) séparant les valeurs du champ multi-valué
nl: Karakter(s) om de waarden in het veld met meerdere waarden te scheiden

source: Output field
de: Ausgabefeld
es: Campo de salida
fr: Champ de sortie
nl: Outputveld

source: Field for the created records, can be an existing field or a new one
de: Feld f체r die erstellten Eintr채ge; dies kann ein bestehendes oder ein neues Feld sein
es: Campo de los registros creados (un campo ya existente o uno nuevo).
fr: Champ des enregistrements créés, peut être nouveau ou existant
nl: Veld voor de aangemaakte records, kan een bestaand veld of een nieuw veld zijn
