Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/expression.po
Languages: de, es, fr, nl

source: Expression processor
de: Ausdrucksprozessor
es: Procesador Expresión
fr: Processeur Expression

source: This processor is a versatile processor that takes an expression as an argument and outputs its result in a field.
de: Dieser Prozessor ist ein vielseitiger Prozessor, der einen Ausdruck als Argument verwendet und sein Ergebnis in einem Feld ausgibt.
es: Este procesador es un procesador versátil que toma una expresión como argumento y genera el resultado en un campo.
fr: Le processeur est versatile. Il peut comprendre une expression comme étant un argument et afficher le résultat dans un champ.
nl: Deze processor is een veelzijdige processor die een uitdrukking beschouwt als een argument en het resultaat ervan in een veld plaatst.

source: The expression can be composed of:
de: Der Ausdruck kann sich aus Folgendem zusammensetzen:
es: La expresión puede estar compuesta por:
fr: L'expression peut être composée des éléments suivants :
nl: De uitdrukking kan samengesteld zijn uit:

source: **identifiers**,
de: **Kennungen**,
es: **identificadores**,
fr: des **identifiants** ;

source: **literals** (numbers, textual literals, booleans and keywords),
de: **Literale** (Zahlen, Textliterale, boolesche Variable, Ausdrücke und Schlüsselwörter)
es: **literales** (números, literales de texto, valores booleanos y palabras clave),
fr: des **littéraux** (nombres, littéraux textuels, booléens et mots-clés) ;
nl: **literals** (cijfers, tekstuele literals, booleans en trefwoorden),

source: **operators**,
de: **Operatoren**,
es: **operadores**,
fr: des **opérateurs** ;

source: **functions**.
de: **Funktionen**.
es: **funciones**.
fr: des **fonctions**.

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: The Expression processor makes more sense in evaluation mode (which means "compute and return the result of the expression"), activated by starting the expression with an equal sign (``=``). Otherwise, the processor will not evaluate the expression, and simply put it as is in the output field.
de: Der Ausdrucksprozessor macht am meisten Sinn im Evaluierungsmodus (d.h. "berechnen und das Ergebnis des Ausdrucks ausgeben"), der durch Starten des Ausdrucks mit einem Gleichheitszeichen (```=```) aktiviert wird. Andernfalls wertet der Prozessor den Ausdruck nicht aus und setzt ihn einfach so ein, wie er im Ausgabefeld steht.
es: El procesador de expresiones es más útil en modo de evaluación (lo cual implica \''calcular y devolver el resultado de la expresión\''), que se activa insertando un signo de igual al principio de la expresión (``=``). De lo contrario, el procesador no evaluará la expresión y simplemente la colocará en el campo de salida.
fr: Le processeur Expression se montre le plus utile en mode évaluation (c'est-à-dire qu'il "calcule et retourne le résultat de l'expression"). Ce mode est activé en commençant l'expression par un signe égal (``=``). En l'absence de ce signe, le processeur n'évaluera pas l'expression et la reproduira simplement dans le champ de résultat.
nl: De Expression-processor is zinvoller in evaluatiemodus (wat betekent "het resultaat van de uitdrukking berekenen en weergeven"), die wordt geactiveerd door de uitdrukking te beginnen met een gelijkheidsteken ("="). Zo niet zal de processor de uitdrukking niet evalueren en deze als dusdanig gewoon in het outputveld plaatsen.

source: The starting equal sign (``=``) will be omitted through all the following examples.
de: Das beginnende Gleichheitszeichen (```=```) wird bei allen folgenden Beispielen weggelassen.
es: En los ejemplos siguientes se omite el signo de igual inicial (``=``).
fr: Le signe (``=``) devant être placé au début des expressions sera omis de l'ensemble des exemples ci-dessous.
nl: Het gelijkheidsteken ("=") in het begin wordt in alle volgende voorbeelden weggelaten.

source: Setting the processor
de: Den Prozessor einrichten
es: Establecer el procesador
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Expression processor, follow the indications from the table below.
de: Befolgen Sie die Anweisungen der unteren Tabelle, um die Parameter des Ausdrucksprozessors einzurichten.
es: Para establecer los parámetros del procesador Expresión, siga las indicaciones de esta tabla.
fr: Pour définir les paramètres du processeur Expression, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Expression processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Label
de: Beschriftung
es: Etiqueta

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Mandatory
de: Obligatorisch
es: Obligatorio
fr: Obligatoire
nl: Verplicht

source: Expression
de: Ausdruck
es: Expresión
nl: Uitdrukking

source: Expression pattern
de: Ausdrucksmuster
es: Patrón de expresión.
fr: Modèle d'expression
nl: Uitdrukkingspatroon

source: yes
de: ja
es: Sí
fr: oui
nl: ja

source: Output field
de: Ausgabefeld
es: Campo de salida
fr: Champ de sortie
nl: Outputveld

source: Field where the expression will be applied. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
de: Feld, in dem der Ausdruck angewendet wird. Es kann sich um ein vorhandenes Feld handeln, das aus der Liste ausgewählt wird, oder ein neues Feld, das zu diesem Zweck erstellt wurde (in diesem Fall bitte **Eingabetext** aus der Liste wählen und den Namen des neuen Feldes in den unteren Textbereich eingeben).
es: Campo en que se aplicará la expresión. Puede ser un campo existente seleccionado de la lista, o un campo nuevo creado con ese fin (en ese caso, elija **Texto de entrada** en la lista y escriba el nombre del campo nuevo en el área de texto que figura a continuación).
fr: Champ dans lequel l'expression sera appliquée. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
nl: Veld waarop de uitdrukking zal worden toegepast. Dit kan een bestaand veld zijn dat gekozen wordt uit de lijst of een nieuw veld dat hiervoor is aangemaakt (in dat geval, kies **Invoer tekst** uit de lijst en noteer de naam van het nieuwe veld in de tekstruimte eronder).

source: Building an expression
de: Einen Ausdruck erstellen
es: Creación de una expresión
fr: Formuler une expression
nl: Een uitdrukking opbouwen

source: An expression is an instruction for the processor to perform an operation and to return the value in a new or existing column of the dataset.
de: Ein Ausdruck ist eine Anweisung an den Prozessor, eine Operation auszuführen und den Wert in einer neuen oder bestehenden Spalte des Datensatzes auszugeben.
es: Una expresión es una instrucción para que el procesador ejecute una operación y devuelva el valor en una columna nueva o existente del conjunto de datos.
fr: Une expression est une instruction à destination du processeur pour qu'il réalise une opération et retourne la valeur dans une colonne, nouvelle ou existante, du jeu de données.
nl: Een uitdrukking is een instructie voor de processor om een operatie uit te voeren en de waarde ervan in een nieuwe of bestaande kolom van de dataset weer te geven.

source: These expressions look like what we call "formulas" in a spreadsheet software. The main difference is that instead of referencing cells (e.g: ``A1 + B2``), the processor can perform operations with the values of given columns (e.g: ``column_1 + column_2``).
de: Diese Ausdrücke ähneln Formeln in einer Tabellenkalkulationssoftware. Der Hauptunterschied besteht darin, dass der Prozessor anstelle der Referenzierung von Zellen (z.B. "A1 + B2") Operationen mit den Werten bestimmter Spalten durchführen kann (z.B. "Spalte_1 + Spalte_2").
es: Estas expresiones tienen el aspecto de lo que, en el software de hoja de datos, se da en llamar \''fórmulas\''. La principal diferencia es que, en lugar de hacer referencia a celdas (p. ej., ``A1 + B2``), el procesador puede realizar operaciones con los valores de las columnas correspondientes (p. ej., ``columna_1 + columna_2``).
fr: Ces expressions ressemblent à ce qu'on appelle des "formules" dans un tableur type Excel. La principale différence est qu'au lieu de référencer des cellules (par ex. ``A1 + B2``), le processeur peut réaliser des opérations à partir des valeurs situées dans des colonnes données (par ex. ``column_1 + column_2``).
nl: Deze uitdrukkingen zien eruit als wat we "formules" noemen in een spreadsheet software. Het grootste verschil is dat de processor in plaats van naar elkaar verwijzende cellen (bijv.: `A1 + B2``), operaties kan uitvoeren met de waarden van welbepaalde kolommen (bijv.: ``column_1 + column_2``).

source: Like in a formula, expressions can be any combination of various elements. The Expression processor supports the following elements:
de: Wie in einer Formel können Ausdrücke eine beliebige Kombination von verschiedenen Elementen sein. Der Ausdrucksprozessor unterstützt die folgenden Elemente:
es: Al igual que en una fórmula, las expresiones pueden ser una combinación cualquiera de varios elementos. El procesador de expresiones admite los elementos siguientes:
fr: Comme les formules, les expressions peuvent combiner divers éléments. Le processeur Expression prend en charge les éléments suivants :
nl: Net zoals in een formule kunnen uitdrukkingen elke combinatie van verschillende elementen zijn. De Expression-processor ondersteunt de volgende elementen:

source: identifiers (e.g: a field name like ``column_1`` or a forced field name like ``$column_1``),
de: Kennungen (z.B.: ein Feldname wie ``Spalte_1`` oder ein erzwungener Feldname wie ``$Spalte_1``),
es: identificadores (p. ej., un nombre de campo como ``columna_1`` o un nombre de campo forzado como ``$column_1``);
fr: les identifiants (par ex. un nom de champ comme ``column_1`` ou un nom de champ verrouillé comme ``$column_1``) ;
nl: identifiers (bijv.: een veldnaam zoals ``column_1`` of een geforceerde veldnaam, zoals ``$column_1``),

source: literals:
de: Literale:
es: literales:
fr: les littéraux :

source: numbers (e.g: ``2`` or ``3.6``),
de: Zahlen (z.B.: ``2`` oder ``3.6``),
es: números (p. ej., ``2`` o ``3,6``);
fr: les nombres (par ex. ``2`` ou ``3.6``) ;
nl: cijfers (bijv.: ``2`` of ``3.6``),

source: textual literals (e.g ``"hello"`` or ``'world'``),
de: Textliterale (z.B. ``"hallo"`` oder ``'Welt'``),
es: literales de texto (p. ej., ``\''hola\''`` o ``'mundo'``);
fr: les littéraux textuels (par ex. ``"hello"`` ou ``'world'``) ;
nl: tekstuele literals (bijv. ``"hallo"`` of ``'wereld'``),

source: booleans (e.g: ``'true'`` or ``'false'``),
de: Boolesche Elemente (z. B.: `'`true'`` oder ``'false'``),
es: valores booleanos (p. ej., ``'true'`` o ``'false'``);
fr: les booléens (par ex. ``'true'`` ou ``'false'``) ;
nl: booleans (bijv.: ``'waar'`` of ``'onwaar'``),

source: keywords (e.g: a mathematical constant like ``pi`` and ``e``),
de: Schlüsselwörter (z.B.: eine mathematische Konstante wie ``pi`` und ``e``),
es: palabras clave (p. ej., una constante matemática como ``pi`` y ``e``);
fr: les mots-clés (par ex. une constante mathématique comme ``pi`` ou ``e``) ;
nl: trefwoorden (bijv.: een wiskundige constante, zoals ``pi`` en ``e``),

source: operators (e.g: ``+``, ``OR``, ``not``, ``<=``),
de: Operatoren (z.B.: ``+``, ``OR``, ``not``, ``<=``),
es: operadores (p. ej., ``+``, ``OR``, ``not``, ``<=``),
fr: les opérateurs (par ex. ``+``, ``OR``, ``not``, ``<=``) ;
nl: operatoren (bijv.: ``+``, ``OR``, ``not``, ``<=``),

source: functions (e.g: ``now()``, ``sin(number)``, ``startswith("hello', 'he')``).
de: Funktionen (z.B.: ``now()``, ``sin(Zahl)``, ``startswith("hallo', 'er')``).
es: funciones (p. ej., ``now()``, ``sin(número)``, ``startswith(\''hola', 'ho')``).
fr: les fonctions (par ex. ``now()``, ``sin(nombre)``, ``startswith("hello', 'he')``).
nl: functies (bijv.: ``now()``, ``sin(number)``, ``startswith("hello', 'he')``).

source: Identifiers
de: Kennungen
es: Identificadores
fr: Les identifiants

source: The main feature of the Expression processor is the ability to perform operations on a record's columns. The technical identifier (or field name) of a column can be used in any expression to access the value of this field for the current record. This technical identifier can be found in the :ref:`field options<configuringoptions>`, as the ``Name`` of this field.
de: Das Hauptmerkmal des Ausdrucksprozessors ist seine Fähigkeit, Operationen mit den Spalten eines Datensatzes durchzuführen. Die technische Kennung (oder der Feldname) einer Spalte kann in jedem beliebigen Ausdruck verwendet werden, um auf den Wert dieses Feldes für den aktuellen Eintrags zuzugreifen. Diese technische Kennung finden Sie in den :ref:`Feldoptionen<configuringoptions>` als ``Name`` dieses Feldes.
es: La característica principal del procesador de expresiones es la capacidad de realizar operaciones en las columnas de un registro. El identificador técnico (o nombre de campo) de una columna se puede utilizar en cualquier expresión para acceder al valor de dicho campo para el registro actual. Puede encontrar dicho identificador técnico en las :ref:`opciones de campo<configuringoptions>`, como ``Nombre`` del campo en cuestión.
fr: La principale fonctionnalité du processeur Expression est sa capacité à réaliser des opérations dans les colonnes d'un enregistrement. L'identifiant technique (ou nom de champ) d'une colonne peut être utilisé dans une expression afin d'accéder aux valeurs contenues dans ce champ pour l'enregistrement actuel. Cet identifiant technique peut être trouvé dans les :ref:`options de champ<configuringoptions>`, sous le ``Nom`` du champ concerné.
nl: Het belangrijkste kenmerk van de Expression-processor is het vermogen om operaties uit te voeren op de kolommen van een record. De technische identifier (of veldnaam) van een kolom kan in een uitdrukking worden gebruikt om toegang te hebben tot de waarde van dit veld voor het huidige record. Deze technische identifier kan teruggevonden worden in de :ref:`veldopties<configuringoptions>`, als de ``Naam`` van dit veld.

source: Examples:
de: Beispiele:
es: Ejemplos:
fr: Exemples :
nl: Voorbeelden:

source: ``column_1`` to access a field named ``column_1`` (and maybe labeled "Column 1")
de: ``Spalte_1`` um auf ein Feld mit dem Namen ``Spalte_1`` zuzugreifen (und ggf. mit der Bezeichnung "Spalte 1")
es: ``columna_1`` para acceder a un campo denominado ``columna_1`` (que posiblemente tiene la etiqueta \''Columna 1\'')
fr: ``column_1`` pour accéder à un champ nommé ``column_1`` (et peut-être intitulé "Column 1")
nl: ``column_1`` om toegang te hebben tot een veld met de naam ``column_1`` (en misschien gelabeld als "Column 1")

source: ``name_en`` to access a field named ``name_en`` (and maybe labeled "Name (EN)")
de: ``name_en`` um auf ein Feld mit dem Namen ``name_en`` zuzugreifen (und ggf. mit der Bezeichnung "Name (EN)")
es: ``nombre_es`` para acceder a un campo denominado ``nombre_es`` (que posiblemente tiene la etiqueta \''Nombre (ES)\'')
fr: ``name_en`` pour accéder à un champ nommé ``name_en`` (et peut-être intitulé "Name (EN)")
nl: ``name_en`` om toegang te hebben tot een veld met de naam ``name_en`` (en misschien gelabeld als "Name (EN)")

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: In some cases, the field name can be ambiguous, for example if it is a number, if it starts with a number or if it is a reserved keyword like "pi" (the mathematical constant PI) or "e" (the mathematical constant Euler's number).
de: In einigen Fällen kann der Feldname mehrdeutig sein, z.B. wenn es sich um eine Zahl handelt, wenn er mit einer Zahl beginnt oder wenn es sich um ein belegtes Schlüsselwort wie "pi" (die mathematische Konstante PI) oder "e" (die mathematische Konstante Eulersche Zahl) handelt.
es: En algunos casos, el nombre del campo puede ser ambiguo; por ejemplo, si es un número, si empieza con un número o si es una palabra clave reservada como \''pi\'' (la constante matemática PI) o \''e\'' (la constante matemática de número de Euler).
fr: Dans certains cas, le nom du champ peut être ambigu, par exemple, s'il s'agit d'un nombre ou d'un mot-clé réservé (comme "pi", la constante mathématique, ou "e", le nombre d'Euler), ou encore s'il commence par un nombre.
nl: In sommige gevallen kan de veldnaam dubbelzinnig zijn. Bijvoorbeeld wanneer hij een cijfer is, wanneer hij begint met een cijfer of wanneer hij een voorbehouden trefwoord is, zoals "pi" (de wiskundige constante het cijfer van Euler).

source: To force the Expression processor to evaluate an identifier as a field name, it is possible to prefix any identifier with the dollar sign (``$``). The dollar sign can be used for any field name, but it is only mandatory for ambiguous field names.
de: Um den Ausdrucksprozessor zu zwingen, eine Kennung als Feldnamen auszuwerten, ist es möglich, jeder Kennung ein Dollarzeichen (``$``) voranzustellen. Das Dollarzeichen kann für jeden beliebigen Feldnamen verwendet werden, ist aber nur bei mehrdeutigen Feldnamen zwingend erforderlich.
es: Para forzar que el procesador de expresiones evalúe un identificador como nombre de campo, es posible añadir a cualquier identificador el signo del dólar (``$``) como prefijo. El signo del dólar se puede utilizar para cualquier nombre de ampo, pero solo es obligatorio en el caso de nombres de campo ambiguos.
fr: Pour forcer le processeur Expression à évaluer un identifiant comme un nom de champ, il est possible d'ajouter le signe dollar (``$``) devant un identifiant. Le signe dollar peut être utilisé avec n'importe quel nom de champ, mais il n'est obligatoire que pour les noms de champ ambigus.
nl: Om de Expression-processor te dwingen een identifier te evalueren als een veldnaam, is het mogelijk om een prefix te plaatsen voor elke identifier met het dollarteken ("$"). Het dollarteken kan voor elke veldnaam worden gebruikt, maar is enkel verplicht voor dubbelzinnige veldnamen.

source: ``$column_1`` to access a field named ``column_1`` (and maybe labeled "Column 1")
de: ``$Spalte_1`` um auf ein Feld mit dem Namen ``Spalte_1`` zuzugreifen (und ggf. mit der Bezeichnung "Spalte 1")
es: ``$column_1`` para acceder a un campo denominado ``columna_1`` (que posiblemente tiene la etiqueta \''Columna 1\'')
fr: ``$column_1`` pour accéder à un champ nommé ``column_1`` (et peut-être intitulé "Column 1")
nl: ``$column_1`` om toegang te hebben tot een veld met de naam ``column_1`` (en misschien gelabeld als "Column 1")

source: ``$name_en`` to access a field named ``name_en`` (and maybe labeled "Name (EN)")
de: ``$name_en`` um auf ein Feld mit dem Namen ``name_en`` zuzugreifen (und ggf. mit der Bezeichnung "Name (EN)")
es: ``$name_en`` para acceder a un campo denominado ``nombre_es`` (que posiblemente tiene la etiqueta \''Nombre (ES)\'')
fr: ``$name_en`` pour accéder à un champ nommé ``name_en`` (et peut-être intitulé "Name (EN)")
nl: ``$name_en`` om toegang te hebben tot een veld met de naam ``name_en`` (en misschien gelabeld als "Name (EN)")

source: ``$20_to_25_yo`` to access a field named ``20_to_25_yo`` (and maybe labeled "20 to 25 years old")
de: ``$20_to_25_yo`` um auf ein Feld mit dem Namen ``20_to_25_yo`` zuzugreifen (und ggf. mit der Bezeichnung "20 to 25 years old")
es: ``$20_to_25_yo`` para acceder a un campo denominado ``20_a_25_años`` (que posiblemente tiene la etiqueta \''20 a 25 años\'')
fr: ``$20_to_25_yo`` pour accéder à un champ nommé ``20_to_25_yo`` (et peut-être intitulé "20 to 25 years old")
nl: ``$20_to_25_yo`` om toegang te hebben tot een veldnaam met de naam ``20_to_25_yo`` (en misschien gelabeld als "20 tot 25 jaar oud")

source: ``$33`` to access a field named ``33``
de: ``$33`` um auf ein Feld mit dem Namen ``33`` zuzugreifen
es: ``$33`` para acceder a un campo denominado ``33``
fr: ``$33`` pour accéder à un champ intitulé ``33``
nl: ``$33`` om toegang te hebben tot een veld met de naam ``33``

source: ``$pi`` to access a field named ``pi``
de: ``$pi`` um auf ein Feld mit dem Namen ``pi`` zuzugreifen
es: ``$pi`` para acceder a un campo denominado ``pi``
fr: ``$pi`` pour accéder à un champ intitulé ``pi``
nl: ``$pi`` om toegang te hebben tot een veld met de naam ``pi``

source: In all the following examples, any number or textual literal can be replaced by a field name holding values of the same type. The Expression processor will extract the value for the specified column and perform the required operation with it.
de: In allen folgenden Beispielen kann jede beliebige Zahl oder jedes Textliteral durch einen Feldnamen ersetzt werden, der Werte des gleichen Typs enthält. Der Ausdrucksprozessor extrahiert den Wert für die angegebene Spalte und führt damit die gewünschte Operation durch.
es: En todos los ejemplos siguientes, cualquier número o literal de texto puede ser sustituido por un nombre de campo con valores del mismo tipo. El procesador de expresiones extraerá el valor de la columna especificada y llevará a cabo la operación correspondiente con dicho valor.
fr: Tout nombre ou littéral textuel peut être remplacé dans les exemples suivants par un nom de champ contenant des données du même type. Le processeur Expression extraira la valeur de la colonne spécifiée et s'en servira pour exécuter l'opération requise.
nl: In alle volgende voorbeelden kan elk cijfer of elke tekstuele literal vervangen worden door een veldnaam waarin waarden van hetzelfde type staan. De Expression-processor extraheert de waarde voor de gespecificeerde kolom en voert daarmee de vereiste operatie uit.

source: Several fields (or even the same field several times) can be used at the same time in an expression.
de: Mehrere Felder (oder sogar mehrmals das gleiche Feld) können gleichzeitig in einem Ausdruck verwendet werden.
es: Es posible utilizar a la vez varios campos (o incluso el mismo campo varias veces) en una expresión.
fr: Une même expression peut contenir plusieurs champs (ou le même champ réutilisé plusieurs fois).
nl: Er kunnen tezelfdertijd verschillende velden (of zelfs hetzelfde veld verschillende keren) gebruikt worden in een uitdrukking.

source: Literals
de: Literale
es: Literales
fr: Expressions littérales

source: Literals like **numbers**, **textual literals** (single or double quoted), **booleans** and **keywords** can be used in any expression.
de: Literale wie **Zahlen**, **Textliterale** (mit einfachen oder doppelten Anführungszeichen), **boolesche Variable** und **Schlüsselwörter** können in jedem Ausdruck verwendet werden.
es: En cualquier expresión se pueden utilizar literales, como pueden ser **números**, **literales de texto** (entre comillas simples o dobles), **valores booleanos** y **palabras clave**.
fr: Les littéraux tels que les **nombres**, les **littéraux textuels** (entre guillemets simples ou doubles), les **booléens** et les **mots-clés** peuvent être utilisés dans n'importe quelle expression.
nl: Literals zoals **cijfers**, **tekstuele literals** (met enkele of dubbele aanhalingstekens), **booleans** en **trefwoorden** kunnen in elke uitdrukking gebruikt worden.

source: ``"Hello"`` or ``'Hello'``
de: ``"Hallo"`` oder ``'Hallo'``
es: ``\''Hola\''`` u ``'Hola'``
fr: ``"Hello"`` ou ``'Hello'``
nl: ``"Hello"`` of ``'Hello'``

source: ``'A bigger sentence'``
de: ``'Ein längerer Satz'``
es: ``'Una frase más larga'``
nl: ``'Een langere zin'``

source: ``'true'`` or ``'false'``
de: ``'true'`` oder ``'false'``
es: ``'true'`` o ``'false'``
fr: ``'true'`` ou ``'false'``
nl: ``'true'`` of ``'false'``
