Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/expression.po
Languages: de, es, fr, nl

source: ``pi``, ``PI`` or ``Pi``
de: ``pi``, ``PI`` oder ``Pi``
es: ``pi``, ``PI`` o ``Pi``
fr: ``pi``, ``PI`` ou ``Pi``
nl: ``pi``, ``PI`` of ``Pi``

source: ``e`` or ``E``
de: ``e`` oder ``E``
es: ``e`` o ``E``
fr: ``e`` ou ``E``
nl: ``e`` of ``E``

source: Operators
de: Operatoren
es: Operadores
fr: Opérateurs
nl: Operatoren

source: Operators are symbols that behave generally like functions but are used with a more natural syntax.
de: Operatoren sind Symbole, die sich im Wesentlichen wie Funktionen verhalten, aber mit einer natürlicheren Syntax verwendet werden.
es: Los operadores son símbolos que se comportan, por lo general, como funciones, pero que se utilizan con una sintaxis más natural.
fr: Les opérateurs sont des symboles qui se comportent généralement comme des fonctions, mais sont utilisés avec une syntaxe plus naturelle.
nl: Operatoren zijn symbolen die zich over het algemeen gedragen als functies maar gebruikt worden met een natuurlijkere syntax.

source: The Expression processor supports 3 kinds of operators, depending on the number of parameters around them:
de: Der Ausdrucksprozessor unterstützt 3 Arten von Operatoren, abhängig von der Anzahl der Parameter, die sie umgeben:
es: El procesador de expresiones admite tres tipos de operadores en función del número de parámetros presentes:
fr: Le processeur Expression prend en charge trois types d'opérateurs, en fonction du nombre de paramètres qui les entourent :
nl: De Expression-processor ondersteunt 3 soorten operatoren, afhankelijk van het aantal parameters er rond:

source: **unary operators** can be used as prefixes or suffixes to alter the value of 1 expression,
de: **Unäre Operatoren** können als Präfixe oder Suffixe verwendet werden, um den Wert eines Ausdrucks zu ändern,
es: Se pueden utilizar **operadores unarios** como prefijos o sufijos para alterar el valor de una expresión.
fr: les **opérateurs unaires** peuvent être utilisés comme préfixes ou suffixes pour modifier la valeur d'1 expression ;
nl: **unaire operatoren** kunnen gebruikt worden als prefixen of suffixen om de waarde van 1 uitdrukking te wijzigen,

source: **binary operators** can be arithmetic operators to perform a calculus between 2 expressions, or boolean operators to compare the result of 2 expressions,
de: **Binäre Operatoren** können arithmetische Operatoren sein, um eine Kalkulation zwischen 2 Ausdrücken durchzuführen, oder boolesche Operatoren, um das Ergebnis von 2 Ausdrücken zu vergleichen,
es: Los **operadores binarios** pueden ser operadores aritméticos para realizar un cálculo entre dos expresiones u operadores booleanos para comparar el resultado de dos expresiones.
fr: les **opérateurs binaires** peuvent être des opérateurs arithmétiques pour réaliser un calcul avec 2 expressions, ou des opérateurs booléens pour comparer le résultat de 2 expressions ;
nl: **binaire operatoren** kunnen rekenkundige operatoren zijn om een berekening tussen 2 uitdrukkingen uit te voeren of boolean operatoren om het resultaat van 2 uitdrukkingen te vergelijken,

source: the **ternary operator**, to convert a conditional expression to either 1 of 2 possible results.
de: der **ternäre Operator**, um einen bedingten Ausdruck in eines von 2 möglichen Ergebnissen umzuwandeln.
es: El **operador ternario** permite convertir una expresión condicional en un resultado de dos posibles.
fr: l'**opérateur ternaire** pour convertir une expression conditionnelle en 1 ou 2 résultats possibles.
nl: de **ternaire operatoren** om een voorwaardelijke uitdrukking om te vormen tot ofwel 1 van 2 mogelijke resultaten.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Operator precedence works in the following order: factorial, exponential, sign, euclidian division, function evaluation, multiplication/division, addition/substraction, concatenation, not, comparison, and, or, ternary operator, ternary operator without else.
de: Es gilt die folgende Operatorrangfolge: Fakultät, exponential, Vorzeichen, euklidische Division, Funktionsbewertung, Multiplikation/Division, Addition/Subtraktion, Verkettung, nicht, Vergleich, und, ternärer Operator, ternärer Operator ohne weiteres.
es: El orden de precedencia de los operadores es el siguiente: factorial, exponencial, signo, división euclídea, evaluación de función, multiplicación/división, suma/resta, concatenación, ''not'', comparación, ''and'', ''or'', operador ternario, operador ternario sin ''else''.
fr: Les opérateurs devraient être placés dans l'ordre suivant : factorielle, exponentielle, signe, division euclidienne, évaluation de fonction, multiplication/division, addition/soustraction, concaténation, not, comparaison, and, or, opérateur ternaire, opérateur ternaire sans else.
nl: De bewerkingsvolgorde voor operatoren is als volgt: factorieel, exponentieel, teken, euclidische deling, functie-evaluatie, vermenigvuldiging/deling, optellen/aftrekken, samenvoeging, niet, vergelijking, en, of, ternaire operator, ternaire operator zonder iets anders.

source: Unary operators
de: Unäre Operatoren
es: Operadores unarios
fr: Opérateurs unaires
nl: Unaire operatoren

source: Operator
es: Operador
fr: Opérateur

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
nl: Voorbeeld

source: Prefix that negates the following value
de: Präfix, das den folgenden Wert negiert
es: Prefijo que niega el valor siguiente
fr: Préfixe rendant la valeur suivante négative
nl: Prefix dat de volgende waarde ontkent

source: ``- 4``, ``- [expression]``
de: ``- 4``, ``- [Ausdruck]``
es: ``- 4``, ``- [expresión]``
nl: ``- 4``, ``- [uitdrukking]``

source: ``not``, ``!`` (not)
es: ``not``, ``!`` (no)

source: Boolean operator that inverts the following condition
de: Boolescher Operator, der die folgende Bedingung umkehrt
es: Operador booleano que invierte la condición siguiente.
fr: Opérateur booléen qui inverse la condition suivante
nl: Boolean operator die de volgende voorwaarde omkeert

source: ``not('true')`` or ``!('true')`` is ``false``
de: ``not('true')`` oder ``!('true')`` ist ``false``
es: ``not('true')`` o ``!('true')`` es ``false``
fr: ``not('true')`` ou ``!('true')`` retourne ``false``
nl: ``not('true')`` of ``!('true')`` is ``false``

source: ``not(4 > 5)`` is ``true``
de: ``not(4 > 5)`` ist ``true``
es: ``not(4 > 5)`` es ``true``
fr: ``not(4 > 5)`` est ``true``

source: ``!(5 <= 10)`` is ``false``
de: ``!(5 <= 10)`` ist ``false``
es: ``!(5 <= 10)`` es ``false``
fr: ``!(5 <= 10)`` est ``false``

source: Suffix that computes the factorial of an expression
de: Suffix, das die Fakultät eines Ausdrucks berechnet
es: Sufijo que calcula el factorial de una expresión.
fr: Suffixe qui calcule la factorielle d'une expression
nl: Suffix dat de factorieel van een uitdrukking berekent

source: ``3!`` returns ``1*2*3``
de: ``3!`` ergibt ``1*2*3``
es: ``3!`` devuelve ``1*2*3``
fr: ``3!`` retourne ``1*2*3``
nl: ``3!`` geeft ``1*2*3``

source: Binary operators
de: Binäre Operatoren
es: Operadores binarios
fr: Opérateurs binaires
nl: Binaire operatoren

source: Arithmetic operators: add, subtract, multiply, divide, modulo, euclidian division, power
de: Arithmetische Operatoren: Addition, Subtraktion, Multiplikation, Division, Modulo, euklidische Division, Potenz
es: Operadores aritméticos: suma, resta, multiplicación, división, módulo, división euclídea, potencia
fr: Opérateurs arithmétiques : ajouter, soustraire, multiplier, diviser, modulo, division euclidienne, puissance
nl: Rekenkundige operatoren: optellen, aftrekken, vermenigvuldigen, delen, modulo, euclidische deling, kracht

source: ``2 + 3`` returns ``5``
de: ``2 + 3`` ergibt ``5``
es: ``2 + 3`` devuelve ``5``
fr: ``2 + 3`` retourne ``5``
nl: ``2 + 3`` geeft ``5``

source: ``5 - 8`` returns ``-3``
de: ``5 - 8`` ergibt ``-3``
es: ``5 - 8`` devuelve ``-3``
fr: ``5 - 8`` retourne ``-3``
nl: ``5 - 8`` geeft ``-3``

source: ``9 * 3`` returns ``27``
de: ``9 * 3`` ergibt ``27``
es: ``9 * 3`` devuelve ``27``
fr: ``9 * 3`` retourne ``27``
nl: ``9 * 3`` geeft ``27``

source: ``15 / 6`` returns ``2.5``
de: ``15 / 6`` ergibt ``2.5``
es: ``15 / 6`` devuelve ``2,5``
fr: ``15 / 6`` retourne ``2.5``
nl: ``15 / 6`` geeft ``2.5``

source: ``15 % 6`` returns ``3``
de: ``15 % 6`` ergibt ``3``
es: ``15 % 6`` devuelve ``3``
fr: ``15 % 6`` retourne ``3``
nl: ``15 % 6`` geeft ``3``

source: ``15 // 6`` returns ``2``
de: ``15 // 6`` ergibt ``2``
es: ``15 // 6`` devuelve ``2``
fr: ``15 // 6`` retourne ``2``
nl: ``15 // 6`` geeft ``2``

source: ``2 ^ 3`` returns ``8``
de: ``2 ^ 3`` ergibt ``8``
es: ``2 ^ 3`` devuelve ``8``
fr: ``2 ^ 3`` retourne ``8``
nl: ``2 ^ 3`` geeft ``8``

source: ``column_1 + column2``
de: ``Spalte_1 + Spalte2``
es: ``columna_1 + columna2``

source: ``and``, ``&&``, ``or``, ``||`` (return a boolean)
de: ``und``, ``&&``, ``oder``, ``||`` (ergibt einen booleschen Wert)
es: ``and``, ``&&``, ``or``, ``||`` (devuelven un valor booleano)
fr: ``and``, ``&&``, ``or``, ``||`` (retournent un booléen)
nl: ``en``, ``&&``, ``or``, ``||`` (geeft een boolean)

source: Boolean operators: and, or
de: Boolesche Operatoren: and, or
es: Operadores booleanos: and, or
fr: Opérateurs boléens : and, or
nl: Boolean operatoren: en, of

source: ``'true' and 'true'`` is ``true``
de: ``'true' und 'true'`` ist ``true``
es: ``'true' and 'true'`` es ``true``
fr: ``'true' and 'true'`` est ``true``
nl: ``'true' en 'true'`` is ``true``

source: ``'true' && 'false'`` is ``false``
de: ``'true' && 'false'`` ist ``false``
es: ``'true' && 'false'`` es ``false``
fr: ``'true' && 'false'`` est ``false``

source: ``'true' or 'false'`` is ``true``
de: ``'true' oder 'false'`` ist ``true``
es: ``'true' or 'false'`` es ``true``
fr: ``'true' or 'false'`` est ``true``
nl: ``'true' of 'false'`` is ``true``

source: ``'false' || 'false'`` is ``false``
de: ``'false' || 'false'`` ist ``false``
es: ``'false' || 'false'`` es ``false``
fr: ``'false' || 'false'`` est ``false``

source: Comparison operators: greater than, lower than, greater or equal to, lower or equal to, equal to, different than return a boolean
de: Vergleichsoperatoren: größer als, kleiner als, größer oder gleich, kleiner oder gleich, gleich, ungleich ergeben einen booleschen Wert
es: Los operadores de comparación mayor que, menor que, mayor o igual que, menor o igual que, igual que y distinto de devuelven un valor booleano.
fr: Opérateurs de comparaison : supérieur à, inférieur à, supérieur ou égal à, inférieur ou égal à, égal à et différent de retournent un booléen
nl: Vergelijkingsoperatoren: groter dan, kleiner dan, groter dan of gelijk aan, kleiner dan of gelijk aan, gelijk aan, verschillend van geeft een boolean

source: ``3 < 4`` is ``true``
de: ``3 < 4`` ist ``true``
es: ``3 < 4`` es ``true``
fr: ``3 < 4`` est ``true``

source: ``5 >= 10`` is ``false``
de: ``5 >= 10`` ist ``false``
es: ``5 >= 10`` es ``false``
fr: ``5 >= 10`` est ``false``

source: String concatenation operator
de: Zeichenfolgen-Verkettungsoperator
es: Operador de concatenación de cadenas
fr: Opérateur de concaténation des chaînes de caractères
nl: Operator voor het samenvoegen van strings

source: ``'Hello' & ' world'`` returns ``'Hello world'``
de: ``'Hallo' & ' Welt'`` ergibt ``'Hallo Welt'``
es: ``'Hola' & 'mundo'`` devuelve ``'Hola mundo'``
fr: ``'Hello' & ' world'`` retourne ``'Hello world'``
nl: ``'Hallo' & ' wereld'`` geeft ``'Hallo wereld'``

source: Ternary operator
de: Ternärer Operator
es: Operador ternario
fr: Opérateur ternaire
nl: Ternaire operator

source: The expression ``[condition] ? [result if true] : [result if false]`` is called the ternary operator, and allows to return different results depending on a condition.
de: Der Ausdruck ``[Bedingung] ? [Ergebnis wenn wahr] : [Ergebnis wenn falsch]`` wird als ternärer Operator bezeichnet und ermöglicht es, je nach Bedingung unterschiedliche Ergebnisse zu ergeben.
es: La expresión ``[condición] ? [resultado si true] : [resultado si false]`` se denomina de operador ternario y permite devolver resultados distintos en función de una condición.
fr: L'expression ``[condition] ? [résultat si vrai] : [résultat si faux]`` s'appelle l'opérateur ternaire et permet de retourner différents résultats en fonction d'une condition.
nl: De uitdrukking ``[voorwaarde] ? [resultaat indien waar] : [resultaat indien onwaar]`` wordt de ternaire operator genoemd en laat toe om verschillende resultaten op te leveren afhankelijk van een voorwaarde.

source: A ternary expression can be read as "if [condition] then [result if true] else [result if false]".
de: Ein ternärer Ausdruck kann als "wenn [Bedingung] dann [Ergebnis wenn wahr] sonst [Ergebnis wenn falsch]" gelesen werden.
es: Una expresión ternaria puede leerse como \''if [condición] then [resultado si true] else [resultado si false]\''.
fr: Une expression ternaire peut être lue comme "si [condition] alors [résultat si vrai] sinon [résultat si faux]".
nl: Een ternaire operator kan gelezen worden als "wanneer [voorwaarde] dan [resultaat indien waar] anders [resultaat indien onwaar]".

source: ``'true' ? 'hello' : 'goodbye'`` returns ``'hello'``
de: ``'true' ? 'hallo' : 'tschüss'`` ergibt ``'hallo'``
es: ``'true' ? 'hola' : 'adiós'`` devuelve ``'hola'``
fr: ``'true' ? 'hello' : 'goodbye'`` retourne ``'hello'``
nl: ``'true' ? 'hallo' : 'vaarwel'`` geeft ``'hallo'``

source: ``'false' ? 'hello' : 'goodbye'`` returns ``'goodbye'``
de: ``'false' ? 'hallo' : 'tschüss'`` ergibt ``'tschüss'``
es: ``'false' ? 'hola' : 'adiós'`` devuelve ``'adiós'``
fr: ``'false' ? 'hello' : 'goodbye'`` retourne ``'good bye'``
nl: ``'false' ? 'hallo' : 'vaarwel'`` geeft ``'vaarwel``

source: ``4 > 3 ? '4 is bigger' : '3 is bigger'`` returns ``'4 is bigger'``
de: ``4 > 3 ? '4 ist größer als' : '3 ist größer'`` ergibt ``'4 ist größer'``
es: ``4 > 3 ? '4 es mayor que' : '3 es mayor que'`` devuelve ``'4 es mayor que'``
fr: ``4 > 3 ? '4 is bigger' : '3 is bigger'`` retourne ``'4 is bigger'``
nl: ``4 > 3 ? '4 is groter' : '3 is groter'`` geeft ``'4 is groter'``

source: ``10 <= 9 ? '9 is bigger' : '10 is bigger'`` returns ``'10 is bigger'``
de: ``10 <= 9 ? '9 ist größer' : '10 ist größer'`` ergibt ``'10 ist größer'``
es: ``10 <= 9 ? '9 es mayor que' : '10 es mayor que'`` devuelve ``'10 es mayor que'``
fr: ``10 <= 9 ? '9 is bigger' : '10 is bigger'`` retourne ``'10 is bigger'``
nl: ``10 <= 9 ? '9 is groter' : '10 is groter'`` geeft ``'10 is groter'``

source: The last part of the ternary operator is optional, which means that the following expressions are valid:
de: Der letzte Teil des ternären Operators ist optional. Deshalb sind die folgenden Ausdrücke gültig:
es: La última parte del operador ternario es opcional, lo que significa que las expresiones siguientes son válidas:
fr: La dernière partie de l'opérateur ternaire est optionnelle, ce qui veut dire que les expressions suivantes sont aussi valides :
nl: Het laatste deel van de ternaire operator is optioneel, wat betekent dat de volgende uitdrukkingen geldig zijn:

source: ``'true' ? 'hello'`` returns ``'hello'``
de: ``'true' ? 'hallo'`` ergibt ``'hallo'``
es: ``'true' ? 'hola'`` devuelve ``'hola'``
fr: ``'true' ? 'hello'`` retourne ``'hello'``
nl: ``'true' ? 'hallo'`` geeft ``'hallo'``

source: ``'false' ? 'hello'`` returns an empty result
de: ``'false' ? 'hallo'`` ergibt ein leeres Ergebnis
es: ``'false' ? 'hola'`` devuelve un resultado vacío
fr: ``'false' ? 'hello'`` retourne un résultat vide
nl: ``'false' ? 'hallo'`` geeft een leeg resultaat

source: Some operations can fail if they involve a field which type was wrongly guessed by the platform at the creation of the dataset, even if the field type was modified afterward. In that case, contact Opendatasoft support team.
de: Einige Vorgänge können fehlschlagen, wenn sie ein Feld beinhalten, dessen Typ von der Plattform bei der Erstellung des Datensatzes falsch eingeschätzt wurde, auch wenn der Feldtyp im Nachhinein geändert wurde. Wenden Sie sich in diesem Fall an das Support-Team von Opendatasoft.
es: Algunas operaciones pueden fallar si incluyen un campo cuyo tipo la plataforma ha averiguado de forma incorrecta al crear el conjunto de datos, aunque el tipo de campo se haya modificado más tarde. En ese caso, póngase en contacto con el equipo de soporte de Opendatasoft.
fr: Certaines opérations peuvent échouer si elles concernent un champ dont la plateforme a mal deviné le type à la création du jeu de données, même si le type de champ a été modifié ultérieurement. Veuillez contacter l'équipe support Opendatasoft si cela se produit.
nl: Sommige operaties kunnen mislukken wanneer er een veld bij betrokken is waarvan het type verkeerd door het platform werd geraden bij het aanmaken van de dataset, zelfs wanneer het veldtype achteraf werd gewijzigd. Neem in dat geval contact op met het support team van Opendatasoft.

source: Functions
de: Funktionen
es: Funciones
fr: Fonctions
nl: Functies

source: Functions are used to perform more advanced operations in an expression. They can take 0 or more parameters, and apply transformations on them such as:
de: Funktionen werden verwendet, um fortgeschrittene Operationen in einem Ausdruck durchzuführen. Sie können 0 oder mehr Parameter annehmen und Transformationen anwenden, wie z.B.:
es: Las funciones se utilizan para llevar a cabo operaciones más avanzadas en una expresión. Pueden tomar cero o más parámetros y aplicar en estos transformaciones, como pueden ser:
fr: Les fonctions sont utilisées pour réaliser des opérations plus avancées dans une expression. Elles acceptent 0 ou plus paramètres et leur appliquent des transformations telles que :
nl: Functies worden gebruikt om meer geavanceerde operaties in een uitdrukking uit te voeren. Ze kunnen 0 of meerdere parameters bevatten en transformaties erop uitvoeren, zoals:

source: text handling,
de: Textverarbeitung,
es: tratamiento de texto,
fr: gestion du texte ;
nl: tekstbehandeling,

source: mathematical functions,
de: mathematische Funktionen,
es: funciones matemáticas,
fr: fonctions mathématiques ;
nl: wiskundige functies,

source: date and time handling.
de: Verarbeitung von Datum und Uhrzeit.
es: tratamiento de indicación de fecha y hora
fr: gestion de la date et de l'heure.
nl: datum- en tijdbehandeling.

source: Text handling
de: Textverarbeitung
es: Tratamiento de texto
fr: Gestion du texte
nl: Tekstbehandeling

source: **Boolean functions**
de: **Boolesche Funktionen**
es: **Funciones booleanas**
fr: **Fonctions booléennes**
nl: **Boolean functies**

source: Function
de: Funktion
es: Función
fr: Fonction
nl: Functie

source: ``isalpha([text])``
es: ``isalpha([texto])``
fr: ``isalpha([texte])``

source: True if text only contains letters
de: Wahr, wenn der Text nur Buchstaben enthält
es: True si el texto solo contiene letras.
fr: Vrai si le texte ne contient que des lettres
nl: Waar indien tekst enkel letters bevat

source: ``isnumeric([text])``
es: ``isnumeric([texto])``
fr: ``isnumeric([texte])``

source: True if text only contains numbers
de: Wahr, wenn der Text nur Zahlen enthält
es: True si el texto solo contiene números.
fr: Vrai si le texte ne contient que des chiffres
nl: Waar indien tekst enkel cijfers bevat

source: ``isalnum([text])``
es: ``isalnum([texto])``
fr: ``isalnum([texte])``

source: True if text only contains letters or numbers
de: Wahr, wenn der Text nur Buchstaben oder Zahlen enthält
es: True si el texto solo contiene letras o números.
fr: Vrai si le texte contient des lettres ou des chiffres
nl: Waar indien tekst enkel letters of cijfers bevat

source: ``isdecimal([text])``
es: ``isdecimal([texto])``
fr: ``isdecimal([texte])``

source: True if text is a valid decimal number
de: Wahr, wenn der Text eine gültige Dezimalzahl ist
es: True si el texto es un número decimal válido.
fr: Vrai si le texte est un nombre décimal valide
nl: Waar indien tekst een geldig decimaal cijfer is

source: ``isdigit([text])``
es: ``isdigit([texto])``
fr: ``isdigit([texte])``

source: True if text is a single digit
de: Wahr, wenn der Text eine einstellige Zahl ist
es: True si el texto es un solo dígito.
fr: Vrai si le texte est un chiffre seul
nl: Waar indien tekst een enkel karakter is

source: ``islower([text])``
es: ``islower([texto])``
fr: ``islower([texte])``

source: True if text is lowercase
de: Wahr, wenn der Text klein geschrieben ist
es: True si el texto está en minúsculas.
fr: Vrai si le texte est en minuscules
nl: Waar indien tekst in kleine letters staat

source: ``isupper([text])``
es: ``isupper([texto])``
fr: ``isupper([texte])``

source: True if text is uppercase
de: Wahr, wenn der Text groß geschrieben ist
es: True si el texto está en mayúsculas.
fr: Vrai si le texte est en majuscules
nl: Waar indien tekst in hoofdletters staat

source: ``empty([text])``
es: ``empty([texto])``
fr: ``empty([texte])``

source: True if text is empty
de: Wahr, wenn der Text leer ist
es: True si el texto está vacío.
fr: Vrai si le texte est vide
nl: Waar indien tekst leeg is

source: ``contains([text],[text])``, ``startswith([text],[text])``, ``endswith([text],[text])``
es: ``contains([texto],[texto])``, ``startswith([texto],[texto])``, ``endswith([texto],[texto])``
fr: ``contains([texte],[texte])``, ``startswith([texte],[texte])``, ``endswith([texte],[texte])``

source: True if text (1st argument) contains, starts with or ends with text (2nd argument)
de: Wahr, wenn der Text (1. Argument) Text enthält, mit ihm beginnt oder mit ihm endet (2. Argument)
es: True si el texto (1.er argumento) contiene, empieza o acaba con el texto (2.º argumento).
fr: Vrai si le texte (1er argument) contient, commence ou finit par le texte (2e argument)
nl: Waar indien tekst (1ste argument) begint met tekst, eindigt met tekst of tekst bevat (2de argument)

source: ``contains("hello", "l")`` returns ``True``
de: ``contains("hallo", "lch")`` ergibt ``True``
es: ``contains(\''hola\'', \''l\'')`` devuelve ``True``
fr: ``contains("hello", "l")`` retourne ``True``
nl: ``contains("hallo", "l")`` geeft ``True``

source: ``startswith("hello", 'he')`` returns ``True``
de: ``startswith("hallo", 'ha')`` ergibt ``True``
es: ``startswith("hola", 'ho')`` devuelve ``True``
fr: ``startswith("hello", 'he')`` retourne ``True``
nl: ``startswith("hello", 'he')`` geeft ``True``

source: ``endswith("hello", 'he')`` returns ``False``
de: ``endswith("hallo", 'ha')`` ergibt ``False``
es: ``endswith("hola", 'ho')`` devuelve ``False``
fr: ``endswith("hello", 'he')`` retourne ``False``
nl: ``endswith("hello", 'he')`` geeft ``False``

source: **Processing functions**
de: **Verarbeitungsfunktionen**
es: **Funciones de procesamiento**
fr: **Fonctions de traitement**
nl: **Verwerkingsfuncties**

source: ``length([text])``
es: ``length([texto])``
fr: ``length([texte])``

source: Return the length of the text
de: Ergibt die Länge des Texts
es: Devuelve la longitud del texto.
fr: Retourne la longueur du texte
nl: Geeft de lengte van de tekst

source: ``length('hello')`` returns ``5``
de: ``length('hallo')`` ergibt ``5``
es: ``length('hola')`` devuelve ``5``
fr: ``length('bonjour')`` retourne ``7``
nl: ``length('hello')`` geeft ``5``

source: ``lower([text])``, ``upper([text])``
es: ``lower([texto])``, ``upper([texto])``
fr: ``lower([texte])``, ``upper([texte])``

source: Convert text to lowercase, to uppercase
de: Konvertiert Text in Kleinbuchstaben, in Großbuchstaben
es: Convierte el texto a minúsculas o mayúsculas.
fr: Convertit le texte en minuscules ou en majuscules
nl: Zet tekst om naar kleine letters, naar hoofdletters

source: ``capitalize([text])``, ``capitalize_all([text])``
es: ``capitalize([texto])``, ``capitalize_all([texto])``
fr: ``capitalize([texte])``, ``capitalize_all([texte])``
