Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/expression.po
Languages: de, es, fr, nl

source: Capitalize the first letter of the text, the first letter of each word
de: Großschreibung des ersten Buchstabens des Textes, des ersten Buchstabens jedes Wortes
es: Convierte a mayúscula la primera letra del texto y la primera letra de cada palabra.
fr: Met la première lettre du texte en majuscule ou la première lettre de chaque mot
nl: Zet de eerste letter van de tekst, de eerste letter van elk woord om naar een hoofdletter

source: ``ljust([text],[numeric],[text])``
es: ``ljust([texto],[numérico],[texto])``
fr: ``ljust([texte],[nombre],[texte])``

source: ``rjust([text],[numeric],[text])``
es: ``rjust([texto],[numérico],[texto])``
fr: ``rjust([texte],[nombre],[texte])``

source: ``center([text],[numeric],[text])``
es: ``center([texto],[numérico],[texto])``
fr: ``center([texte],[nombre],[texte])``

source: Left, right and center justify a text (1st argument), until it reaches [numeric] characters with another text (3rd argument)
de: Einen Text links, rechts und mittig ausrichten (1. Argument), bis er [numerische] Zeichen mit einem anderen Text (3. Argument) erreicht
es: Justifica a la izquierda (ljust), a la derecha (rjust) o centra un texto (1.er argumento) con otro texto (3.er argumento) hasta que se llega al carácter que indica [numérico].
fr: Justifie à gauche, à droite et au centre un texte (1er argument), jusqu'à atteindre le [nombre] de caractères à l'aide d'un autre texte (3e argument)
nl: Een tekst links, rechts en centraal motiveren (1ste argument) tot hij [numeric] karakters met een andere tekst bereikt (3de argument)

source: ``ljust("4400", 5, "0")`` returns ``"44000"``
de: ``ljust("4400", 5, "0")`` ergibt ``"44000"``
es: ``ljust(\''4400\'', 5, \''0\'')`` devuelve ``\''44000\''``
fr: ``ljust("4400", 5, "0")`` retourne ``"44000"``
nl: ``ljust("4400", 5, "0")`` geeft ``"44000"``

source: ``rjust("4400", 5, "0")`` returns ``"04400"``
de: ``rjust("4400", 5, "0")`` ergibt ``"04400"``
es: ``rjust(\''4400\'', 5, \''0\'')`` devuelve ``\''04400\''``
fr: ``rjust("4400", 5, "0")`` retourne ``"04400"``
nl: ``rjust("4400", 5, "0")`` geeft ``"04400"``

source: ``center("4400", 6,"0")`` returns ``"044000"``
de: ``center("4400", 6,"0")`` ergibt ``"044000"``
es: ``center(\''4400\'', 6,\''0\'')`` devuelve ``\''044000\''``
fr: ``center("4400", 6,"0")`` retourne ``"044000"``
nl: ``center("4400", 6,"0")`` geeft ``"044000"``

source: ``normalize([text])``
es: ``normalize([texto])``
fr: ``normalize([texte])``

source: Convert a text to its ascii representation
de: Konvertiert einen Text in seine ASCII-Darstellung
es: Convierte un texto en su representación ASCII.
fr: Remplace un texte par sa représentation ASCII
nl: Converteert een tekst naar zijn ascii-weergave

source: ``normalize("你好")`` returns ``"ni hao"``
de: ``normalize("你好")`` ergibt ``"ni hao"``
es: ``normalize(\''你好\'')`` devuelve ``\''ni hao\''``
fr: ``normalize("你好")`` retourne ``"ni hao"``
nl: ``normalize("你好")`` geeft ``"ni hao"``

source: ``substring([text],[numeric],[numeric])``
es: ``substring([texto],[numérico],[numérico])``
fr: ``substring([texte],[nombre],[nombre])``

source: Extract a substring of text, starting at index indicated by 2nd argument and of a length indicated by 3rd argument (optional)
de: Extrahiert eine Teilzeichenkette aus Text, beginnend mit dem durch das 2. Argument angegebenen Index und einer Länge, die durch das 3. Argument angegeben wird (optional)
es: Extrae una subcadena de texto empezando en el índice indicado por el 2.º argumento de la longitud indicada por el 3.er argumento (opcional).
fr: Extrait une sous-chaîne de texte, en commençant à l'index indiqué par le 2nd argument et d'une longueur indiquée par le 3e argument (optionnel).
nl: Een substring van tekst extraheren, te beginnen bij de index die aangegeven wordt door het 2de argument en met een lengte die aangegeven wordt door het 3de argument (optioneel)

source: ``substring('hello', 1, 3)`` returns ``"ell"``
de: ``substring('hallo', 1, 3)`` ergibt``"all"``
es: ``substring('hola', 1, 3)`` devuelve ``\''ell\''``
fr: ``substring('hello', 1, 3)`` retourne ``"ell"``
nl: ``substring('hallo', 1, 3)`` geeft ``"all"``

source: ``count([text], [text])``
es: ``count([texto], [texto])``
fr: ``count([texte], [texte])``

source: Return the number of times the 2nd argument is found in the 1st argument
de: Gibt an, wie oft das 2. Argument innerhalb des 1. Arguments gefunden wird
es: Devuelve el número de veces que el 2.º argumento se ha encontrado en el 1.er argumento.
fr: Retourne le nombre de fois où le 2nd argument apparaît dans le 1er argument
nl: Geeft het aantal keren weer dat het 2de argument teruggevonden is in het 1ste argument

source: ``count("Hello world", "l")`` returns ``3``
de: ``count("Hallo Welt", "l")`` ergibt ``3``
es: ``count("Hola mundo", "l")`` devuelve ``3``
fr: ``count("Hello world", "l")`` retourne ``3``
nl: ``count("Hello world", "l")`` geeft ``3``

source: ``left([text],[numeric])``
es: ``left([texto],[numérico])``
fr: ``left([texte],[nombre])``

source: ``right([text],[numeric])``
es: ``right([texto],[numérico])``
fr: ``right([texte],[nombre])``

source: ``mid([text],[numeric])``
es: ``mid([texto],[numérico])``
fr: ``mid([texte],[nombre])``

source: Extract a part of text (1st argument), from the left, right or the middle; the size of the extract is given by the 2nd argument for ``left`` and ``right``, by the 2nd and 3rd arguments for ``mid``
de: Extrahiert einen Textteil (1. Argument) von links, aus der Mitte oder von rechts; die Länge des Auszugs wird für ``left`` und ``right`` durch das 2. Argument, für ``mid`` durch das 2. und 3. Argument angegeben.
es: Extrae una parte de texto (1.er argumento), de la izquierda, derecha o centro; el tamaño de la extracción está determinado por el 2.º argumento para ``left`` y ``right``, y por el 2.º y el 3.er argumento para ``mid``.
fr: Extrait une partie du texte (1er argument) en partant de la gauche, de la droite ou du milieu ; la taille de l'extrait est déterminé par le 2nd argument pour ``gauche`` et ``droite``, par les 2nd et 3e arguments pour ``mid``
nl: Extraheer een deel tekst (1ste argument) van links, rechts of het midden; de grootte van de extractie wordt aangegeven door het 2de argument voor ``left`` en ``right`` en door de 2de en 3de argumenten voor ``mid``

source: ``left("hello", 2)`` returns ``"he"``
de: ``left("hallo", 2)`` ergibt ``"ha"``
es: ``left("hola", 2)`` devuelve ``"ho"``
fr: ``left("hello", 2)`` retourne ``"he"``
nl: ``left("hello", 2)`` geeft ``"he"``

source: ``right("hello", 3)`` returns ``"llo"``
de: ``right("hallo", 3)`` ergibt ``"llo"``
es: ``right("hola", 3)`` devuelve ``"ola"``
fr: ``right("hello", 3)`` retourne ``"llo"``
nl: ``right("hello", 3)`` geeft ``"llo"``

source: ``mid("hello", 2, 3)`` returns ``"ell"``
de: ``mid("hallo", 2, 3)`` ergibt ``"all"``
es: ``mid("hola", 2, 3)`` devuelve ``"ola"``
fr: ``mid("hello", 2, 3)`` retourne ``"ell"``
nl: ``mid("hello", 2, 3)`` geeft ``"ell"``

source: Mathematical functions
de: Mathematische Funktionen
es: Funciones matemáticas
fr: Fonctions mathématiques
nl: Wiskundige functies

source: ``abs([numeric])``
es: ``abs([numérico])``
fr: ``abs([nombre])``

source: Absolute value
de: Absoluter Wert
es: Valor absoluto
fr: Valeur absolue
nl: Absolute waarde

source: ``abs(-4)`` returns ``4``
de: ``abs(-4)`` ergibt ``4``
es: ``abs(-4)`` devuelve ``4``
fr: ``abs(-4)`` retourne ``4``
nl: ``abs(-4)`` geeft ``4``

source: ``sqrt([numeric])``
es: ``sqrt([numérico])``
fr: ``sqrt([nombre])``

source: Square root
de: Quadratwurzel
es: Raíz cuadrada
fr: Racine carrée
nl: Vierkantswortel

source: ``floor([numeric])``, ``ceil([numeric])``
es: ``floor([numérico])``, ``ceil([numérico])``
fr: ``floor([nombre])``, ``ceil([nombre])``

source: Floor and ceiling functions
de: Boden- und Deckenfunktionen
es: Funciones suelo y techo
fr: Fonctions arrondi à l'entier inférieur et supérieur
nl: Bodem- en plafondfuncties

source: ``floor(4.6)`` returns ``4``
de: ``floor(4.6)`` ergibt ``4``
es: ``floor(4,6)`` devuelve ``4``
fr: ``floor(4.6)`` retourne ``4``
nl: ``floor(4.6)`` geeft ``4``

source: ``ceil(3.3)`` returns ``4``
de: ``ceil(3.3)`` ergibt ``4``
es: ``ceil(3,3)`` devuelve ``4``
fr: ``ceil(3.3)`` retourne ``4``
nl: ``ceil(3.3)`` geeft ``4``

source: ``max([numeric],[numeric])``, ``min([numeric],[numeric])``
es: ``max([numérico],[numérico])``, ``min([numérico],[numérico])``
fr: ``max([nombre],[nombre])``, ``min([nombre],[nombre])``

source: Max and min functions
de: Max- und Min-Funktionen
es: Funciones de mínimo y máximo
fr: Fonctions minimales et maximales
nl: Maximale en minimale functies

source: ``round([numeric])``
es: ``round([numérico])``
fr: ``round([nombre])``

source: Return the nearest integer
de: Ergibt die nächstgelegene Ganzzahl
es: Devuelve el entero más cercano.
fr: Arrondit à l'entier le plus proche
nl: Geeft het dichtstbijzijnde geheel getal

source: ``round(4.6)`` returns ``5``
de: ``round(4.6)`` ergibt ``5``
es: ``round(4,6)`` devuelve ``5``
fr: ``round(4.6)`` retourne ``5``
nl: ``round(4.6)`` geeft ``5``

source: ``round(3.3)`` returns ``4``
de: ``round(3.3)`` ergibt ``4``
es: ``round(3,3)`` devuelve ``4``
fr: ``round(3.3)`` retourne ``4``
nl: ``round(3.3)`` geeft ``4``

source: ``random([numeric])``
es: ``random([numérico])``
fr: ``random([nombre])``

source: Random number generator (between 0 and [numeric])
de: Zufallszahlengenerator (zwischen 0 und [numeric])
es: Generador de número aleatorio (entre 0 y [numérico])
fr: Génère un nombre aléatoire (entre 0 et [nombre])
nl: Willekeurig weergeven van cijfers (tussen 0 en [numeric])

source: ``random(10)`` returns for example ``7.27846540481``
de: ``random(10)`` ergibt zum Beispiel ``7.27846540481``
es: ``random(10)`` devuelve, por ejemplo, ``7,27846540481``
fr: ``random(10)`` retourne par exemple ``7.27846540481``
nl: ``random(10)`` geeft bijvoorbeeld ``7.27846540481``

source: ``pow([numeric], [numeric])``
es: ``pow([numérico], [numérico])``
fr: ``pow([nombre], [nombre])``

source: Power function
de: Potenzfunktion
es: Función de potencia
fr: Fonction puissance
nl: Krachtfunctie

source: ``pow(2, 3)`` returns ``8``
de: ``pow(2, 3)`` ergibt ``8``
es: ``pow(2, 3)`` devuelve ``8``
fr: ``pow(2, 3)`` retourne ``8``
nl: ``pow(2, 3)`` geeft ``8``

source: ``exp([numeric])``, ``log([numeric])``, ``log10([numeric])``
es: ``exp([numérico])``, ``log([numérico])``, ``log10([numérico])``
fr: ``exp([nombre])``, ``log([nombre])``, ``log10([nombre])``

source: Exponential, logarithm and base 10 logarithm functions
de: Exponentielle, logarithmische und Basis 10 Logarithmusfunktionen
es: Funciones exponencial, logarítmica y logarítmica de base 10
fr: Fonctions exponentielles, logarithmiques et du logarithme en base 10
nl: Exponentieel, logaritme en 10 logaritmische basisfuncties

source: ``exp(1)`` returns ``E``
de: ``exp(1)`` ergibt ``E``
es: ``exp(1)`` devuelve ``E``
fr: ``exp(1)`` retourne ``E``
nl: ``exp(1)`` geeft ``E``

source: ``radians([numeric])``
es: ``radians([numérico])``
fr: ``radians([nombre])``

source: Convert an angle from degrees to radians
de: Konvertiert einen Winkel von Grad in Radiant
es: Convierte un ángulo de grados a radianes.
fr: Convertit un angle de degrés en radians
nl: Converteert een hoek van graden naar radialen

source: ``radians(180)`` returns ``PI``
de: ``radians(180)`` ergibt ``PI``
es: ``radians(180)`` devuelve ``PI``
fr: ``radians(180)`` retourne ``PI``
nl: ``radians(180)`` geeft ``PI``

source: ``degrees([numeric])``
es: ``degrees([numérico])``
fr: ``degrees([nombre])``

source: Convert an angle from radians to degrees
de: Konvertiert einen Winkel von Radiant in Grad
es: Convierte un ángulo de radianes a grados.
fr: Convertit un angle de radians en degrés
nl: Converteert een hoek van radialen naar graden

source: ``degrees(PI)`` returns ``180``
de: ``degrees(PI)`` ergibt ``180``
es: ``grados(PI)`` devuelve ``180``
fr: ``degrees(PI)`` retourne ``180``
nl: ``degrees(PI)`` geeft ``180``

source: ``cos([numeric])``, ``cosh([numeric])``, ``sin([numeric])``, ``sinh([numeric])``, ``tan([numeric])``, ``tanh([numeric])``
es: ``cos([numérico])``, ``cosh([numérico])``, ``sin([numérico])``, ``sinh([numérico])``, ``tan([numérico])``, ``tanh([numérico])``
fr: ``cos([nombre])``, ``cosh([nombre])``, ``sin([nombre])``, ``sinh([nombre])``, ``tan([nombre])``, ``tanh([nombre])``

source: Cosine, hyperbolic cosine, sine, hyperbolic sine, tangent, hyperbolic tangent (in radians)
de: Kosinus, hyperbolischer Kosinus, Sinus, hyperbolischer Sinus, Tangens, hyperbolischer Tangens (in Radiant)
es: Coseno, coseno hiperbólico, seno, seno hiperbólico, tangente, tangente hiperbólica (en radianes)
fr: Cosinus, cosinus hyperbolique, sinus, sinus hyperbolique, tangente, tangente hyperbolique (en radians)
nl: Cosinus, hyperbolische cosinus, sinus, hyperbolische sinus, tangens, hyperbolische tangens (in radialen)

source: ``sin(PI)`` returns ``0``
de: ``sin(PI)`` ergibt ``0``
es: ``sin(PI)`` devuelve ``0``
fr: ``sin(PI)`` retourne ``0``
nl: ``sin(PI)`` geeft ``0``

source: ``acos([numeric])``, ``acosh([numeric])``, ``asin([numeric])``, ``asinh([numeric])``, ``atan([numeric])``, ``atanh([numeric])``
es: ``acos([numérico])``, ``acosh([numérico])``, ``asin([numérico])``, ``asinh([numérico])``, ``atan([numérico])``, ``atanh([numérico])``
fr: ``acos([nombre])``, ``acosh([nombre])``, ``asin([nombre])``, ``asinh([nombre])``, ``atan([nombre])``, ``atanh([nombre])``

source: Inverse cosine, inverse cosine hyberbolical, inverse sine, inverse sine hyperbolical, inverse tangent, inverse tangent hyperbolical (in radians)
de: Umgekehrter Kosinus, umgekehrter hyperbolischer Kosinus, umgekehrter Sinus, umgekehrter hyperbolischer Sinus, umgekehrter Tangens, umgekehrter hyperbolischer Tangens (in Radiant)
es: Coseno inverso, coseno hiperbólico inverso, seno inverso, seno hiperbólico inverso, tangente inversa, tangente hiperbólica inversa (en radianes)
fr: Cosinus inverse, cosinus inverse hyperbolique, sinus inverse, cosinus inverse hyperbolique, tangente inverse, tangente inverse hyperbolique (en radians)
nl: Omgekeerde cosinus, omgekeerde hyperbolische cosinus, omgekeerde sinus, omgekeerde hyperbolische sinus, omgekeerde tangens, omgekeerde hyperbolische tangens (in radialen)

source: ``acos(0)`` returns ``PI/2``
de: ``acos(0)`` ergibt ``PI/2``
es: ``acos(0)`` devuelve ``PI/2``
fr: ``acos(0)`` retourne ``PI/2``
nl: ``acos(0)`` geeft ``PI/2``

source: Date and time handling
de: Verarbeitung von Datum und Uhrzeit
es: Tratamiento de indicación de fecha y hora
fr: Gestion de la date et de l'heure
nl: Datum- en tijdbehandeling

source: ``year([datetime])``, ``quarter([datetime])``, ``month([datetime])``, ``week([datetime])``, ``day([datetime])``, ``dayofweek([datetime])``, ``hour([datetime])``, ``minute([datetime])``, ``second([datetime])``
es: ``year([indicación fecha y hora])``, ``quarter([indicación fecha y hora])``, ``month([indicación fecha y hora])``, ``week([indicación fecha y hora])``, ``day([indicación fecha y hora])``, ``dayofweek([indicación fecha y hora])``, ``hour([indicación fecha y hora])``, ``minute([indicación fecha y hora])``, ``second([indicación fecha y hora])``
nl: ``jaar([datetime])``, ``kwartaal([datetime])``, ``maand([datetime])``, ``week([datetime])``, ``dag([datetime])``, ``dagvandeweek([datetime])``, ``uur([datetime])``, ``minuut([datetime])``, ``seconde([datetime])``

source: Extract the year, quarter, month, week, day, day of week, hours, minutes, seconds from a datetime
de: Extrahiert das Jahr, das Vierteljahr, den Monat, die Woche, den Tag, den Wochentag, die Stunden, Minuten und Sekunden aus einer DateTime
es: Extrae el año, el trimestre, el mes, la semana, el día, el día de la semana, las horas, los minutos y los segundos de una indicación de fecha y hora.
fr: Extrait l'année, le trimestre, le mois, la semaine, la date, le jour de la semaine, les heures, les minutes et les secondes d'un datetime
nl: Extraheer het jaar, kwartaal, maand, week, dag, dag van de week, uren, minuten, seconden uit een datumtijd

source: ``year("2014-06-07")`` returns ``2014``
de: ``year("2014-06-07")`` ergibt ``2014``
es: ``year(\''2014-06-07\'')`` devuelve ``2014``
fr: ``year("2014-06-07")`` retourne ``2014``
nl: ``year("2014-06-07")`` geeft ``2014``

source: ``hour("2014-06-07 17:00")`` returns ``17``
de: ``hour("2014-06-07 17:00")`` ergibt ``17``
es: ``hour(\''2014-06-07 17:00\'')`` devuelve ``17``
fr: ``hour("2014-06-07 17:00")`` retourne ``17``
nl: ``hour("2014-06-07 17:00")`` geeft ``17``

source: ``hour("2014-06-07 17:00", "Europe/Paris")`` returns ``19``
de: ``hour("2014-06-07 17:00", "Europe/Paris")`` ergibt ``19``
es: ``hour(\''2014-06-07 17:00\'', \''Europa/París\'')`` devuelve ``19``
fr: ``hour("2014-06-07 17:00", "Europe/Paris")`` retourne ``19``
nl: ``hour("2014-06-07 17:00", "Europa/Parijs")`` geeft ``19``

source: Suppose that the current date is "2021-04-21". In this case, ``month(now())`` returns ``4``.
es: Suponga que la fecha actual es "2021-04-21". En este caso, ``month(now())`` devuelve ``4``.
fr: Imaginez que la date actuelle est "2021-04-21". Dans ce cas, ``month(now())`` renvoie ``4``.

source: ``add_years([datetime],[numeric])``, ``add_months([datetime],[numeric])``, ``add_days([datetime],[numeric])``, ``add_hours([datetime],[numeric])``, ``add_minutes([datetime],[numeric])``, ``add_seconds([datetime],[numeric])``
es: ``add_years([indicación fecha y hora],[numérico])``, ``add_months([indicación fecha y hora],[numérico])``, ``add_days([indicación fecha y hora],[numérico])``, ``add_hours([indicación fecha y hora],[numérico])``, ``add_minutes([indicación fecha y hora],[numérico])``, ``add_seconds([indicación fecha y hora],[numérico])``
fr: ``add_years([datetime],[nombre])``, ``add_months([datetime],[nombre])``, ``add_days([datetime],[nombre])``, ``add_hours([datetime],[nombre])``, ``add_minutes([datetime],[nombre])``, ``add_seconds([datetime],[nombre])``

source: Add years, months, days, hours, minutes, seconds to a datetime
de: Fügt einer DateTime Jahre, Monate, Tage, Stunden, Minuten, Sekunden hinzu
es: Añade años, meses, días, horas, minutos y segundos a una indicación de fecha y hora.
fr: Ajoute des années, des mois, des jours, des heures, des minutes ou des secondes à un datetime
nl: Voeg jaren, maanden, dagen, uren, minuten, seconden toe aan een datetime

source: ``add_months("2014-11-14", 3)`` returns ``2015-02-14``
es: ``add_months("2014-11-14", 3)`` devuelve ``2015-02-14``
fr: ``add_months("2014-11-14", 3)`` renvoie ``2015-02-14``.

source: Suppose that the current date is "2020-04-21". In this case, ``add_months(now(), 3)`` returns ``2021-07-21``.
es: Suponga que la fecha actual es "2020-04-21". En este caso, ``add_months(now(), 3)`` devuelve ``2021-07-21``.
fr: Imaginez que la date actuelle est "2021-04-21". Dans ce cas, ``add_months(now(), 3)`` renvoie ``2021-07-21``.

source: ``fromtimestamp([numeric])``
es: ``fromtimestamp([numérico])``
fr: ``fromtimestamp([nombre])``

source: Convert a timestamp to a datetime
de: Konvertiert einen Zeitstempel in eine DateTime
es: Convierte una marca horaria en una indicación de fecha y hora.
fr: Convertit un indicateur temporel en datetime
nl: Converteert een tijdzegel naar een datetime

source: ``quartertodaterange([numeric])``
es: ``quartertodaterange([numérico])``
fr: ``quartertodaterange([nombre])``

source: Convert a quarter (e.g: "2014Q2", "2019q1") to a date range
de: Konvertiert ein Quartal (z.B.: "2014Q2", "2019q1") in einen Datumsbereich
es: Convierte un trimestre (p. ej., \''2014T2\'', \''2019t1\'') en un rango de fechas.
fr: Convertit un trimestre en intervalle de dates
nl: Converteert een kwartaal (bijv. "2014Q2", "2019q1") naar een datumbereik

source: ``quartertodaterange("2014Q2")`` returns ``"2014-04-01 / 2014-06-30"``
de: ``quartertodaterange("2014Q2")`` ergibt ``"2014-04-01 / 2014-06-30"``
es: ``quartertodaterange(\''2014T2\'')`` devuelve ``\''2014-04-01 / 2014-06-30\''``
fr: ``quartertodaterange("2014Q2")`` retourne ``"2014-04-01 / 2014-06-30"``
nl: ``quartertodaterange("2014Q2")`` geeft ``"2014-04-01 / 2014-06-30"``

source: ``datediff([datetime], [datetime], [unit])``
es: ``datediff([indicación fecha y hora], [indicación fecha y hora], [unidad])``
fr: ``datediff([datetime], [datetime], [unité])``

source: Count the number of units between the two datetime expressions. ``[unit]`` can be "year", "month", "day", "hour", "minute", "second".
es: Cuenta el número de unidades entre las dos expresiones de fecha y hora. ``[unidad]`` puede ser \''year\'', \''month\'', \''day\'', \''hour\'', \''minute\'', \''second\''.
fr: Compte le nombre d'unités entre deux expressions datetime. ``[unité]`` peut être être "year", "month", "day", "hour", "minute" ou "second".

source: ``datediff("2014-02-28", "2015-02-28", "month")`` returns ``12``
de: ``datediff("2014-02-28", "2015-02-28", "month")`` ergibt ``12``
es: ``datediff(\''2014-02-28\'', \''2015-02-28\'', \''month\'')`` devuelve ``12``
fr: ``datediff("2014-02-28", "2015-02-28", "month")`` retourne ``12``
nl: ``datediff("2014-02-28", "2015-02-28", "maand")`` geeft ``12``

source: ``datediff("2014-02-28T20:00:00Z", "2014-02-28T21:00:00Z", "minute")`` returns ``60``
de: ``datediff("2014-02-28T20:00:00Z", "2014-02-28T21:00:00Z", "minute")`` ergibt ``60``
es: ``datediff(\''2014-02-28T20:00:00Z\'', \''2014-02-28T21:00:00Z\'', \''minute\'')`` devuelve ``60``
fr: ``datediff("2014-02-28T20:00:00Z", "2014-02-28T21:00:00Z", "minute")`` retourne ``60``
nl: ``datediff("2014-02-28T20:00:00Z", "2014-02-28T21:00:00Z", "minuut")`` geeft ``60``

source: Suppose that the current time is "2021-04-21". In this case, ``datediff("2020-04-01", now(), "year")`` returns ``1``.
es: Suponga que la hora actual es "2021-04-21". En este caso, ``datediff("2020-04-01", now(), "year")`` devuelve ``1``.
fr: Imaginez que la date actuelle est "2021-04-21". Dans ce cas, ``datediff("2020-04-01", now(), "year")`` renvoie ``1``.

source: ``!`` (factorial)
de: ``!`` (Fakultät)
fr: ``!`` (factorielle)
nl: ``!`` (factorieel)

source: ``add_months("2014-11-14", "3")`` returns ``2015-02-14``
de: ``add_months("2014-11-14", "3")`` ergibt ``2015-02-14``
nl: ``add_months("2014-11-14", "3")`` geeft ``2015-02-14``

source: Count the number of units between the two datetimes. ``[unit]`` can be "year", "month", "day", "hour", "minute", "second".
de: Zählt die Anzahl der Einheiten zwischen den zwei DateTimes. ``[unit]`` kann "year" (Jahr), "month" (Monat), "day" (Tag), "hour" (Stunde), "minute" (Minute), "second" (Sekunde) sein.
nl: Tel het aantal eenheden tussen twee datetimes. ``[eenheid]`` kan "year", "month", "day", "hour", "minute", "second" zijn.
