Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/extract_from_json.po
Languages: fr, nl

source: Extract from JSON processor
fr: Processeur Extraire d'un objet JSON

source: This processor extracts values from a field containing a JSON object following a list of iJSON rules.
fr: Ce processeur permet d'extraire des valeurs depuis un champ contenant un objet JSON en observant une liste de règles iJSON.
nl: Deze processor extraheert waarden uit een veld dat een JSON-voorwerp bevat volgens een lijst met iJSON-regels.

source: It creates target columns for the extracted data that are automatically named like the iJSON rules but replacing dots with underscores. For each iJSON rule, a column is created with the extracted value.
fr: Il crée des colonnes cibles pour les données extraites qui sont automatiquement nommées de la même manière que les règles ijson, mais en remplaçant les points par des underscores ("_"). Pour chaque règle iJSON, une colonne contenant la valeur extraite est créée.
nl: Hij maakt doelkolommen aan voor de geëxtraheerde data die automatisch benoemd worden zoals de iJSON-regels maar waarbij puntjes vervangen worden door laag liggende streepjes. Voor elke iJSON-regel wordt een kolom aangemaakt met de geëxtraheerde waarde.

source: The processor doesn't support iJSON rules that lead to an array (containing a ``.item`` in the rule).
fr: Le processeur ne prend pas en charge les règles iJSON qui entraînent la création d'un tableau (règles qui contiennent un ``.item``).
nl: De processor ondersteunt geen iJSON-regels die leiden tot een array (waarbij een ``.item`` in de regel staat).

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Extract from JSON processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Extraire d'un objet JSON, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Extract from JSON processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Example
fr: Exemple
nl: Voorbeeld

source: Field
fr: Champ
nl: Veld

source: Name of the field that holds the JSON object
fr: Nom du champ contenant l'objet JSON
nl: Naam van het veld waarin het JSON-voorwerp staat

source: iJSON rules
fr: Règles iJSON
nl: iJSON-regels

source: iJSON rules to apply to extract data from the JSON object above. An iJSON rule is built with the names of all the field from the JSON root to the data to extract, separated with a dot.
fr: Règles iJSON à appliquer pour extraire les données de l'objet JSON ci-dessus. Une règle iJSON se construit avec les noms de tous les champs de la racine JSON des données à extraire, séparés par des points.
nl: Toe te passen iJSON-regels om data te extraheren uit het bovenstaande JSON-voorwerp. Een iJSON-regel is opgebouwd met de namen van alle velden uit de JSON-root naar de data die geëxtraheerd moeten worden, gescheiden door een puntje.

source: The JSON object below is into a text field:
fr: L'objet JSON ci-dessous se trouve dans un champ texte :
nl: Het onderstaande JSON-voorwerp staat in een tekstveld:

source: you will be able to extract the value ``Joe`` with this rule : ``metaA``
fr: vous pouvez extraire la valeur ``Joe`` avec cette règle : ``metaA``
nl: u zal de waarde ``Joe`` kunnen extraheren met deze regel: ``metaA``

source: you will be able to extract the value ``valueB`` with this rule : ``bloc.metaB``
fr: vous pouvez extraire la valeur ``valueB`` avec cette règle : ``bloc.metaB``
nl: u zal de waarde ``valueB`` kunnen extraheren met deze regel: ``bloc.metaB``

source: you will be able to extract the value ``5`` with this rule : ``bloc.int``
fr: vous pouvez extraire la valeur ``5`` avec cette règle : ``bloc.int``
nl: u zal de waarde ``5`` kunnen extraheren met deze regel: ``bloc.int``

source: you will be able to extract the value ``sub_value`` with this rule : ``sub.sub_sub``
fr: vous pouvez extraire la valeur ``sub_value`` avec cette règle : ``sub.sub_sub``
nl: u zal de waarde ``sub_value`` kunnen extraheren met deze regel: ``sub.sub_sub``

source: The rule ``bloc`` will extract the JSON object:
fr: La règle ``bloc`` extraira l'objet JSON :
nl: De regel ``bloc`` zal het JSON-voorwerp extraheren:

source: Description
nl: Omschrijving
