Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/extract_url.po
Languages: fr

source: Extract URLs processor
fr: Processeur Extraire les URLs

source: This processor allows to extract URLs from HTML or text content. The Extract URLs processor extracts http and https links into a field, and the links are then separated by a space.
fr: Ce processeur permet d'extraire les URLs du contenu HTML ou texte. Le processeur Extraire les URLs extrait des liens http et https dans un champ, et les liens sont ensuite séparés par une espace.

source: Setting the processor
fr: Configurer le processeur

source: To set the parameters of the Extract URLs processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Extraire les URLs, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire

source: Field
fr: Champ

source: Field which contains the HTML or text content from where to extract the URL
fr: Champ contenant le contenu HTML ou texte à partir duquel extraire l'URL

source: yes
fr: oui

source: Output field
fr: Champ de sortie

source: Field where the extracted value will be displayed. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ dans lequel la valeur extraite sera affichée. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
