Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/extract_bit_range.po
Languages: de, es, fr, nl

source: Extract bit range processor
de: Prozessor "Bitbereich extrahieren"
es: Procesador Extraer rango de bits
fr: Processeur Extraire la plage de bits

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: This processor is not available by default. Please contact OpenDataSoft support team if you want this processor to be activated in your domain.
de: Dieser Prozessor ist standardmäßig nicht verfügbar. Wenden Sie sich an das OpenDataSoft-Supportteam, wenn dieser Prozessor für Ihre Domain aktiviert werden soll.
fr: Ce processeur n'est pas disponible par défaut. Veuillez contacter l'équipe support OpenDataSoft si vous souhaitez l'activer dans votre domaine.

source: This processor extracts an arbitrary bit range from an hexadecimal or binary content, and converts it into one of the following data types: integer, unsigned integer and float.
de: Dieser Prozessor extrahiert einen beliebigen Bitbereich aus einem hexadezimalen oder binären Inhalt und wandelt ihn in einen der folgenden Datentypen um: Ganzzahl, vorzeichenlose Ganzzahl und Gleitkommazahl.
es: Este procesador extrae un rango de bits arbitrario de un contenido hexadecimal o binario y lo convierte en uno de los tipos de datos siguientes: entero, entero sin signo o flotante.
fr: Ce processeur extrait une plage de bits arbitraire depuis un contenu hexadécimal ou binaire et la convertit dans l'un des types de données suivants : entier, entier non signé et non entier.
nl: Deze processor extraheert een willekeurig bitbereik van een hexadecimale of binaire content en converteert deze in een van de volgende datatypes: integer, unsigned integer en float.

source: Example of use: when processing data coming from a network of sensors as sensors often encode their payloads as hexadecimal content.
de: Anwendungsbeispiel: Bei der Verarbeitung von Daten aus einem Netzwerk von Sensoren, da Sensoren ihre Datenmengen häufig als hexadezimalen Inhalt kodieren.
es: Ejemplo de uso: Se puede emplear al procesar datos de una red de sensores, ya que los sensores suelen codificar sus cargas útiles en forma de contenido hexadecimal.
fr: Exemple d'utilisation : pour le traitement de données provenant d'un réseau de sondes, car celles-ci encodent souvent leur charge utile sous la forme de contenu hexadécimal.
nl: Gebruiksvoorbeelden: wanneer data worden verwerkt die afkomstig zijn van een netwerk van sensoren, aangezien sensoren vaak hun payloads coderen als hexadecimale content.

source: Setting the processor
de: Den Prozessor einrichten
es: Establecer el procesador
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Extract bit range processor, follow the indications from the table below.
de: Befolgen Sie die Anweisungen der unteren Tabelle, um die Parameter des Prozessors "Bitbereich extrahieren" einzurichten.
es: Para establecer los parámetros del procesador Extraer rango de bits, siga las indicaciones de esta tabla.
fr: Pour définir les paramètres du processeur Extraire la plage de bits, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Extract bit range processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Label
de: Beschriftung
es: Etiqueta

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Mandatory
de: Obligatorisch
es: Obligatorio
fr: Obligatoire
nl: Verplicht

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
nl: Voorbeeld

source: Field
de: Feld
es: Campo
fr: Champ
nl: Veld

source: Field containing the hexadecimal or binary content
de: Feld, das den hexadezimalen oder binären Inhalt enthält
es: Campo que contiene el contenido hexadecimal o binario.
fr: Champ avec le contenu hexadécimal ou binaire
nl: Een veld dat hexadecimale of binaire content bevat

source: yes
de: ja
es: Sí
fr: oui
nl: ja

source: ``column_a``
de: "Spalte_a"

source: Input type
de: Eingabeart
es: Tipo de entrada
fr: Type d'entrée

source: Type of the content: hexadecimal or binary. If this parameter is not set, the content is considered hexadecimal by default.
de: Art des Inhalts: hexadezimal oder binär. Ist dieser Parameter nicht eingestellt, wird der Inhalt standardmäßig als hexadezimal angesehen.
es: Tipo de contenido: hexadecimal o binario. Si no se establece este parámetro, el contenido se considera hexadecimal de forma predeterminada.
fr: Type du contenu : hexadécimal ou binaire. Si ce paramètre n'est pas défini, le contenu est considéré comme hexadécimal par défaut.
nl: Type content: hexadecimaal of binair. Wanneer deze parameter niet is ingesteld, wordt de content standaard als hexadecimaal beschouwd.

source: no
de: nein
fr: non
nl: nee

source: Either hexadecimal or binary
de: Entweder hexadezimal oder binär
es: Hexadecimal o binario
fr: Hexadécimal ou binaire
nl: Ofwel hexadecimaal ofwel binair

source: Start bit offset
de: Bitversatz starten
es: Offset de bit de inicio
fr: Décalage du bit de départ
nl: Start bit offset op

source: Starting offset corresponding to the position of the first bit. It starts at 0.
de: Der Ausgangsversatz entsprechend der Position des ersten Bits. Die Nummerierung beginnt mit 0.
es: Offset de inicio correspondiente a la posición del primer bit. Empieza por 0.
fr: Décalage de départ correspondant à la position du premier bit. Il commence à 0.
nl: Offset beginnen die overeenstemt met de positie van het eerste bit. Dit begint bij 0.

source: Stop bit offset
de: Bitversatz stoppen
es: Offset de bit de parada
fr: Décalage du bit d'arrêt

source: Ending offset corresponding to the position of the last bit. Must be greater than the starting offset.
de: Der Abschlussversatz entsprechend der Position des letzten Bits. Muss größer als der Ausgangsversatz sein.
es: Offset de finalización correspondiente a la posición del último bit. Debe ser mayor que el offset de inicio.
fr: Décalage d'arrêt correspondant à la position du dernier bit. Il doit être supérieur au décalage de départ.
nl: Offset eindigen die overeenstemt met de positie van de laatste bit. Moet groter zijn dan de beginnende offset.

source: Convert to
de: Umwandeln in
es: Convertir en
fr: Convertir en
nl: Converteer naar

source: Wanted format to output and convert the data
de: Gewünschtes Format zum Ausgeben und Konvertieren der Daten
es: Formato deseado para enviar a la salida y convertir los datos.
fr: Format dans lequel les données doivent être renvoyées et converties
nl: Gewenst formaat om de data te outputten en te converteren

source: Either int (integer), uint (unsigned integer) or float
de: Entweder int (Ganzzahl), Uint (Ganzzahl ohne Vorzeichen) oder float
es: int (entero), uint (entero sin signo) o float (flotante)
fr: Soit int (entier), unint (entier non signé) ou non entier (float)
nl: Ofwel int (integer), uint (unsigned integer) of float

source: Output field
de: Ausgabefeld
es: Campo de salida
fr: Champ de sortie
nl: Outputveld

source: Field where the extracted bit range will be displayed. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
de: Feld, in dem der extrahierte Bitbereich angezeigt wird. Es kann sich um ein vorhandenes Feld handeln, das aus der Liste ausgewählt wird, oder ein neues Feld, das zu diesem Zweck erstellt wurde (in diesem Fall bitte **Eingabetext** aus der Liste wählen und den Namen des neuen Feldes in den unteren Textbereich eingeben).
es: Campo en que se visualizará el rango de bits extraído. Puede ser un campo existente seleccionado de la lista, o un campo nuevo creado con ese fin (en ese caso, elija **Texto de entrada** en la lista y escriba el nombre del campo nuevo en el área de texto que figura a continuación).
fr: Champ dans lequel la plage de bits extraite sera affichée. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
nl: Veld waar het geëxtraheerde bitbereik wordt weergegeven. Dit kan een bestaand veld zijn dat gekozen wordt uit een lijst of een nieuw veld dat speciaal hiervoor werd aangemaakt (kies in dit geval **Invoertekst** uit de lijst en noteer de naam van het nieuwe veld in de tekstruimte eronder).

source: ``result``
de: "Ergebnis"

source: A temperature sensor sends an hexadecimal value.
de: Ein Temperatursensor sendet einen hexadezimalen Wert.
es: Un sensor de temperatura envía un valor hexadecimal.
fr: Une sonde de température envoie une valeur hexadécimale.
nl: Een temperatuursensor stuurt een hexadecimale waarde door.

source: This hexadecimal value (2 bytes) contains: - a decimal value encoded on the 1st byte - the sensor identifier encoded on the first 4 bits of the 2nd byte - a set of flags representing the sensor configuration, encoded on the remaining 4 bits
de: Dieser hexadezimale Wert (2 Bytes) umfasst: - einen auf dem ersten Byte codierten Dezimalwert - die Sensorkennung, die auf den ersten 4 Bits des 2. Bytes codiert ist - eine Reihe Flags, die die Sensorkonfiguration darstellen, und auf den verbleibenden 4 Bits codiert sind
es: Este valor hexadecimal (2 bytes) contiene: - un valor decimal codificado en el primer byte - el identificador de sensor codificado en los 4 primeros bits del segundo byte - un conjunto de marcas en representación de la configuración del sensor, codificado en los 4 bits restantes
fr: Cette valeur hexadécimale (2 octets) comprend : - une valeur décimale encodée sur le 1er octet - l'identifiant de la sonde encodé sur les 4 premiers bits du 2e octet - un ensemble d'indicateurs représentant la configuration de la sonde, encodés sur les 4 bits restants
nl: Deze hexadecimale waarde (2 bytes) bevat: - een decimale waarde gecodeerd op het 1ste bit - de gecodeerde sensor identifier op de eerste 4 bits van de 2de bit - een reeks vlaggen die de sensorconfiguratie vertegenwoordigen, gecodeerd op de resterende 4 bits

source: the first byte '00010110' is the temperature in degrees
de: Das erste Byte "00010110" ist die Temperatur in Grad
es: El primer byte '00010110' es la temperatura en grados.
fr: le premier octet '00010110' correspond à la température en degrés
nl: de eerste bit "00010110" is de temperatuur in graden

source: the next 4 bits '0100' is the sensor identifier
de: Die nächsten 4 Bits "0100" sind die Sensorkennung
es: Los 4 bits '0100' siguientes son el identificador de sensor.
fr: les 4 bits suivants '0100' correspondent à l'identifiant de la sonde
nl: de volgende 4 bits "0100" is de sensor identifier

source: the next 4 bits '1001' is the sensor configuration, but we only want the first bit
de: Die nächsten 4 Bits "1001" sind die Sensorkonfiguration, aber uns interessiert nur das erste Bit
es: Los 4 bits '1001' siguientes son la configuración del sensor, pero solo queremos el primer bit.
fr: les 4 bits suivants '1001' correspondent à la configuration de la sonde, mais nous souhaitons uniquement le premier bit
nl: de volgende 4 bits "1001" is de sensorconfiguratie, maar we willen enkel de eerste bit

source: Therefore, the processing pipeline will contains 3 Extract bit range processors
de: Die Verarbeitungspipeline enthält zu diesem Zweck 3 Prozessoren des Typs "Bitbereich extrahieren"
es: En consecuencia, la canalización de procesamiento contendrá 3 procesadores Extraer rango de bits.
fr: Par conséquent, le pipeline de traitement comprendra 3 processeurs Extraire la plage de bits
nl: Daarom zal de verwerkingspijplijn 3 Extract bit range processors bevatten

source: one Extract bit range from 0 to 8 to convert into signed integer (int) -> int_temperature
de: einen "Bitbereich extrahieren" von 0 bis 8 zur Umwandlung in eine Ganzzahl mit Vorzeichen (int) -> int_temperature
es: 1 procesador Extraer rango de bits de 0 a 8 para convertir en entero con signo (int) -> int_temperature
fr: un processeur Extraire la plage de bits de 0 à 8 pour convertir en entier signé (int) -> int_temperature
nl: één Extract bit range van 0 tot 8 om te converteren in signed integer (int) -> int_temperature

source: one Extract bit range from 8 to 12 to convert into unsigned integer (uint) -> sensor_identifier
de: einen "Bitbereich extrahieren" von 8 bis 12 zur Umwandlung in eine vorzeichenlose Ganzzahl (uint) -> sensor_identifier
es: 1 procesador Extraer rango de bits de 8 a 12 para convertir en entero sin signo (uint) -> sensor_identifier
fr: un processeur Extraire la plage de bits de 8 à 12 pour convertir en entier non signé (unint) -> sensor_identifier
nl: één Extract bit range van 8 tot 12 om te converteren in unsigned integer (uint) -> sensor_identifier

source: one Extract bit range from 12 to 13 to convert into unsigned integer, 0 meaning "Not OK" and 1 meaning "OK" (uint) -> status
de: einen "Bitbereich extrahieren" von 12 bis 13 zur Umwandlung in eine vorzeichenlose Ganzzahl, wobei 0 "Not OK" bedeutet und 1 "OK" (uint) -> status
es: 1 procesador Extraer rango de bits de 12 a 13 para convertir en entero sin signo, en que 0 significa "Not OK" y 1 significa "OK" (uint) -> status
fr: un processeur Extraire la plage de bits de 12 à 13 pour convertir en entier non signé (unint) -> status avec 0 correspondant à "Not OK" et 1 correspondant à "OK"
nl: één Extract bit range van 12 tot 13 om te converteren in unsigned integer, waarbij 0 "Niet OK" betekent en 1 "OK" betekent (uint) -> status

source: Extract bit range 1
de: Bitbereich extrahieren 1
es: Extraer rango de bits 1
fr: Extraire la plage de bits 1

source: Extract bit range 2
de: Bitbereich extrahieren 2
es: Extraer rango de bits 2
fr: Extraire la plage de bits 2

source: Extract bit range 3
de: Bitbereich extrahieren 3
es: Extraer rango de bits 3
fr: Extraire la plage de bits 3

source: Final result:
de: Endergebnis:
es: Resultado final:
fr: Résultat final :
nl: Eindresultaat:

source: This processor is not available by default. Please contact Opendatasoft support team if you want this processor to be activated in your domain.
es: De forma predeterminada, este procesador no está disponible. Póngase en contacto con el equipo de soporte de Opendatasoft si desea activar este procesador en su dominio.
nl: Deze processor is standaard niet beschikbaar. Gelieve contact op te nemen met het support team van Opendatasoft indien u wenst dat deze processor op uw domein wordt geactiveerd.
