Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/extract_text.po
Languages: fr, nl

source: Extract Text processor
fr: Processeur Extraire du Texte

source: This processor allows to extract any part of a text, a number or a combination of both into a new column. It's similar to the Replace via Regexp processor, except that instead of replacing the content in the same original column, a new column is created with the extracted text. The idea is indeed to put the part to extract in parentheses. This part will then be extracted in a new column.
fr: Ce processeur permet d'extraire une partie d'un texte, d'un nombre ou d'une combinaison des deux dans une nouvelle colonne. Il est identique au processeur Remplacer via Expression Régulière, mais au lieu de remplacer le contenu dans la même colonne d'origine, une colonne est créée avec le texte extrait. L'idée consiste en fait à placer la partie à extraire entre parenthèses. Cette partie sera ensuite extraite dans une nouvelle colonne.
nl: Deze processor laat toe om enig deel van een tekst, een getal of een combinatie van beide te extraheren in een nieuwe kolom. Hij is vergelijkbaar met de Replace via Regexp processor, behalve dat in plaats van de content in dezelfde oorspronkelijke kolom te vervangen, er een nieuwe kolom wordt aangemaakt met de geëxtraheerde tekst. De idee is inderdaad om het deel dat moet worden geëxtraheerd tussen haakjes te plaatsen. Vervolgens zal dit deel worden geëxtraheerd in een nieuwe kolom.

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Extract Text processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Extraire du Texte, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de ExtractText processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Mandatory
fr: Obligatoire
nl: Verplicht

source: Field
fr: Champ
nl: Veld

source: Field which contains the value(s) to extract
fr: Champ contenant les valeurs à extraire
nl: Veld dat de waarde(n) bevat die moet(en) worden geëxtraheerd

source: yes
fr: oui
nl: ja

source: Regular expression
fr: Expression régulière
nl: Regelmatige uitdrukking

source: Regular expression to determine which part of the values will be extracted. See `<http://en.wikipedia.org/wiki/Regular_expression>`_ for more details on how to write a regular expressions. It is also possible to test regular expressions with an online debugger tool like `Regex101 <https://regex101.com/>`_.
fr: Expression régulière permettant de déterminer la partie des valeurs qui sera extraite. Consultez `<http://en.wikipedia.org/wiki/Regular_expression>`_ pour plus d'informations sur l'utilisation des expressions régulières. Vous pouvez également tester les expressions régulières avec un débogueur en ligne comme `Regex101 <https://regex101.com/>`_.
nl: Regelmatige uitdrukking om te bepalen welk deel van de waarden zal worden geëxtraheerd. Zie `<http://en.wikipedia.org/wiki/Regular_expression>`_ voor meer informatie over hoe u een regelmatige uitdrukking kunt schrijven. Het is ook mogelijk om regelmatige uitdrukkingen te testen met een online debugger tool, zoals `Regex101 <https://regex101.com/>`_.

source: Example
fr: Exemple
nl: Voorbeeld

source: Using the same example as for the Replace via Regexp processor (from a French zip code like 44100, keep only the area code 44), the Extract Text processor can be used to create another column with the area code selected, instead of replacing the content like with the Replace via Regexp processor.
fr: En utilisant le même exemple que le processeur Remplacer via Expression Régulière (à partir d'un code postal français tel que 44100, gardez uniquement le code de département 44), le processeur Extraire du Texte peut être utilisé pour créer une colonne avec le code du département sélectionné au lieu de remplacer le contenu comme avec le processeur Remplacer via Expression Régulière.
nl: Wanneer we hetzelfde voorbeeld gebruiken als voor de Replace via Regexp processor (uit een Franse postcode zoals 44100 behouden we enkel de regiocode 44), kan de Extract Text processor gebruikt worden om een andere kolom aan te maken met de geselecteerde regiocode in plaats van de content te vervangen, zoals bij de Replace via Regexp processor.

source: In this example, we use the pattern ``(?P<area>[0-9]{2})[0-9]{3}``. ``[0-9]`` means any digit, and ``{2}`` or ``{3}`` means the number of digits we are looking for. In this case we want to extract the first two digits, so we put them in parenthesis, then after the parenthesis we put the rest of the sequence that we don't want to extract, here the remaining 3 digits. The special expression ``?P<area>`` is just for specifying the new column name
fr: Dans cet exemple, nous utilisons la chaine ``(?P<area>[0-9]{2})[0-9]{3}``. ``[0-9]`` signifie n'importe quel numéro et ``{2}`` ou ``{3}`` signifient le nombre de numéro recherchés. Dans ce cas, nous voulons extraire les deux premiers numéros, nous utilisons donc les parenthèses; après les parenthèses, nous plaçons le reste de la chaîne que nous ne voulons pas écrire, ici les 3 numéros restants. L'expression spéciale ``?P<area>`` permet de spécifier le nom de la nouvelle colonne.

source: From a more technical point of view, this processor can be used to extract an arbitrary pattern expressed as a regular expression out of a string using sub matching.
fr: D'un point de vue technique, ce processeur peut être utilisé pour extraire un certain motif exprimé sous forme d'expression régulière depuis une chaîne de caractères en utilisant la correspondance.
nl: Vanuit een meer technisch oogpunt, kan de processor gebruikt worden om een willekeurig uitgedrukt patroon te extraheren als een regelmatige uitdrukking uit een string door gebruik te maken van sub matching.

source: The syntax of the sub-matching expression to specify is the following: ``(?P<NAME>REGEXP)``. Where:
fr: La syntaxe de l'expression d'extraction est la suivante: ``(?P<NOM>REGEXP)``. Où :
nl: De syntax van de sub-matching uitdrukking die moet worden gespecificeerd, is de volgende: ``(?P<NAME>REGEXP)``. Waarbij:

source: ``NAME`` is the name of a new field which will receive the result of the extraction. This field name can only contain letters, numbers and underscores (special characters like accentuated letters or commas are not allowed).
fr: ``NOM`` est le nom d’un nouveau champ qui recevra le résultat de l’extraction. Ce nom ne peut contenir que des lettres, des chiffres et des underscore (``_``). Les caractères spéciaux tels que les lettres accentuées ou les virgules ne sont pas autorisés.
nl: ``NAME`` de naam is van een nieuw veld waarin het resultaat van de extractie zal worden geplaatst. Deze veldnaam kan enkel letters, cijfers en laag liggende streepjes (speciale karakters, zoals letters met accenten of komma's zijn niet toegelaten).

source: ``REXGEXP`` is the submatch expression
fr: ``REGEXP`` est l'expression servant à l'extraction.
nl: ``REXGEXP`` de sub-match uitdrukking is

source: For example, let's assume that you want to extract a street name out of an address. That is, for the address
fr: Par exemple, supposons que vous voudriez extraire le nom de rue depuis une adresse. C'est à dire, pour l'adresse
nl: Bijvoorbeeld: veronderstel dat u een straatnaam uit een adres wil extraheren. Dat wil zeggen, voor het adres

source: you might want to extract the value ``Pennsylvania Ave NW`` in a field ``street_name``.
fr: vous voudriez extraire la valeur ``Pennsylvania Ave NW`` dans un champ ``street_name``.
nl: wil u mogelijk de waarde ``Pennsylvania Ave NW`` extraheren in een veld ``street_name``.

source: You would have to write the following expression:
fr: Vous devriez écrire l'expression suivante :
nl: U zou de volgende uitdrukking moeten schrijven:

source: And if you want to extract the street number in a field ``street_number``, simply extend the previous expression:
fr: Et si vous souhaitiez extraire le numéro depuis un champ ``street_number``, il suffirait d'étendre l'expression précédente :
nl: En indien u het straatnummer wil extraheren in een veld ``street_number``, breidt de vorige uitdrukking dan gewoon uit:

source: Description
nl: Omschrijving
