Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/file.po
Languages: fr

source: File processor
fr: Processeur Fichier

source: This processor allows to retrieve images from URLs.
fr: Ce processeur permet de récupérer des images d'URL.

source: This processor is usually used after :doc:`creating a dataset with images</publishing_data/01_creating_a_dataset/creating_dataset_with_images>`, when these images are sourced via a URL (e.g. images stored in a remote server).
fr: Ce processeur est généralement utilisé après la :doc:`création d'un jeu de données avec des images</publishing_data/01_creating_a_dataset/creating_dataset_with_images>`, quand celles-ci proviennent d'une URL (par ex. des images stockées sur un serveur distant).

source: Setting the processor
fr: Configurer le processeur

source: To set the parameters of the File processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Fichier, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire

source: Default value
fr: Valeur par défaut

source: Field
fr: Champ

source: Field containing the URL of the dataset's images
fr: Champ contenant l'URL des images du jeu de données

source: yes
fr: oui

source: Extract metadata
fr: Extraire des métadonnées

source: If checked: the images' EXIF metadata are extracted and added to the dataset
fr: Si la case de cette option est cochée : les métadonnées EXIF des images sont extraites et ajoutées au jeu de données

source: no
fr: non
