Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/geo_distance.po
Languages: fr

source: Compute geo distance processor
fr: Processeur Calculer la distance géographique

source: This processor computes the distance between 2 coordinates. The computed distance is in kilometers.
fr: Ce processeur calcule la distance entre 2 coordonnées. La distance calculée est exprimée en kilomètres.

source: Setting the processor
fr: Configurer le processeur

source: To set the parameters of the Compute geo distance processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Calculer la distance géographique, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire

source: Coordinates A
fr: Coordonnée A

source: Field containing the one of the 2 required coordinates
fr: Champ contenant l'une des 2 coordonnées requises

source: yes
fr: oui

source: Coordinates B
fr: Coordonnée B

source: Field containing the second of the 2 required coordinates
fr: Champ contenant la deuxième coordonnée requise

source: Output field
fr: Champ de sortie

source: Field that will contain the computed distance. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ qui contiendra la distance calculée. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
