Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/geocode_with_google.po
Languages: es, it

source: Geocode with Google processor
es: Procesador Geocodificar con Google
it: Processore Geocodifica con Google

source: Important
es: Importante

source: This processor is not available by default. Please contact OpenDataSoft support team if you want this processor to be activated in your domain.
es: De forma predeterminada, este procesador no está disponible. Póngase en contacto con el equipo de soporte de OpenDataSoft si desea activar este procesador en su dominio.

source: This processor allows you to geocode full text addresses by using the Google geocoding API.
es: Este procesador permite geocodificar las direcciones de texto completo mediante la API de geocodificación de Google.
it: Questo processore permette di eseguire la geocodifica degli indirizzi full-text mediante l'API di geocodifica Google.

source: This processor requires a Google API key.
es: Este procesador requiere una clave de API de Google.
it: Questo processore richiede una chiave API Google.

source: Setting the API key
es: Definir la clave de API
it: Configurazione della chiave API

source: To setup a Google API key in order to use this processor:
es: Para configurar una clave de API de Google para utilizar este procesador:
it: Per configurare una chiave API Google e utilizzare questo processore:

source: Leave the Catalog tab and click on the Configuration tab in the backoffice menu.
es: Salga de la ficha Catálogo y haga clic en la ficha Configuración del menú del back office.
it: Esci dalla scheda Catalogo e clicca sulla scheda Configurazione nel menu di back-office.

source: Click on the **Data processing** tab of the Configuration menu.
es: Haga clic en la ficha **Procesamiento de datos** del menú Configuración.
it: Clicca sulla scheda **Elaborazione dei dati** del menu Configurazione.

source: In the **Google geocoding API** section, fill in the following parameters: API key, Business Client ID and Private key.
es: En la sección **API de geocodificación de Google**, especifique los parámetros siguientes: Clave de API, ID de cliente de empresa y Clave privada.
it: Nella sezione **API di geocodifica Google**, compila i seguenti parametri: Chiave API, ID client business e Chiave privata.

source: Click on the **Save** button at the top of the page.
es: Haga clic en el botón **Guardar** en la parte superior de la página.
it: Clicca sul pulsante **Salva** all'inizio della pagina.

source: Setting the processor
es: Establecer el procesador
it: Configurazione del processore

source: After setting the Google API key in the platform, the Geocode with Google processor is ready to be used.
es: Tras definir la clave de API de Google en la plataforma, el procesador Geocodificar con Google está listo para su uso.
it: Dopo aver configurato la chiave API Google nella piattaforma, il processore Geocodifica con Google è pronto all'uso.

source: To set the parameters of the Geocode with Google processor, follow the indications from the table below.
es: Para establecer los parámetros del procesador Geocodificar con Google, siga las indicaciones de esta tabla.
it: Per configurare i parametri del processore Geocodifica con Google, procedi come descritto nella tabella sottostante.

source: Label
es: Etiqueta
it: Etichetta

source: Description
es: Descripción
it: Descrizione

source: Mandatory
es: Obligatorio
it: Obbligatorio

source: Address
es: Dirección
it: Indirizzo

source: Field containing the address to geocode
es: Campo que contiene la dirección para geocodificar.
it: Campo contenente l'indirizzo di cui eseguire la geocodifica

source: yes
es: Sí
it: sì

source: Postal code
es: Código postal
it: Codice postale

source: Field containing the postal code
es: Campo que contiene el código postal.
it: Campo contenente il codice postale

source: City
es: Ciudad
it: Città

source: Field containing the city
es: Campo que contiene la ciudad.
it: Campo contenente la città

source: State
es: Estado
it: Stato

source: Field containing the state
es: Campo que contiene el estado.
it: Campo contenente lo stato

source: Country
es: País
it: Paese

source: Field containing the country
es: Campo que contiene el país.
it: Campo contenente il paese

source: Output field
es: Campo de salida
it: Campo di output

source: Field that will contain the produced WSG84 coordinates. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
es: Campo que contendrá las coordenadas WGS84 producidas. Puede ser un campo existente seleccionado de la lista, o un campo nuevo creado con ese fin (en ese caso, elija **Texto de entrada** en la lista y escriba el nombre del campo nuevo en el área de texto que figura a continuación).
it: Campo che conterrà le coordinate WSG84 ottenute. Può essere un campo esistente all'interno dell'elenco o un nuovo campo creato appositamente allo scopo. In tal caso, seleziona **Inserisci testo** nell'elenco e digita il nome del nuovo campo nell'area di testo sottostante.
