Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/geocode_with_arcgis.po
Languages: fr, nl

source: Geocode with ArcGIS processor
fr: Processeur Géocoder avec ArcGIS

source: This processor allows to geocode full text addresses by using the ArcGIS geocoding API.
fr: Ce processeur vous permet de géocoder des adresses en format texte en utilisant l'API de géolocalisation ArcGIS.
nl: Deze processor laat u toe de geografische code te bepalen van adressen die volledig uit tekst bestaan door de ArcGIS geocoding API te gebruiken.

source: This processor can be connected with a custom ArcGIS geocoder. Please contact Opendatasoft support team if you want this configuration to be activated in your domain.
fr: Ce processeur peut être connecté avec un géocodeur ArcGIS personnalisé. Veuillez contacter l'équipe support Opendatasoft si vous souhaitez l'activer dans votre domaine.
nl: Deze processor kan gekoppeld worden aan een gepersonaliseerde ArcGIS-geocoder. Gelieve contact op te nemen met het support team van Opendatasoft wanneer u wil dat deze configuratie geactiveerd wordt in uw domein.

source: Prerequisites
fr: Prérequis
nl: Voorvereisten

source: Make sure you have an ArcGIS paying account.
fr: Vérifiez que vous avez un compte ArcGIS payant.
nl: Zorg ervoor dat u een ArcGIS-betaalrekening hebt.

source: Register an application in your ArcGIS developer dashboard.
fr: Enregistrez une application dans votre tableau de bord de développement ArcGIS.
nl: Registreer een app in uw ArcGIS ontwikkelaarsdashboard.

source: Retrieve the authorization credentials (``client ID`` and ``client secret``) for the registered application from your ArcGIS account.
fr: Récupérez les identifiants d'autorisation (``ID client`` et ``mot de passe client``) pour l'application enregistrée dans votre compte ArcGIS.
nl: Haal de autorisatiegegevens (``client ID`` en ``client secret``) op voor de geregistreerde app uit uw ArcGIS-account.

source: Configuring the Client ID and Client Secret
fr: Configurer l'ID client et le mode de passe client
nl: Het Client ID en Client Secret configureren

source: Before using the processor, configure the ArcGIS geocoding API with the Client ID and Client Secret you obtained in your ArcGIS developer dashboard.
fr: Avant d'utiliser le processeur, configurez l'API de géocodage ArcGIS avec l'ID client et le mot de passe client que vous avez obtenus dans votre tableau de bord de développement ArcGIS.
nl: Alvorens de processor te gebruiken, configureer de ArcGIS geocoding API met het Client ID en Client Secret dat u gekregen hebt in uw ArcGIS ontwikkelaarsdashboard.

source: In the back office, go to **Configuration** > **Data processing**.
fr: Dans l'interface d'administration, accédez à **Configuration** > **Traitement de données**.
nl: Ga in de back office naar **Configuratie** > **Gegevensverwerking**.

source: In the **ArcGIS geocoding API** section, enter your Client ID and Client Secret in the corresponding fields.
fr: Dans la section **API de géocodage ArcGIS**, entrez votre ID de client et mot de passe de client dans les champs correspondants.
nl: Voer in de rubriek **ArcGIS geocoding API** uw Client ID en Client Secret in in de overeenkomstige velden.

source: Click on the **Save** button at the top of the page.
fr: Cliquez sur le bouton **Enregistrer** en haut de la page.
nl: Klik op de knop **Opslaan** bovenaan de pagina.

source: You can now use the Geocode with ArcGIS processor.
fr: Vous pouvez désormais utiliser le processeur Géocoder avec ArcGIS.
nl: U kan nu de Geocode gebruiken met ArcGIS-processor.

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: After setting the ArcGIS API key in the platform, the Geocode with ArcGIS processor is ready to be used.
fr: Après avoir défini la clé d'API ArcGIS dans la plateforme, le processeur Géocoder avec ArcGIS peut être utilisé.
nl: Nadat u de ArcGIS API-sleutel in het platform heeft ingesteld, is de Geocode with ArcGIS processor klaar voor gebruik.

source: To set the parameters of the Geocode with ArcGIS processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Géocoder avec ArcGIS, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Geocode with ArcGIS processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Mandatory
fr: Obligatoire
nl: Verplicht

source: Address
fr: Adresse
nl: Adres

source: Field containing the address to geocode
fr: Champ contenant l'adresse à géocoder
nl: Veld waarin het adres van de geografische code staat

source: yes
fr: oui
nl: ja

source: Postal code
fr: Code postal
nl: Postcode

source: Field containing the postal code
fr: Champ contenant le code postal
nl: Veld waarin de postcode staat

source: no
fr: non
nl: nee

source: City
fr: Ville
nl: Stad

source: Field containing the city
fr: Champ contenant la ville
nl: Veld waarin de naam van de stad staat

source: State
fr: Département
nl: Staat

source: Field containing the state
fr: Champ contenant le département
nl: Veld waarin de naam van de staat staat

source: Country
fr: Pays

source: Field containing the country
fr: Champ contenant le pays
nl: Veld waarin de naam van het land staat

source: Output field
fr: Champ de sortie
nl: Outputveld

source: Field that will contain the produced WSG84 coordinates.
fr: Champ qui contiendra les coordonnées WSG84 générées.
nl: Veld waarin de geproduceerde WSG84-co√∂rdinaten zullen staan.

source: You can select an existing field from the list or create a new field create for that purpose.
fr: Vous pouvez sélectionner un champ existant dans la liste ou en créer un à cette fin.
nl: U kan een bestaand veld uit de lijst selecteren of hiervoor een nieuw veld aanmaken.

source: To create a new field, select **Input text** from the list and enter the name of the new field.
fr: Pour créer un champ, sélectionnez **Saisir du texte** dans la liste et entrez le nom du nouveau champ.
nl: Om een nieuw veld aan te maken, selecteer **Input tekst** uit de lijst en voer de naam van het nieuwe veld in.

source: Description
nl: Omschrijving
