Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/geohash_to_geojson.po
Languages: fr

source: GeoHash to GeoJSON processor
fr: Processeur GeoHash en GeoJSON

source: This processor is not available by default. Please contact Opendatasoft support team if you want this processor to be activated in your domain.
fr: Ce processeur n'est pas disponible par défaut. Veuillez contacter l'équipe support Opendatasoft si vous souhaitez l'activer dans votre domaine.

source: This processor converts geohashes (short strings of letters and digits encoding a geographical location) into a GeoJSON object.
fr: Ce processeur convertit les geohash (courtes chaînes de lettres et de chiffres encodant un emplacement géographique) en un objet GeoJSON.

source: Setting the processor
fr: Configurer le processeur

source: To set the parameters of the GeoHash to GeoJSON processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur GeoHash en GeoJSON, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire

source: Geohash field
fr: Champ GeoHash

source: Field that contain the geohashes
fr: Champ contenant les geohash

source: yes
fr: oui

source: Output field
fr: Champ de sortie

source: Field that will contain the GeoJSON object. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ qui contiendra l'objet GeoJSON. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
