Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/geomasking.po
Languages: fr, nl

source: Geomasking processor
fr: Processeur Masquage géographique

source: This processor provides privacy protection by approximating a geographical location within a specific radius.
fr: Ce processeur offre une protection de la vie privée en indiquant la position approximative d'un lieu géographique dans un rayon donné.
nl: Deze processor biedt privacybescherming door een geografische locatie te benaderen binnen een welbepaalde radius.

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Geomasking processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Masquage géographique, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Geomasking processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Mandatory
fr: Obligatoire
nl: Verplicht

source: Default value
fr: Valeur par défaut
nl: Standaard waarde

source: Field
fr: Champ
nl: Veld

source: Field containing the coordinates to approximate
fr: Champ contenant les coordonnées à transformer en position approximative
nl: Veld dat de co√∂rdinaten bevat die moeten worden benaderd

source: yes
fr: oui
nl: ja

source: Minimum distance (in meters)
fr: Distance minimale (en mètres)
nl: Minimale afstand (in meter)

source: Minimum level for the displacement of the geopoint
fr: Niveau minimum pour le déplacement du point géo
nl: Minimumniveau voor het verplaatsen van het geografisch punt

source: no
fr: non
nl: nee

source: Maximum distance (in meters)
fr: Distance maximale (en mètres)
nl: Maximale afstand (in meter)

source: Maximum level for the displacement of the geopoint
fr: Niveau maximum pour le déplacement du point géo
nl: Maximumniveau voor het vervangen van het geografisch punt

source: Description
nl: Omschrijving
