Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/get_coordinates_from_3_word_address.po
Languages: fr

source: Get coordinates from a 3 word address processor
fr: Processeur Récupérer les coordonnées d'une adresse 3 mots

source: This processor is not available by default. Please contact Opendatasoft support team if you want this processor to be activated in your domain.
fr: Ce processeur n'est pas disponible par défaut. Veuillez contacter l'équipe support Opendatasoft si vous souhaitez l'activer dans votre domaine.

source: This processor converts a 3 word address into geographical coordinates.
fr: Ce processeur convertit une adresse 3 mots en coordonnées géographiques.

source: This processor requires a `what3words <https://what3words.com/>`_ API key.
fr: Une clé d'API `what3words <https://what3words.com/>`_ est nécessaire pour utiliser ce processeur.

source: Setting the API key
fr: Définir la clé d'API

source: To setup a what3words key in order to use this processor:
fr: Pour paramétrer une clé d'API what3words afin d'utiliser ce processeur :

source: Leave the Catalog tab and click on the Configuration tab in the backoffice menu.
fr: Quittez l'onglet Catalogue et cliquez sur l'onglet Configuration dans le menu de backoffice.

source: Click on the **Data processing** tab of the Configuration menu.
fr: Cliquez sur l'onglet **Traitement de données** dans le menu Configuration.

source: In the **what3words API** section, fill in the API key parameter.
fr: Dans la section **API what3words**, renseignez les paramètres de la clé d'API.

source: Click on the **Save** button at the top of the page.
fr: Cliquez sur le bouton **Sauvegarder** en haut de la page.

source: Setting the processor
fr: Configurer le processeur

source: To set the parameters of the Get coordinates from a 3 word address processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Récupérer les coordonnées d'une adresse 3 mots, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire

source: 3 word address
fr: adresse 3 mots

source: Field containing the 3 word address
fr: Champ contenant l'adresse 3 mots

source: yes
fr: oui

source: Output field
fr: Champ de sortie

source: Field that will contain the resulting geographical coordinates. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ qui contiendra les coordonnées géographiques générées. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).

source: no
fr: non
