Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/join_dataset.po
Languages: de, es, fr, it, nl

source: Join datasets processor
de: Prozessor "Datensätze verbinden"
es: Procesador Unir conjuntos de datos
fr: Processeur Joindre des jeux de données

source: This processor allows to join 2 datasets together. However, these 2 datasets must have a common field to be joined.
de: Dieser Prozessor ermöglicht es, zwei Datensätze zu verbinden. Beide Datensätze müssen jedoch ein gemeinsames Feld haben, damit sie verbunden werden können.
es: Este procesador permite unir 2 conjuntos de datos. Sin embargo, para poder unirse, estos 2 conjuntos de datos deben tener un campo en común.
fr: Ce processeur vous permet de joindre 2 jeux de données. Toutefois, ces 2 jeux de données doivent avoir un champ commun à joindre.
it: Questo processore permette di unire due dataset. Per poter essere uniti, i due dataset devono necessariamente avere un campo comune.
nl: Deze processor laat u toe om 2 datasets samen te voegen. Deze 2 datasets moeten wel gemeenschappelijke velden hebben die moeten worden samengevoegd.

source: Example: a dataset A could be enriched with more data, which are in a dataset B. If datasets A and B have one field in common, it is possible to join these datasets together, in order to retrieve a field from dataset B et add it to dataset A.
de: Beispiel: ein Datensatz A kann mit Daten angereichert werden, die sich in einem Datensatz B befinden. Wenn die Datensätze A und B ein gemeinsames Feld haben, können diese Datensätze zusammengefügt werden, um ein Feld von Datensatz B in Datensatz A zu übertragen.
es: Ejemplo: Se quiere enriquecer un conjunto de datos A con más datos, que están en un conjunto de datos B. Si los conjuntos de datos A y B tienen un campo en común, ambos conjuntos de datos se pueden unir a fin de recuperar un campo del conjunto de datos B y añadirlo al conjunto de datos A.
fr: Par exemple : un jeu de données A peut être enrichi avec d'autres données qui se trouvent dans un jeu de données B. Si les jeux de données A et B ont un champ en commun, il est possible de joindre ces jeux de données, afin de récupérer un champ du jeu de données B et de l'ajouter au jeu de données A.
it: Esempio: il dataset A potrebbe essere arricchito con altri dati, contenuti nel dataset B. Se i dataset A e B hanno un campo in comune, è possibile unirli, in modo da recuperare un campo dal dataset B e aggiungerlo al dataset A.
nl: Voorbeeld: er kunnen meer data, die in een dataset B staan, in een dataset A worden geplaatst. Wanneer datasets A en B één gemeenschappelijk veld hebben is het mogelijk om deze datasets samen te voegen om zo een veld op te halen uit dataset B en het toe te voegen aan dataset A.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: By default, the Join dataset processor can only be used with remote datasets that have fewer than 100,000 records. In addition to that, when applying a join dataset processor to a scheduled dataset, the join is only reapplied when the resource has changed. This means that given a scheduled dataset A, that has a join dataset processor that pulls values from dataset B, if there are new values in dataset B but the resources of dataset A haven't changed, the scheduled processing will not pull the new values from B.
de: Der Prozessor "Datensätze verbinden" kann standardmäßig nur mit Remote-Datensätzen mit weniger als 100.000 Einträgen verwendet werden. Wenn ein Prozessor "Datensätze verbinden" zusätzlich für einen geplanten Datensatz eingesetzt wird, so wird die Verbindung erst dann angewendet, wenn sich die Ressource geändert hat. Nehmen wir das Beispiel, dass ein Prozessor "Datensätze verbinden" für einen geplanten Datensatz A Werte aus einem Datensatz B abruft. Befinden sich jetzt neue Werte im Datensatz B und haben sich die Ressourcen von Datensatz A nicht geändert, ruft die geplante Verarbeitung keine neuen Werte aus Datensatz B ab.
es: De forma predeterminada, el procesador Unir conjunto de datos solo se puede utilizar con conjuntos de datos remotos que tengan menos de 100.000 registros. Además, al aplicar un procesador Unir conjunto de datos a un conjunto de datos planificado, la unión solo se vuelve a aplicar cuando el recurso ha cambiado. Esto significa que, dado un conjunto de datos planificado A, que tiene un procesador Unir conjunto de datos que extrae valores del conjunto de datos B, si hay valores nuevos en el conjunto de datos B pero los recursos del conjunto de datos A no han cambiado, el procesamiento planificado no extraerá los valores nuevos de B.
fr: Par défaut, le processeur Joindre deux jeux de données ne peut être utilisé qu'avec des jeux de données distants de moins de 100 000 enregistrements. En outre, lors de l'application d'un processeur Joindre deux jeux de données à un jeu de données planifié, la jointure n'est réappliquée que lorsque la ressource a été modifiée. Cela signifie que, étant donné un ensemble de données planifiées A, ayant un processeur de jeu de données joint qui tire des valeurs du jeu de données B, s'il y a de nouvelles valeurs dans le jeu de données B mais que les ressources du jeu de données A n'ont pas changé, le traitement planifié ne récupèrera pas les nouvelles valeurs de B.
it: Per impostazione predefinita, il processore Unisci dataset è utilizzabile solo con dataset remoti contenenti meno di 100.000 record. Quando si applica un processore Unisci dataset a un dataset pianificato, inoltre, l'unione viene riapplicata solo quando la risorsa viene modificata. Ciò significa che, dato un dataset pianificato A con un processore Unisci dataset che estrae i valori dal dataset B, se quest'ultimo contiene nuovi valori ma le risorse del dataset A non sono cambiate, l'elaborazione pianificata non estrarrà i nuovi valori da B.
nl: Standaard kan de Join Dataset-processor enkel worden gebruikt met datasets op afstand die minder dan 100.000 records hebben. Daarnaast, wanneer een Join Dataset-processor wordt toegepast op een geplande dataset, wordt de join enkel opnieuw toegepast wanneer de bron is gewijzigd. Dit betekent dat, gelet op een geplande dataset A die een Join Dataset-processor heeft die waarden haalt uit dataset B, wanneer er nieuwe waarden zijn in dataset B maar de bronnen van dataset A zijn niet gewijzigd, de geplande verwerking de nieuwe waarden uit B niet zal ophalen.

source: Setting the processor
de: Den Prozessor einrichten
es: Establecer el procesador
fr: Configurer le processeur
it: Configurazione del processore
nl: De processor instellen

source: To set the parameters of the Join datasets processor, follow the indications from the table below.
de: Befolgen Sie die Anweisungen der unteren Tabelle, um die Parameter des Prozessors "Datensätze verbinden" einzurichten.
es: Para establecer los parámetros del procesador Unir conjuntos de datos, siga las indicaciones de esta tabla.
fr: Pour définir les paramètres du processeur Joindre des jeux de données, suivez les indications du tableau ci-dessous.
nl: Volg de aanwijzingen in onderstaande tabel om de parameters van de Join datasets-processor in te stellen.

source: Label
de: Beschriftung
es: Etiqueta
it: Etichetta

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Mandatory
de: Obligatorisch
es: Obligatorio
fr: Obligatoire
it: Obbligatorio
nl: Verplicht

source: Dataset
de: Datensatz
es: Conjunto de datos
fr: Jeu de données

source: Dataset used for the join. It can be selected from the portal's datasets or from Opendatasoft's network.
de: Datensatz, der für die Verbindung verwendet wird; dieser kann aus den Datensätzen des Portals oder dem Netzwerk von Opendatasoft ausgewählt werden.
es: Conjunto de datos utilizado para la unión. Puede seleccionarse de los conjuntos de datos del portal o de la red de Opendatasoft.
fr: Le jeu de données utilisé pour la jointure. Il peut être sélectionné depuis les jeux de données du portail ou du réseau Opendatasoft.
nl: Dataset die gebruikt wordt voor de toevoeging. Deze kan worden geselecteerd uit de datasets van het portaal of uit het netwerk van Opendatasoft.

source: yes
de: ja
es: Sí
fr: oui
it: sì
nl: ja

source: Local Key
de: Lokaler Schlüssel
es: Clave local
fr: Clé locale
it: Chiave locale

source: Local field that will be used to identify the corresponding records in the remote dataset. More than one key can be specified.
de: Lokales Feld, mit dem die entsprechenden Einträge im Remote-Datensatz identifiziert werden sollen. Es kann mehr als ein Schlüssel angegeben werden.
es: Campo local que se usará para identificar los registros correspondientes en el conjunto de datos remoto. Se puede especificar más de una clave.
fr: Le champ local qui sera utilisé pour identifier les enregistrements correspondants dans le jeu de données distant. Il est possible de spécifier plus d'une clé.
it: Campo locale che verrà utilizzato per identificare i record corrispondenti nel dataset remoto. È possibile specificare più di una chiave.
nl: Lokaal veld dat gebruikt wordt om de overeenstemmende records in de dataset op afstand te identificeren. Er kan meer dan één sleutel worden gespecificeerd.

source: Remote Key
de: Remote-Schlüssel
es: Clave remota
fr: Clé distante
it: Chiave remota

source: Remote field corresponding to the local key. It can be a list.
de: Remote-Feld mit dem lokalen Schlüssel. Hierbei kann es sich um eine Liste handeln.
es: Campo remoto correspondiente a la clave local. Puede ser una lista.
fr: Le champ distant correspondant à la clé locale. Il est possible d'en avoir plusieurs.
it: Campo remoto corrispondente alla chiave locale. Può essere un elenco.
nl: Veld op afstand dat overeenstemt met de plaatselijke sleutel. Dit kan een lijst zijn.

source: Output Fields
de: Ausgabefelder
es: Campos de salida
fr: Champs de sortie
it: Campi di output

source: List of fields to retrieve from the remote dataset
de: Die Liste der abzurufenden Felder des Remote-Datensatzes.
es: Lista de campos para recuperar del conjunto de datos remoto.
fr: La liste des champs à récupérer à partir du jeu de données distant
it: Elenco di campi da recuperare dal dataset remoto
nl: Lijst met velden die opgehaald moeten worden uit de dataset op afstand

source: Retrieve All Fields
de: Alle Felder abrufen
es: Recuperar todos los campos
fr: Récupérer tous les champs
it: Recupera tutti i campi

source: Set to retrieve all the fields from the remote dataset
de: Um alle Felder des Remote-Datensatzes abzurufen.
es: Establecer para recuperar todos los campos del conjunto de datos remoto.
fr: Activer pour récupérer l'intégralité des champs du jeu de données distant
it: Impostandolo si recuperano tutti i campi del dataset remoto
nl: Ingesteld om alle velden op te halen uit de dataset op afstand

source: no
de: nein
fr: non
nl: nee

source: Case Sensitive
de: Groß- und Kleinschreibung beachten
es: Distinguir mayúsculas de minúsculas
fr: Sensible à la casse
it: Sensibile alle maiuscole

source: Set to retrieve the field name without accents and in lower case format
de: Um den Feldnamen ohne Akzente und in Kleinbuchstabenformat abzurufen
es: Establecer para recuperar el nombre del campo sin marcas de acentuación y en minúsculas.
fr: Activer pour récupérer le nom du champ sans accents et en minuscules
it: Impostandolo si recupera il nome del campo senza accenti e in lettere minuscole
nl: Ingesteld om de veldnaam op te halen zonder accenten en in klein letterformaat

source: One line
de: Eine Zeile
es: Una línea
fr: Résultats sur une ligne
it: Una riga
nl: Eén lijn

source: In some specific cases, the remote dataset may contain more than one row matching the local key. In which case, you may want to either collapse duplicates (that is, generate a single row which will contain multi-valued fields) or not.
de: In bestimmten Fällen kann der Remote-Datensatz mehr als eine Zeile enthalten, die mit dem lokalen Schlüssel übereinstimmen. In diesem Fall können Sie die Duplikate minimieren (d. h. eine einzige Zeile erzeugen, die mehrwertige Felder enthält) oder auch nicht.
es: En algunos casos, el conjunto de datos remoto puede contener más de una fila que coincida con la clave local. En esa circunstancia, puede interesarle contraer los duplicados (es decir, generar una única fila con campos multivalor) o no.
fr: Dans certains cas, le jeu de données distant peut contenir plus d'une seule ligne correspondant à la clé locale. Dans ce scénario, vous pouvez souhaiter fusionner les doublons (c'est-à-dire, générer une seule ligne qui contiendra des champs multivalués) ou non.
it: In alcuni casi specifici, il dataset remoto può contenere più di una riga corrispondente alla chiave locale. In tal caso, puoi decidere o meno di unire tutti i duplicati, generando un'unica riga che contenga campi multivalore.
nl: In bepaalde specifieke gevallen kan de dataset op afstand meer dan één rij bevatten die overeenstemt met de plaatselijke sleutel. In dit geval kunt u ofwel duplicaten samenvoegen (m.a.w. één enkele rij aanmaken die velden met meerdere waarden bevat) of niet.

source: Separator
de: Trennzeichen
es: Separador
fr: Séparateur
it: Separatore
nl: Scheidingsteken

source: To fill if One line is set. Specifies the character to use to separate values in the generated field.
de: Auszufüllen, wenn "Eine Zeile" eingestellt ist. Bestimmt das Zeichen, das verwendet werden soll, um Werte im generierten Feld zu trennen.
es: Para rellenar si se establece Una línea. Especifica el carácter que se usará para separar los valores en el campo generado.
fr: À renseigner si l'option Résultats sur une ligne est définie. Spécifie le caractère à utiliser pour séparer les valeurs dans le champ généré.
it: Da compilare se si imposta il parametro Una riga. Specifica il carattere da utilizzare per separare i valori nel campo generato.
nl: Te vullen wanneer One Line is ingesteld. Specificeert het karakter om de afzonderlijke waarden in het aangemaakte veld te gebruiken.

source: Republish all records upon update
de: Alle Einträge nach einem Update erneut publizieren
es: Volver a publicar todos los registros tras la actualización
fr: Republier tous les enregistrements lors de la mise à jour
nl: Alle records na update opnieuw publiceren

source: Activates scheduling on the dataset, if it is not already activated (see :doc:`Keeping data up to date</publishing_data/03_scheduling_updates/scheduling_updates>`). Once scheduling is configured, this option allows an automatic republish when the remote dataset is updated.
de: Aktiviert einen Zeitplan für den Datensatz, falls dieser nicht bereits aktiviert ist (siehe :doc:`Daten auf dem neuesten Stand halten</publishing_data/03_scheduling_updates/scheduling_updates>`). Sobald der Zeitplan konfiguriert ist, sorgt diese Option automatisch für eine erneute Veröffentlichung, wenn der Remote-Datensatz aktualisiert wurde.
es: Activa la planificación en el conjunto de datos, si aún no lo está (consulte :doc:`Mantener los datos actualizados</publishing_data/03_scheduling_updates/scheduling_updates>`). Una vez que la planificación está configurada, esta opción permite la republicación automática cuando se actualice el conjunto de datos remoto.
fr: Active la planification du jeu de données, si elle n'a pas déjà été activée (voir la documentation :doc:`Maintenir les données à jour</publishing_data/03_scheduling_updates/scheduling_updates>`). Une fois que la planification est configurée, cette option permet de republier automatiquement le jeu de données lorsque jeu de données distant est mis à jour.
nl: Activeert het plannen op de dataset, wanneer dit nog niet reeds geactiveerd is (zie :doc:`Data up-to-date houden</publishing_data/03_scheduling_updates/scheduling_updates>`). Eenmaal het plannen is geconfigureerd, laat deze optie toe om automatisch opnieuw te publiceren wanneer de dataset op afstand is bijgewerkt.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: This option is most useful when the remote dataset is scheduled.
de: Diese Option ist vor allem praktisch, wenn für den Remote-Datensatz ein Zeitplan vorliegt.
es: Esta opción resulta de especial utilidad cuando el conjunto de datos remoto está planificado.
fr: Cette option est particulièrement utile lorsque le jeu de données distant est planifié.
nl: Deze optie is vooral nuttig wanneer de dataset op afstand is gepland.

source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples
it: Esempi
nl: Voorbeelden

source: Simple join
de: Einfache Verbindung
es: Unión simple
fr: Jointure simple
it: Unione semplice
nl: Gewoon samenvoegen

source: Dataset A: list of taxi stations in Paris (dataset name: paris_taxis_stations).
de: Datensatz A: Liste der Taxistationen in Paris (Der Name dieses Datensatzes lautet: paris_taxis_stations).
es: Conjunto de datos A: La lista de estaciones de taxi de París (nombre del conjunto de datos: paris_taxis_stations).
fr: Jeu de données A : liste des stations de taxi à Paris (nom du jeu de données : paris_taxis_stations).
it: Dataset A: elenco delle stazioni di taxi di Parigi (nome del dataset: paris_taxis_stations).
nl: Dataset A: lijst met taxistations in Parijs (naam van de dataset: paris_taxis_stations).

source: station_address
de: station_adresse

source: Tour Eiffel
de: Eiffelturm
nl: Eiffeltoren

source: Dataset B: number of taxis waiting per station in Paris.
de: Datensatz B: Die Anzahl der Taxis, die pro Station in Paris warten.
es: Conjunto de datos B: El número de taxis en espera por estación en París.
fr: Jeu de données B : nombre de taxis en attente à chaque station dans Paris.
it: Dataset B: numero di taxi in attesa per ogni stazione di Parigi.
nl: Dataset B: aantal wachtende taxi's per station in Parijs.

source: number
de: Anzahl
es: Número
fr: nombre
it: numero
nl: aantal

source: Dataset A after being enriched with a field from dataset B, using the Join dataset processor:
de: Datensatz A, nachdem er unter Einsatz des Prozessors "Datensätze verbinden" mit einem Feld aus Datensatz B angereichert wurde:
es: Conjunto de datos A una vez enriquecido con un campo del conjunto de datos B, mediante el procesador Unir conjunto de datos:
fr: Le jeu de données A après avoir été enrichi avec un champ du jeu de données B, à l'aide du processeur Joindre des Jeux de Données :
it: Dataset A dopo che è stato arricchito con un campo del dataset B tramite il processore Unisci dataset:
nl: Dataset A nadat deze is verrijkt met een veld uit dataset B, met behulp van de Join dataset processor:

source: Join with "One line" parameter set
de: Wenn der Parameter "Eine Zeile" eingestellt ist
es: Unión con el parámetro "Una línea" establecido
fr: Joindre avec le paramètre "Résultats sur une ligne" activé
it: Unione con il parametro "Una riga" impostato
nl: Samenvoegen met de parameter ingesteld op "One Line"

source: The example datasets used in the following example are the same as in the previous one.
de: Die Beispieldatensätze, die im folgenden Beispiel verwendet werden, sind dieselben wie im vorherigen Beispiel.
es: Los conjuntos de datos utilizados en el ejemplo siguiente son los mismos que en el anterior.
fr: Les exemples de jeux de données utilisés ci-après sont identiques aux précédents.
it: I dataset utilizzati nel seguente esempio sono uguali a quello precedente.
nl: De voorbeelddatasets die gebruikt worden in het volgende voorbeeld zijn dezelfde als in het vorige voorbeeld.

source: Dataset A contains two rows for the first station:
de: Datensatz A enthält zwei Zeilen für die erste Station:
es: El conjunto de datos A contiene 2 filas para la primera estación:
fr: Le jeu de données A comprend deux lignes pour la première station :
it: Il dataset A contiene due righe per la prima stazione:
nl: Dataset A bevat twee rijen voor het eerste station:

source: If One line is set (with ``|`` set as separator), the Join will result in:
de: Wenn "Eine Zeile" eingestellt ist (mit dem Trennzeichen "|"), erhält man folgendes Ergebnis:
es: Si se establece Una línea (con ``|`` como separador), la unión dará como resultado:
fr: Si l'option Résultats sur une ligne est activée (avec ``|`` en tant que séparateur), la jointure donnera :
it: Se si imposta il parametro Una riga (con "|" come separatore), l'unione risulterà come segue:
nl: Wanneer One Line is ingesteld (met ``|`` ingesteld als scheidingsteken), zal de Join resulteren in:

source: Tour Eiffel|Quai Branly
de: Eiffelturm|Quai Branly

source: However, if One line is not set, the Join will result in:
de: Wenn "Eine Zeile" nicht eingestellt ist, erhält man folgendes Ergebnis:
es: Sin embargo, si no se establece Una línea, la unión dará como resultado:
fr: Toutefois, si l'option Résultats sur une ligne n'est pas activée, la jointure donnera :
it: Se invece non si imposta Una riga, l'unione si presenterà in questo modo:
nl: Wanneer One Line echter niet is ingesteld, zal de Join resulteren in:

source: Join with different field types
de: Verbindung mit verschiedenen Feldtypen
es: Unión con tipos de campo diferentes
fr: Joindre avec différents types de champ
it: Unione con campi di tipo diverso
nl: Samenvoegen met verschillende soorten velden

source: Integers, decimals and text field containing numerical values can be joined together.
de: Ganze und Dezimalzahlen sowie Textfelder mit numerischen Werten können zusammengefügt werden.
es: Pueden unirse campos de enteros, campos de decimales y campos de texto con valores numéricos.
fr: Les champs texte, décimal et entier comprenant des valeurs numériques peuvent être joints.
it: È possibile unire campi di numeri interi, numeri decimali e campi di testo contenenti valori numerici.
nl: Gehele getallen, decimalen en tekstvelden die numerieke waarden bevatten, kunnen worden samengevoegd.

source: Dataset A: with decimal fields and text fields containing numerical values.
de: Datensatz A: mit Dezimalfeldern und Textfeldern mit numerischen Werten.
es: Conjunto de datos A: Con campos de decimales y campos de texto con valores numéricos.
fr: Jeu de données A : avec des champs décimal et texte comprenant des valeurs numériques.
it: Dataset A: con campi decimali e campi di testo contenenti valori numerici.
nl: Dataset A: met decimale velden en tekstvelden die numerieke waarden bevatten.

source: bloom_competition_result (decimal)
de: bloom_competition_result (Dezimalzahl)
fr: bloom_competition_result (décimal)
it: bloom_competition_result (decimale)
nl: bloom_competition_result (decimaal)

source: Dataset B: with integer fields.
de: Datensatz B: mit Ganzzahlfeldern
es: Conjunto de datos B: Con campos de enteros.
fr: Jeu de données B : avec des champs entier.
it: Dataset B: con campi di interi.
nl: Dataset B: met velden met gehele getallen.

source: bloom_ranks (integer)
de: bloom_ranks (Ganzzahl)
es: bloom_ranks (entero)
fr: bloom_ranks (entier)
it: bloom_ranks (intero)
nl: bloom_ranks (geheel getal)

source: Dataset A after using Join dataset: the matching between values ``2`` and ``2.0`` is successful despite the type difference.
de: Datensatz A nach der Verwendung des Prozessors "Datensätze verbinden": Die Übereinstimmung zwischen den Werten "2" und "2.0" ist trotz des unterschiedlichen Typs erfolgreich.
es: Conjunto de datos A una vez utilizado Unir conjunto de datos: La coincidencia entre los valores ``2`` y ``2.0`` se ha detectado correctamente a pesar de la diferencia de tipo.
fr: Jeu de données A après avoir utilisé le processeur Joindre des Jeux de Données : la mise en correspondance entre les valeurs ``2`` et ``2.0`` a réussi malgré la différence de format.
it: Dataset A dopo l'utilizzo del processore Unisci dataset: la corrispondenza tra i valori "2" e "2.0" è riuscita, nonostante la differenza dei tipi di campo.
nl: Dataset A na Join dataset te hebben gebruikt: matching tussen waarden ``2`` en ``2.0`` is succesvol uitgevoerd ondanks de verschillende types.
