Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/join_dataset.po
Languages: de, es, fr, it, nl

source: It is possible to a second Join dataset processor, such as this dataset C:
de: Es ist möglich, einen zweiten Prozessor zur Datensatzverbindung, z. B. für diesen Datensatz C, zu verwenden:
es: Se puede utilizar un segundo procesador Unir conjunto de datos, como este conjunto de datos C:
fr: Il est possible d'ajouter un deuxième processeur Joindre des Jeux de Données, comme pour ce jeu de données C :
it: È possibile utilizzare un secondo processore Unisci dataset, come nel caso di questo dataset C:
nl: Het is mogelijk om een tweede Join dataset processor uit te voeren, zoals deze dataset C:

source: insee_code (integer)
de: insee_code (Ganzzahl)
es: insee_code (entero)
fr: insee_code (entier)
it: insee_code (intero)
nl: insee_code (geheel getal)

source: Dataset A after being joined with datasets B and C:
de: Datensatz A, nachdem er mit Datensatz B und Datensatz C verbunden wurde:
es: Conjunto de datos A una vez unido con los conjuntos de datos B y C:
fr: Le jeu de données A après avoir été joint aux jeux de données B et C :
it: Dataset A dopo l'unione con i dataset B e C:
nl: Dataset A nadat deze werd samengevoegd met datasets B en C:

source: Even though the insee_code was not in the same type, the matching happened. The matching worked even for the value ``1262`` in the first dataset (note the absence of leading 0, due to it being an integer value), that matched against the value ``01262`` in the second dataset. While most column types can be retrieved by using the Join dataset processor, file type columns do not yield the actual resource through the processor but instead yield the identifier of the underlying resource.
de: Trotz des unterschiedlichen Formats beim insee_code war der Abgleich erfolgreich. Der Abgleich funktionierte sogar für den Wert "1262" im ersten Datensatz (beachten Sie das Fehlen der führenden 0, da es ein Ganzzahlwert ist), der dem Wert "01262" im zweiten Datensatz zugeordnet wurde. Während die meisten Spaltentypen mit dem Prozessor "Datensätze verbinden" abgerufen werden können, geben Dateitypspalten nicht die tatsächliche Ressource über den Prozessor an, sondern stattdessen die Kennung der hinterlegten Ressource.
es: Aunque insee_code no era del mismo tipo, se ha detectado la coincidencia. La coincidencia ha funcionado incluso para el valor ``1262`` del primer conjunto de datos (obsérvese la ausencia de 0 inicial al tratarse de un valor entero), que ha coincidido con el valor ``01262`` del segundo conjunto de datos. Si bien la mayoría de los tipos de columnas se pueden recuperar mediante el procesador Unir conjunto de datos, las columnas de tipo archivo no generan el recurso real por medio del procesador sino que generan el identificador del recurso subyacente.
fr: Bien que insee_code ne soit pas au même format, la mise en correspondance a réussi. La mise en correspondance a réussi y compris pour la valeur ``1262`` dans le premier jeu de données (notez l'absence d'un 0 non significatif, car il s'agit d'une valeur entière), qui a été mise en correspondance avec la valeur ``01262`` dans le deuxième jeu de données. Si la plupart des types de colonne peuvent être récupérés au moyen du processeur Joindre des jeux de données, les colonnes de type de fichier ne renvoient pas la ressource réelle via le processeur, mais génèrent à la place l'identifiant de la ressource sous-jacente.
nl: Hoewel de insee_code niet van hetzelfde type was, heeft de matching plaatsgevonden. De matching werkte zelfs voor de waarde ``1262`` in de eerste dataset (noteer de afwezigheid van de eerste 0 als gevolg van het feit dat dit een volledige waarde is), die gematcht is tegen de waarde ``01262`` in de tweede dataset. Hoewel de meeste kolomtypes opgehaald kunnen worden door gebruik te maken van de Join dataset-processor, geeft het bestand type kolommen niet de effectieve bron via de processor, maar in plaats daarvan de identifier van de onderliggende bron.

source: 69 quai Branly, 75007 Paris|69 quai Branly, 75007 Paris
es: 69 quai Branly, 75007 Paris|69 quai Branly, 75007 París

source: insee_code (text)
es: insee_code (texto)
fr: insee_code (texte)
it: insee_code (testo)
nl: insee_code (tekst)

source: city (text)
es: city (texto)
fr: city (texte)
it: city (testo)
nl: city (tekst)

source: postal_code (text)
es: postal_code (texto)
fr: postal_code (texte)
it: postal_code (testo)
nl: postal_code (tekst)

source: Join dataset processor
it: Processore Unisci dataset

source: To set the parameters of the Join dataset processor, follow the indications from the table below.
it: Per configurare i parametri del processore Unisci dataset, procedi come descritto nella tabella sottostante.

source: Dataset used for the join. It can be selected from the portal's datasets or from OpenDataSoft's network.
it: Dataset utilizzato per l'unione. È possibile selezionarlo tra i dataset del portale o dalla rete OpenDataSoft.

source: Even though the insee_code was not in the same type, the matching happened. The matching worked even for the value ``1262`` in the first dataset (note the absence of leading 0, due to it being an integer value), that matched against the value ``01262`` in the second dataset. While most column types can be retrieved by using the Join dataset processor, file type columns do not yield the actual resource through the processor but instead yield the name of the underlying resource.
it: Anche se insee_code non è dello stesso tipo, la corrispondenza è riuscita. Lo stesso accade per il valore "1262" del primo dataset (nota l'assenza dello 0 iniziale, poiché si tratta di un valore intero), che è stato associato al valore "01262" del secondo dataset. Il processore Unisci dataset permette di recuperare la maggior parte dei tipi di colonne; tuttavia per le colonne del tipo di file non viene restituita la risorsa effettiva, ma il nome della risorsa sottostante.
