Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/json_array_to_multivalued.po
Languages: fr, nl

source: JSON array to multivalued
fr: Tableau JSON vers multivalué
nl: JSON array naar meerdere waarden

source: This processor extracts multiple values from a field containing a JSON array and concatenates them into a multivalued field.
fr: Ce processeur extrait les différentes valeurs d'un champ contenant un tableau JSON et les concatène dans un champ à valeurs multiples.
nl: Deze processor extraheert meerdere waarden uit een veld dat een JSON array bevat en voegt deze samen in een veld met meerdere waarden.

source: Note
fr: Remarque
nl: Opmerking

source: The ``multivalued`` property will not be set automatically in the field, so don't forget to enable it on the field's parameters, along with the same separator as in the processor.
fr: La propriété ``multivalued`` ne sera pas définie automatiquement dans le champ. Par conséquent, n'oubliez pas de l'activer dans les paramètres du champ et d'utiliser les mêmes séparateurs que dans le processeur.
nl: De eigenschap ``multivalued`` zal niet automatisch worden ingesteld in het veld, dus vergeet niet om deze te activeren op de parameters van het veld, samen met hetzelfde scheidingsteken als in de processor.

source: Original value
fr: Valeur d'origine
nl: Oorspronkelijke waarde

source: After processor
fr: Après le processeur
nl: Na processor

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: The parameter "iJSON rule to array" works exactly like in the "Extract from JSON" processor and should contain the array to concatenate (represented with the iJSON rule ``.item``).
fr: Le paramètre "Règle iJSON vers tableau" fonctionne exactement de la même manière que dans le processeur "Extraire depuis un objet JSON" et doit contenir le tableau à concaténer (représenté par la règle iJSON ``.item``).
nl: De parameter "iJSON-regel naar array" werkt precies zoals in de processor "Extraheer uit JSON" en zou de array die samengevoegd moet worden, moeten bevatten (weergegeven door de iJSON-regel ``.item``).

source: If the field contains the JSON array directly, just put ``item`` as an iJSON rule.
fr: Si le champ contient directement le tableau JSON, ajoutez simplement ``.item`` en tant que règle iJSON.
nl: Wanneer het veld rechtstreeks de JSON-array bevat, plaats dan enkel ``item`` als een iJSON-regel.

source: If the final element is an array, the iJSON rule must end with ``.item``, meaning that the reached object should be treated as an array of items in the iJSON syntax.
fr: Si l'élément final est un tableau, la règle iJSON doit se terminer par ``.item``, ce qui signifie que l'objet atteint doit toujours être traité comme un tableau d'éléments dans la syntaxe iJSON.
nl: Wanneer het laatste element een array is, moet de iJSON-regel eindigen met ``.item``. Dit betekent dat het bereikte voorwerp behandeld zou moeten worden als een array van items in de iJSON-syntax.

source: If you want to keep going into the items inside the array, you can keep adding key names after the ``.item``, but be careful to check that this path is valid for every object in the array.
fr: Si vous souhaitez continuer à énumérer les articles dans le tableau, vous pouvez continuer à ajouter des noms de clé après ``.item``. Veillez toutefois à vous assurer que ce chemin d'accès est valide pour chaque objet dans le tableau.
nl: Wanneer u wil blijven verdergaan in de items in de array, kan u kernnamen blijven toevoegen na het ``.item``. Zorg er wel voor dat u controleert of dit pad geldig is voor elk voorwerp in de array.

source: To set the parameters of the JSON array to multivalued processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Tableau JSON vers multivalué, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de JSON array to multivalued processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Description
nl: Omschrijving

source: Example
fr: Exemple
nl: Voorbeeld

source: Field
fr: Champ
nl: Veld

source: Name of the field that holds the JSON array
fr: Nom du champ contenant le tableau JSON
nl: Naam van het veld waarin de JSON array staat

source: iJSON rule to array
fr: Règle iJSON vers tableau
nl: iJSON regel naar array

source: iJSON rule to iterate in the JSON array above. An iJSON rule is built with the names of all the field from the JSON root to the data to extract, separated with a dot. The position of the array is indicated with the ``item`` keyword.
fr: Règle iJSON à itérer dans le tableau JSON ci-dessus. Une règle iJSON se construit avec les noms de tous les champs de la racine JSON des données à extraire, séparés par des points. La position du tableau est indiquée par le mot-clé ``item``.
nl: iJSON regel die herhaald moet worden in de bovenstaande JSON array. Een iJSON-regel is opgebouwd met de namen van alle velden uit de JSON root naar de data die geëxtraheerd moeten worden, gescheiden door een puntje. De positie van de array staat aangegeven door het trefwoord "item".

source: Separator
fr: Séparateur
nl: Scheidingsteken

source: Character or string used to separate the different values found
fr: Caractère ou chaîne de caractères utilisé pour séparer les différentes valeurs trouvées
nl: Karakter of string die gebruikt wordt om de verschillende teruggevonden waarden te scheiden

source: Output field
fr: Champ de sortie
nl: Outputveld

source: Name of the field that will contain the extracted element
fr: Nom du champ qui contiendra l'élément extrait
nl: Naam van het veld dat het geëxtraheerde element zal bevatten

source: iJSON rules to extract from the following JSON array field:
fr: Règles iJSON à extraire du champ du tableau JSON suivant :
nl: iJSON-regels om te extraheren uit het volgende JSON array-veld:
