Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/meta_expression.po
Languages: fr

source: Meta expression processor
fr: Processeur Méta-expression

source: This processor is not available by default. Please contact Opendatasoft support team if you want this processor to be activated in your domain.
fr: Ce processeur n'est pas disponible par défaut. Veuillez contacter l'équipe support Opendatasoft si vous souhaitez l'activer dans votre domaine.

source: This processor allows to write an expression and apply its result on several fields of the dataset.
fr: Ce processeur permet d'écrire une expression et d'appliquer son résultat à plusieurs champs du jeu de données.

source: Please refer to the documentation of the :doc:`Expression processor <expression>` for more information about how to write an expression. Both the Expression and the Meta expression processors function the same way, the main difference being that when using the Meta expression processor, the field(s) should be represented with ``X``.
fr: Veuillez vous reporter à la documentation sur le :doc:`processeur Expression<expression>` pour plus d'informations sur l'écriture d'une expression. Les processeurs Expression et Méta-expression fonctionnent de la même façon, la principale différence étant que pour le processeur Méta-expression, les champs doivent être représentés par "X".

source: Setting the processor
fr: Configurer le processeur

source: To set the parameters of the Meta expression processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Méta-expression, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire

source: Expression pattern. Use ``X`` to represent the field(s).
fr: Modèle d'expression. Utilisez "X" pour représenter les champs.

source: yes
fr: oui

source: Fields
fr: Champs

source: Fields where the meta expression will be applied. Click on the + icon next to the drop-down menu to add another field on which the meta expression will be applied.
fr: Champs dans lesquels la méta-expression sera appliquée. Cliquez sur l’icône + en regard du menu déroulant pour ajouter un champ pour lequel la méta-expression s'appliquera.
