Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/normalize_projection_reference.po
Languages: fr, it

source: Normalize Projection Reference processor
fr: Processeur Normaliser le Système de Projection
it: Processore Normalizza il riferimento di proiezione

source: This processor handles a geopoint or a geoshape with a projection system different from a `WGS84 <http://en.wikipedia.org/wiki/WGS_84>`_ field. The field value containing a geopoint or geoshape other than a WGS84 representation is replaced with its WGS84 representation.
it: Questo processore gestisce i punti geografici o le forme geografiche associati a sistemi di proiezione diversi da un campo `WGS84 <http://en.wikipedia.org/wiki/WGS_84>`_. Il valore del campo contenente tali punti o forme geografiche viene sostituito con la relativa rappresentazione WGS84.

source: For example, if the EPSG code is set to ``27572``, the processor will consider that the original geo field contains coordinates expressed in `Lambert Zone II <http://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.
it: Impostando, ad esempio, il valore "27572" per il codice EPSG, il processore considererà che il campo geografico originale contenga le coordinate della proiezione `Lambert Zone II <http://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.

source: The input must be expressed with the same logic as a WGS84 geo coordinate: ``Y,X``.
fr: La valeur en entrée doit être écrite selon la même logique que des coordonnées géo WGS84 : ``Y,X``.
it: L'input deve essere espresso con la stessa logica di una coordinata geografica WGS84: "Y,X".

source: Setting the processor
fr: Configurer le processeur
it: Configurazione del processore

source: To set the parameters of the Normalize Projection Reference processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Normaliser le Système de Projection, suivez les indications du tableau ci-dessous.
it: Per configurare i parametri del processore Normalizza il riferimento di proiezione, procedi come descritto nella tabella sottostante.

source: Label
it: Etichetta

source: Description
it: Descrizione

source: Mandatory
fr: Obligatoire
it: Obbligatorio

source: Field
fr: Champ
it: Campo

source: Field that will be normalized, containing a geopoint or a geoshape with another projection system than WGS84
fr: Champ qui sera normalisé, contenant un point géo ou une forme géo avec un système de projection différent de WGS84
it: Campo da normalizzare, contenente un punto geografico o una forma geografica associati a un sistema di proiezione diverso da WGS84

source: yes
fr: oui
it: sì

source: Source epsg code
fr: Code EPSG source
it: Codice source epsg

source: `EPSG <http://spatialreference.org/ref/epsg/>`_ code of the source coordinates system
it: Codice `EPSG <http://spatialreference.org/ref/epsg/>`_ del sistema di coordinate di origine

source: This processor handles a geopoint or a geoshape with a projection system different from a `WGS84 <https://en.wikipedia.org/wiki/WGS_84>`_ field. The field value containing a geopoint or geoshape other than a WGS84 representation is replaced with its WGS84 representation.
fr: Ce processeur interprète un point géo ou une forme géo avec un système de projection différent d'un champ `WGS84 <https://en.wikipedia.org/wiki/WGS_84>`. La valeur du champ contenant un point géo ou une forme géo autre qu'une représentation WGS84 est remplacée par sa représentation WGS84.

source: For example, if the EPSG code is set to ``27572``, the processor will consider that the original geo field contains coordinates expressed in `Lambert Zone II <https://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.
fr: Par exemple, si le code EPSG est défini sur ``27572``, le processeur va considérer que le champ géo d'origine contient des coordonnées exprimées en `Lambert Zone II <https://spatialreference.org/ref/epsg/ntf-paris-lambert-zone-ii/>`_.

source: Note
fr: Remarque

source: `EPSG <https://spatialreference.org/ref/epsg/>`_ code of the source coordinates system
fr: Code `EPSG <https://spatialreference.org/ref/epsg/>`_ du système de coordonnées source
