Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/replace_via_regexp.po
Languages: fr

source: Replace via Regexp processor
fr: Processeur Remplacer via Expression Régulière

source: This processor allows to replace or remove any part of a text, a number or a combination of both.
fr: Ce processeur permet de remplacer ou de supprimer une partie d'un texte, d'un nombre ou d'une combinaison des deux.

source: Setting the processor
fr: Configurer le processeur

source: To set the parameters of the Replace via Regexp processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Remplacer via Expression Régulière, suivez les indications du tableau ci-dessous.

source: Mandatory
fr: Obligatoire

source: Default value
fr: Valeur par défaut

source: Field
fr: Champ

source: Field which contains the values to replace or remove.
fr: Champ contenant les valeurs à remplacer ou à supprimer.

source: yes
fr: oui

source: All fields
fr: Tous les champs

source: If checked: all fields from the dataset are processed with the Replace via Regexp processor
fr: Si la case de cette option est cochée : tous les champs du jeu de données sont traités avec le processeur Remplacer via Expression Régulière

source: no
fr: non

source: Regular expression
fr: Expression régulière

source: Regular expression to determine which part of the values will be replaced or removed. See `<http://en.wikipedia.org/wiki/Regular_expression>`_ for more details on how to write a regular expressions. It is also possible to test regular expressions with an online debugger tool like `Regex101 <https://regex101.com/>`_.
fr: Expression régulière permettant de déterminer la partie des valeurs qui sera remplacée ou supprimée. Consultez `<http://en.wikipedia.org/wiki/Regular_expression>`_ pour plus d'informations sur l'utilisation des expressions régulières. Vous pouvez également tester les expressions régulières avec un débogueur en ligne comme `Regex101 <https://regex101.com/>`_.

source: New value
fr: Nouvelle valeur

source: If the field value determined with the regular expression is replaced, write the new value that must replace the old one. If the field value determined with the regular expression is removed, let this parameter empty.
fr: Si la valeur de champ identifiée par l'expression régulière est remplacée, écrivez la nouvelle valeur qui doit remplacer l'ancienne. Si la valeur de champ identifiée par l'expression régulière est supprimée, laissez ce paramètre vide.

source: Case insensitive regular expression
fr: Expression régulière non sensible à la casse

source: If checked: the regular expressions are case insensitive
fr: Si la case de cette option est cochée : les expressions régulières ne sont pas sensibles à la casse

source: Multiline regular expression
fr: Expression régulière sur plusieurs lignes

source: If checked: each newline marks the beginning of an other line. More information about `the multiline option in the Python documentation <https://docs.python.org/2/library/re.html#re.MULTILINE>`_.
fr: Si la case de cette option est cochée : chaque nouvelle ligne marque le début d'une autre ligne. Vous trouverez plus d'informations sur `l'option multiligne dans la documentation Python <https://docs.python.org/2/library/re.html#re.MULTILINE>`_.

source: '.' character match newlines
fr: Le caractère '.' correspond aux nouvelles lignes

source: If checked: '.' character also encompasses newlines. More information about `the '.' character in the Python documentation <https://docs.python.org/2/library/re.html#re.DOTALL>`_.
fr: Si la case de cette option est cochée : le caractère '.' inclut également les nouvelles lignes. Vous trouverez plus d'informations sur `le caractère '.' dans la documentation Python <https://docs.python.org/2/library/re.html#re.DOTALL>`_.

source: Example
fr: Exemple

source: In order to keep only a part of a number, the processor Replace via Regexp should be used. For example, it is possible to keep only the area code from a French zip code (e.g from 44100 [Nantes], to keep only 44 [Loire-Atlantique]).
fr: Si vous souhaitez garder uniquement une partie d'un nombre, le processeur Remplacer via Expression Régulière doit être utilisé. Par exemple, vous pouvez garder uniquement le code de département d'un code postal français (par ex. pour 44100 [Nantes], gardez uniquement 44 [Loire-Atlantique]).

source: In this example, the regular expression processor is configured with the pattern ``[0-9]{3}$``, and a replacement by nothing. The pattern means "select 3 digits from the end", with ``[0-9]`` meaning any digit, ``{3}`` meaning exactly 3 occurences, and ``$`` meaning the end of the text. These 3 digits from the end are then replaced by nothing, so only the first 2 digits will stay.
fr: Dans cet exemple, le processeur d'expression régulière est configuré avec la chaine ``[0-9]{3}$``, et un remplacement par rien. La chaîne signifie : "sélectionner 3 caractères de la fin", ``[0-9]`` pour n'importe quel chiffre, ``{3}`` pour exactement 3 occurrences et ``$`` qui signifie fin du texte. Ces 3 numéros à la fin sont remplacés par rien, il ne restera que les 2 premiers numéros.
