Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/simplify_geo_shape.po
Languages: fr, nl

source: Simplify Geo Shape processor
fr: Processeur Simplifier les formes géo

source: This processor simplifies a geo shape to reduce both the processing time and the dataset size.
fr: Ce processeur simplifie une forme géo afin de réduire le temps de traitement et la taille du jeu de données.
nl: Deze processor vereenvoudigt de geografische vorm om de verwerkingstijd te verkorten en de omvang van de dataset te verkleinen.

source: Note
fr: Remarque
nl: Opmerking

source: The process of simplification will not respect the topology of the geo shapes.
fr: Le processus de simplification ne suivra pas la topologie des formes géo.
nl: Bij het vereenvoudigingsproces zal de topologie van de geografische vormen niet worden gerespecteerd.

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Simplify Geo Shape processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Simplifier les formes géo, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Simplify Geo Shape processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Mandatory
fr: Obligatoire
nl: Verplicht

source: Tolerance (simplification level)
fr: Tolérance (niveau de simplification)
nl: Tolerantie (vereenvoudigingsniveau)

source: Value below which intermediate points will be suppressed. Depending on the shape complexity, different tolerances can be tested: the idea could be starting with a tolerance value of 0.0001 and in order to simplify more, to use a power of ten e.g. 0.001, then 0.01. If the tolerance is too high, the shapes will be overly simplified and unrecognizable. Use the preview to find out which tolerance works best.
fr: La valeur en dessous de laquelle les points intermédiaires seront supprimés. En fonction de la complexité de la forme, différentes tolérances peuvent être testées : l'idée pourrait être de commencer avec une valeur de tolérance de 0.0001 et pour accentuer la simplification, d'utiliser une puissance de dix, par ex. 0.001, puis 0.01. Si la tolérance est trop élevée, les formes seront trop simplifiées et non reconnaissables. Utilisez l'aperçu pour déterminer la tolérance la plus adaptée.
nl: Waarde onder welke de tussenpunten zullen worden onderdrukt. Afhankelijk van de complexiteit van de vorm kunnen verschillende toleranties worden getest: de idee zou kunnen zijn om te beginnen met een tolerantiewaarde van 0.0001 en om nog verder te vereenvoudigen, om een macht van tien te gebruiken, bijv. 0.001, daarna 0.01. Wanneer de tolerantie te hoog is, zullen de vormen te veel vereenvoudigd zijn en onherkenbaar worden. Gebruik de voorbeeldweergave om te weten te komen welke tolerantie het best werkt.

source: yes
fr: oui
nl: ja

source: Description
nl: Omschrijving
