Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/skip_records.po
Languages: nl

source: This processor allows to skip records from a dataset.
nl: Deze processor laat toe records uit een dataset over te slaan.

source: Setting the processor
nl: De processor instellen

source: To set the parameters of the Skip records processor, follow the indications from the table below.
nl: Om de parameters van de Skip records processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Description
nl: Omschrijving

source: Mandatory
nl: Verplicht

source: Field
nl: Veld

source: Field containing the record value to delete
nl: Veld dat de recordwaarde bevat die moet worden verwijderd

source: yes
nl: ja

source: Value to skip
nl: Waarde om over te slaan

source: Value to delete from the field's records
nl: Waarde die moet worden verwijderd uit de records van het veld

source: Note
nl: Opmerking

source: It is possible, instead of writing a value, to write an expression. Write an equals sign ``=`` at the beginning to enter in expression mode (see :doc:`Expression processor<expression>` documentation for more information about expressions).
nl: Het is mogelijk om een uitdrukking te schrijven in plaats van een waarde te schrijven. Schrijf een gelijkheidsteken "=" aan het begin om in uitdrukkingsmodus in te voeren (zie :doc:`Expression processor<expression>` documentatie voor meer informatie over uitdrukkingen).

source: no
nl: nee

source: Exact match
nl: Exacte match

source: If checked: the field must contain the exact value written in the **Value to skip** parameter. If unchecked: the field must at least contain what was written in the **Value to skip** parameter.
nl: Indien aangevinkt: het veld moet de precieze waarde bevatten die vermeld staat in de parameter **Waarde om over te slaan**. Indien uitgevinkt: het veld moet minstens datgene bevatten wat vermeld staat in de parameter **Waarde om over te slaan**.

source: Keep instead of skip
nl: Behouden in plaats van overslaan

source: If checked: the value written in the **Value to skip** parameter will be kept instead of being skipped, and all other values will be skipped.
nl: Indien aangevinkt: de waarde die vermeld staat in de parameter **Waarde om over te slaan** zal behouden worden in plaats van worden overgeslagen, en alle andere waarden zullen worden overgeslagen.
