Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/transpose_fields.po
Languages: nl

source: This processor transforms labels into field values.
nl: Deze processor transformeert labels in veldwaarden.

source: Example: if a dataset -containing the estimated number of inhabitants in France, the UK and the US, between 2020 and 2050- initially looks like in the table below, it is quite difficult to analyze it and draw meaningful visualizations for instance.
nl: Voorbeeld: wanneer een dataset, die een geschat aantal inwoners in Frankrijk, het VK en de V tussen 2020 en 2050 bevat, er aanvankelijk uitziet als in de onderstaande tabel, is het vrij moeilijk om deze te analyseren en er bijvoorbeeld betekenisvolle weergaven uit te halen.

source: Country name
nl: Naam van het land

source: France
nl: Frankrijk

source: UK
nl: VK

source: USA
nl: VS

source: However, with the representation below, it is possible to set up relevant facets and analyze the data, because these data are ordered a better way. The Transpose fields allows to go from the representation above to the one below, by creating a new field with the former field titles (Year), and another new field with the values left (Inhabitants).
nl: Met onderstaande representatie is het evenwel mogelijk om relevante facetten in te stellen en de gegevens te analyseren omdat deze gegevens op een betere manier zijn geordend. De Transpose fields processor laat toe om van de bovenstaande representatie naar de onderstaande te gaan via het aanmaken van een nieuw veld met de vorige veldtitels (Jaar) en een ander nieuw veld met de overgebleven waarden (Inwoners).

source: Country Name
nl: Naam van het land

source: Year
nl: Jaar

source: Inhabitants
nl: Inwoners

source: Setting the processor
nl: De processor instellen

source: To set the parameters of the Transpose fields processor, follow the indications from the table below.
nl: Om de parameters van de Transpose fields processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Description
nl: Omschrijving

source: Mandatory
nl: Verplicht

source: Fixed fields
nl: Vaste velden

source: List of fields that will be kept as is
nl: Lijst van velden die als dusdanig behouden worden

source: yes
nl: ja

source: Invert fixed fields
nl: Vaste velden omkeren

source: If checked: the fields chosen in the **Fixed fields** parameter will be transposed instead of being kept as they are, and the other fields will however be considered as fixed fields
nl: Indien aangevinkt: de velden die gekozen zijn in de parameter **Vaste velden** worden omgezet in plaats van dat deze als dusdanig worden behouden en de overige velden zullen evenwel beschouwd worden als vaste velden

source: no
nl: nee

source: Label for title column
nl: Label voor titel kolom

source: Name of the newly created field, containing the former fields titles
nl: Naam van het nieuw aangemaakt veld dat de vorige veldtitels bevat

source: Label for value column
nl: Label voor waarde kolom

source: Name of the newly created field, containing the former records values
nl: Naam van het nieuw aangemaakt veld dat de vorige recordwaarden bevat

source: One line
nl: EÃ©n lijn

source: If checked: records values will not be split in several lines for each possible value, but separated by a defined separator
nl: Indien aangevinkt: recordwaarden zullen niet worden opgesplitst in verschillende lijnen voor elke mogelijke waarde, maar gescheiden worden door een welbepaald scheidingsteken

source: Separator
nl: Scheidingsteken

source: To fill if One line is set. Specifies the character to use to separate values in the new field
nl: In te vullen indien One line is ingesteld. Specificeert het karakter dat gebruikt moet worden om de waarden in het nieuwe veld te scheiden
