Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/transform_boolean_columns_to_multivalued_field.po
Languages: de, es, fr, it, nl

source: Transform boolean columns to multivalued field processor
de: Prozessor "Boolesche Spalten in mehrwertige Felder umwandeln"
es: Procesador Transformar columnas booleanas en campo multivalor
fr: Processeur Transformer des colonnes de booléens en champs multivalués
it: Trasforma le colonne booleane in campi multivalore

source: This processor transforms true values from boolean fields into a multivalued field.
de: Dieser Prozessor wandelt wahre Werte aus booleschen Feldern in ein mehrwertiges Feld um.
es: Este procesador transforma los valores verdaderos de los campos booleanos en un campo multivalor.
fr: Ce processeur transforme les valeurs réelles de champs booléens en un champ multivalué.
it: Questo processore trasforma i valori veri dei campi booleani in un campo multivalore.
nl: Deze processor zet echte waarden uit boolean velden om in een veld met meerdere waarden.

source: Setting the processor
de: Den Prozessor einrichten
es: Establecer el procesador
fr: Configurer le processeur
it: Configurazione del processore
nl: De processor instellen

source: To set the parameters of the Transform boolean columns to multivalued field processor, follow the indications from the table below.
de: Befolgen Sie die Anweisungen der unteren Tabelle, um die Parameter des Prozessors "Boolesche Spalten in mehrwertige Felder umwandeln" einzurichten.
es: Para establecer los parámetros del procesador Transformar columnas booleanas en campo multivalor, siga las indicaciones de esta tabla.
fr: Pour définir les paramètres du processeur Transformer des colonnes de booléens en champs multivalués, suivez les indications du tableau ci-dessous.
it: Per configurare i parametri del processore Trasforma le colonne booleane in campi multivalore, procedi come descritto nella tabella sottostante.
nl: Om de parameters van de Transform boolean columns to multivalued field processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Label
de: Beschriftung
es: Etiqueta
it: Etichetta

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Mandatory
de: Obligatorisch
es: Obligatorio
fr: Obligatoire
it: Obbligatorio
nl: Verplicht

source: Boolean fields
de: Boolesche Felder
es: Campos booleanos
fr: Champs booléens
it: Campi booleani
nl: Boolean velden

source: Boolean fields from the dataset
de: Boolesche Felder aus dem Datensatz
es: Campos booleanos del conjunto de datos.
fr: Champs booléens du jeu de données
it: Campi booleani del dataset
nl: Boolean velden uit de dataset

source: yes
de: ja
es: Sí
fr: oui
it: sì
nl: ja

source: Values considered as 'false'
de: Werte, die als "falsch" gelten
es: Valores considerados como 'false'
fr: Valeurs considérées comme 'false'
it: Valori considerati come "falsi"
nl: Waarden die beschouwd worden als "onwaar"

source: All values from the dataset's boolean fields which are considered as "false"
de: Alle Werte aus den booleschen Feldern des Datensatzes, die als "falsch" betrachtet werden
es: Todos los valores de los campos booleanos del conjunto de datos que se consideran como "false".
fr: Toutes les valeurs des champs booléens du jeu de données qui sont considérées comme "false"
it: Tutti i valori dei campi booleani del dataset che sono considerati come "falsi"
nl: Alle waarden uit de boolean velden van de dataset die beschouwd worden als "onwaar"

source: Empty field is 'false'
de: Leeres Feld ist "falsch"
es: Campo vacío es 'false'
fr: Champ vide considéré comme 'false'
it: Il campo vuoto è "falso"
nl: Leeg veld is "onwaar"

source: Set if the empty fields from the dataset must be considered as "false"
de: Bestimmen Sie, ob die leeren Felder des Datensatzes als "falsch" betrachtet werden sollen
es: Establecer si los campos vacíos del conjunto de datos deben considerarse como "false".
fr: Ce paramètre définit si les champs vides du jeu de données doivent être considérés comme "false"
it: Se impostato, i campi vuoti del dataset sono considerati come "falsi"
nl: Stel in indien de lege velden uit de dataset beschouwd moeten worden als "onwaar"

source: no
de: nein
fr: non
nl: nee

source: Use labels instead of field names
de: Beschriftungen statt Feldnamen verwenden
es: Utilizar etiquetas en lugar de nombres de campo
fr: Utiliser des labels au lieu de noms de fichier
it: Utilizza etichette anziché nomi dei campi
nl: Gebruik labels in plaats van veldnamen

source: Set if the former boolean fields must be displayed in the new multivalued field with their labels or with their field names (meaning their technical identifiers)
de: Bestimmen Sie, ob die früheren booleschen Felder im neuen mehrwertigen Feld mit ihren Beschriftungen oder mit ihren Feldnamen (d. h. ihrer technischen Kennung) angezeigt werden.
es: Establecer si los campos booleanos anteriores deben visualizarse en el campo multivalor nuevo con sus etiquetas o con sus nombres de campo (es decir, sus identificadores técnicos).
fr: Ce paramètre définit si les anciens champs booléens doivent être affichés dans le nouveau champ multivalué avec ses labels ou ses noms de champ (c'est-à-dire, ses identifiants techniques)
it: Se impostato, i campi booleani precedenti sono visualizzati nel nuovo campo multivalore con le rispettive etichette o nomi, cioè con i relativi identificatori tecnici
nl: Stel in indien de voormalige boolean velden in het nieuwe veld met meerdere waarden moet worden weergegeven met hun labels of met hun veldnamen (m.a.w. hun technische identifiers)

source: Remove boolean fields after processing
de: Boolesches Feld nach der Verarbeitung entfernen
es: Eliminar campos booleanos después del procesamiento
fr: Supprimer les champs booléens après le traitement
it: Rimuovi campi booleani dopo l'elaborazione
nl: Verwijder boolean velden na verwerking

source: Set if boolean fields used in the processor must be removed from the dataset after the processing
de: Bestimmen Sie, ob die vom Prozessor verarbeiteten booleschen Felder nach der Verarbeitung aus dem Datensatz entfernt werden sollen
es: Establecer si los campos booleanos empleados en el procesador deben eliminarse del conjunto de datos después del procesamiento.
fr: Ce paramètre définit si les champs booléens utilisés dans le processeur doivent être supprimés du jeu de données après le traitement
it: Se impostato, i campi booleani utilizzati nel processore vengono rimossi dal dataset dopo l'elaborazione
nl: Stel in indien boolean velden, die in de processor gebruikt worden, na verwerking verwijderd moeten worden uit de dataset

source: Separator
de: Trennzeichen
es: Separador
fr: Séparateur
it: Separatore
nl: Scheidingsteken

source: Separator to use to separate multivalued records from the new field. Default separator is ``,``.
de: Trennzeichen, das verwendet wird, um mehrwertige Einträge von dem neuen Feld zu trennen. Das Standardtrennzeichen ist ",".
es: Separador que se usará para separar los registros multivalor del campo nuevo. El separador predeterminado es ``,``.
fr: Séparateur à utiliser pour séparer les enregistrements multivalués du nouveau champ. Le séparateur par défaut est ``,``.
it: Separatore da utilizzare per separare i record multivalore dal nuovo campo. Il separatore predefinito è ",".
nl: Scheidingsteken dat gebruikt moet worden om records met meerdere waarden te scheiden van het nieuwe veld. Het standaard scheidingsteken is ",".

source: Output field
de: Ausgabefeld
es: Campo de salida
fr: Champ de sortie
it: Campo di output
nl: Outputveld

source: Field containing the multivalued records from the boolean fields used in the processor. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
de: Feld, das die mehrwertigen Einträge aus den booleschen Feldern enthält, die vom Prozessor verarbeitet werden. Es kann sich um ein vorhandenes Feld handeln oder eines, das zu diesem Zweck erstellt wurde (wählen Sie in diesem Fall **Eingabetext** aus der Liste und geben Sie den Namen des neuen Feldes in den unteren Textbereich ein).
es: Campo que contiene los registros multivalor de los campos booleanos utilizados en el procesador. Puede ser un campo existente seleccionado de la lista, o un campo nuevo creado con ese fin (en ese caso, elija **Texto de entrada** en la lista y escriba el nombre del campo nuevo en el área de texto que figura a continuación).
fr: Champ contenant les enregistrements multivalués issus des champs booléens utilisés dans le processeur. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
it: Campo contenente i record multivalore dei campi booleani utilizzati nel processore. Può essere un campo esistente selezionato dall'elenco o un nuovo campo creato appositamente allo scopo. In tal caso, seleziona **Inserisci testo** nell'elenco e digita il nome del nuovo campo nell'area di testo sottostante.
nl: Veld waarin de records met meerdere waarden staan uit de boolean velden die gebruikt worden in de processor. Dit kan een bestaand veld zijn dat gekozen wordt uit de lijst of een nieuw veld dat hiervoor is aangemaakt (in dat geval, kies **Invoer tekst** uit de lijst en noteer de naam van het nieuwe veld in de tekstruimte eronder).
