Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/what3words.po
Languages: nl

source: Important
nl: Belangrijk

source: This processor is not available by default. Please contact OpenDataSoft support team if you want this processor to be activated in your domain.
nl: Deze processor is standaard niet beschikbaar. Gelieve contact op te nemen met het support team van OpenDataSoft indien u wenst dat deze processor op uw domein wordt geactiveerd.

source: This processor uses geographical coordinates to produce a 3 word address.
nl: Deze processor gebruikt geografische coördinaten om een adres in 3 woorden te genereren.

source: This processor requires a `what3words <https://what3words.com/>`_ API key.
nl: Deze processor vereist een `what3words <https://what3words.com/>`_ API-sleutel.

source: Setting the API key
nl: De API-sleutel instellen

source: To setup a what3words key in order to use this processor:
nl: Om een what3words-sleutel in te stellen om deze processor te kunnen gebruiken:

source: Leave the Catalog tab and click on the Configuration tab in the backoffice menu.
nl: Verlaat het tabblad Catalogus en klik op het tabblad Configuratie in het back office-menu.

source: Click on the **Data processing** tab of the Configuration menu.
nl: Klik op het tabblad **Dataverwerking** van het configuratiemenu.

source: In the **what3words API** section, fill in the API key parameter.
nl: Vul in het **what3words API**-deel de API-sleutelparameter in.

source: Click on the **Save** button at the top of the page.
nl: Klik op de knop **Opslaan** bovenaan de pagina.

source: Setting the processor
nl: De processor instellen

source: To set the parameters of the what3words processor, follow the indications from the table below.
nl: Om de parameters van de what3words processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Description
nl: Omschrijving

source: Mandatory
nl: Verplicht

source: Language
nl: Taal

source: Desired language for the 3 word address. Default is English.
nl: Gewenste taal voor het adres in 3 woorden. Standaard is het Engels.

source: no
nl: nee

source: Coordinates
nl: Coördinaten

source: Field containing the geographical coordinates to geocode
nl: Veld dat de geografische coördinaten bevat voor het geocoderen

source: yes
nl: ja

source: Output field
nl: Outputveld

source: Field that will contain the resulting 3 word address. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
nl: Veld dat het gegenereerde adres in 3 woorden bevat. Dit kan een bestaand veld zijn dat gekozen wordt uit de lijst of een nieuw veld dat hiervoor is aangemaakt (in dat geval, kies **Invoer tekst** uit de lijst en noteer de naam van het nieuwe veld in de tekstruimte eronder).
