Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/wkt_and_wkb_to_geojson.po
Languages: de, fr, it, nl

source: WKT and WKB to GeoJson processor
de: Prozessor "WKT und WKB zu GeoJSON"
fr: Processeur WKT et WKB en GeoJSON
it: Processore Da WKT e WKB a GeoJson

source: Important
de: Wichtig
nl: Belangrijk

source: This processor is not available by default. Please contact Opendatasoft support team if you want this processor to be activated in your domain.
de: Dieser Prozessor ist standardmäßig nicht verfügbar. Wenden Sie sich an das Opendatasoft-Supportteam, wenn dieser Prozessor für Ihre Domain aktiviert werden soll.
fr: Ce processeur n'est pas disponible par défaut. Veuillez contacter l'équipe support Opendatasoft si vous souhaitez l'activer dans votre domaine.
nl: Deze processor is standaard niet beschikbaar. Gelieve contact op te nemen met het support team van Opendatasoft indien u wenst dat deze processor op uw domein wordt geactiveerd.

source: This processor converts vector geometry object represented in Well-known text (WKT) or Well-known binary (WKB) into a GeoJSON object.
de: Dieser Prozessor konvertiert in Well-known text (WKT) oder Well-known binary (WKB) dargestellte Vektorgeometrieobjekte in ein GeoJSON-Objekt.
fr: Ce processeur convertit un objet géométrique vectoriel en Well-known text (WKT) ou Well-known binary (WKB) en un objet GeoJSON.
it: Questo processore converte un oggetto di geometria vettoriale con formato WKT (Well-known text) o WKB (Well-known binary) in un oggetto GeoJSON.
nl: Deze processor converteert vector geometry-voorwerp weergegeven in Well-known text (WKT) of Well-known binary (WKB) in een GeoJSON-voorwerp.

source: Note
de: Hinweis
fr: Remarque
nl: Opmerking

source: Extended well-known binary (EWKB) is also supported for this processor.
de: Extended well-known binary (EWKB) wird für diesen Prozessor ebenfalls unterstützt.
fr: Le format Extended well-known binary (EWKB) est également pris en charge par ce processeur.
nl: Extended well-know binary (EWKB) wordt ook ondersteund voor deze processor.

source: For Well-known binary, an hexadecimal input is expected.
de: Für Well-known binary wird eine hexadezimale Eingabe erwartet.
fr: Pour le format Well-known binary, une valeur hexadécimale est requise.
it: Per il formato Well-known binary è previsto un input esadecimale.
nl: Voor Well-known binary wordt een hexadecimale input verwacht.

source: Setting the processor
de: Den Prozessor einrichten
fr: Configurer le processeur
it: Configurazione del processore
nl: De processor instellen

source: To set the parameters of the WKT and WKB to GeoJson processor, follow the indications from the table below.
de: Befolgen Sie die Anweisungen der unteren Tabelle, um die Parameter des Prozessors "WKT und WKB zu GeoJSON" einzurichten.
fr: Pour définir les paramètres du processeur WKT et WKB en GeoJSON, suivez les indications du tableau ci-dessous.
it: Per configurare i parametri del processore Da WKT e WKB a GeoJson, procedi come descritto nella tabella sottostante.
nl: Om de parameters van de WKT and WKB to GeoJSON processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Label
de: Beschriftung
it: Etichetta

source: Description
de: Beschreibung
it: Descrizione
nl: Omschrijving

source: Mandatory
de: Obligatorisch
fr: Obligatoire
it: Obbligatorio
nl: Verplicht

source: WKT|WKB field
de: WKT|WKB-Feld
fr: Champ WKT|WKB
it: Campo WKT|WKB
nl: WKT|WKB-veld

source: Field that will be normalized, containing a geopoint with another projection system than WGS84
de: Feld, das normalisiert wird und einen Geopunkt mit einem anderen Projektionssystem als WGS84 enthält
fr: Champ qui sera normalisé, contenant un point géo avec un système de projection différent de WGS84
it: Campo da normalizzare, contenente un punto geografico con un sistema di proiezione diverso da WGS84
nl: Veld dat zal worden genormaliseerd en dat een geografisch punt met een ander projectiesysteem dan WGS84 bevat

source: yes
de: ja
fr: oui
it: sì
nl: ja

source: Examples
de: Beispiele
fr: Exemples
it: Esempi
nl: Voorbeelden

source: Examples of Well-known binary format:
de: Beispiele für das Format Well-known binary:
fr: Exemples de valeurs au format Well-known binary :
it: Esempi di formato Well-known binary:
nl: Voorbeelden van Well-known binary-formaat:

source: Examples of Well-known text format:
de: Beispiele für das Format Well-known text:
fr: Exemples de valeurs au format Well-known text :
it: Esempi di formato Well-known text:
nl: Voorbeelden van Well-known text-formaat:
