Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/zip_code_to_geo_coordinates.po
Languages: fr, nl

source: Zip Code to Geo Coordinates processor
fr: Processeur Code Postal vers Coordonnées Géo

source: This processor uses a French postal code to produce a geo coordinate.
fr: Ce processeur utilise un code postal français pour générer des coordonnées géographiques.
nl: Deze processor gebruikt een Franse postcode om een geografische coördinaat te genereren.

source: The Zip Code to Geo Coordinates processor is available for the following countries:
fr: Le processeur Code Postal vers Coordonnées Géo est disponible pour les pays suivants :
nl: De Zip Code to Geo Coordinates processor is beschikbaar voor de volgende landen:

source: Germany
fr: Allemagne
nl: Duitsland

source: the USA
fr: États-Unis d'Amérique
nl: de VS

source: Setting the processor
fr: Configurer le processeur
nl: De processor instellen

source: To set the parameters of the Zip Code to Geo Coordinates processor, follow the indications from the table below.
fr: Pour définir les paramètres du processeur Code Postal vers Coordonnées Géo, suivez les indications du tableau ci-dessous.
nl: Om de parameters van de Zip Code to Geo Coordinates processor in te stellen, dient u de aanwijzingen in onderstaande tabel te volgen.

source: Mandatory
fr: Obligatoire
nl: Verplicht

source: Country
fr: Pays

source: Country of the postal code (France, Germany or the USA only)
fr: Pays correspondant au code postal (France, Allemagne ou États-Unis d'Amérique uniquement)
nl: Land van de postcode (enkel Frankrijk, Duitsland of de VS)

source: yes
fr: oui
nl: ja

source: Postal code
fr: Code postal
nl: Postcode

source: Field that contains the French postal code to geocode
fr: Champ contenant le code postal français à géocoder
nl: Veld dat de Franse postcode bevat die geografisch moet worden gecodeerd

source: Retrieve Geo Shapes
fr: Récupérer les formes géographiques
nl: Geografische vormen ophalen

source: If checked: the processor retrieves the geo shape corresponding to the postal code as well of the geo point
fr: Si la case de cette option est cochée : le processeur récupère la forme géo correspondant au code postal, ainsi qu'au point géo
nl: Indien aangevinkt: de processor haalt de geografische vorm op die overeenstemt met de postcode alsook het geografisch punt

source: no
fr: non
nl: nee

source: Output field
fr: Champ de sortie
nl: Outputveld

source: Field that will contain the produced WSG84 coordinates. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
fr: Champ qui contiendra les coordonnées WSG84 générées. Il peut s'agir d'un champ existant choisi dans la liste ou d'un champ créé à cette fin (dans ce cas, choisissez **Saisir du texte** dans la liste et écrivez le nom du nouveau champ dans la zone de texte en dessous).
nl: Veld dat de gegenereerde WSG84-coördinaten bevat. Dit kan een bestaand veld zijn dat gekozen wordt uit de lijst of een nieuw veld dat hiervoor is aangemaakt (in dat geval, kies **Invoer tekst** uit de lijst en noteer de naam van het nieuwe veld in de tekstruimte eronder).

source: France
nl: Frankrijk

source: Description
nl: Omschrijving
