Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/04_configuring_data_visualizations/basemaps.po
Languages: es

source: Adding basemaps
es: Añadir mapas de base

source: Basemaps are the canvas on which geographic data are represented. They are used for any map displayed on OpenDataSoft, whether it is the visualization map of a dataset or the Map Builder.
es: Los mapas de base son los lienzos donde se representan los datos geográficos. Se usan para cualquiera de los mapas visualizados en OpenDataSoft, tanto si es el mapa de visualización de un conjunto de datos o el compilador de mapas.

source: A basic basemap is used by default for all maps of all OpenDataSoft domains. It is however possible to change that default basemap, as well as to make other basemaps available in an OpenDataSoft portal. It will allow users to change the basemap at any time on a map, and even to change the default basemap of a specific dataset.
es: De forma predeterminada se usa un mapa de base básico para todos los mapas de todos los dominios OpenDataSoft. No obstante, se puede cambiar ese mapa de base predeterminado y hacer que haya otros mapas de base disponibles en un portal OpenDataSoft. Los usuarios podrán cambiar el mapa de base en cualquier momento que estén sobre un mapa, o incluso cambiar el mapa de base predeterminado de un conjunto de datos específico.

source: Note
es: Nota

source: To know more about basemaps and how to use them, you can read our blog post "`What is a basemap & how to choose the best one for your data <https://www.opendatasoft.com/2015/09/03/what-is-a-basemap-and-how-to-choose-the-best-one-for-your-data/>`_".
es: Para ampliar información sobre los mapas de base y cómo utilizarlos, puede leer nuestra publicación de blog "`What is a basemap & how to choose the best one for your data <https://www.opendatasoft.com/2015/09/03/what-is-a-basemap-and-how-to-choose-the-best-one-for-your-data/>`_".

source: To manage basemaps, go to Look & feel > Data visualizations. In this subsection of the back office menu, look for the "Basemaps" area.
es: Para administrar los mapas de base, vaya a Apariencia > Visualizaciones de datos. En esta subsección del menú del back office, busque el área "Mapas de base".

source: Basemaps should be managed from the table of the "Basemaps" area. This table displays the currently available basemaps that can be used on the domain. It comprises 5 columns:
es: Los mapas de base deben administrarse desde la tabla del área "Mapas de base". Esta tabla muestra los mapas de base que están disponibles en estos momentos y se pueden emplear en el dominio. Consta de 5 columnas:

source: |icon-reorder| to change the order of the basemaps. The first one is the default one on the whole domain.
es: |icon-reorder|: para cambiar el orden de los mapas de base. El primero es el predeterminado en todo el dominio.

source: Label: to name the basemaps. Each basemap should have one label per language available on the domain.
es: Etiqueta: para denominar los mapas de base. Cada uno de los mapas de base debe tener una etiqueta por idioma disponible en el dominio.

source: Basemap: to choose the basemap.
es: Mapa de base: para elegir el mapa de base.

source: Preview: to see what the basemaps look like.
es: Vista previa: para ver cuál es la apariencia de los mapas de base.

source: |icon-trash| to delete a basemap.
es: |icon-trash|: para suprimir un mapa de base.

source: Adding default basemaps
es: Añadir mapas de base predeterminados

source: By default, OpenDataSoft provides several basemaps. They are the default basemaps displayed in the drop-down menu of the Basemap table column (described in the introduction of this documentation). All these default basemaps can be made available on the platform, using the table. Even though the basemaps appear in the list of default basemaps, they will only be usable once added to the table.
es: De forma predeterminada, OpenDataSoft proporciona varios mapas de base. Estos son los mapas de base predeterminados que aparecen en el menú desplegable de la columna de la tabla Mapa de base (descrita en la introducción de esta documentación). Todos estos mapas de base predeterminados pueden establecerse como disponibles en la plataforma, por medio de la tabla. Aunque los mapas de base figuren en la lista de mapas de base predeterminados, solo se podrán usar una vez añadidos a la tabla.

source: To add default basemaps to the table and make them available on the domain:
es: Para añadir mapas de base predeterminados a la tabla y establecerlos como disponibles en el dominio:

source: Click on the "Add basemap" button under the table.
es: Haga clic en el botón "Añadir mapa de base" debajo de la tabla.

source: In the Basemap column, click on the drop-down menu. By default, it should display "Streets" (default basemap for all OpenDataSoft domains).
es: En la columna Mapa de base, haga clic en el menú desplegable. De forma predeterminada, se mostrará "Calles" (el mapa de base predeterminado de todos los dominios de OpenDataSoft).

source: The drop-down menu indicates all basemaps available in the domain, ordered by basemap providers. Click on the basemap to add to the domain.
es: El menú desplegable indica todos los mapas de base disponibles en el dominio, ordenados por proveedores de mapas de base. Haga clic en el mapa de base para añadirlo al dominio.

source: In the Label column, indicate a label for the newly added basemap. There must be one label per language (if the domain supports more than one), otherwise the configurations cannot be saved.
es: En la columna Etiqueta, indique una etiqueta para el mapa de base que acaba de añadir. Debe haber una etiqueta por idioma (si el dominio admite más de uno) o, de lo contrario, no podrán guardarse las configuraciones.

source: Click on the "Save" button in the top right corner of the page.
es: Haga clic en el botón "Guardar" de la esquina superior derecha de la página.

source: Adding custom basemaps
es: Añadir mapas de base personalizados

source: Among the default basemaps, displayed in the drop-down menu of the Basemap table column (described in the introduction of this documentation), are 2 options that allow the addition of custom basemaps:
es: Entre los mapas de base predeterminados que figuran en el menú desplegable de la columna de la tabla Mapa de base (descrita en la introducción de esta documentación), hay 2 opciones que permiten añadir mapas de base personalizados:

source: "Custom", to add TMS and other OpenStreetMap compatible basemaps
es: "Personalizado", para añadir mapas de base TMS y otros compatibles con OpenStreetMap

source: "Custom (WMS)", to add WMS basemaps
es: "Personalizado (WMS)", para añadir mapas de base WMS

source: WMTS basemaps are not supported by the OpenDataSoft platform.
es: Los mapas de base WMTS no están permitidos en la plataforma OpenDataSoft.

source: To add a custom basemap to the domain:
es: Para añadir un mapa de base personalizado al dominio:

source: Click on the "Add basemap" button.
es: Haga clic en el botón "Añadir mapa de base".

source: In the Basemap column of the newly added row of the table, click on the drop-down menu.
es: En la columna Mapa de base de la fila de la tabla acabada de añadir, haga clic en el menú desplegable.

source: In the drop-down menu, select either "Custom" or "Custom (WMS)".
es: En el menú desplegable, seleccione "Personalizado" o "Personalizado (WMS)".

source: Fill up the basemap configurations.
es: Especifique las configuraciones del mapa de base.

source: If adding a "Custom" basemap, please refer to the table below:
es: Si añade un mapa de base "Personalizado", consulte la tabla siguiente:

source: Name
es: Nombre

source: Description
es: Descripción

source: Example
es: Ejemplo

source: Tiles URL (required)
es: URL de teselas (obligatoria)

source: URL of the basemap.
es: URL del mapa de base.

source: ``http://tile.basemapprovider.io/{z}/{x}/{y}.png``
es: ``http://tesela.proveedormapabase.io/{z}/{x}/{y}.png``

source: Subdomains
es: Subdominios

source: Subdomains of the basemap (provided by the basemap provider). Subdomains must be separated with a comma.
es: Subdominios del mapa de base (proporcionado por el proveedor del mapa de base). Los subdominios deben ir separados por una coma.

source: Zoom min
es: Zoom mín.

source: Minimum zoom available (the most global view we can have of the map).
es: Zoom mínimo disponible (la vista más global que se puede tener del mapa).

source: Zoom max
es: Zoom máx.

source: Maximum zoom available (the closer we can be into the map).
es: Zoom máximo disponible (la vista más cercana que podemos tener del mapa).

source: Attribution
es: Atribución

source: Source of the basemap data. Will be displayed at the bottom of the basemap everywhere it is used.
es: Origen de los datos del mapa de base. Se visualizará en la parte inferior del mapa de base en cualquier lugar donde se utilice.

source: Basemap data from OpenStreetMap
es: Datos de mapas de base de OpenStreetMap

source: TMS service
es: Servicio TMS

source: Should only be checked in case the basemap is a strict TMS basemap, with inverted coordinates.
es: Solo debe marcarse si el mapa de base es un mapa de base TMS estricto, con coordenadas invertidas.

source: If adding a "Custom (WMS)" basemap, please refer to the table below:
es: Si añade un mapa de base "Personalizado (WMS)", consulte la tabla siguiente:

source: WMS URL (required)
es: URL de WMS (obligatoria)

source: ``https://www.basemapprovider.com/wms``
es: ``https://www.proveedormapabase.com/wms``

source: Layers (required)
es: Capas (obligatorias)

source: Layer(s) of the basemap (provided by the basemap provider).
es: Capa(s) del mapa de base (proporcionado por el proveedor del mapa de base).

source: Tiles images format
es: Formato de las imágenes de teselas

source: Format of the tiles: either .png or .jpeg (provided by the basemap provider).
es: Formato de las teselas: .png o .jpeg (proporcionado por el proveedor del mapa de base).

source: Styles
es: Estilos

source: Styles of the basemap (provided by the basemap provider).
es: Estilos del mapa de base (proporcionado por el proveedor del mapa de base).

source: In the Label column, indicate a label for the newly added basemap. There must be one label per language (if the domain supports more than one).
es: En la columna Etiqueta, indique una etiqueta para el mapa de base que acaba de añadir. Debe haber una etiqueta por idioma (si el dominio admite más de uno).

source: Adding external basemaps
es: Añadir mapas de base externos

source: OpenDataSoft allows the addition of external basemaps through specific integrations.
es: OpenDataSoft permite añadir mapas de base externos por medio de integraciones específicas.

source: Currently, the only available integration is with Mapbox.
es: En la actualidad, la única integración disponible es con Mapbox.

source: Although `Thunderforest <https://www.thunderforest.com/>`_ is presented in the interface as an available integration like Mapbox, it does not allow the integration of other Thunderforest basemaps. It only allows to have more quotas on the 2 Thunderforest basemaps available in the default basemaps list ("OpenCycleMap" and "OSM Transport").
es: Aunque `Thunderforest <https://www.thunderforest.com/>`_ se presenta en la interfaz como si fuera una integración disponible como Mapbox, no permite la integración de otros mapas de base Thunderforest. Solo permite tener más cuotas en los 2 mapas de base Thunderforest disponibles en la lista de mapas de base predeterminados ("OpenCycleMap" y "OSM Transport").

source: To fully use the default Thunderforest basemaps instead of within the default, limited quotas:
es: Para usar plenamente los mapas de base Thunderforest en lugar de limitarse a las cuotas predeterminadas:

source: Go to the Thunderforest website, logged in.
es: Vaya al sitio web de Thunderforest e inicie la sesión.

source: In the `Thunderforest console page <https://manage.thunderforest.com/dashboard>`_, copy the API Key.
es: En la `página de la consola Thunderforest <https://manage.thunderforest.com/dashboard>`_, copie la clave de API.

source: Go back to the Look & feel > Data Visualizations subsection of the OpenDataSoft's domain back office.
es: Vuelva a la subsección Apariencia > Visualizaciones de datos del back office del dominio de OpenDataSoft.

source: In the "Basemaps" area, click on "Thunderforest integration" to expand the related configurations.
es: En el área "Mapas de base", haga clic en "Integración de Thunderforest" para expandir las configuraciones relacionadas.

source: Paste the API Key in the textbox.
es: Pegue la clave de API en el cuadro de texto.

source: Mapbox integration
es: Integración de Mapbox

source: `Mapbox <https://www.mapbox.com/>`_ is a mapping platform that allows to build and design custom maps. They also provide a dozen different map styles that can be directly used. OpenDataSoft allows to integrate these Mapbox basemaps into an OpenDataSoft domain, to make them usage throughout the portal.
es: `Mapbox <https://www.mapbox.com/>`_ es una de mapas que le permite compilar y diseñar mapas personalizados. También proporciona una docena de estilos de mapa para usar directamente. OpenDataSoft permite integrar estos mapas de base Mapbox en un dominio OpenDataSoft a fin de poder usarlos en el portal.

source: Prerequisite
es: Requisito previo

source: A Mapbox account is required. It is possible to create a Mapbox account for free, although it is going to have a small number of allowed "map views". See `Mapbox plans <https://www.mapbox.com/plans/>`_ for more information.
es: Es necesaria una cuenta Mapbox. Se puede crear una cuenta Mapbox gratis, aunque esta tendrá un número reducido de "vistas de mapas" permitidas. Consulte los `planes de Mapbox <https://www.mapbox.com/plans/>`_ para obtener más información.

source: To integrate Mapbox basemaps:
es: Para integrar los mapas de base Mapbox:

source: Go to the Mapbox website, logged in.
es: Vaya al sitio web de Mapbox e inicie la sesión.

source: In the `Mapbox account page <https://www.mapbox.com/account/apps/>`_, either copy the Default Public Token, or create a new Public Token and copy it. This will be used by OpenDataSoft to display maps on the behalf of the user's own Mapbox account.
es: En la `página de la cuenta Mapbox <https://www.mapbox.com/account/apps/>`_, copie el token público predeterminado, o cree un token público nuevo y cópielo. OpenDataSoft lo utilizará para visualizar los mapas en nombre de la propia cuenta Mapbox del usuario.

source: In the "Basemaps" area, click on "Mapbox integration" to expand the related configurations.
es: En el área "Mapas de base", haga clic en "Integración de Mapbox" para expandir las configuraciones relacionadas.

source: Paste the Public Token in the textbox. A message will confirm whether the access token is valid or not.
es: Pegue el token público en el cuadro de texto. Un mensaje confirmará si el token de acceso es válido o no.

source: Using the basemaps table, it is now possible to select one of Mapbox's default styles, or choose "Custom" to enter the MapID of a custom created map.
es: Mediante la tabla de mapas de base, ahora es posible seleccionar uno de los estilos predeterminados de Mapbox o elegir "Personalizado" para especificar el ID de mapa de un mapa creado personalizado.
