Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/04_configuring_data_visualizations/data_visualizations.po
Languages: de, fr, nl

source: Configuring the data visualizations
de: Konfigurieren der Datenvisualisierung
fr: Configurer les visualisations de données
nl: De weergaves van data configureren

source: Although the visualizations of the created datasets are configured both in terms of content and appearance from the edition interface of the datasets themselves, some other global data visualizations configurations such as custom default chart colors, available basemaps, and default map locations, are managed from the **Look & feel > Data visualizations** subsection of the back office.
de: Zwar werden die Visualisierungen der erstellten Datensätze sowohl inhaltlich als auch in der Darstellung über die Bearbeitungsoberfläche der Datensätze selbst konfiguriert, einige andere globale Datenvisualisierungen wie benutzerdefinierte Standardfarben für Diagramme, verfügbare Grundkarten und Standardpositionen für Karten werden jedoch über den Unterabschnitt **Aussehen & Eindruck > Datenvisualisierungen** im Back-Office verwaltet.
fr: Même si le contenu et l'apparence des visualisations des jeux de données créés sont configurés dans l'interface d'édition des jeux de données, la sous-section **Apparence > Visualisations de données** de l'interface d'administration permet de gérer d'autres configurations de visualisations de données globales (p. ex. couleurs du graphe par défaut personnalisées, fonds de carte disponibles et localisations de carte par défaut).
nl: Hoewel de weergaves van de aangemaakte datasets worden geconfigureerd zowel in termen van inhoud en voorkomen vanuit de bewerkingsinterface van de datasets zelf, worden enkele andere globale configuraties van dataweergaves, zoals gepersonaliseerde standaard grafiekkleuren, beschikbare basiskaarten en standaard kaartlocaties, beheerd vanuit de subrubriek **Look & feel > Dataweergaves** van de back-office.

source: Configuring chart default colors
de: Konfigurieren der Standardfarben für Diagramme
fr: Configurer les couleurs du graphe par défaut
nl: Standaard grafiekkleuren configureren

source: Charts are composed of at least one color, but depending on what they represent they can be composed of many more. By default, a set of 8 colors is used, and Opendatasoft users also have the possibility to use other sets of colors that are available by default as well. The Chart colors configuration allows to define a new set of colors, that will replace the original 8-colors set.
fr: Les graphes sont composés d'une couleur minimum. En fonction de ce qu'ils représentent, plusieurs autres couleurs peuvent venir s'ajouter. Par défaut, un ensemble de 8 couleurs est utilisé, et les utilisateurs Opendatasoft ont également la possibilité d'utiliser d'autres ensembles de couleurs, disponibles par défaut. La configuration Couleurs des graphiques permet de définir un nouvel ensemble de couleurs, qui remplacera l'ensemble de 8 couleurs d'origine.

source: To add a new default chart color:
de: Hinzufügen einer neuen Standardfarbe für Diagramme:
fr: Pour ajouter une nouvelle couleur de graphe par défaut :
nl: Om een nieuwe standaard grafiekkleur toe te voegen:

source: In the **Data visualizations** configuration interface, look for the **Chart color** configuration.
de: Suchen Sie die Konfiguration für die **Diagrammfarbe** in der Konfigurationsoberfläche **Datenvisualisierungen**.
fr: Dans l'interface de configuration **Visualisations de données**, recherchez la configuration **Couleurs des graphiques**.
nl: Zoek in de configuratie-interface **Dataweergaves** naar de configuratie **Grafiekkleur**.

source: Click on the + Add color button.
de: Klicken Sie auf den Button + Farbe hinzufügen.
fr: Cliquez sur le bouton + Ajouter une couleur.
nl: Klik op de knop "Kleur toevoegen".

source: Add the hexadecimal code of the new color, or click the color button to choose a new color using either the Nice colors, or the Color wheel.
fr: Ajoutez le code hexadécimal de la nouvelle couleur ou cliquez sur le bouton Couleur pour choisir une nouvelle couleur via Jolies couleurs ou Roue colorimétrique.

source: (optional) Click the reorder |icon-reorder| button to reorganise the new color among the others. The order of the colors matters because they will be used one after the other by the chart.
fr: (optionnel) Cliquez sur le bouton de réorganisation |icon-reorder| pour réorganiser la nouvelle couleur parmi les autres. L'ordre des couleurs est important, puisqu'elles seront utilisées les unes après les autres par le graphe.

source: Click the Save button in the top right corner of the page.
de: Klicken Sie oben rechts auf den Button "Speichern".
fr: Cliquez sur le bouton Enregistrer en haut à droite de la page.
nl: Klik op de knop Opslaan in de rechter bovenhoek van de pagina.

source: To delete a color, click the trash |icon-trash| button.
de: Um eine Farbe zu löschen, klicken Sie auf den Papierkorb-Button |icon-trash|.
fr: Pour supprimer une couleur, cliquez sur le bouton de suppression |icon-trash|.
nl: Om een kleur te wissen, klik op de knop |icon-trash|.

source: Caution
de: Vorsicht
fr: Avertissement
nl: Opgelet

source: Be careful when deleting chart colors: visualizations configured with these specific custom colors may break.
de: Seien Sie vorsichtig, wenn Sie Diagrammfarben löschen: Visualisierungen, die mit diesen speziell angepassten Farben konfiguriert wurden, könnten beschädigt werden.
fr: Faites preuve de vigilance si vous supprimez des couleurs du graphe : les visualisations configurées avec ces couleurs personnalisées peuvent être affectées.
nl: Wees voorzichtig wanneer u grafiekkleuren wist: weergaves die geconfigureerd zijn met deze specifiek gepersonaliseerde kleuren verloren gaan.

source: Adding basemaps
de: Grundkarten hinzufügen
fr: Ajouter des fonds de carte
nl: Basiskaarten toevoegen

source: Basemaps are the canvas on which geographic data are represented. They are used for any map displayed on Opendatasoft, whether it is the visualization map of a dataset or the Map Builder.
de: Grundkarten sind die Grundlage, auf der geografische Daten dargestellt werden. Sie werden für alle Karten verwendet, die auf Opendatasoft angezeigt werden - egal ob es sich um die Kartenvisualisierung eines Datensatzes oder den Map Builder handelt.
fr: Les fonds de carte correspondent au canevas sur lequel des données géographiques sont représentées. Ils sont utilisés pour toutes les cartes affichées sur Opendatasoft, qu'il s'agisse de la carte de visualisation d'un jeu de données ou de l'Editeur de cartes.
nl: Basiskaarten zijn het canvas waarop geografische data worden weergegeven. Ze worden gebruikt voor alle kaarten die weergegeven worden op Opendatasoft, ongeacht of het de visualisatiekaart van een dataset of de Map Builder is.

source: A basic basemap is used by default for all maps of all Opendatasoft domains. It is however possible to change that default basemap, as well as to make other basemaps available in an Opendatasoft portal. It will allow users to change the basemap at any time on a map, and even to change the default basemap of a specific dataset.
fr: Par défaut, un fond de carte basique est utilisé pour toutes les cartes de l'ensemble des domaines Opendatasoft. Vous avez néanmoins la possibilité de modifier ce fond de carte par défaut, ainsi que de proposer d'autres fonds de carte dans un portail Opendatasoft. Ainsi, les utilisateurs pourront changer de fond de carte à tout moment, et même le fond de carte par défaut d'un jeu de données spécifique.

source: Note
de: Hinweis
fr: Remarque
nl: Opmerking

source: To know more about basemaps and how to use them, you can read our blog post "`What is a basemap & how to choose the best one for your data <https://www.opendatasoft.com/2015/09/03/what-is-a-basemap-and-how-to-choose-the-best-one-for-your-data/>`_".
fr: Pour en apprendre davantage sur les fonds de carte et leur utilisation, vous pouvez consulter notre article de blog, en anglais, intitulé "`What is a basemap & how to choose the best one for your data (Présentation d'un fond de carte et comment en choisir un adapté à vos données) <https://www.opendatasoft.com/2015/09/03/what-is-a-basemap-and-how-to-choose-the-best-one-for-your-data/>`_".

source: To manage basemaps, look for the **Basemaps** configuration in the **Data visualizations** configuration interface.
de: Um Grundkarten anzupassen, suchen Sie die Konfiguration für **Grundkarten** in der Konfigurationsoberfläche **Datenvisualisierungen**.
fr: Pour gérer les fonds de carte, recherchez la configuration **Fonds de carte** dans l'interface de configuration **Visualisations de données**.
nl: Om basiskaarten te beheren, zoek dan in de configuratie-interface **Dataweergaves** naar de configuratie **Basiskaarten**.

source: Basemaps should be managed from the table of the Basemaps configuration. This table displays the currently available basemaps that can be used on the domain. It comprises 3 columns:
de: Grundkarten sollten über die Tabelle der Grundkarten-Konfiguration verwaltet werden. In dieser Tabelle werden die aktuell verfügbaren Grundkarten angezeigt, die für die Domain verwendet werden können. Sie umfasst 3 Spalten:
fr: Les fonds de carte doivent être gérés via le tableau de la configuration Fonds de carte. Ce dernier contient les fonds de carte actuellement disponibles, qui peuvent être utilisés sur le domaine. Il est constitué de 3 colonnes :
nl: Basiskaarten zouden beheerd moeten worden vanuit de tabel van de configuratie Basiskaarten. In deze tabel staan de momenteel beschikbare basiskaarten die op het domein gebruikt kunnen worden. Ze bestaat uit 3 kolommen:

source: **Label**, to name the basemaps. Each basemap should have one label per language available on the domain.
de: **Beschriftung**, um die Grundkarten zu benennen. Für jede Grundkarte sollte jeweils eine Beschriftung pro Sprache auf der Domain verfügbar sein.
fr: **Label**, pour donner un nom aux fonds de carte. Chaque fond de carte doit avoir un label par langue disponible sur le domaine.
nl: **Label**, om de basiskaarten een naam te geven. Elke basiskaart zou één label per taal beschikbaar moeten hebben op het domein.

source: **Basemap**, to choose the basemap
de: **Grundkarte**, um die Grundkarte auszuwählen
fr: **Fond de carte**, pour choisir le fond de carte.
nl: **Basiskaart**, om de basiskaart te kiezen

source: **Preview**, to see what the basemaps look like
de: **Vorschau**, um zu sehen, wie die Grundkarten aussehen
fr: **Aperçu**, pour voir à quoi ressemblent les fonds de carte.
nl: **Voorbeeldweergave**, om te zien hoe de basiskaarten eruit zien

source: The basemaps table also contains 2 options:
de: Die Grundkarten-Tabelle enthält zudem 2 Optionen:
fr: Par ailleurs, le tableau de fonds de carte présente 2 options :
nl: De tabel met basiskaarten bevat ook 2 opties:

source: |icon-reorder| to change the order of the basemaps. The first one is the default one on the whole domain.
de: |icon-reorder| um die Reihenfolge der Grundkarten zu ändern. Die Erste ist die Standard-Grundkarte für die gesamte Domain.
fr: |icon-reorder| pour modifier l'ordre des fonds de carte. Le premier élément correspond au fond de carte par défaut sur l'ensemble du domaine.
nl: |icon-reorder| om de volgorde van de basiskaarten te wijzigen. De eerste is de standaardkaart voor het volledige domein.

source: |icon-trash| to delete a basemap
de: |icon-trash|, um eine Grundkarte zu löschen
fr: |icon-trash| pour supprimer un fond de carte.
nl: |icon-trash| om een basiskaart te wissen

source: Adding default basemaps
de: Standard-Grundkarten hinzufügen
fr: Ajouter des fonds de carte par défaut
nl: Standaard basiskaarten toevoegen

source: By default, Opendatasoft provides several basemaps. They are the default basemaps displayed in the drop-down menu of the Basemap table column. All these default basemaps can be made available on the platform, using the table. Even though the basemaps appear in the list of default basemaps, they will only be usable once added to the table.
fr: Opendatasoft propose plusieurs fonds de carte par défaut. Ces derniers sont affichés dans le menu déroulant de la colonne Fond de carte du tableau. Tous ces fonds de carte par défaut peuvent être mis à disposition sur la plateforme, via le tableau. Bien que les fonds de carte s'affichent dans la liste des fonds de carte par défaut, ils ne pourront être utilisés qu'une fois ajoutés au tableau.

source: To add default basemaps to the table and make them available on the domain:
de: So gehen Sie vor, um der Tabelle Standard-Grundkarten hinzuzufügen und sie auf der Domain bereitzustellen:
fr: Pour ajouter des fonds de carte par défaut au tableau et les mettre à disposition sur le domaine :
nl: Om standaard basiskaarten aan de tabel toe te voegen en deze beschikbaar te stellen op het domein:

source: Click on the + Add basemap button under the table.
de: Klicken Sie unter der Tabelle auf den Button + Grundkarte hinzufügen.
fr: Cliquez sur le bouton + Ajouter un fond de carte sous le tableau.
nl: Klik op de knop "Basiskaart toevoegen" onder de tabel.

source: In the Basemap column, click on the drop-down menu. By default, it should display "Streets" (default basemap for all Opendatasoft domains).
de: Klicken Sie in der Grundkarten-Spalte auf das Dropdown-Menü. Standardmäßig sollte "Straßen" angezeigt werden (Standard-Grundkarte für alle Opendatasoft-Domains).
fr: Dans la colonne Fond de carte, cliquez sur le menu déroulant. "Streets" (le fond de carte par défaut de tous les domaines Opendatasoft) doit s'afficher.
nl: Klik in de kolom Basemap op het drop-down menu. Standaar wordt "Straten" weergegeven (standaard basiskaart voor alle Opendatasoft-domeinen).

source: The drop-down menu indicates all basemaps available in the domain, ordered by basemap providers. Click on the basemap to add to the domain.
de: Im Dropdown-Menü werden alle verfügbaren Grundkarten der Domain angezeigt, geordnet nach Anbietern der jeweiligen Grundkarte. Klicken Sie auf die gewünschte Grundkarte, um sie der Domain hinzuzufügen.
fr: Le menu déroulant répertorie tous les fonds de carte disponibles dans le domaine, classés par fournisseurs de fonds de carte. Cliquez sur le fond de carte pour l'ajouter au domaine.
nl: Het drop-down menu geeft alle basiskaarten weer die beschikbaar zijn in het domein, in volgorde van de providers van basiskaarten. Klik op de basiskaart op deze aan het domein toe te voegen.

source: In the Label column, indicate a label for the newly added basemap. There must be one label per language (if the domain supports more than one), otherwise the configurations cannot be saved.
de: Geben Sie in der Spalte "Beschriftung" eine Bezeichnung für die neu hinzugefügte Grundkarte an. Sie müssen eine Beschriftung pro Sprache angeben (wenn die Domain in mehreren Sprachen angeboten wird), andernfalls können die Konfigurationen nicht gespeichert werden.
fr: Dans la colonne Label, indiquez un label pour le fond de carte nouvellement ajouté. Il ne doit y avoir qu'un seul label par langue (si le domaine en prend en charge plusieurs), sinon les configurations ne peuvent pas être enregistrées.
nl: Geef in de kolom Label een label voor nieuw toegevoegde basiskaarten. Er moet één label per taal zijn (wanneer het domein meer dan één ondersteunt). Zo niet kunnen de configuraties niet worden opgeslagen.

source: Click on the Save button in the top right corner of the page.
de: Klicken Sie oben rechts auf den Button "Speichern".
fr: Cliquez sur le bouton Enregistrer en haut à droite de la page.
nl: Klik op de knop Opslaan in de rechter bovenhoek van de pagina.

source: Adding custom basemaps
de: Benutzerdefinierte Grundkarten hinzufügen
fr: Ajouter des fonds de carte personnalisés
nl: Gepersonaliseerde basiskaarten toevoegen

source: Among the default basemaps, displayed in the drop-down menu of the Basemap table column, are 2 options that allow the addition of custom basemaps:
de: Zu den standardmäßigen Grundkarten, die im Dropdown-Menü der Tabellenspalte "Grundkarte" angezeigt werden, gehören 2 Optionen, die das Hinzufügen benutzerdefinierter Grundkarten ermöglichen:
fr: Parmi les fonds de carte par défaut, qui sont affichés dans le menu déroulant de la colonne Fond de carte du tableau, 2 options vous permettent d'ajouter des fonds de carte personnalisés :
nl: Onder de standaard basiskaarten die in het drop-down menu van de tabelkolom Basiskaart weergegeven staan, zijn 2 opties waarmee gepersonaliseerde basiskaarten kunnen worden toegevoegd:

source: "Custom", to add TMS and other OpenStreetMap compatible basemaps
de: "Benutzerdefiniert", um TMS- und andere mit OpenStreetMap kompatible Grundkarten hinzuzufügen
fr: "Personnalisé" pour ajouter des fonds de carte TMS et d'autres fonds de carte compatibles OpenStreetMap
nl: "Custom" om TMS en andere met OpenStreetMap compatibele basiskaarten toe te voegen

source: "Custom (WMS)", to add WMS basemaps
de: "Benutzerdefiniert (WMS)", um WMS-Grundkarten hinzuzufügen
fr: "Personnalisé (WMS)" pour ajouter des fonds de carte WMS
nl: "Custom (WMS)" om WMS-basiskaarten toe te voegen

source: WMTS basemaps are not supported by the Opendatasoft platform.
de: WMTS-Grundkarten werden von der Opendatasoft-Plattform nicht unterstützt.
fr: Les fonds de carte WMTS ne sont pas pris en charge par la plateforme Opendatasoft.
nl: WMTS basiskaarten worden niet ondersteund door het Opendatasoft-platform.

source: To add a custom basemap to the domain:
de: Um der Domain eine benutzerdefinierte Grundkarte hinzuzufügen:
fr: Pour ajouter un fond de carte personnalisé au domaine :
nl: Om een gepersonaliseerde basiskaart aan het domein toe te voegen:

source: Click on the + Add basemap button.
de: Klicken Sie auf den Button + Grundkarte hinzufügen.
fr: Cliquez sur le bouton + Ajouter un fond de carte.
nl: Klik op de knop "Basiskaart toevoegen".

source: In the Basemap column of the newly added row of the table, click on the drop-down menu.
de: Klicken Sie in der Grundkarten-Spalte der neu hinzugefügten Tabellenzeile auf das Dropdown-Menü.
fr: Dans la colonne Fond de carte de la nouvelle ligne du tableau, cliquez sur le menu déroulant.
nl: Klik in de kolom Basemap van de nieuw toegevoegde rij van de tabel op het drop-down menu.

source: In the drop-down menu, select either "Custom" or "Custom (WMS)".
de: Klicken Sie im Dropdown-Menü entweder auf "Benutzerdefiniert" oder auf "Benutzerdefiniert (WMS)".
fr: Dans le menu déroulant, sélectionnez "Personnalisé" ou "Personnalisé (WMS)".
nl: Selecteer in het drop-down menu ofwel "Custom" ofwel "Custom (WMS)".

source: Fill up the basemap configurations.
de: Füllen Sie die Grundkarten-Konfigurationen aus.
fr: Configurez le fond de carte.
nl: Vul de configuraties van de basiskaart in.

source: If adding a "Custom" basemap, please refer to the table below:
de: Wenn Sie eine "benutzerdefinierte" Grundkarte hinzufügen, beachten Sie bitte die folgende Tabelle:
fr: Si vous choisissez un fond de carte "Personnalisé", reportez-vous au tableau ci-dessous :
nl: Wanneer een "Custom" basiskaart wordt toegevoegd, zie de onderstaande tabel:

source: Name
fr: Nom
nl: Naam

source: Example
de: Beispiel
fr: Exemple
nl: Voorbeeld

source: Tiles URL (required)
de: URL der Kacheln (erforderlich)
fr: URL des tuiles (obligatoire)
nl: URL tegels (verplicht)

source: URL of the basemap.
de: URL der Grundkarte.
fr: URL du fond de carte.
nl: URL van de basiskaart.

source: Subdomains
fr: Sous-domaines
nl: Subdomeinen

source: Subdomains of the basemap (provided by the basemap provider). Subdomains must be separated with a comma.
de: Subdomains der Grundkarte (vom Anbieter der Grundkarte bereitgestellt). Subdomains müssen durch ein Komma getrennt werden.
fr: Sous-domaines du fond de carte (proposés par le fournisseur de fonds de carte). Les sous-domaines doivent être séparés par une virgule.
nl: Subdomeinen van de basiskaart (aangeleverd door de provider van de basiskaart). Subdomeinen moet van elkaar gescheiden zijn door een komma.

source: Zoom min
de: Min. Zoom
fr: Zoom minimum

source: Minimum zoom available (the most global view we can have of the map).
de: Verfügbarer minimaler Zoom (die umfassendste Ansicht, die wir von der Karte haben können).
fr: Zoom minimum disponible (la vue la plus globale possible de la carte).
nl: Minimale zoom beschikbaar (het meest globale beeld dat we van de kaart kunnen hebben).

source: Zoom max
de: Max. Zoom
fr: Zoom maximum

source: Maximum zoom available (the closer we can be into the map).
de: Verfügbarer maximaler Zoom (die maximale Tiefe beim Heranzoomen der Karte).
fr: Zoom maximum disponible (la vue la plus rapprochée dans la carte).
nl: Maximale zoom beschikbaar (hoe dichter we in de kaart kunnen).

source: Source of the basemap data. Will be displayed at the bottom of the basemap everywhere it is used.
de: Quelle der Daten der Grundkarte. Wird immer unter der Grundkarte angezeigt.
fr: Source des données du fond de carte. Affichée en bas du fond de carte, quel que soit l'endroit où il est utilisé.
nl: Bron van de data van basiskaart. Wordt onderaan de basiskaart weergegeven overal waar ze wordt gebruikt.

source: Basemap data from OpenStreetMap
de: Grundkarten-Daten aus OpenStreetMap
fr: Données de fond de carte d'OpenStreetMap
nl: Data van de basiskaart uit OpenStreetMap

source: TMS service
fr: Service TMS

source: Should only be checked in case the basemap is a strict TMS basemap, with inverted coordinates.
de: Sollte nur angekreuzt werden, wenn die Grundkarte eine reine TMS-Grundkarte mit invertierten Koordinaten ist.
fr: Cette option doit être sélectionnée uniquement si le fond de carte est un fond de carte TMS strict avec des coordonnées inversées.
nl: Moet enkel worden gecontroleerd wanneer de basiskaart een strikte TMS-basiskaart is met omgekeerde coördinaten.

source: If adding a "Custom (WMS)" basemap, please refer to the table below:
de: Wenn Sie eine "benutzerdefinierte (WMS)" Grundkarte hinzufügen, beachten Sie bitte die folgende Tabelle:
fr: Si vous choisissez un fond de carte "Personnalisé (WMS)", reportez-vous au tableau ci-dessous :
nl: Wanneer een "Custom (WMS)" basiskaart wordt toegevoegd, zie de onderstaande tabel:

source: WMS URL (required)
de: WMS-URL (erforderlich)
fr: URL WMS (obligatoire)
nl: WMS URL (verplicht)

source: Layers (required)
de: Ebenen (erforderlich)
fr: Calques (obligatoire)
nl: Lagen (verplicht)

source: Layer(s) of the basemap (provided by the basemap provider).
de: Ebene(n) der Grundkarte (vom Anbieter der Grundkarte bereitgestellt).
fr: Calque(s) du fond de carte (proposés par le fournisseur de fonds de carte).
nl: La(a)g(en) van de basiskaart (aangeleverd door de provider van de basiskaart).

source: LayerName
fr: NomCalque

source: Tiles images format
de: Bildformat der Kacheln
fr: Format des images des tuiles
nl: Formaat van de tegelafbeeldingen

source: Format of the tiles: either .png or .jpeg (provided by the basemap provider).
de: Format der Kacheln: .png oder .jpeg (vom Anbieter der Grundkarte bereitgestellt).
fr: Format des tuiles : .png ou .jpeg (proposé par le fournisseur de fonds de carte).
nl: Formaat van de tegels: ofwel .png ofwel .jpeg (aangeleverd door de provider van de basiskaart).

source: Styles of the basemap (provided by the basemap provider).
de: Formatvorlagen der Grundkarte (vom Anbieter der Grundkarte bereitgestellt).
fr: Styles du fond de carte (proposés par le fournisseur de fonds de carte).
nl: Stijlen van de basiskaart (aangeleverd door de provider van de basiskaart)

source: DefaultStyle
fr: StyleParDéfaut
