Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/04_configuring_data_visualizations/data_visualizations.po
Languages: de, fr, nl

source: In the Label column, indicate a label for the newly added basemap. There must be one label per language (if the domain supports more than one).
de: Geben Sie in der Spalte "Beschriftung" eine Bezeichnung für die neu hinzugefügte Grundkarte an. Sie müssen eine Beschriftung pro Sprache angeben (wenn die Domain in mehreren Sprachen angeboten wird).
fr: Indiquez un label pour le fond de carte nouvellement ajouté dans la colonne Label. Il doit y avoir un label par langue (si le domaine en prend plusieurs en charge).
nl: In de kolom Label staat een label voor de nieuw toegevoegde basiskaart. Er moet minstens één label per taal zijn (wanneer het domein meer dan één taal ondersteunt).

source: Adding external basemaps
de: Externe Grundkarten hinzufügen
fr: Ajouter des fonds de carte externes
nl: Externe basiskaarten toevoegen

source: Opendatasoft currently only allows the integration of Mapbox basemaps.
de: Opendatasoft ermöglicht derzeit ausschließlich die Integration von Mapbox-Grundkarten.
fr: Actuellement, Opendatasoft autorise uniquement l'intégration des fonds de carte Mapbox.
nl: Opendatasoft laat momenteel enkel de integratie van Mapbox-basiskaarten toe.

source: Although `Thunderforest <https://www.thunderforest.com/>`_ is presented in the interface as an available integration like Mapbox, it does not allow the integration of other Thunderforest basemaps. It only allows to have more quotas on the 2 Thunderforest basemaps available in the default basemaps list ("OpenCycleMap" and "OSM Transport").
de: Obwohl `Thunderforest <https://www.thunderforest.com/>`_ ebenso wie Mapbox in der Benutzeroberfläche als verfügbare Integration angezeigt wird, ist eine Integration anderer Thunderforest-Grundkarten nicht möglich. Es ist lediglich möglich, mehr Quoten auf den 2 Thunderforest-Grundkarten zu haben, die in der Liste der Standard-Grundkarten ("OpenCycleMap" und "OSM Transport") verfügbar sind.
fr: Même si `Thunderforest <https://www.thunderforest.com/>`_ est présenté dans l'interface en tant qu'intégration disponible comme Mapbox, cela ne permet pas l'intégration d'autres fonds de carte Thunderforest. Cela permet uniquement d'avoir des quotas plus élevés sur les 2 fonds de carte Thunderforest disponibles dans la liste de fonds de carte par défaut ("OpenCycleMap" et "OSM Transport").
nl: Hoewel `Thunderforest <https://www.thunderforest.com/>`_ voorgesteld wordt in de interface als een beschikbare integratie zoals Mapbox, laat het niet toe andere basiskaarten van Thunderforest te integreren. Het laat enkel toe meer quota's te hebben voor de 2 basiskaarten van Thunderforest die beschikbaar zijn in de lijst met standaard basiskaarten ("OpenCycleMap" en "OSM Transport").

source: To fully use the default Thunderforest basemaps instead of within the default, limited quotas:
de: Gehen Sie wie folgt vor, um die standardmäßigen Thunderforest-Grundkarten vollständig zu nutzen, anstatt innerhalb der üblichen begrenzten Quoten:
fr: Pour tirer pleinement parti des fonds de carte Thunderforest par défaut plutôt que d'être restreint par les quotas limités par défaut :
nl: Om de standaard basiskaarten van Thunderforest te gebruiken in plaats van binnen de standaard, beperkte quota's:

source: Go to the Thunderforest website, logged in.
fr: Identifiez-vous pour accéder au site web Thunderforest.

source: In the `Thunderforest console page <https://manage.thunderforest.com/dashboard>`_, copy the API Key.
fr: Sur la `page de la console Thunderforest <https://manage.thunderforest.com/dashboard>`_, copiez la clé d'API.

source: Go back to the **Look & feel > Data Visualizations** subsection of the Opendatasoft's domain back office.
de: Wechseln Sie erneut zu dem Unterabschnitt **Aussehen & Eindruck > Datenvisualisierungen** im Back-Office-Menü von Opendatasoft.
fr: Revenez à la sous-section **Apparence > Visualisations de données** de l'interface d'administration du domaine Opendatasoft.
nl: Keer terug naar de subrubriek **Look & Feel > Dataweergaves** van de back-office van het Opendatasoft-domein.

source: In the **Basemaps** configuration, click on "Thunderforest integration" to expand the related configurations.
de: Klicken Sie in der **Grundkarten**-Konfiguration auf "Thunderforest-Integration", um die zugehörigen Konfigurationen auszuklappen.
fr: Dans la configuration **Fonds de carte**, cliquez sur "Intégration Thunderforest" pour développer les configurations associées.
nl: Klik in de configuratie **Basiskaarten** op "Thunderforest-integratie* om de desbetreffende configuraties te vergroten.

source: Paste the API Key in the textbox.
de: Fügen Sie den API-Schlüssel in das Textfeld ein.
fr: Collez la clé d'API dans la zone de texte.
nl: Plak de API-sleutel in het tekstvak.

source: Mapbox integration
fr: Intégration Mapbox
nl: Integratie van Mapbox

source: `Mapbox <https://www.mapbox.com/>`_ is a mapping platform that allows to build and design custom maps. They also provide a dozen different map styles that can be directly used. Opendatasoft allows to integrate these Mapbox basemaps into an Opendatasoft domain, to make them usage throughout the portal.
fr: `Mapbox <https://www.mapbox.com/>`_ est une plateforme de cartographie permettant de construire et dessiner ses propres cartes. Cette plateforme met également à disposition de tous une dizaine de fonds de carte. Opendatasoft vous permet d'intégrer ces fonds de carte Mapbox à un domaine Opendatasoft pour les utiliser dans l'ensemble du portail.

source: Prerequisite
de: Voraussetzung
fr: Prérequis
nl: Voorvereiste

source: A Mapbox account is required. It is possible to create a Mapbox account for free, although it is going to have a small number of allowed "map views". See `Mapbox plans <https://www.mapbox.com/plans/>`_ for more information.
de: Es wird ein Mapbox-Konto benötigt. Ein solches Konto kann kostenlos erstellt werden. Es bietet jedoch nur eine geringe Anzahl von zulässigen "Kartenansichten". Weitere Informationen finden Sie hier: `Mapbox-Abonnements <https://www.mapbox.com/plans/>`_.
fr: Un compte Mapbox est obligatoire. Vous pouvez en créer un gratuitement, même si celui-ci ne permet qu'un nombre limité de vues. Vous pouvez vous référer aux `abonnements Mapbox <https://www.mapbox.com/plans/>`_ pour plus d'informations.
nl: U heeft een Mapbox-account nodig. Het is mogelijk een gratis Mapbox-account aan te maken, hoewel dit slechts een beperkt aantal toegelaten "kaartweergaves" biedt. Zie `Mapbox plans <https://www.mapbox.com/plans/>`_ voor meer informatie.

source: To integrate Mapbox basemaps:
de: Gehen Sie wie folgt vor, um Mapbox-Grundkarten zu integrieren:
fr: Pour intégrer des fonds de carte Mapbox :
nl: Om Mapbox-basiskaarten te integreren:

source: Go to the Mapbox website, logged in.
fr: Identifiez-vous pour accéder au site web Mapbox.

source: In the `Mapbox account page <https://www.mapbox.com/account/apps/>`_, either copy the Default Public Token, or create a new Public Token and copy it. This will be used by Opendatasoft to display maps on the behalf of the user's own Mapbox account.
fr: Sur la `page du compte Mapbox <https://www.mapbox.com/account/apps/>`_, copiez le jeton d'accès public par défaut ou créez-en un et copiez-le. C'est ce jeton d'accès qui permettra à Opendatasoft d'afficher des cartes pour le compte Mapbox de l'utilisateur.

source: In the **Basemaps** configuration, click on "Mapbox integration" to expand the related configurations.
de: Klicken Sie in der **Grundkarten**-Konfiguration auf "Mapbox-Integration", um die zugehörigen Konfigurationen auszuklappen.
fr: Dans la configuration **Fonds de carte**, cliquez sur "Intégration Mapbox" pour développer les configurations associées.
nl: Klik in de configuratie **Basiskaarten** op *Mapbox-integratie* om de desbetreffende configuraties te vergroten.

source: Paste the Public Token in the textbox. A message will confirm whether the access token is valid or not.
de: Fügen Sie den öffentliche Token in das Textfled ein. Eine Meldung bestätigt, ob das Zugriffstoken gültig ist oder nicht.
fr: Copiez le jeton d'accès public dans la zone de texte. Un message vous confirme si le jeton d'accès est valide ou non.
nl: Plak het Public Token in het tekstvak. Een bericht zal bevestigen of het toegangstoken al dan niet geldig is.

source: Using the basemaps table, it is now possible to select one of Mapbox's default styles, or choose "Custom" to enter the MapID of a custom created map.
fr: À l'aide du tableau de fonds de carte, vous pouvez désormais sélectionner l'un des styles par défaut de Mapbox ou choisir l'option "Personnalisé" pour entrer le MapID d'une carte personnalisée.

source: Defining a default Map Builder location
de: Eine Standardposition für den Kartenersteller festlegen
fr: Définir un emplacement d'éditeur de cartes par défaut
nl: Een standaard Map Builder-locatie definiëren

source: The Map Builder is Opendatasoft's tool to create advanced maps using one or more published dataset from one or more Opendatasoft portal. The Default map builder location configuration allows to define which location the Map Builder will focus on by default when landing on it.
de: Bei dem Kartenersteller handelt es sich um das Tool von Opendatasoft zur professionellen Erstellung von Karten aus einem oder mehreren Datensätzen von einem oder mehreren Opendatasoft-Portalen. Die Konfiguration einer Standardposition für den Kartenersteller sorgt dafür, dass diese beim Öffnen des Werkzeugs im Zentrum angezeigt wird.
fr: L'éditeur de cartes est l'outil d'Opendatasoft pour créer des cartes avancées à l'aide d'un ou de plusieurs jeux de données publiés dans un ou plusieurs portails Opendatasoft. La configuration Emplacement de l'éditeur de cartes par défaut permet de définir l'emplacement sur lequel l'éditeur de cartes devra centrer par défaut en arrivant dessus.
nl: De Map Builder is een tool van Opendatasoft om geavanceerde kaarten te maken met een of meer gepubliceerde datasets uit een of meerdere portalen van Opendatasoft. De standaard configuratie van de locatie van de Map Builder laat toe de locatie te definiëren waarop de Map Builder zich standaard zal focussen wanneer hij erop terecht komt.

source: In the **Data visualizations** configuration interface, look for the **Default map builder location** configuration.
de: Suchen Sie die Konfiguration für die **Standardposition im Kartenersteller** in der Konfigurationsoberfläche **Datenvisualisierungen**.
fr: Dans l'interface de configuration **Visualisations de données**, recherchez la configuration **Emplacement de l'éditeur de cartes par défaut**.
nl: Zoek in de configuratie-interface **Dataweergaven** naar de configuratie **Standaard Map Builder-locatie**.

source: Click on the map, and maintain the click while moving the map until the chosen location is is enclosed in the rectangle. Some options are available to help defining the right location:
fr: Cliquez sur la carte et maintenez le bouton de la souris enfoncé tout en parcourant la carte jusqu'à inclure l'emplacement choisi dans le rectangle. Voici quelques options pour définir facilement l'emplacement approprié :

source: |icon-zoom-in| and |icon-zoom-out| zoom in and out,
de: |icon-zoom-in| und |icon-zoom-out| Ein- und Auszoomen,
fr: |icon-zoom-in| et |icon-zoom-out| pour zoomer et dézoomer,
nl: |icon-zoom-in| en |icon-zoom-out|,

source: |icon-localize| moves the map to your current location,
de: |icon-localize| bewegt die Karte zu Ihrem aktuellen Aufenthaltsort,
fr: |icon-localize| pour déplacer la carte sur votre emplacement actuel,
nl: |icon-localize| verplaatst de kaart naar uw huidige locatie,

source: |icon-search| allows to make a textual search of a location.
fr: |icon-search| pour effectuer une recherche d'emplacement textuelle.

source: Charts are composed of at least one color, but depending on what they represent, they can be composed of many more. By default, a set of 8 colors is used, and Opendatasoft users also have the possibility to use other sets of colors that are available by default as well. The Chart colors configuration allows to define a new set of colors that will replace the original 8-color set.
de: Diagramme bestehen aus mindestens einer Farbe, abhängig vom dargestellten Thema können sie jedoch viele verschiedene Farben enthalten. Standardmäßig wird eine Zusammenstellung von acht Farben verwendet; Opendatasoft-Nutzer haben zusätzlich die Möglichkeit, andere ebenfalls standardmäßig vorhandene Zusammenstellungen zu verwenden. In der Konfiguration der Diagrammfarben kann die ursprüngliche Zusammenstellung von acht Farben durch eine benutzerdefinierte Auswahl ersetzt werden.
nl: Grafieken bestaan uit minstens één kleur, maar afhankelijk van wat ze vertegenwoordigen, kunnen ze uit veel meer kleuren bestaan. Standaard wordt een set van 8 kleuren gebruikt en hebben gebruikers van Opendatasoft ook de mogelijkheid om andere sets met kleuren te gebruiken die ook standaard beschikbaar zijn. De configuratie Grafiekkleuren laat toe om een nieuwe set met kleuren te definiëren die de oorspronkelijke set met 8 kleuren zal vervangen.

source: Add the hexadecimal code of the new color, or click the color button to choose a new color using either the Nice colors or the Color wheel.
de: Fügen Sie den Hexadezimalcode der neuen Farbe ein oder klicken Sie auf den Farben-Button, um entweder aus den Farbvorschlägen oder mit dem Farbrad eine neue Farbe auszuwählen.
nl: Voeg de hexadecimale code van de nieuwe kleur toe of klik op de kleurknop om een nieuwe kleur te kiezen Uit de Leuke kleuren of met de kleur picker.

source: (optional) Click the reorder |icon-reorder| button to reorganize the new color among the others. The order of the colors matters because they will be used one after the other by the chart.
de: (optional) Klicken Sie auf den Button zur Neuanordnung |icon-reorder|, um die neuen und bestehenden Farben zu sortieren. Die Reihenfolge der Farben ist wichtig, da sie im Diagramm eine nach der anderen verwendet werden.
nl: (optioneel) Klik op de knop |icon-reorder| om de nieuwe kleur tussen de andere te reorganiseren. De volgorde van de kleuren is belangrijk omdat deze de ene na de andere gebruikt zullen worden door de grafiek.

source: A basic basemap is used by default for all maps of all Opendatasoft domains. It is possible to change that default basemap, as well as to make other basemaps available in an Opendatasoft portal. It will allow users to change the basemap at any time on a map and even to change the default basemap of a specific dataset.
de: Eine Standard-Grundkarte wird standardmäßig für alle Karten aller Opendatasoft-Domains verwendet. Es ist möglich, diese Standard-Grundkarte zu verändern oder andere Grundkarten in einem Opendatasoft-Portal bereitzustellen. So können Benutzer jederzeit die Grundkarte auf einer Karte oder die Standard-Grundkarte eines bestimmten Datensatzes ändern.
nl: Standaard wordt een basic basiskaart gebruikt voor alle domeinen van Opendatasoft. Het is wel mogelijk om de standaard basiskaart te wijzigen of om andere basiskaarten beschikbaar te maken in een Opendatasoft-portaal. Het zal gebruikers toelaten de basiskaart op elk moment op een kaart te wijzigen en zelfs om de standaard basiskaart van een welbepaalde dataset te wijzigen.

source: To know more about basemaps and how to use them, you can read our blog post: "`What is a basemap & how to choose the best one for your data <https://www.opendatasoft.com/blog/what-is-a-basemap-how-to-choose-the-best-one-for-your-data>`_".
de: Um mehr über Grundkarten und deren Verwendung zu erfahren, können Sie unseren Blogbeitrag lesen: "`What is a basemap & how to choose the best one for your data <https://www.opendatasoft.com/blog/what-is-a-basemap-how-to-choose-the-best-one-for-your-data>`_".
nl: Voor meer informatie over basiskaarten en hoe u deze kunt gebruiken, kunt u onze blog post lezen "Wat is een basiskaart en hoe kiest u de beste voor uw data <https://www.opendatasoft.com/blog/what-is-a-basemap-how-to-choose-the-best-one-for-your-data>`_".

source: By default, Opendatasoft provides several basemaps. They are the default basemaps displayed in the drop-down menu of the Basemap table column. All these default basemaps can be made available on the platform using the table. Even though the basemaps appear in the list of default basemaps, they will only be usable once added to the table.
de: Opendatasoft stellt standardmäßig mehrere Grundkarten zur Verfügung. Es handelt sich um die Standard-Grundkarten, die im Dropdown-Menü der Tabellenspalte Grundkarte angezeigt werden. All diese Standard-Grundkarten können über die Tabelle auf der Plattform bereitgestellt werden. Auch wenn die Grundkarten in der Liste der Standard-Grundkarten zu sehen sind, können sie erst nach dem Hinzufügen zur Tabelle verwendet werden.
nl: Standaard voorziet Opendatasoft verschillende basiskaarten. Het zijn de standaard basiskaarten die weergegeven zijn in het drop-down menu van de tabelkolom Basiskaart. Al deze standaard basiskaarten kunnen beschikbaar worden gesteld op het platform met behulp van de tabel. Hoewel de basiskaarten in de lijst met standaard basiskaarten staan, kunnen ze enkel worden gebruikt wanneer ze aan de tabel zijn toegevoegd.

source: Description
de: Beschreibung
nl: Omschrijving

source: Attribution
de: Zuordnung
nl: Toewijzing

source: Styles
de: Formatvorlagen
nl: Stijlen

source: Go to the `Thunderforest website <https://manage.thunderforest.com/users/sign_in>`_ and sign in to your account.
de: Öffnen Sie die `Thunderforest-Website <https://manage.thunderforest.com/users/sign_in>`_ und melden Sie sich bei Ihrem Konto an.
nl: Ga naar de website van Thunderforest <https://manage.thunderforest.com/users/sign_in>`_ en log in op uw account.

source: Copy the API Key.
de: Kopieren Sie den API-Schlüssel.
nl: Kopieer de API-sleutel.

source: `Mapbox <https://www.mapbox.com/>`_ is a mapping platform that allows to build and design custom maps. They also provide different basic map styles that can be directly used. Opendatasoft allows to integrate these Mapbox basemaps into an Opendatasoft domain to make them available throughout the portal.
de: `Mapbox <https://www.mapbox.com/>`_ ist eine Kartenplattform, mit der benutzerdefinierte Karten erzeugt und gestaltet werden können. Sie stellt auch verschiedene Kartenformatvorlagen zur sofortigen Verwendung bereit. Opendatasoft ermöglicht die Integration dieser Mapbox-Grundkarten in eine Opendatasoft-Domain, um sie im gesamten Portal zur Verfügung zu stellen.
nl: `Mapbox <https://www.mapbox.com/>`_ is een mapping platform waarmee u uw eigen kaarten kunt bouwen en ontwerpen. Ze bieden ook verschillende kaartstijlen die u rechtstreeks kunt gebruiken. Opendatasoft laat u toe om deze Mapbox-basiskaarten te integreren in een Opendatasoft-domein zodat deze gebruikt kunnen worden in het hele portaal..

source: Go to the Mapbox website and log in.
de: Öffnen Sie die Mapbox-Website und melden Sie sich an.
nl: Ga naar de Mapbox-website en log in.

source: In the `Mapbox account page <https://account.mapbox.com/connected-apps/>`_, either copy the Default Public Token or create a new Public Token and copy it. This will be used by Opendatasoft to display maps on behalf of the user's own Mapbox account.
de: Auf der `Seite Ihres Mapbox-Kontos <https://account.mapbox.com/connected-apps/>`_ können Sie den öffentlichen Standardtoken kopieren oder einen neuen öffentlichen Standardtoken erstellen und diesen dann kopieren. Dieser wird von Opendatasoft verwendet, um Karten im Namen des Mapbox-Kontos des Benutzers anzuzeigen.
nl: Ofwel kopieert u in de Mapbox-accountpagina <https://account.mapbox.com/connected-apps/>`_, het Default Public Token ofwel maakt u een nieuw Public Token aan en kopieert u dit. Dit zal door Opendatasoft worden gebruikt om kaarten namens het eigen Mapbox-account van de gebruiker weer te geven.

source: Using the basemaps table, it is now possible to select one of Mapbox's default styles or add one of your own custom Mapbox basemaps:
de: Über die Grundkarten-Tabelle ist es nun möglich, eine der Mapbox-Standardformatvorlagen zu wählen oder eine von Ihnen auf Mapbox erstellten Karte hinzuzufügen:
nl: Dankzij de tabel met basiskaarten is het nu mogelijk om een van de standaard stijlen van Mapbox te selecteren of om een van uw eigen gepersonaliseerde Mapbox-basiskaarten toe te voegen:

source: In case of a "Tileset", enter the "Tileset ID" (which is usually under the form `accountname.identifier`)
de: Geben Sie bei einem "Tileset" die "Tileset ID" ein (in der Regel im Format `accountname.identifier`)
nl: Voer, in geval van een "Tileset" het "Tileset ID" in (dat meestal terug te vinden is onder de vorm `accountname.identifier`)

source: In case of a map style created using Mapbox Studio, enter the map identifier (usually under the form `accountname/identifier`), which is the last part of the "Style URL" provided by Mapbox (for example, `mapbox://styles/opendatasoft/abcdefg12345678` means the map identifier is `opendatasoft/abcdefg12345678`).
de: Geben Sie bei einem mit Mapbox Studio erstellten Kartenformat die Kartenkennung ein (in der Regel im Format `accountname/identifier`). Hierbei handelt es sich um den letzten Teil der von Mapbox bereitgestellten "Style URL" (z.B. bedeutet `mapbox://styles/opendatasoft/abcdefg12345678`, dass die Kartenkennung `opendatasoft/abcdefg12345678` lautet).
nl: Voer, in geval van een kaartstijl die aangemaakt is door gebruik te maken van Mapbox Studio, de kaartidentifier in (meestal terug te vinden onder de vorm accountname/identifier), dat het laatste deel is van de "Style URL" die verschaft wordt door Mapbox (bijvoorbeeld, `mapbox://styles/opendatasoft/abcdefg12345678` betekent dat de kaartidentifier `opendatasoft/abcdefg12345678` is).

source: Click on the map, and maintain the click while moving the map until the chosen location is enclosed in the rectangle. Some options are available to help to define the right location:
de: Klicken Sie auf die Karte und halten Sie die Maustaste gedrückt, um die Karte zu bewegen und die gewünschte Position in das Rechteck zu ziehen. Um bei der Definition der korrekten Position zu helfen, stehen einige Optionen zur Verfügung:
nl: Klik op de kaart en houd de muisknop ingedrukt terwijl u over de kaart beweegt tot de gekozen locatie opgenomen is in de rechthoek. Er zijn enkele opties beschikbaar om te helpen bij het bepalen van de juiste locatie:

source: |icon-search| allows you to make a textual search of a location.
de: |icon-search| ermöglicht eine Suche anhand der Bezeichnung eines Ortes.
nl: |icon-search| biedt de mogelijk om een tekstuele zoekopdracht voor een locatie uit te voeren.
