Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/02_managing_subdomains/create.po
Languages: de, es, fr, it, nl

source: Creating a new subdomain
de: Erstellen einer neuen Subdomain
es: Crear un subdominio nuevo
fr: Créer un sous-domaine
it: Creazione di un nuovo sottodominio
nl: Een nieuw subdomein aanmaken

source: Subdomains management is granted to users which have the *Manage all subdomains* permission. This permission can be given to any user by the portal administrators (those users having the *Edit domain properties* permission).
de: Subdomains können von Benutzern verwaltet werden, die über die Berechtigung *Alle Subdomains verwalten* verfügen. Die Portaladministratoren können diese Berechtigung einem beliebigen Benutzer (mit der Berechtigung *Domaineigenschaften bearbeiten*) zuweisen.
es: La administración de subdominios se concede a los usuarios que tienen el permiso *Administrar todos los subdominios*. Cualquier usuario puede recibir este permiso de los administradores del portal (los usuarios que tienen el permiso *Editar propiedades de dominio*).
fr: La capacité de gérer les sous-domaines est octroyée aux utilisateurs disposant de la permission *Gérer tous les sous-domaines*. Cette permission peut être octroyée à n'importe quel utilisateur par les administrateurs du portail (utilisateurs disposant de la permission *Éditer les propriétés du domaine*).
it: La possibilità di gestire i sottodomini è data agli utenti che dispongono del permesso *Gestisci tutti i sottodomini*. Tale autorizzazione può essere assegnata dagli amministratori del portale agli utenti che dispongono del permesso *Modifica le proprietà del dominio*.
nl: Het beheer van subdomeinen wordt verleend aan gebruikers die de toelating "Alle subdomeinen beheren" hebben. Deze toelating kan aan elke gebruiker gegeven worden door de portaalbeheerders (die gebruikers die de toelating "Domeineigenschappen bewerken" hebben).

source: Subdomains management permission
de: Berechtigung Sudomainverwaltung
es: Permiso de administración de subdominios
fr: Permission de gestion des sous-domaines
it: Permesso di gestione dei sottodomini
nl: Toelating voor het beheer van subdomeinen

source: Users with this permission will see a *Subdomains* menu in the left control pane. Simply click this menu item to access the subdomains management section.
de: Benutzer mit dieser Berechtigung sehen im linken Steuerbereich das Menü *Subdomains*. Klicken Sie einfach auf diesen Menüpunkt, um auf den Subdomainverwaltungsbereich zuzugreifen.
es: Los usuarios con este permiso verán un menú *Subdominios* en el panel de control izquierdo. Basta con hacer clic en este elemento de menú para acceder a la sección de administración de subdominios.
fr: Les utilisateurs disposant de cette permission verront un menu *Sous-domaines* sur le panneau de commande de gauche. Cliquez simplement sur cet élément du menu pour accéder à la section gestion des sous-domaines.
it: Gli utenti a cui viene assegnato questo permesso vedranno comparire il menu *Sottodomini* nel pannello di controllo di sinistra. Per accedere alla sezione di gestione dei sottodomini, è sufficiente cliccare su questo collegamento.
nl: Gebruikers met deze toelating zullen een menu "Subdomeinen" zin in het controlevenster links. Klik gewoon op dit menu-item om toegang te krijgen tot de sectie voor het beheer van subdomeinen.

source: Access subdomains configuration screen
de: Zugriff auf den Bildschirm Subdomainkonfiguration
es: Acceso a la pantalla de configuración de los subdominios
fr: Accéder à l'écran de configuration des sous-domaines
it: Accesso alla configurazione dei sottodomini
nl: Configuratiescherm voor toegang tot subdomeinen

source: The maximum number of subdomains you can create is limited and depends on your OpenDataSoft's contract.
de: Die maximale Anzahl an Subdomains, die Sie erstellen können, ist begrenzt und hängt von Ihrem OpenDataSoft-Vertrag ab.
es: El número máximo de subdominios que puede crear es limitado y depende de su contrato de OpenDataSoft.
fr: Le nombre maximum de sous-domaines que vous pouvez créer est limité et dépend de votre contrat OpenDataSoft.
it: Il numero di sottodomini che è possibile creare è limitato e dipende dalle condizioni del tuo contratto OpenDataSoft.
nl: Het maximum aantal subdomeinen dat u kan aanmaken, is beperkt en hangt af van uw OpenDataSoft-contract.

source: To create a new subdomain, click the *Add subdomain* link in the menu, or click the *Create subdomain* button on the Subdomain's list page.
de: Klicken Sie zum Erstellen einer neuen Subdomain entweder im Menü auf den Link *Subdomain hinzufügen* oder klicken Sie auf der Seite der Subdomainliste auf die Schaltfläche *Subdomain erstellen*.
es: Para crear un nuevo subdominio, haga clic en el vínculo *Añadir subdominio* del menú, o haga clic en el botón *Crear subdominio* de la página de lista de subdominios.
fr: Pour créer un nouveau sous-domaine, cliquez sur le lien *Ajouter un sous-domaine* dans le menu ou cliquez sur le bouton *Créer un sous-domaine* dans l'index des sous-domaines.
it: Per creare un nuovo sottodominio, clicca nel menu su *Aggiungi sottodominio* oppure sul pulsante *Crea un sottodominio* nella pagina con l'elenco dei sottodomini.
nl: Om een nieuw subdomein aan te maken, klik op de koppeling "Voeg subdomein toe" in het menu of klik op de knop "Maak subdomein aan" op de pagina waarop de lijst met subdomeinen staat.

source: Button to create a subdomain
de: Schaltfläche zum Erstellen einer Subdomain
es: Botón para crear un subdominio
fr: Bouton de création de sous-domaine
it: Pulsante di creazione di un sottodominio
nl: Knop om een subdomein aan te maken

source: You will be prompted a form to create your new subdomain, with the following fields:
de: Zur Erstellung Ihrer neuen Subdomain wird ein Formular mit folgenden Feldern angezeigt:
es: Se le mostrará un formulario para crear el nuevo subdominio, con los campos siguientes:
fr: Un formulaire sera affiché pour créer un nouveau sous-domaine avec les champs suivants :
it: A questo punto comparirà un modulo contenente i seguenti campi:
nl: U zal gevraagd worden naar een formulier om uw nieuw subdomein aan te maken met de volgende velden:

source: **Subdomain name**: the name of the subdomain, which will appear for example in emails. This can be changed later by the subdomain's administrator.
de: **Subdomainname**: der Name der Subdomain, der z. B. in E-Mails erscheinen wird. Der Subdomainadministrator kann ihn später ändern.
es: **Nombre de subdominio**: El nombre del subdominio que aparecerá, por ejemplo, en los correos electrónicos. El administrador del subdominio puede cambiarlo más adelante.
fr: ** Nom du sous-domaine ** : le nom du sous-domaine, tel qu'il apparaîtra par exemple dans les emails. Ceci peut être changé plus tard par l'administrateur du sous-domaine.
it: **Nome del sottodominio**: il nome del sottodominio, che verrà ad esempio visualizzato nelle e-mail. Questo campo può essere modificato in seguito dall'amministratore del sottodominio.
nl: **Naam subdomein**: de naam van het subdomein, die bijvoorbeeld in e-mails zal verschijnen. Deze kan later door de beheerder van het subdomein worden gewijzigd.

source: **Subdomain identifier**: the identifier of your subdomain.
de: **Subdomainbezeichner**: der Bezeichner Ihrer Subdomain.
es: **Identificador de dominio**: El identificador del subdominio.
fr: **Identifiant du domaine** : identifiant de votre sous-domaine.
it: **Identificatore di sottodominio**: l'identificatore del tuo sottodominio.
nl: **Identifier van het subdomein**: de identifier van uw subdomein.

source: The real address of your domain will thus be: <Subdomain Identifier>-<Domain Identifier>.opendatasoft.com. For instance, if you own an OpenDataSoft domain named **mydomain** (that can be accessed at **mydomain.opendatasoft.com**) and if you create a subdomain named **test**, the subdomain full address will be: **test-mydomain.opendatasoft.com**.
de: Die tatsächliche Adresse Ihrer Domain ist also: <Subdomain Identifier>-<Domain Identifier>.opendatasoft.com. Wenn Sie beispielsweise eine OpenDataSoft-Domain namens **mydomain** besitzen (auf die unter **mydomain.opendatasoft.com** zugegriffen werden kann) und Sie eine Subdomain namens **test** erstellen, lautet die vollständige Adresse der Subdomain: **test-mydomain.opendatasoft.com**.
es: En consecuencia, la dirección real del dominio será: <identificador_subdominio>-<identificador_dominio>.opendatasoft.com. Por ejemplo, si posee un dominio OpenDataSoft denominado **mydomain** (al cual se puede acceder en **mydomain.opendatasoft.com**) y crea un subdominio denominado **test**, la dirección completa del subdominio será: **test-mydomain.opendatasoft.com**.
fr: L'adresse réelle de votre domaine sera ainsi <Identifiant du sous-domaine>-<Identifiant du domaine>.opendatasoft.com. Par exemple, si vous possédez un domaine OpenDataSoft nommé **mondomaine** (accessible à l'adresse **mondomaine.opendatasoft.com**) et si vous créez un sous-domaine nommé **test**, l'adresse complète du sous-domaine sera la suivante : **test-mondomaine.opendatasoft.com**.
it: L'indirizzo reale del tuo dominio sarà quindi: <Identificatore di sottodominio>-<Identificatore del dominio>.opendatasoft.com. Ad esempio, se il nome del tuo dominio OpenDataSoft è **miodominio** (accessibile all'indirizzo **miodominio.opendatasoft.com**) e il sottodominio da te creato è **test**, l'indirizzo completo del sottodominio sarà: **test-miodominio.opendatasoft.com**.
nl: Het daadwerkelijke adres van uw domein zal dan zijn: <Subdomain Identifier>-<Domain Identifier>.opendatasoft.com. Bijvoorbeeld, wanneer u eigenaar bent van een OpenDataSoft-domein met de naam **mydomain** (waar men zich toegang toe kan verschaffen via **mydomain.opendatasoft.com**) en wanneer u een subdomein aanmaakt met de naam **test**, zal de volledige naam van het subdomein zijn: **test-mydomain.opendatasoft.com**.

source: Of course, like with domains, you can contact the OpenDataSoft's support to get your subdomains DNS customized, see :doc:`Customizing your domain URL</configuring_domain/06_customizing_domain_url/custom_urls>` for more details.
de: Natürlich können Sie wie bei Domains auch den Support von OpenDataSoft kontaktieren, um die DNS Ihrer Subdomains anpassen zu lassen. Weitere Informationen finden Sie unter :doc:`Anpassen Ihrer Domain-URL</configuring_domain/06_customizing_domain_url/custom_urls>`.
es: Por supuesto, al igual que con los dominios, puede ponerse en contacto con el equipo de soporte de OpenDataSoft para personalizar sus DNS de subdominios; consulte :doc:`Personalizar la dirección URL de dominio</configuring_domain/06_customizing_domain_url/custom_urls>` para obtener más detalles.
fr: Bien entendu, tout comme pour les domaines, vous pouvez contacter le service d'assistance OpenDataSoft pour personnaliser les DNS de vos sous-domaines, reportez-vous à :doc:`Personnaliser l'URL de votre domaine</configuring_domain/06_customizing_domain_url/custom_urls>` pour plus de détails.
nl: Vanzelfsprekend kan u, net zoals voor domeinen, contact opnemen met de support van OpenDataSoft om het DNS van uw subdomeinen te personaliseren. Zie :doc:`De URL van uw domein personaliseren</configuring_domain/06_customizing_domain_url/custom_urls>` voor meer details.

source: **Administrator's email address**: the email address of the subdomain administrator.
de: **E-Mail-Adresse des Administrators**: die E-Mail Adresse des Subdomainadministrators.
es: **Dirección de correo electrónico del administrador**: La dirección de correo electrónico del administrador del subdominio.
fr: **Adresse e-mail de l'administrateur** : adresse e-mail de l'administrateur du sous-domaine.
it: **Indirizzo e-mail dell'amministratore**: l'indirizzo e-mail dell'amministratore del sottodominio.
nl: **E-mailadres van de beheerder**: het e-mailadres van de beheerder van het subdomein.

source: This email address does not have to belong to a user already having an OpenDataSoft account. In which case, the OpenDataSoft platform will automatically initiate the account creation procedure.
de: Diese E-Mail-Adresse muss nicht unbedingt zu einem Benutzer gehören, der bereits ein OpenDataSoft-Konto hat. In dem Fall startet die OpenDataSoft-Plattform automatisch die Kontoerstellungsprozedur.
es: Esta dirección de correo electrónico no tiene que pertenecer a un usuario que ya tenga una cuenta OpenDataSoft. Dado el caso, la plataforma OpenDataSoft iniciará automáticamente el procedimiento de creación de la cuenta.
fr: Cette adresse e-mail ne doit pas obligatoirement appartenir à un utilisateur disposant déjà un compte OpenDataSoft. Le cas échéant, la plateforme OpenDataSoft initiera automatiquement la procédure de création de compte.
it: Questo indirizzo non deve necessariamente appartenere a un utente con un account OpenDataSoft. In questo caso, la piattaforma OpenDataSoft avvierà automaticamente la procedura di creazione di un account.
nl: Dit e-mailadres hoeft niet te behoren tot een gebruiker die reeds een OpenDataSoft-account heeft. In dit geval zal het OpenDataSoft-platform automatisch een aanmaakprocedure voor een account opstarten.

source: The owner is granted full administrative privilege over the newly created subdomain.
de: Der Besitzer erhält vollständige Administratorrechte über die neu erstellte Subdomain.
es: Se concede al propietario pleno privilegio administrativo sobre el subdominio recién creado.
fr: Le propriétaire se voit octroyer des privilèges d'administration complets sur le sous-domaine nouvellement créé.
it: Al proprietario vengono assegnati tutti i privilegi di amministratore per il sottodominio creato.
nl: De eigenaar krijgt het volledige administratieve privilege over het nieuw aangemaakte subdomein.

source: You will also be able to pre-configure :doc:`distribution parameters, distributed content and datasets </managing_domain/02_managing_subdomains/distribute>`, and :doc:`usage limits </managing_domain/02_managing_subdomains/quotas>`, as described in their respective documentation.
de: Sie haben auch die Möglichkeit, die Vorkonfiguration von :doc:`Verteilungsparametern, verteilten Inhalten und Datensätzen </managing_domain/02_managing_subdomains/distribute>` sowie :doc:`Verwendungseinschränkungen </managing_domain/02_managing_subdomains/quotas>` vorzunehmen, wie in den jeweiligen Dokumentationen beschrieben.
es: Asimismo, podrá preconfigurar los :doc:`parámetros de distribución, el contenido distribuido y los conjuntos de datos distribuidos </managing_domain/02_managing_subdomains/distribute>`, así como los :doc:`límites de uso </managing_domain/02_managing_subdomains/quotas>`, tal como se describe en la documentación correspondiente.
fr: Vous pourrez aussi pré-configurer :doc:`les paramètres de distribution, le contenu distribué et les jeux de données </managing_domain/02_managing_subdomains/distribute>` et :doc:`les limites d'usage </managing_domain/02_managing_subdomains/quotas>`, décrites dans leurs documentations respectives.
nl: U kunt ook :doc:`distributieparameters, gedistribueerde content en datasets </managing_domain/02_managing_subdomains/distribute>`, en :doc:`gebruikslimieten </managing_domain/02_managing_subdomains/quotas>` vooraf configureren, zoals beschreven staat in de respectieve documentatie.

source: Once created, the subdomain appears in the subdomains list, along with some information related to its current quotas.
de: Nach der Erstellung erscheint die Subdomain in der Subdomainliste, einschließlich einiger Informationen im Zusammenhang mit ihren aktuellen Quoten.
es: Una vez creado el subdominio, este aparece en la lista de subdominios, junto con información acerca de sus cuotas actuales.
fr: Une fois créé, le sous-domaine apparaît dans la liste des sous-domaines, avec les informations relatives à ses quotas.
it: Una volta creato, il sottodominio comparirà nell'elenco dei sottodomini, accompagnato da alcune informazioni sullo stato delle quote.
nl: Eenmaal het subdomein is aangemaakt, verschijnt dit in de lijst met subdomeinen, samen met enkele informatie over de huidige quota's ervan.

source: The subdomain has been created
de: Die Subdomain wurde erstellt.
es: Subdominio creado
fr: Le sous-domaine a été créé
it: Il sottodominio è stato creato
nl: Het subdomein werd aangemaakt
