Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/02_managing_subdomains/distribute.po
Languages: de, es, fr, it, nl

source: If you have several subdomains, you may want to distribute pages and datasets slightly different for each: for example, maybe you want to distribute a homepage containing "Welcome on [something]", or maybe you have a country-wide dataset but you want to distribute parts of it to regional subdomains.
de: Wenn Sie mehrere Subdomains haben, möchten Sie Seiten und Datensätze unter Umständen etwas unterschiedlich verteilen: Sie möchten beispielsweise eine Homepage mit dem Content "Willkommen bei [xx]" verteilen oder Sie haben einen landesweiten Datensatz, möchten jedoch Teile von diesem auf regionale Subdomains verteilen.
es: Si tiene varios subdominios, tal vez desee distribuir páginas y conjuntos de datos ligeramente diferentes para cada uno de ellos: por ejemplo, quizás le interese distribuir una página principal que contenga "Welcome on [something]", o tenga un conjunto de datos de alcance nacional y desee distribuir partes del mismo a subdominios regionales.
fr: Si vous avez plusieurs sous-domaines, vous voulez peut-être distribuer des pages et des jeux de données différents à chacun : par exemple, vous voulez peut-être distribuer une page d'accueil qui contient "Bienvenue sur [Quelque chose]", ou bien vous avez un jeu de données sur le pays entier et vous voulez distribuer des parties à des sous-domaines régionaux.
it: Se disponi di diversi sottodomini, potresti aver bisogno di personalizzare le modalità di distribuzione delle pagine e dei dataset: ad esempio, perché desideri distribuire una homepage con il messaggio "Benvenuto su [nome specifico]", oppure perché hai bisogno di distribuire nei tuoi sottodomini regionali parti diverse di un dataset su scala nazionale.
nl: Indien u verschillende subdomeinen hebt, wil u misschien pagina's en datasets verspreiden die licht verschillend zijn. Bijvoorbeeld: misschien wil u een homepagina verspreiden die de tekst *Welkom op [iets]* bevat, of misschien hebt u wel een dataset die een volledig land omvat maar wil u delen ervan verspreiden naar regionale subdomeinen.

source: Distributing data based on a subdomain parameter
de: Verteilen von Daten auf der Grundlage eines Subdomain-Parameters
es: Distribuir los datos en función de un parámetro de subdominio
fr: Distribuer des données basées sur un paramètre de sous-domain
it: Distribuzione dei dati in base ai parametri di un sottodominio
nl: Verspreiden van data op basis van een parameter binnen een subdomein

source: As an administrator managing your subdomains, you can define "distribution parameters"; and then you can fill these parameters for each subdomain. These parameters will then be available to change the distributed content depending on the subdomain.
de: Als Administrator, der Ihre Subdomains verwaltet, können Sie "Verteilungsparameter" definieren; diese Parameter können Sie dann für jede Subdomain füllen. Die Parameter stehen Ihnen daraufhin zur Verfügung, um den verteilten Content für jede Subdomain zu ändern.
es: Como administrador de los subdominios, puede definir "parámetros de distribución"; a continuación, puede especificar estos parámetros para cada uno de los subdominios. Así, estos parámetros estarán disponibles para cambiar el contenido distribuido en función del subdominio.
fr: En tant qu'administrateur de sous-domaines, vous pouvez définir des "paramètres de distribution"; ensuite, vous pouvez remplir ces paramètres pour chaque sous-domaine. Ces paramètres seront disponibles pour modifier le content distribué en fonction du sous-domaine.
it: In qualità di amministratore che gestisce i propri sottodomini, puoi definire i tuoi "parametri di distribuzione" e in seguito assegnarli a ciascun sottodominio. Questi permetteranno poi di modificare i contenuti distribuiti in base al singolo sottodominio.
nl: Als beheerder die uw eigen subdomeinen beheert, kan u "verspreidingsparameters" definiëren. Vervolgens kan u deze parameters invullen voor elk subdomein. Deze parameters zullen vervolgens beschikbaar zijn om de verspreide inhoud te wijzigen afhankelijk van het subdomein.

source: For example, we'd like to prepare a homepage and a dataset for a few city portals. We want the homepage to contain the city name, and the dataset to be filtered on the ZIP Code.
de: Wir möchten zum Beispiel eine Homepage und einen Datensatz für einige Stadt-Portale erstellen. Wir wollen, dass die Homepage den Stadtnamen enthält und der Datensatz nach der PLZ gefiltert wird.
es: Por ejemplo, queremos preparar una página principal y un conjunto de datos para varios portales de ciudades. Queremos que la página principal contenga el nombre de la ciudad y que el conjunto de datos se filtre según el código postal.
fr: Par exemple, nous voudrions préparer une page d'accueil et un jeu de données pour quelques portails locaux. Nous voulons que la page d'accueil contienne le nom de la ville et que le jeu de données soit filtré sur le code postal.
it: Ad esempio, desideriamo preparare una homepage e un dataset per i portali di alcune città: la homepage dovrà contenere il nome della città, mentre il dataset sarà filtrato per codice postale.
nl: Bijvoorbeeld: we zouden graag een homepagina en een dataset aanmaken voor de portalen van enkele steden. We willen dat de homepagina de naam van de stad bevat en dat de dataset gefilterd wordt op de postcode.

source: First, we'll add two parameters for all our subdomains. This is managed from the subdomains' *Settings* page.
de: Zunächst fügen wir zwei Parameter für alle unsere Subdomains hinzu. Dies kann auf der *Einstellungen*-Seite der Subdomain verwaltet werden.
es: En primer lugar, añadiremos 2 parámetros para todos los subdominios. Esto se administra desde la página *Configuración* de los subdominios.
fr: Pour commencer, nous ajoutons deux paramètres pour tous nos sous-domaines. Ceci est fait à partir de la page *Configuration* des sous-domaines.
it: Per cominciare, apriamo la pagina *Impostazioni* dei sottodomini e aggiungiamo due parametri validi per tutti.
nl: Allereerst voegen we twee parameters toe voor al onze subdomeinen. Dit gebeurt vanuit de pagina "Instellingen" van de subdomeinen.

source: Subdomains' settings
de: Subdomain-Einstellungen
es: Configuración de los subdominios
fr: Configuration du sous-domaine
it: Impostazioni dei sottodomini
nl: Instellingen van subdomeinen

source: By clicking *Add a parameter*, we'll add two parameters, "zipcode" and "cityname".
de: Durch Klicken auf *Parameter hinzufügen* können wir die beiden Parameter "PLZ" und "Stadtname" hinzufügen.
es: Al hacer clic en *Añadir un parámetro*, añadiremos 2 parámetros: "zipcode" y "cityname".
fr: En cliquant sur *Ajouter un paramètre* nous ajouterons deux paramètres, "zipcode" et "cityname"
it: Cliccando su *Aggiungi un parametro*, creeremo i parametri "zipcode" e "cityname".
nl: Door te klikken op *Voeg een parameter toe* voegen we twee parameters toe, "postcode" en "naam van de stad".

source: Add a distribution parameter
de: Hinzufügen von Verteilungsparametern
es: Añadir un parámetro de distribución
fr: Ajouter un paramètre de distribution
it: Aggiunta di un parametro di distribuzione
nl: Voeg een distributieparameter toe

source: Distribution parameters
de: Verteilungsparameter
es: Parámetros de distribución
fr: Paramètres de distribution
it: Parametri di distribuzione
nl: Distributieparameters

source: Now, we can fill these parameters for each of my subdomains, by clicking on the subdomain's name in the subdomains list to get to the subdomain configuration page.
de: Nun können wir diese Parameter für jede meiner Subdomains füllen, indem wir auf den Subdomain-Namen in der Subdomain-Liste klicken, um zur Subdomain-Konfigurationsseite zu gelangen.
es: Ahora podemos especificar estos parámetros para cada uno de los subdominios, haciendo clic en el nombre del subdominio en la lista de subdominios para acceder a la página de configuración del subdominio.
fr: Maintenant, nous pouvons remplir ces paramètres pour chacun des sous-domaines, il suffit de cliquer sur le nom du sous-domaine dans la liste des sous-domaines pour accéder à la page de configuration.
it: Ora possiamo assegnare questi parametri a ciascun sottodominio. Per fare ciò, clicchiamo sul singolo nome nell'elenco dei sottodomini e accediamo alla relativa pagina di configurazione.
nl: Nu kunnen we deze parameters invullen voor elk van mijn subdomeinen door te klikken op de naam van het subdomein in de lijst met subdomeinen om zo de configuratiepagina van het subdomein te bekomen.

source: Then, we can create the content I want to distribute. First, we can do a homepage containing the city's name. In the page editor, we can use :code:`{domain.cityname}` as a placeholder for the city name filled for that subdomain.
de: Dann können wir den Content erstellen, den ich verteilen möchte. Zunächst können wir eine Hompage erstellen, die den Stadtnamen enthält. Im Seiten-Editor können wir :code:`{domain.cityname}` als Platzhalter für den Stadtnamen verwenden, der für diese Subdomain gefüllt wurde.
es: Acto seguido, podemos crear el contenido que queremos distribuir. Primero, podemos elaborar una página principal que contenga el nombre de la ciudad. En el editor de páginas, podemos emplear :code:`{domain.cityname}` como marcador de posición del nombre de ciudad especificado para ese subdominio.
fr: Ensuite, on peut créer le contenu à distribuer. Premièrement, nous pouvons créer une page d'accueil contenant le nom de la ville. Dans l'éditeur de page, il suffit d'insérer la valeur :code:`{domain.cityname}` comme espace réservé pour le nom de la ville qui correspond à ce sous-domaine.
it: Creiamo poi i contenuti da distribuire. Innanzitutto la homepage con il nome della città: nell'editor di pagina, utilizzeremo come segnaposto :code:`{domain.cityname}`, per indicare il nome della città assegnata a quel sottodominio.
nl: Vervolgens kunnen we de inhoud aanmaken die ik wil verspreiden. Allereerst kunnen we een homepagina aanmaken die de naam van de stad bevat. In de page editor kunnen we :code:`{domain.cityname}` gebruiken als plaatsvervanger voor de naam van de stad die is ingevuld voor dat subdomein.

source: Now, we can distribute my homepage and my dataset, using for example the multiple domain distribution page.
de: Nun können wir meine Homepage und meinen Datensatz verteilen, indem wir beispielsweise die Verteilungsseite für mehrere Domains verwenden.
es: Ahora podemos distribuir la página principal y el conjunto de datos utilizando, por ejemplo, la página de distribución para varios dominios.
fr: Maintenant, on peut distribuer notre page d'accueil et notre jeu de données, on utilisant par exemple, la page de distribution vers plusieurs sous-domaines.
it: Siamo infine pronti per distribuire la nostra homepage e il nostro dataset, servendoci ad esempio della pagina di distribuzione per più domini.
nl: Nu kunnen we mijn homepagina en mijn dataset verspreiden door bijvoorbeeld de distributiepagina voor meerdere domeinen te gebruiken.

source: To distribute the homepage, we just add it to the list as usual.
de: Zum Verteilen der Homepage müssen wir sie nur wie üblich zu der Liste hinzufügen.
es: Para distribuir la página principal, basta con añadirla a la lista según el procedimiento habitual.
fr: Pour distribuer une page d'accueil, on l'ajoute simplement à la liste.
it: Nel caso della homepage, basterà aggiungerla all'elenco, come già visto.
nl: Om de homepagina te verspreiden voegen we deze zoals gewoonlijk enkel toe aan de lijst.

source: To distribute the dataset, we add it to the list, and then click *Match parameters*: this allows you to configure a filter on the data depending on one of the distribution parameters. In our case, our dataset has a :code:`zipcode` field, and we match it with the :code:`zipcode` parameter of our subdomains.
de: Zum Verteilen des Datensatzes fügen wir diesen zu der Liste hinzu und klicken dann auf *Parameter anpassen*: Damit können Sie einen Filter für die Daten konfigurieren, der von einem der Verteilungsparameter abhängt. In unserem Fall hat unser Datensatz ein :code:`zipcode` Feld, und wir passen es mit dem :code:`zipcode` Parameter unserer Subdomains an.
es: Para distribuir el conjunto de datos, lo añadimos a la lista y hacemos clic en *Establecer coincidencias de parámetros*: Esto permite configurar un filtro en los datos en función de uno de los parámetros de distribución. En nuestro caso, el conjunto de datos tiene un campo :code:`zipcode` y establecemos la coincidencia con el parámetro :code:`zipcode` de los subdominios.
fr: Pour distribuer le jeu de données, on l'ajoute à la liste, puis on clique sur *Appairer les paramètres* : cela vous permet de configurer un filtre sur les données en fonction d'un des paramètres de distribution. Dans notre cas, notre jeu de données à un champ :code:`zipcode` et nous l'appairons avec le paramètre :code:`zipcode` de nos sous-domaines.
it: Per quanto riguarda il dataset, dopo averlo aggiunto all'elenco, clicca su *Associa i parametri*: in questo modo imposterai un filtro sui dati collegandolo a uno dei parametri di distribuzione. Nel nostro caso, il campo :code:`zipcode` del dataset verrà associato al parametro :code:`zipcode` dei nostri sottodomini.
nl: Om de dataset te verspreiden, voegen we deze toe aan de lijst en klikken we op *Match parameters*: hierdoor kan u een filter op de data configureren afhankelijk van één van de distributieparameters. In ons geval heeft onze dataset een :code:`postcode` veld en matchen we dit met de :code:`postcode` parameter van onze subdomeinen.

source: Matching parameters for a dataset
de: Anpassen von Parametern für einen Datensatz
es: Establecer coincidencias de parámetros para un conjunto de datos
fr: Faire correspondre des paramètres pour un jeu de données
it: Associazione dei parametri in un dataset
nl: Matchen van parameters voor een dataset

source: Our content distribution is ready.
de: Unsere Content-Verteilung ist abgeschlossen.
es: La distribución del contenido está lista.
fr: Notre distribution de contenu est prête.
it: La distribuzione dei contenuti è pronta.
nl: We zijn klaar om onze inhoud te verspreiden.

source: Content distribution with parameters
de: Content-Verteilung mit Parametern
es: Distribución de contenido con parámetros
fr: Distribution de contenu avec des paramètres
it: Distribuzione dei contenuti tramite i parametri
nl: Verspreiden van inhoud met parameters

source: Now, we just have to *Save* it. Each of our subdomains now have a dedicated homepage that they can use, and the part of the dataset that matches their city!
de: Nun müssen wir nur noch auf *Speichern* klicken. Jede unserer Subdomains hat nun eine eigene Homepage, die sie nutzen kann, sowie den Teil des Datensatzes, der zu ihrer Stadt passt!
es: Ya solo nos queda *Guardar* la operación. Ahora cada uno de los subdominios tiene una página principal específica para su uso, ¡y la parte del conjunto de datos que coincide con su ciudad!
fr: Il ne nous reste plus qu'à *Sauver*. Chacun de nos sous-domaines a maintenant une page d'accueil dédiée qu'ils peuvent utiliser et un jeu de données filtré qui correspond à leur ville !
it: Non ci resta che cliccare su *Salva*. Ogni sottodominio avrà una homepage dedicata e usufruirà di quella parte del dataset che corrisponde alla sua città!
nl: Nu hoeven we deze alleen nog maar op te slaan. Elk van onze subdomeinen heeft nu een eigen homepagina die ze kunnen gebruiken en het deel van de dataset dat overeenstemt met hun stad!
