Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/02_managing_subdomains/distribute.po
Languages: de, es, fr, it, nl

source: Distributing content to subdomains
de: Verteilen von Content auf Subdomains
es: Distribuir contenido a subdominios
fr: Distribuer du contenu aux sous-domaines
it: Distribuzione dei contenuti nei sottodomini
nl: Content verspreiden naar subdomeinen

source: As a "parent" domain, you can choose to distribute specific pages and datasets to your subdomains. For example you could:
de: Als "Parent"-Domain können Sie spezifische Seiten und Datensätze auf Ihre Subdomains verteilen. Sie können beispielsweise:
es: Como dominio "primario", puede elegir distribuir páginas y conjuntos de datos específicos a sus subdominios. Por ejemplo, podría realizar estas acciones:
fr: En tant que domaine "parent", vous pouvez choisir de distribuer des pages et des jeux de données spécifiques à vos sous-domaines. Par exemple, vous pourriez :
it: In qualità di dominio "padre", hai la facoltà di distribuire pagine e dataset di tua scelta nei sottodomini creati. Ad esempio, potresti distribuire:
nl: Als een "ouder" domein kan u ervoor kiezen om specifieke pagina's en datasets naar uw subdomeinen te verdelen. Zo zou u bijvoorbeeld het volgende kunnen doen:

source: distribute a common homepage to your other business units
de: eine gemeinsame Homepage auf Ihre weiteren Geschäftseinheiten verteilen
es: Distribuir una página principal común a sus unidades de negocio restantes
fr: distribuer une page d'accueil à vos autres "Business Units"
it: una homepage comune per le divisioni della tua impresa;
nl: een gewone homepagina verspreiden naar uw andere business units

source: distribute a part of a large dataset to subdomains you created for each of your customers
de: einen Teil eines großen Datensatzes auf Domains verteilen, die Sie für Ihre einzelnen Kunden erstellt haben
es: Distribuir una parte de un conjunto de datos extenso a subdominios que ha creado para cada uno de sus clientes
fr: distribuer une partie d'un gros jeu de données à des sous-domaines créés pour chacun de vos clients
it: una parte di un vasto dataset nei vari sottodomini dedicati ai diversi tipi di cliente;
nl: een deel van een grote dataset verspreiden naar subdomeinen die u voor elk van uw klanten hebt aangemaakt

source: distribute a dashboard, and at the same time the datasets used for the dashboard
de: ein Dashboard und gleichzeitig die Datensätze verteilen, die Sie für das Dashboard verwenden
es: Distribuir un panel y simultáneamente los conjuntos de datos utilizados para el panel
fr: distribuer un tableau de bord et, en même temps, les jeux de données utilisés pour le créer
it: un dashboard e i dataset in esso utilizzati.
nl: een dashboard verspreiden en tezelfdertijd de datasets die gebruikt worden voor het dashboard

source: Distributing datasets to a subdomain
de: Verteilen von Datensätzen auf eine Subdomain
es: Distribuir conjuntos de datos a un subdominio
fr: Distribuer des jeux de données aux sous-domaines
it: Distribuzione dei dataset in un sottodominio
nl: Verspreiden van datasets naar een subdomein

source: From the subdomain's management page in the backoffice, you can find the *Distribute datasets* interface. By default, nothing is distributed, so the list is empty.
de: Auf der Subdomain-Verwaltungsseite im Backoffice finden Sie die Schnittstelle *Datensätze verteilen*. Standardmäßig wird nichts verteilt, so dass die Liste zunächst leer ist.
es: En la página de administración del subdominio del back office, puede encontrar la interfaz *Distribuir conjuntos de datos*. De forma predeterminada no se distribuye nada, de ahí que la lista esté vacía.
fr: De la page de gestion des sous-domaines du Back Office, vous pouvez trouver l'interface de *distribution des datasets*. Par défaut, rien n'est distribué, la liste est vide.
it: Accedendo alla pagina di gestione del sottodominio, nell'interfaccia di back-office, viene visualizzata l'interfaccia *Distribuisci dataset*: la lista dei dataset distribuiti è vuota per impostazione predefinita.
nl: Vanuit de beheerpagina van het subdomein in de back-office kan u de "Distribute datasets"-interface terugvinden. Standaard wordt er niets verspreid. Dus is de lijst leeg.

source: Distribution interface
de: Verteilungsschnittstelle
es: Interfaz de distribución
fr: Interface de distribution
it: Interfaccia di distribuzione
nl: Distributie-interface

source: Clicking on *Add a dataset* opens your domain's catalog, which allows you to find and select a dataset to distribute.
de: Durch Klicken auf *Datensatz hinzufügen* öffnet sich Ihr Domain-Katalog, in dem Sie einen Datensatz zum Verteilen finden und auswählen können.
es: Al hacer clic en *Añadir un conjunto de datos*, se abre el catálogo del dominio que permite buscar y seleccionar un conjunto de datos para distribuirlo.
fr: En cliquant sur *Ajouter un jeu de données*, vous ouvrez le catalogue de votre domaine. Cela vous permet de trouver et sélectionner un jeu de données à distribuer.
it: Dopo aver cliccato su *Aggiungi un dataset*, viene visualizzato il catalogo del dominio, all'interno del quale puoi selezionare il dataset da distribuire.
nl: Wanneer u klikt op "Voeg een dataset toe", wordt de catalogus van uw domein geopend die u toelaat om een dataset die u wil verspreiden terug te vinden en te selecteren.

source: Dataset selection
de: Auswahl eines Datensatzes
es: Selección de conjuntos de datos
fr: Sélection d'un jeu de données
it: Selezione del dataset
nl: Datasetselectie

source: Once the dataset is selected, it appears in the distributed dataset list.
de: Sobald der gewünschte Datensatz ausgewählt ist, erscheint er in der Liste der verteilten Datensätze.
es: Una vez seleccionado el conjunto de datos, este aparecerá en la lista de conjuntos de datos distribuidos.
fr: Une fois le jeu de données sélectionné, il apparaît dans la liste des jeux de données distribués.
it: Una volta selezionato, il dataset appare nell'elenco dei dataset distribuiti.
nl: Eenmaal de dataset is geselecteerd, verschijnt deze in de lijst met verspreide datasets.

source: As soon as you save, the dataset will be distributed and available on the subdomain's catalog.
de: Nach dem Speichern wird der Datensatz verteilt und ist im Subdomain-Katalog verfügbar.
es: En cuanto guarde los cambios, el conjunto de datos se distribuirá y estará disponible en el catálogo del subdominio.
fr: Dès que vous sauvez, le jeu de données sera distribué et disponible sur le catalogue du sous-domaine.
it: Verrà distribuito non appena effettuerai il salvataggio, entrando così a far parte del catalogo del sottodominio.
nl: Zodra u opslaat, zal de dataset worden verspreid en beschikbaar worden in de catalogus op het subdomein.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: From the subdomain, a distributed dataset acts just like a federated dataset: you can't edit its data (e.g. you can't re-order fields, or add processors), but you can override metadata, manage the security settings, set the dataset as restricted, filter the data for specific users or groups. The dataset may also be deleted from the subdomain.
de: In der Subdomain verhält sich ein verteilter Datensatz wie ein verbundener Datensatz: Sie können seine Daten nicht bearbeiten (Sie können beispielsweise keine Felder neu ordnen oder Prozessoren hinzufügen), Sie können jedoch Metadaten überschreiben, die Sicherheitseinstellungen verwalten, den Datensatz als beschränkt einrichten oder die Daten für bestimmte Benutzer oder Gruppen filtern. Der Datensatz kann außerdem von der Subdomain gelöscht werden.
es: Desde el subdominio, un conjunto de datos distribuido se comporta igual que un conjunto de datos federado: usted no puede editar sus datos (p. ej. no puede reordenar los campos ni añadir procesadores), pero sí puede sobrescribir los metadatos, administrar la configuración de seguridad, establecer el conjunto de datos como restringido, y filtrar los datos para usuarios o grupos específicos. También se puede suprimir el conjunto de datos del subdominio.
fr: Pour le sous-domaine, un jeu de données distribué est comme un jeu de données fédéré : vous ne pouvez pas éditer ses données (par exemple, réordonner les champs ou ajouter des processeurs). Mais vous pouvez surcharger les méta-données, gérer les paramètres de sécurité, changer la sécurité du jeu de données, filtrer les données pour des utilisateurs ou des groupes. Le jeu de données peut aussi être supprimé du sous-domaine.
it: A livello del sottodominio, un dataset distribuito si comporta come un dataset federato: non puoi modificare i suoi dati, ad esempio riordinando i campi o aggiungendo processori, ma puoi ignorare i metadati, gestire le impostazioni di sicurezza, rendere riservato l'accesso, filtrare i dati per utenti o gruppi specifici, nonché eliminare il dataset stesso dal sottodominio.
nl: Vanuit het subdomein gedraagt een verspreide dataset zich net zoals een samengevoegde dataset: u kan de data ervan niet bewerkten (bijv. u kan de velden niet in een andere volgorde zetten of processors toevoegen), maar u kan metadata opheffen, de veiligheidsinstellingen beheren, de dataset instellen als beperkt, de data filteren voor specifieke doeleinden of groepen. De dataset kan ook verwijderd worden uit het subdomein.

source: At any time, you can cancel the distribution using the little icon on the right in the distributed datasets list. This will remove the dataset from the subdomain's catalog, but it won't delete the dataset from the parent domain.
de: Sie können die Verteilung jederzeit abbrechen, indem Sie das kleine Icon rechts auf der Liste der verteilten Datensätze verwenden. Damit wird der Datensatz aus dem Subdomain-Katalog gelöscht, jedoch nicht aus der Parent-Domain.
es: En cualquier momento puede cancelar la distribución por medio del icono pequeño situado a la derecha de la lista de conjuntos de datos distribuidos. De este modo se eliminará el conjunto de datos del catálogo del subdominio, pero no se suprimirá el conjunto de datos del dominio primario.
fr: A n'importe quel moment, vous pouvez annuler la distribution en utilisant l'icône à droite du jeu de données distribué. Ceci enlèvera le jeu de données du catalogue du sous-domaine mais cela ne supprimera pas le jeu de données du domaine parent.
it: La distribuzione può essere annullata in qualunque momento, grazie alla piccola icona presente sulla destra, nell'elenco dei dataset distribuiti. Cliccando su di essa, rimuoverai il dataset dal catalogo del sottodominio, senza per questo eliminarlo dal dominio padre.
nl: U kan te allen tijde de verspreiding annuleren door middel van een klein pictogram rechts in de lijst met verspreide datasets. Hiermee wordt de dataset verwijderd uit de catalogus van het subdomein, maar wordt de dataset niet verwijderd uit het ouderdomein.

source: Distributing pages to a subdomain
de: Verteilen von Seiten auf eine Subdomain
es: Distribuir páginas a un subdominio
fr: Distribuer des pages à un sous-domaine
it: Distribuzione delle pagine a un sottodominio
nl: Verspreiden van pagina's naar een subdomein

source: From the subdomain's management page in the backoffice, you can find the *Distribute pages* interface. By default, nothing is distributed, so the list is empty.
de: Auf der Subdomain-Verwaltungsseite im Backoffice finden Sie die Schnittstelle *Seiten verteilen*. Standardmäßig wird nichts verteilt, so dass die Liste zunächst leer ist.
es: En la página de administración del subdominio del back office, puede encontrar la interfaz *Distribuir páginas*. De forma predeterminada no se distribuye nada, de ahí que la lista esté vacía.
fr: De la page de gestion des sous-domaines du Back Office, vous pouvez trouver l'interface de *distribution des pages*. Par défaut, rien n'est distribué, la liste est vide.
it: Accedendo alla pagina di gestione del sottodominio, si apre l'interfaccia *Distribuisci pagine*: la lista delle pagine distribuite è vuota per impostazione predefinita.
nl: Vanuit de beheerpagina van het subdomein in de back-office kan u de "Distribute datasets"-interface terugvinden. Standaard wordt er niets verspreid. Dus is de lijst leeg.

source: Clicking on *Add a page* opens a list of your domain's pages, which allows you to select one or more pages to distribute.
de: Durch Klicken auf *Datensatz hinzufügen* öffnet sich eine Liste Ihrer Domain-Seiten, mit der Sie eine oder mehrere Seiten zum Verteilen auswählen können.
es: Al hacer clic en *Añadir una página*, se abre una lista de páginas del dominio que permite seleccionar una o varias páginas para distribuirlas.
fr: En cliquant sur *Ajouter une page*, vous ouvrez le catalogue des pages de votre domaine. Cela vous permet de trouver et sélectionner une ou plusieurs pages à distribuer.
it: Dopo aver cliccato su *Aggiungi una pagina*, viene visualizzato un elenco di pagine del tuo dominio, nel quale puoi selezionare uno o più pagine da distribuire.
nl: Wanneer u klikt op "Voeg een pagina toe", wordt een lijst met pagina's van uw domein geopend die u toelaat om één of meerdere pagina's die u wil verspreiden te selecteren.

source: Pages list
de: Seitenliste
es: Lista de páginas
fr: Liste des pages
it: Elenco delle pagine
nl: Lijst met pagina's

source: Once the selection is done, your pages will appear in the list.
de: Nach der Auswahl erscheinen Ihre Seiten auf der Liste.
es: Una vez seleccionadas las páginas, estas aparecerán en la lista.
fr: Une fois la sélection faite, les pages apparaîtront dans la liste.
it: Una volta selezionate, le pagine appaiono nell'elenco.
nl: Eenmaal de selectie is uitgevoerd, verschijnen uw pagina's in de lijst.

source: Distribution interface with distributed pages
de: Verteilungsschnittstelle mit verteilten Seiten
es: Interfaz de distribución con páginas distribuidas
fr: Interface de distribution avec des pages distribuées
it: Interfaccia di distribuzione con le pagine distribuite
nl: Distributie-interface met verspreide pagina's

source: You just need to click on the *Save* button now, and the page will appear in the subdomain.
de: Nun müssen Sie nur noch auf die Schaltfläche "Speichern" klicken, und die Seite erscheint in der Subdomain.
es: Ya solo tiene que hacer clic en el botón *Guardar* y la página aparecerá en el subdominio.
fr: Il ne vous reste plus qu'à cliquer sur le bouton *Sauver* et la page apparaîtra dans le sous-domaine.
it: Devi semplicemente cliccare su *Salva* e le pagine entreranno a far parte del sottodominio.
nl: Het enige wat u nu hoeft te doen is klikken op de knop *Opslaan* en de pagina verschijnt in het subdomein.

source: From the subdomain, a distributed page can not be edited, because the page's content is entirely managed by the parent domain: if the content changes in the parent domain, it is immediately also changed in the subdomains. However, the subdomain can delete the page; it can also copy the page's content into a new page, which will be entirely editable like any normal page, but therefore won't automatically receive updates from the parent domain.
de: In der Subdomain kann eine verteilte Seite nicht bearbeitet werden, da der Seiten-Content komplett von der Parent-Domain aus verwaltet wird: Wenn der Content in der Parent-Domain geändert wird, ändert er sich sofort auch in der Subdomain. Dennoch kann die Seite in der Subdomain gelöscht werden; der Seiten-Content kann auch in eine neue Seite kopiert werden, die wie eine normale Seite bearbeitbar ist, jedoch keine automatischen Updates von der Parent-Domain erhält.
es: Desde el subdominio, no se puede editar una página distribuida porque el contenido de la página es administrado íntegramente por el dominio primario: si el contenido cambia en el dominio primario, también se modifica de inmediato en los subdominios. Sin embargo, el subdominio puede suprimir la página; también puede copiar el contenido de la página en una página nueva que será totalmente editable como cualquier página normal pero que, como tal, no recibirá automáticamente las actualizaciones del dominio primario.
fr: Dans le sous-domaine, une page ne peut pas être éditée car son contenu est entièrement géré depuis le domaine parent : si le contenu change sur le domaine parent, il est immédiatement changé sur les sous-domaines. Cependant, un sous-domaine peut supprimer la page; il peut aussi copier le contenu dans une nouvelle page, contenu qui sera entièrement editable comme dans une page normale mais ne recevra plus les mises à jour du domaine parent.
it: A livello del sottodominio, una pagina distribuita non può essere modificata, poiché i suoi contenuti sono gestiti interamente dal dominio padre: quando questi vengono modificati, la nuova versione appare immediatamente anche nel sottodominio distribuito. Il sottodominio, però, ha facoltà di eliminare la pagina, oppure di copiarne il contenuto su una nuova. In quest'ultimo caso, la nuova pagina sarà completamente modificabile, ma non verrà aggiornata automaticamente dal dominio padre.
nl: Een verspreide pagina kan vanuit het subdomein niet worden bewerkt aangezien de inhoud van de pagina volledig beheerd wordt door het ouderdomein: wanneer de inhoud wijzigt in het ouderdomein, wordt deze ook onmiddellijk gewijzigd in de subdomeinen. Het subdomein kan de pagina echter wel verwijderen; ze kan ook de inhoud van de pagina kopiëren naar een nieuwe pagina, die volledig zal kunnen worden bewerkt zoals elke normale pagina, maar zal daarom niet automatisch updates krijgen van het ouderdomein.

source: At any time, you can remove a distributed page using the little icon on the right of the page in the list. This will cancel the distribution to the subdomain, but will not delete the page on the parent domain.
de: Sie können jederzeit eine verteilte Seite löschen, indem Sie das kleine Icon rechts auf der Listen-Seite verwenden. Damit wird die Verteilung auf die Subdomain abgebrochen, die Seite auf der Parent-Domain jedoch nicht gelöscht.
es: En cualquier momento puede eliminar una página distribuida por medio del icono pequeño situado a la derecha de la página en la lista. De este modo se cancelará la distribución al subdominio, pero no se suprimirá la página en el dominio primario.
fr: A n'importe quel moment, vous pouvez annuler la distribution en utilisant l'icône à droite de le page distribuée. Ceci annulera la distribution au sous-domaine mais cela ne supprimera pas la page du domaine parent.
it: La distribuzione può essere annullata in qualunque momento, grazie alla piccola icona presente sulla destra dell'elenco. Cliccando su di essa, rimuoverai la pagina dal sottodominio, senza per questo eliminarla dal dominio padre.
nl: U kan te allen tijde een verspreide pagina verwijderen door middel van een pictogram rechts van de pagina in de lijst. Hiermee wordt de verspreiding naar het subdomein geannuleerd, maar wordt de pagina niet verwijderd op het ouderdomein.

source: Distributing content to multiple subdomains
de: Verteilen von Content auf mehrere Subdomains
es: Distribuir contenido a varios subdominios
fr: Distribuer du contenu à différents sous-domaines
it: Distribuzione dei contenuti in più sottodomini
nl: Verspreiden van inhoud naar meerdere subdomeinen

source: From the subdomains list, you can select two or more subdomains, and click on the *Distribute* button; this will bring you to a dedicated content distribution page for these subdomains.
de: In der Subdomain-Liste können Sie zwei oder mehrere Subdomains auswählen, klicken Sie dann auf die Schaltfläche *Verteilen*; Sie werden dann zu einer speziellen Content-Verteilungsseite für diese Subdomains weitergeleitet.
es: En la lista de subdominios, puede seleccionar 2 o más subdominios y hacer clic en el botón *Distribuir*; se le dirigirá a una página de distribución de contenido específica para estos subdominios.
fr: A partir de la liste des sous-domaines, vous pouvez sélectionner un ou plusieurs sous-domaines, en cliquant sur le bouton *Distribuer*. Ceci vous amènera à une page dédiée à la distribution de contenu pour ces sous-domaines.
it: Accedi all'elenco dei sottodomini e selezionane due o più: cliccando su *Distribuisci*, si aprirà una pagina dedicata ai contenuti da distribuire nella tua selezione.
nl: U kan vanuit de lijst met subdomeinen twee of meerdere subdomeinen selecteren en klikken op de knop *Verspreiden*; hiermee komt u terecht op een speciale pagina voor het verspreiden van inhoud voor deze subdomeinen.

source: Selecting subdomains for distribution
de: Auswählen von Subdomains für die Verteilung
es: Seleccionar subdominios para la distribución
fr: Sélectionner les sous-domaines pour la distribution
it: Selezione dei sottodomini da distribuire
nl: Selecteren van subdomeinen voor verspreiding

source: This new page will remind you of the impacted subdomains, and will let you select pages and datasets in a interface similar to the one for individual subdomains.
de: Diese neue Seite erinnert Sie an die betreffenden Subdomains und ermöglicht Ihnen die Auswahl von Seiten und Datensätzen auf einer Schnittstelle, die der für einzelne Subdomains entspricht.
es: Esta página nueva le recordará cuáles son los subdominios afectados, y le permitirá seleccionar las páginas y los conjuntos de datos en una interfaz parecida a la de los subdominios individuales.
fr: Cette nouvelle page vous rappellera les sous-domaines impactés et vous permettra de choisir les pages et les jeux de données dans une interface utilisateur similaire à celle utilisée pour un seul sous-domaine.
it: Qui troverai il riepilogo dei sottodomini interessati e avrai modo di scegliere le pagine e i dataset che desideri attraverso un'interfaccia simile a quella delle distribuzioni singole.
nl: Deze nieuwe pagina zal u herinneren aan de subdomeinen die beïnvloed werden en laat u toe pagina's en datasets te selecteren in een interface die gelijkaardig is van die voor individuele subdomeinen.

source: Selecting content
de: Auswählen von Content
es: Seleccionar contenido
fr: Sélectionner du contenu
it: Selezione dei contenuti
nl: Selecteren van inhoud

source: Organize your distribution using parameters
de: Organisieren Ihrer Verteilung mit Parametern
es: Organizar la distribución mediante parámetros
fr: Organiser votre distribution en utilisant des paramètres
it: Organizzazione della distribuzione tramite l'uso dei parametri
nl: Organiseer uw verspreiding die gebruik maakt van parameters
