Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/02_managing_subdomains/quotas.po
Languages: de, es, fr, nl

source: Managing subdomains quotas
de: Verwalten von Subdomain-Quoten
es: Administrar las cuotas de subdominios
fr: Gérer les quotas des sous-domaines
nl: Quota's van subdomeinen beheren

source: A subdomain's consumption (API calls, number of datasets...) is done directly from the parent domain's quotas. To prevent one of your subdomain to consume too much of your own quotas, you can assign individual limits to each subdomain.
de: Der Verbrauch einer Subdomain (API-Aufrufe, Anzahl an Datensätzen usw.) wird direkt von den Quoten der übergeordneten Domain abgezogen. Um zu vermeiden, dass eine Ihrer Subdomains zu viel Ihrer eigenen Quoten verbraucht, können Sie jeder einzelnen Subdomain Einschränkungen zuordnen.
es: El consumo de un subdominio (llamadas de API, número de conjuntos de datos...) se toma directamente de las cuotas del dominio primario. Para evitar que un subdominio consuma demasiada parte de sus cuotas, puede asignar límites individuales a cada uno de los subdominios.
fr: La consommation d'un sous-domaine (appels d'API, nombres de jeux de données) est prélevée directement des quotas du domaine parent. Pour empêcher un de vos sous-domaines de consommer trop de vos quotas, vous pouvez attribuer des limites à chaque sous-domaine.
nl: Het gebruik van een subdomein (API calls, aantal datasets, ...) wordt rechtstreeks beheerd vanuit de quota's van het ouderdomein. Om te vermijden dat één van uw subdomeinen te veel van uw eigen quota's opgebruikt, kan u individuele limieten toewijzen aan elk subdomein.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: This will not *assign* a part of your quota for the subdomain's exclusive usage, but will instead act as a limit. So if you have a quota of 1 million API calls per month, and have 5 subdomains each with 500 000 API calls per month, all the quota of your own domain could be consumed entirely by subdomains, but it may also be a good solution if you just want to plan ahead for a sudden API calls surge on your subdomains. Plan carefully!
de: Dadurch wird der Subdomain keinesfalls ein Teil Ihrer Quote zur exklusiven Nutzung *zugeordnet*, sondern vielmehr eine Begrenzung geschaffen. Wenn Sie also eine Quote von 1 Million API-Aufrufen pro Monat und 5 Subdomains mit jeweils 500 000 API-Aufrufen pro Monat haben, könnte Ihre eigene Quote vollständig durch die Subdomains aufgebraucht werden. Es könnte aber auch eine gute Lösung sein, wenn Sie nur für einen plötzlichen Anstieg der API-Aufrufe bei Ihren Subdomains vorausplanen möchten. Planen Sie sorgfältig!
es: Con ello no se *asigna* una parte de la cuota para uso excluso del subdominio, sino que se establece un límite. Así, si tiene una cuota de 1 millón de llamadas de API al mes y tiene 5 subdominios con 500.000 llamadas de API al mes cada uno, los subdominios podrían consumir toda la cuota de su propio dominio. Sin embargo, también puede ser una buena solución cuando solo desee prever un aumento repentino de las llamadas de API en los subdominios. ¡Lleve a cabo la planificación con cautela!
fr: Cela ne va pas *attribuer* un morceau de votre quota à l'usage exclusif du sous-domaine mais plutôt fixer une limite. Par exemple, si vous avez un quota d'1 million d'appels API par moi et que vous avez 5 sous-domaines avec chacun 500 000 appels d'API par mois, tout votre quota pourrait être entièrement consommé par vos sous-domaines mais cela pourrait aussi être une bonne solution si vous voulez prévoir une recrudescence d'appels d'API sur vos sous-domaines. Planifiez vos quotas !
nl: Hierdoor wordt geen deel van uw quota's "toegewezen" om exclusief gebruikt te worden door het subdomein, maar werkt dit wel als een limiet. Dus wanneer u een quotum hebt van 1 miljoen API calls per maand en u 5 subdomeinen hebt met elk 500 000 API calls per maand, zouden alle quota's van uw eigen domein volledig opgebruikt kunnen worden door subdomeinen, maar het kan ook een goede oplossing zijn indien u enkel vooruit wil plannen voor een plotse opstoot van het aantal API calls op uw subdomeinen. Plan zorgvuldig!

source: Quotas of subdomains are managed at the parent domain level. Administrators can thus:
de: Quoten von Subdomains werden auf der Ebene der übergeordneten Domain verwaltet. Administratoren können daher:
es: Las cuotas de los subdominios se administran a nivel del dominio primario. En este sentido, los administradores pueden:
fr: Les quotas des sous-domaines sont gérés au niveau du domaine parent. Les administrateurs des sous-domaines peuvent ainsi configurer :
nl: De quota's van subdomeinen worden beheerd op niveau van het ouderdomein. Bijgevolg kunnen beheerders:

source: Configure the number of API calls a subdomain can have
de: Die Anzahl der von einer Subdomain zulässigen API-Aufrufe konfigurieren
es: Configurar el número de llamadas de API que puede tener un subdominio
fr: Le nombre d'appels d'API dont un sous-domaine peut disposer
nl: Het aantal API calls dat een subdomein kan hebben, configureren

source: The maximum number of datasets that can be published on a subdomain
de: Die Anzahl der auf einer Subdomain maximal veröffentlichbaren Datensätze
es: El número máximo de conjuntos de datos que se pueden publicar en un subdominio
fr: Le nombre maximal de jeux de données pouvant être publiés sur un sous-domaine
nl: Het maximum aantal datasets dat gepubliceerd kan worden op een subdomein

source: The maximum total number of records in a subdomain
de: Die maximale Gesamtanzahl von Datensätzen in einer Subdomain
es: El número total máximo de registros de un subdominio
fr: Le nombre maximal d'enregistrements dans un sous-domaine
nl: Het maximum totaal aantal records in een subdomein

source: The maximum number of records of a dataset in a subdomain
de: Die maximale Anzahl von Einträgen eines Datensatzes in einer Subdomain
es: El número máximo de registros de un conjunto de datos en un subdominio
fr: Le nombre maximal d'enregistrements dans un jeu de données d'un sous-domaine
nl: Het maximum aantal records van een dataset in een subdomein

source: Manage your subdomain quotas
de: Ihre Subdomain-Quoten verwalten
es: Administrar las cuotas de subdominios
fr: Gérer les quotas de vos sous-domaines
nl: De quota's van uw subdomein beheren
