Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/adding_processors_to_a_dataset.po
Languages: de, es, fr, it, nl

source: :doc:`WKT and WKB to GeoJSON<processors/wkt_and_wkb_to_geojson>`
de: :doc:`WKT und WKB zu GeoJSON<processors/wkt_and_wkb_to_geojson>`
es: :doc:`WKT y WKB en GeoJSON<processors/wkt_and_wkb_to_geojson>`
fr: :doc:`WKT et WKB en GeoJSON<processors/wkt_and_wkb_to_geojson>`
it: :doc:`Da WKT e WKB a GeoJSON<processors/wkt_and_wkb_to_geojson>`

source: Convert vector geometry object represented in WKT or WKB into a GeoJson object
de: Mit diesem Prozessor können Sie das in WKT oder WKB dargestellte Vektorgeometrieobjekt in ein GeoJson-Objekt umwandeln.
es: Convertir un objeto de geometría vectorial representado con el formato WKT o WKB en un objeto GeoJson
fr: Convertir un objet géométrique vectoriel en WKT ou WKB en un objet GeoJson
it: Converte un oggetto di geometria vettoriale con formato WKT o WKB in un oggetto GeoJson
nl: Zet een vector geometrie voorwerp dat weergegeven wordt in WKT of WKB om in een GeoJson-voorwerp

source: Date processors
de: Datumsprozessoren
es: Procesadores de fecha
fr: Processeurs de dates
it: Processori di data
nl: Datumverwerkers

source: :doc:`Normalize date<processors/normalize_date>`
de: :doc:`Datum normalisieren<processors/normalize_date>`
es: :doc:`Normalizar fecha<processors/normalize_date>`
fr: :doc:`Normaliser une Date<processors/normalize_date>`
it: :doc:`Normalizza la data<processors/normalize_date>`

source: Normalize a date format not automatically understood by the platform
de: Mit diesem Prozessor können Sie ein Datumsformat normalisieren, das von der Plattform nicht automatisch verstanden wird.
es: Normalizar un formato de fecha que la plataforma no entendería automáticamente
fr: Normaliser un format de date qui n'est pas automatiquement compris par la plateforme
it: Normalizza un formato di data non compreso automaticamente dalla piattaforma
nl: Normaliseert een datumformaat dat niet automatisch begrepen wordt door het platform

source: :doc:`Set timezone<processors/set_timezone>`
de: :doc:`Zeitzone einstellen<processors/set_timezone>`
es: :doc:`Establecer zona horaria<processors/set_timezone>`
fr: :doc:`Définir le fuseau horaire<processors/set_timezone>`
it: :doc:`Imposta fuso orario<processors/set_timezone>`

source: Define a timezone for a datetime field
de: Mit diesem Prozessor können Sie eine Zeitzone für ein DateTime-Feld bestimmen.
es: Definir una zona horaria para un campo de fecha y hora
fr: Définir un fuseau horaire pour un champ datetime
it: Definisce un fuso orario per un campo data/ora
nl: Definieert een tijdzone voor een datum/tijd-veld

source: Text processors
de: Textprozessoren
es: Procesadores de texto
fr: Processeurs de texte
it: Processori di testo
nl: Tekstverwerkers

source: :doc:`Concatenate text<processors/concatenate_text>`
de: :doc:`Text verknüpfen<processors/concatenate_text>`
es: :doc:`Concatenar texto<processors/concatenate_text>`
fr: :doc:`Concaténer du Texte<processors/concatenate_text>`
it: :doc:`Testo concatenato<processors/concatenate_text>`

source: Concatenate 2 fields
de: Mit diesem Prozessor können Sie zwei Felder verknüpfen.
es: Concatenar 2 campos
fr: Concaténer 2 champs
it: Concatena 2 campi
nl: Voegt 2 velden samen

source: :doc:`Decode HTML entities<processors/decode_html_entities>`
de: :doc:`HTML-Entities dekodieren<processors/decode_html_entities>`
es: :doc:`Descodificar entidades HTML<processors/decode_html_entities>`
fr: :doc:`Décoder les entités HTML<processors/decode_html_entities>`
it: :doc:`Decodifica entità HTML<processors/decode_html_entities>`

source: Decode HTML entities from a text, to transform them into valid HTML
de: Dieser Prozessor dekodiert HTML-Entities aus einem Text, um sie in gültiges HTML umzuwandeln.
es: Descodificar entidades HTML de un texto para convertirlas en HTML válido
fr: Décoder les entités HTML d'un texte, afin de les transformer en code HTML valide
it: Decodifica le entità HTML da un testo, trasformandole in codice HTML valido
nl: Decodeert HTML-entiteiten uit een tekst om deze om te zetten naar geldige HTML.

source: :doc:`Extract HTML<processors/extract_html>`
de: :doc:`HTML extrahieren<processors/extract_html>`
es: :doc:`Extraer HTML<processors/extract_html>`
fr: :doc:`Extraire du HTML<processors/extract_html>`
it: :doc:`Estrai HTML<processors/extract_html>`

source: Extract HTML from an HTML tag to only keep textual content
de: Mit diesem Prozessor können Sie HTML aus einem HTML-Tag extrahieren, um nur den Textinhalt zu beizubehalten.
es: Extraer HTML de una etiqueta HTML para conservar únicamente el contenido textual
fr: Extraire les tags HTML d’un texte afin de ne conserver que le contenu textuel
it: Estrae i tag HTML mantenendo solo il contenuto testuale
nl: Extraheert HTML uit een HTML-tag om enkel de tekstuele context te behouden

source: :doc:`Extract text<processors/extract_text>`
de: :doc:`Text extrahieren<processors/extract_text>`
es: :doc:`Extraer texto<processors/extract_text>`
fr: :doc:`Extraire du Texte<processors/extract_text>`
it: :doc:`Estrai testo<processors/extract_text>`

source: Extract part of a field value using a regular expression
de: Mit diesem Prozessor können Sie einen Teil eines Feldwertes mit einem regulären Ausdruck extrahieren.
es: Extraer parte del valor de un campo con una expresión regular
fr: Extraire une partie d'une valeur de champ à l'aide d'une expression régulière
it: Estrae parte del valore di un campo mediante un'espressione regolare
nl: Extraheert een deel van een veldwaarde met behulp van een regelmatige uitdrukking

source: :doc:`Extract URLs<processors/extract_url>`
de: :doc:`URLs extrahieren<processors/extract_url>`
es: :doc:`Extraer direcciones URL<processors/extract_url>`
fr: :doc:`Extraire les URL<processors/extract_url>`
it: :doc:`Estrai URL<processors/extract_url>`

source: Extract URLs from HTML or text contents
de: Mit diesem Prozessor können Sie URLs aus HTML oder Textinhalt extrahieren.
es: Extraer direcciones URL de contenido de texto o HTML
fr: Extraire les URL du contenu HTML ou texte
it: Estrae gli URL da un contenuto HTML o testuale
nl: Extraheert URL's uit HTML of tekstinhoud

source: :doc:`Normalize Unicode values<processors/normalize_unicode_values>`
es: :doc:`Normalizar valores Unicode<processors/normalize_unicode_values>`

source: Normalize Unicode content using the Normalization Form Canonical Composition (NFC)
es: Normalizar el contenido Unicode mediante el formato NFC (Normalization Form Canonical Composition).
nl: Normaliseer Unicode-content door gebruik te maken van de Normalization Form Canonical Composition (NFC)

source: :doc:`Normalize URL<processors/normalize_url>`
de: :doc:`URL normalisieren<processors/normalize_url>`
es: :doc:`Normalizar dirección URL<processors/normalize_url>`
fr: :doc:`Normaliser une URL<processors/normalize_url>`
it: :doc:`Normalizza l'URL<processors/normalize_url>`

source: Normalize a field value to obtain a valid URL
de: Mit diesem Prozessor können Sie einen Feldwert normalisieren, um eine gültige URL zu erhalten.
es: Normalizar el valor de un campo para obtener una dirección URL válida
fr: Normaliser une valeur de champ pour obtenir une URL valide
it: Normalizza il valore di un campo per ottenere un URL valido
nl: Normaliseert een veldwaarde om een geldige URL te bekomen

source: :doc:`Replace text<processors/replace_text>`
de: :doc:`Text ersetzen<processors/replace_text>`
es: :doc:`Sustituir texto<processors/replace_text>`
fr: :doc:`Remplacer le Texte<processors/replace_text>`
it: :doc:`Sostituisci il testo<processors/replace_text>`

source: Replace a textual field value with a chosen text
de: Mit diesem Prozessor können Sie einen Textfeldwert durch einen ausgewählten Text ersetzen.
es: Sustituir el valor de un campo textual por un texto seleccionado
fr: Remplacer une valeur de champ textuel par un texte choisi
it: Sostituisce il valore di un campo testuale con il testo desiderato
nl: Vervangt een tekstueel veld door een gekozen tekst

source: :doc:`Replace via regular expression<processors/replace_via_regexp>`
es: :doc:`Sustituir mediante expresión regular<processors/replace_via_regexp>`
fr: :doc:`Remplacer avec une expression régulière<processors/replace_via_regexp>`

source: Replace a remove part of a field value using a regular expression
de: Mit diesem Prozessor können Sie einen Teil eines Feldwertes mit einem regulären Ausdruck ersetzen.
es: Sustituir o eliminar una parte del valor de un campo por una expresión regular
fr: Remplacer une partie supprimée d'une valeur de champ à l'aide d'une expression régulière
it: Sostituisce la parte rimossa del valore di un campo utilizzando un'espressione regolare
nl: Vervangt een verwijderd deel van een veldwaarde met behulp van een regelmatige uitdrukking

source: :doc:`Split text<processors/split_text>`
de: :doc:`Text aufteilen<processors/split_text>`
es: :doc:`Dividir texto<processors/split_text>`
fr: :doc:`Séparer le Texte<processors/split_text>`
it: :doc:`Dividi il testo<processors/split_text>`

source: Split a field value and extract part of it in a new field
de: Mit diesem Prozessor können Sie den Wert eines Feldes aufteilen und einen Teil davon in ein neues Feld zu extrahieren.
es: Dividir el valor de un campo y extraer una parte del mismo en un campo nuevo
fr: Séparer la valeur d'un champ et en extraire une partie dans un nouveau champ.
it: Divide il valore di un campo ed estrae una parte di esso in un nuovo campo
nl: Splitst een veldwaarde en extraheert een deel ervan in een nieuw veld

source: Generic processors
de: Generische Prozessoren
es: Procesadores genéricos
fr: Processeurs génériques
it: Processori generici
nl: Generische processoren

source: :doc:`Add a field<processors/add_field>`
de: :doc:`Ein Feld hinzufügen<processors/add_field>`
es: :doc:`Añadir un campo<processors/add_field>`
fr: :doc:`Ajouter un Champ<processors/add_field>`
it: :doc:`Aggiungi un campo<processors/add_field>`

source: Add a new empty field in a dataset
es: Añadir un nuevo campo vacío en un conjunto de datos
nl: Voegt een nieuw leeg veld toe in een dataset

source: :doc:`Copy a field<processors/copy_field>`
de: :doc:`Ein Feld kopieren<processors/copy_field>`
es: :doc:`Copiar un campo<processors/copy_field>`
fr: :doc:`Copier un Champ<processors/copy_field>`
it: :doc:`Copia un campo<processors/copy_field>`

source: Copy a field value from a field to another
de: Mit diesem Prozessor können Sie einen Feldwert von einem in ein anderes Feld kopieren.
es: Copiar el valor de un campo en otro campo
fr: Copier une valeur de champ d'un champ à un autre
it: Copia un valore da un campo a un altro
nl: Kopieert een veldwaarde vanuit een veld naar een ander veld

source: :doc:`Deduplicate multivalued fields <processors/deduplicate_multivalued_fields>`
es: :doc:`Desduplicar campos multivalor <processors/deduplicate_multivalued_fields>`
fr: :doc:`Dédupliquer des champs multi-valués <processors/deduplicate_multivalued_fields>`

source: Remove duplicated values in a multivalued field
es: Eliminar valores duplicados en un campo multivalor
fr: Supprimer les valeurs dupliquées d'un champ multivalué
nl: Gedupliceerde waarden in een veld met meerdere waarden verwijderen

source: :doc:`Delete record <processors/delete_record>`
es: :doc:`Suprimir registro <processors/delete_record>`
nl: :doc:`Record verwjderen <processors/delete_record>`

source: Delete a record based on field values
es: Suprimir un registro en función de los valores de campo
nl: Een record verwijderen op basis van veldwaarden

source: :doc:`Expand JSON array<processors/expand_json_array>`
es: :doc:`Expandir matriz JSON<processors/expand_json_array>`
fr: :doc:`Déplier le tableau JSON<processors/expand_json_array>`

source: Transpose rows containing a JSON array into several rows
de: Mit diesem Prozessor können Sie Zeilen mit einem JSON-Array in mehrere Zeilen umwandeln.
es: Transponer las filas que contiene una matriz JSON en varias filas
fr: Transposer les lignes contenant un tableau JSON en plusieurs lignes
it: Traspone le righe contenenti un array JSON in varie righe
nl: Zet rijen die een JSON-array bevatten om in verschillende rijen

source: :doc:`Expand multivalued field<processors/expand_multivalued_field>`
es: :doc:`Expandir el campo multivalor<processors/expand_multivalued_field>`
fr: :doc:`Agrandir le champ multi-valué<processors/expand_multivalued_field>`

source: Transform the values contained in a multivalued field into several records
es: Transformar los valores dentro de un campo multivalor en varios registros
fr: Transformer les valeurs contenues dans un champ multi-valué en plusieurs enregistrements
nl: De waarde die in een veld met meerdere waarden zitten, omvormen tot verschillende records.

source: :doc:`Expression<processors/expression>`
de: :doc:`Ausdruck<processors/expression>`
es: :doc:`Expresión<processors/expression>`
it: :doc:`Espressione<processors/expression>`

source: Write complex expression patterns using field values
de: Mit diesem Prozessor können Sie komplexe Ausdrucksmuster mit Feldwerten schreiben.
es: Escribir patrones de expresiones complejas mediante valores de campo
fr: Écrire des expressions complexes à l'aide de valeurs de champ
it: Scrive espressioni complesse utilizzando i valori dei campi
nl: Schrijft complexe uitdrukkingspatronen met behulp van veldwaarden

source: :doc:`Extract bit range<processors/extract_bit_range>`
de: :doc:`Bitbereich extrahieren<processors/extract_bit_range>`
es: :doc:`Extraer rango de bits<processors/extract_bit_range>`
fr: :doc:`Extraire la plage de bits<processors/extract_bit_range>`
it: :doc:`Estrai intervallo di bit<processors/extract_bit_range>`

source: Extract an arbitrary bit range from an hexadecimal or binary content
de: Mit diesem Prozessor können Sie einen beliebigen Bitbereich aus einem hexadezimalen oder binären Inhalt extrahieren.
es: Extraer un rango de bits arbitrario de un contenido hexadecimal o binario
fr: Extraire une plage de bits arbitraire à partir d'un contenu hexadécimal ou binaire
nl: Extraheert een arbitrair bit-bereik uit een hexadecimale of binaire inhoud

source: :doc:`Extract from JSON<processors/extract_from_json>`
de: :doc:`Extrahieren von JSON<processors/extract_from_json>`
es: :doc:`Extraer de JSON<processors/extract_from_json>`
fr: :doc:`Extraire d'un objet JSON<processors/extract_from_json>`
it: :doc:`Estrai da JSON<processors/extract_from_json>`

source: Extract values from a field containing a JSON object
de: Mit diesem Prozessor können Sie Werte aus einem Feld mit einem JSON-Objekt extrahieren.
es: Extraer los valores de un campo que contiene un objeto JSON
fr: Extraire des valeurs d'un champ contenant un objet JSON
it: Estrae i valori da un campo che contiene un oggetto JSON
nl: Extraheert waarden uit een veld dat een JSON-voorwerp bevat

source: :doc:`File<processors/file>`
de: :doc:`Datei<processors/file>`
es: :doc:`Archivo<processors/file>`
fr: :doc:`Fichier<processors/file>`

source: Retrieve images from URLs
de: Mit diesem Prozessor können Sie Bilder aus URLs abrufen.
es: Recuperar imágenes de direcciones URL
fr: Récupérer des images depuis des URL
it: Richiama immagini dagli URL
nl: Haalt afbeeldingen uit URL's

source: :doc:`Join datasets<processors/join_dataset>`
es: :doc:`Unir conjuntos de datos<processors/join_dataset>`
fr: :doc:`Joindre des jeux de données<processors/join_dataset>`

source: Join 2 datasets together to retrieve a specified field in a dataset
de: Mit diesem Prozessor können Sie zwei Datensätze verbinden, um ein bestimmtes Feld in einem Datensatz abzurufen.
es: Unir 2 conjuntos de datos para recuperar un campo especificado en un conjunto de datos
fr: Joindre 2 jeux de données pour récupérer un champ spécifié dans un jeu de données
it: Unisce 2 dataset per recuperare un campo specificato in un dataset
nl: Voegt 2 datasets samen om een welbepaald veld in een dataset terug te vinden

source: :doc:`JSON array to multivalued<processors/json_array_to_multivalued>`
de: :doc:`JSON-Array zu mehrwertigem Feld<processors/json_array_to_multivalued>`
es: :doc:`Matriz JSON en multivalor<processors/json_array_to_multivalued>`
fr: :doc:`Tableau JSON vers multivalué<processors/json_array_to_multivalued>`
it: :doc:`Dall'array JSON al campo multivalore<processors/json_array_to_multivalued>`

source: Extract multiple values from a JSON array and concatenates them into a multivalued field
de: Mit diesem Prozessor können Sie mehrere Werte aus einem Feld mit einem JSON-Array extrahieren und in einem mehrwertigen Feld verknüpfen.
es: Extraer varios valores de una matriz JSON y concatenarlos en un campo multivalor
fr: Extraire des valeurs multiples d'un tableau JSON et les concaténer dans un champ multivalué
it: Estrae valori multipli da un array JSON e li concatena in un campo multivalore
nl: Extraheert meerdere waarden uit een JSON-array en voegt deze samen in een veld met meerdere waarden

source: :doc:`Meta expression <processors/meta_expression>`
es: :doc:`Expresión de metadatos <processors/meta_expression>`
fr: :doc:`Méta-expression <processors/meta_expression>`

source: Apply an expression on multiple fields
es: Aplicar una expresión en varios campos
fr: Appliquer une expression sur plusieurs champs
nl: Een uitdrukking op meerdere velden toepassen

source: :doc:`Skip records<processors/skip_records>`
de: :doc:`Einträge überspringen<processors/skip_records>`
es: :doc:`Omitir registros<processors/skip_records>`
fr: :doc:`Ignorer des enregistrements<processors/skip_records>`
it: :doc:`Ignora i record<processors/skip_records>`

source: Skip records from a dataset
de: Mit diesem Prozessor können Sie Einträge eines Datensatzes überspringen.
es: Omitir registros de un conjunto de datos
fr: Ignorer des enregistrements d'un jeu de données
it: Ignora i record di un dataset
nl: Slaat records uit een dataset over

source: :doc:`Transform boolean columns to multivalued field<processors/transform_boolean_columns_to_multivalued_field>`
es: :doc:`Transformar columnas booleanas en campo multivalor<processors/transform_boolean_columns_to_multivalued_field>`
fr: :doc:`Transformer les colonnes de booléens en champs multivalués<processors/transform_boolean_columns_to_multivalued_field>`

source: Transform true values from boolean fields into a multivalued field
de: Mit diesem Prozessor können Sie wahre Werte aus booleschen Feldern in ein mehrwertiges Feld umwandeln.
es: Transformar los valores verdaderos de los campos booleanos en un campo multivalor
fr: Transformer des valeurs réelles de champs booléens en un champ à valeurs multiples
it: Trasforma i valori veri dei campi booleani in un campo multivalore
nl: Zet ware waarden uit boolean velden om in een veld met meerdere waarden

source: :doc:`Transpose columns to rows<processors/transpose_fields>`
es: :doc:`Transponer columnas en filas<processors/transpose_fields>`
fr: :doc:`Transposer des colonnes en lignes<processors/transpose_fields>`

source: Transform labels into field values
de: Mit diesem Prozessor können Sie Beschriftungen in Feldwerte umwandeln.
es: Transformar etiquetas en valores de campo
fr: Transformer des labels en valeurs de champ
it: Trasforma le etichette in valori di campi
nl: Transformeert labels in veldwaarden

source: Processors are tools that can be used in order to modify, improve or enrich the data of a dataset. In the Opendatasoft platform, processors are classified in 4 different categories:
fr: Les processeurs sont des outils qui peuvent être utilisés pour modifier, améliorer ou enrichir les données d'un jeu de données. Dans la plateforme Opendatasoft, les processeurs sont répartis en 4 catégories différentes :

source: (optional) Click on the edition icon |icon-edit| to rename the processor. This step can especially be useful when a lot of processors are applied to a dataset, including multiple processors of the same type (e.g. renaming the multiple Expression processors applied to a dataset to know more easily which one contains which expression).
fr: (optionnel) Cliquez sur l'icône de modification |icon-edit| pour renommer le processeur. Cette étape peut être particulièrement utile quand de nombreux processeurs sont appliqués à un jeu de données, notamment plusieurs processeurs du même type (p. ex, renommer les multiples processeurs Expression appliqués à un jeu de données pour identifier plus facilement l'expression contenue dans chaque processeur).

source: You may need to click outside the processor box once the parameters are configured, to make sure the processor and the changes it triggers are taken into account and applied to the dataset.
de: Nachdem die Einstellungen vorgenommen wurden, müssen Sie möglicherweise ein Mal außerhalb des Prozessorfeldes klicken, um zu prüfen, ob der Prozessor und die von ihm ausgelösten Änderungen berücksichtigt und für den Datensatz übernommen werden.
fr: Vous devez peut-être cliquer en dehors de la zone du processeur une fois les paramètres configurés, pour vous assurer que le processeur et les modifications qu'il déclenche sont pris en compte et appliqués au jeu de données.
it: Una volta configurati i parametri, può essere necessario cliccare all'esterno della casella del processore, per fare in modo che esso e le modifiche che determina siano presi in carico e applicati al dataset.

source: **Geocoders**: to convert a human readable address into a geo point.
fr: **Géocodeurs** : pour convertir une adresse lisible par l'homme en un point géo.

source: **GeoJoin processor**: to retrieve geoshapes from normalized codes for country specific administrative divisions. The GeoJoin processor supports several countries, each of which features several indexing codes like postcode, state or region identifier, etc.
de: **GeoJoin-Prozessor**: zum Abruf von Geoformen aus normalisierten Codes für länderspezifische Verwaltungseinheiten. Der GeoJoin-Prozessor unterstützt verschiedene Länder, mit jeweils mehreren Indizierungscodes (wie Postleitzahl-, Status- oder Ortskennung usw.).
fr: **Processeur de jointure géo** : pour récupérer des formes géo à partir de codes normalisés, pour des divisions administratives spécifiques de pays. Le processeur de jointure géographique supporte plusieurs pays, chacun d'entre eux possédant ses propres codes d'indexation comme le code postal, l'état ou l'identifiant régional, etc.
it: **Processore GeoJoin**: per recuperare le forme geografiche da codici normalizzati per le divisioni amministrative di un determinato paese. Il processore GeoJoin supporta vari paesi, ciascuno dei quali con vari codici di indicizzazione, come codici di avviamento postale, identificativi di stato o di regione e così via.

source: **Retrieve Administrative Divisions processor**: to retrieve the name, code and geoshape of country specific administrative divisions enclosing a geopoint.
de: **Prozessor zum Abruf von Verwaltungseinheiten**: zum Abruf von Namen, Code und Geoform länderspezifischer Verwaltungseinheiten, die einen Geopunkt einschließen.
fr: **Processeur Récupérer les divisions administratives** : pour récupérer le nom, le code et la forme géo des divisions administratives spécifiques d'un pays comprenant un point géo.
it: **Processore Recupera divisioni amministrative**: per recuperare nome, codice e forma geografica delle divisioni amministrative di un determinato paese che racchiudono un punto geografico.

source: Geocode full text addresses by using the ArcGIS geocoding API
de: Mit diesem Prozessor können Sie Volltext-Adressen mit der ArcGIS Geocoding-API geocodieren.
fr: Géocoder des adresses en format texte en utilisant l'API de géocodage ArcGIS
it: Esegue la geocodifica degli indirizzi full-text mediante l'API di geocodifica ArcGIS

source: :doc:`Geojoin<processors/geojoin>`
fr: :doc:`Jointure géographique<processors/geojoin>`
