Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/adding_processors_to_a_dataset.po
Languages: de, es, fr, it, nl

source: Adding processors to a dataset
de: Prozessoren zu einem Datensatz hinzufügen
es: Añadir procesadores a un conjunto de datos
fr: Ajouter des processeurs à un jeu de données
it: Aggiunta di processori a un dataset
nl: Processors aan een dataset toevoegen

source: Processors are tools that can be used in order to modify, improve, or enrich the data of a dataset. In the Opendatasoft platform, processors are classified into 4 different categories:
es: Los procesadores son herramientas que pueden emplearse para modificar, mejorar o enriquecer los datos de un conjunto de datos. En la plataforma Opendatasoft, los procesadores se clasifican en 4 categorías distintas:
nl: Processors zijn tools die gebruikt kunnen worden om de data van een dataset te wijzigen, te verbeteren of te verrijken. In het Opendatasoft-platform worden processors ondergebracht in 4 verschillende categorieën:

source: Processors for geographical mapping
de: Prozessoren für die geografische Zuordnung
es: Procesadores para los mapas geográficos
fr: processeurs pour les traitements géographiques,
it: Processori per la mappatura geografica
nl: Processors voor geografische mapping

source: Processors for dates handling
de: Prozessoren für die Datenverarbeitung
es: Procesadores para la gestión de fechas
fr: processeur pour le traitement des dates,
it: Processori per la gestione delle date
nl: Processors voor gegevensverwerking

source: Processors for text transformations
de: Prozessoren für Textumwandlungen
es: Procesadores para las transformaciones de texto
fr: processeurs pour les transformations de texte,
it: Processori per le trasformazioni del testo
nl: Processors voor teksttransformaties

source: Processors for generic operations
de: Prozessoren für generische Operationen
es: Procesadores para las operaciones genéricas
fr: processeurs pour les traitements génériques.
it: Processori per le operazioni generiche
nl: Processors voor generische operaties

source: To add a processor to a dataset:
de: Um einen Prozessor zu einem Datensatz hinzuzufügen:
es: Para añadir un procesador a un conjunto de datos:
fr: Pour ajouter un processeur à un jeu de données :
it: Per aggiungere un processore a un dataset:
nl: Om een processor aan een dataset toe te voegen:

source: In the Processing tab, click on the **Add a processor** button.
de: Klicken Sie in der Registerkarte "Verarbeitung" auf den Button **Einen Prozessor hinzufügen**.
es: En la ficha Procesadores, haga clic en el botón **Añadir un procesador**.
fr: Dans l'onglet Traitement, cliquez sur le bouton **Ajouter un processeur**.
it: Nella scheda Elaborazione, clicca sul pulsante **Aggiungi un processore**.
nl: Klik in het tabblad Verwerken op de knop **Een processor toevoegen**

source: Choose the processor to add to the dataset.
de: Wählen Sie den Prozessor, den Sie dem Datensatz hinzufügen möchten.
es: Elija el procesador que desea añadir al conjunto de datos.
fr: Choisissez le processeur à ajouter au jeu de données.
it: Scegli il processore da aggiungere al dataset.
nl: Kies de processor die aan de dataset moet worden toegevoegd.

source: Using the documentation of the chosen processor, fill in the right parameters to set the processor.
de: Achten Sie auf die Dokumentation des ausgewählten Prozessors, um die richtigen Parameter zur Einstellung des Prozessors einzugeben.
es: Con la documentación del procesador seleccionado, especifique los parámetros adecuados para establecer el procesador.
fr: À l'aide de la documentation correspondant au processeur choisi, renseignez les paramètres appropriés pour configurer le processeur.
it: In base alla documentazione del processore scelto, compila i parametri appropriati per impostarlo.
nl: Vul met behulp van de documentatie van de gekozen processor, de juiste parameters in om de processor in te stellen.

source: (optional) Click on the edition icon |icon-edit| to rename the processor. This step can especially be useful when a lot of processors are applied to a dataset, including multiple processors of the same type (for example, renaming the multiple Expression processors applied to a dataset to know more easily which one contains which expression).
es: (opcional) Haga clic en el icono de edición |icon-edit| para cambiar el nombre del procesador. Este paso puede resultar especialmente útil cuando se aplican muchos procesadores a un conjunto de datos, como por ejemplo varios procesadores del mismo tipo (por ejemplo, cambiar el nombre de los diversos procesadores Expresión aplicados a un conjunto de datos para saber más fácilmente cuál contiene qué expresión).
nl: (optioneel) Klik op het icoon bewerken |icon-edit| om de processor een nieuwe naam te geven. Deze stap kan bijzonder nuttig zijn wanneer een groot aantal processoren op een dataset worden toegepast, waaronder meerdere processoren van hetzelfde type (bijv. meerdere Expression-processoren die op een dataset worden toegepast een nieuwe naam geven om gemakkelijker te weten welke nu juist welke uitdrukking bevat).

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: You may need to click outside the processor box once the parameters are configured to make sure the processor and the changes it triggers are taken into account and applied to the dataset.
es: Tal vez tenga que hacer clic fuera del cuadro del procesador una vez configurados los parámetros para asegurarse de que el procesador y los cambios que desencadena se tienen en cuenta y se aplican al conjunto de datos.
nl: Eenmaal de parameters zijn geconfigureerd, kunt u buiten het processorvakje klikken om ervoor te zorgen dat de processor en de wijzigingen die deze veroorzaakt, worden geregistreerd en toegepast op de dataset.

source: No matter the processor, always use the technical identifiers of the fields to process, never the labels.
de: Verwenden Sie unabhängig vom Prozessor stets die technischen Kennungen der zu verarbeitenden Felder und niemals die Beschriftungen.
es: Independientemente del procesador, utilice siempre los identificadores técnicos de los campos de proceso, nunca las etiquetas.
fr: Quel que soit le processeur, utilisez toujours les identifiants techniques des champs à traiter, jamais les labels.
it: Con qualsiasi processore, utilizza sempre gli identificatori dei campi da elaborare, mai le etichette.
nl: Gebruik altijd de technische identifiers van de velden die moeten worden verwerkt en nooit de labels, ongeacht de processor.

source: Geographical processors
de: Geografische Prozessoren
es: Procesadores geográficos
fr: Processeurs géographiques
it: Processori geografici
nl: Geografische processoren

source: Geographical processors are divided into 4 categories, according to what is tried to being achieved:
de: Geografische Prozessoren sind je nach Zweck in 4 Kategorien unterteilt:
es: Los procesadores geográficos se dividen en 4 categorías en función de lo que se desea obtener:
fr: Les processeurs géographiques sont divisés en 4 catégories, en fonction du but recherché :
it: I processori geografici sono suddivisi in 4 categorie, a seconda del risultato che si desidera ottenere:
nl: Geografische processors worden onderverdeeld in 4 categorieën, afhankelijk van wat geprobeerd wordt te realiseren:

source: **Geocoders**: to convert a human-readable address into a geo point.
es: **Geocodificadores**: Para convertir una dirección natural en un punto geográfico.
nl: **Geocoders**: om een adres dat door mensen kan worden gelezen om te zetten naar een geopoint.

source: **GeoJoin processor**: to retrieve geoshapes from normalized codes for country-specific administrative divisions. The GeoJoin processor supports several countries, each of which features several indexing codes like postcode, state or region identifier, etc.
es: **Procesador GeoJoin**: Para recuperar las formas geográficas de los códigos normalizados de las divisiones administrativas específicas de país. El procesador GeoJoin admite varios países, cada uno de ellos con varios códigos de indexación como código postal, identificador de estado o región, etc.
nl: **GeoJoin processor**: om geoshapes uit genormaliseerde codes voor landenspecifieke administratieve afdelingen terug te vinden. De GeoJoin-processor ondersteunt verschillende landen, die elk afzonderlijke indexatiecodes heeft, zoals postcode, staat of regio identifier, enz.

source: **Retrieve Administrative Divisions processor**: to retrieve the name, code, and geoshape of country-specific administrative divisions enclosing a geopoint.
es: **Procesador Recuperar divisiones administrativas**: Para recuperar el nombre, el código y la forma geográfica de las divisiones administrativas específicas de país en que se encuentra un punto geográfico.
nl: **Retrieve Administrative Divisions processor**: om de naam, code en geografische vorm op te halen van landenspecifieke afdelingen die een geografisch punt omvatten.

source: **Converters & Functions**: to simplify, convert or normalize geographical data, or run computations based on them.
es: **Convertidores y funciones**: Para simplificar, convertir o normalizar datos geográficos, o ejecutar cálculos a partir de ellos.
fr: **Convertisseurs et fonctions** : pour simplifier, convertir ou normaliser des données géographiques, ou effectuer des calculs à partir de ces données.
nl: **Converters and functions**: om geografische gegevens te vereenvoudigen, te converteren of te normaliseren of om berekeningen uit te voeren die erop gebaseerd zijn.

source: Geocoders
de: Geocoder
es: Geocodificadores
fr: Géocodeurs
it: Geocodificatori

source: Name
es: Nombre
fr: Nom
it: Nome
nl: Naam

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Availability
de: Verfügbarkeit
es: Disponibilidad
fr: Disponibilité
it: Disponibilità
nl: Beschikbaarheid

source: :doc:`Geocode with ArcGIS<processors/geocode_with_arcgis>`
de: :doc:`Geocode mit ArcGIS<processors/geocode_with_arcgis>`
es: :doc:`Geocodificar con ArcGIS<processors/geocode_with_arcgis>`
fr: :doc:`Géocoder avec ArcGIS<processors/geocode_with_arcgis>`
it: :doc:`Geocodifica con ArcGIS<processors/geocode_with_arcgis>`

source: Geocode full-text addresses by using the ArcGIS geocoding API
es: Geocodificar las direcciones de texto completo mediante la API de geocodificación de ArcGIS
nl: Volledige tekstadressen van geocodes door gebruik te maken van ArcGIS Geocoding API

source: Default
de: Standard
es: Valor predeterminado
fr: Par défaut
it: Predefinito
nl: Standaard

source: :doc:`Geocode with BAN (France)<processors/geocode_with_ban>`
es: :doc:`Geocodificar con BAN (Francia)<processors/geocode_with_ban>`
fr: :doc:`Géocoder avec la BAN (France)<processors/geocode_with_ban>`

source: Geocode addresses in France by using the Base d'Adresses Nationale (BAN) service
de: Mit diesem Prozessor können Sie Adressen in Frankreich mit dem BAN-Service (Base d'Adresses Nationale) geokodieren.
es: Geocodificar las direcciones de Francia a través del servicio BAN (Base d'Adresses Nationale)
fr: Géocoder des adresses en France grâce au service de Base d'Adresses Nationale (BAN)
it: Esegue la geocodifica degli indirizzi della Francia tramite il servizio BAN (Base d'Adresses Nationale)
nl: Geocode-adressen in Frankrijk door de Base d'Adresses Nationale (BAN) service te gebruiken

source: :doc:`Geocode with PDOK<processors/geocode_with_pdok>`
de: :doc:`Geocode mit PDOK<processors/geocode_with_pdok>`
es: :doc:`Geocodificar con PDOK<processors/geocode_with_pdok>`
fr: :doc:`Géocoder avec PDOK<processors/geocode_with_pdok>`
it: :doc:`Geocodifica con PDOK<processors/geocode_with_pdok>`

source: Geocode addresses in the Netherlands by using the PDOK service
de: Mit diesem Prozessor können Sie Adressen in den Niederlanden mit dem PDOK-Service geokodieren.
es: Geocodificar las direcciones de los Países Bajos mediante el servicio PDOK
fr: Géocoder des adresses aux Pays-Bas en utilisant le service PDOK
it: Esegue la geocodifica degli indirizzi dei Paesi Bassi tramite il servizio PDOK
nl: Geocode-adressen in Nederland door gebruik te maken van de PDOK service

source: On demand
de: Auf Abruf
es: Bajo demanda
fr: À la demande
it: Su richiesta
nl: Op verzoek

source: :doc:`Geocode with the Census Bureau (USA)<processors/geocode_with_census_bureau>`
es: :doc:`Geocodificar con la Oficina del Censo (Estados Unidos)<processors/geocode_with_census_bureau>`
fr: :doc:`Géocoder avec le Census Bureau (États-Unis)<processors/geocode_with_census_bureau>`

source: Geocode addresses in the USA by using the Census Bureau
es: Geocodificar las direcciones de EE. UU. con la Oficina del Censo
fr: Géocoder des adresses aux États-Unis en utilisant le Census Bureau
nl: Geocode-adressen in de VS door het Census Bureau te gebruiken

source: :doc:`Get coordinates from a 3 word address<processors/get_coordinates_from_3_word_address>`
es: :doc:`Obtener coordenadas a partir de una dirección de 3 palabras<processors/get_coordinates_from_3_word_address>`
fr: :doc:`Récupérer les coordonnées d'une adresse 3 mots<processors/get_coordinates_from_3_word_address>`

source: Convert a 3 word address into geographical coordinates
de: Mit diesem Prozessor können Sie eine 3-Wörter-Adresse in geographische Koordinaten umwandeln.
es: Convertir una dirección de 3 palabras en coordenadas geográficas
fr: Convertir une adresse 3 mots en coordonnées géographiques
it: Converte un indirizzo composto da 3 parole in coordinate geografiche
nl: Zet een adres met 3 woorden om in geografische coördinaten

source: :doc:`IP address to geo coordinates<processors/ip_address_to_geo_coordinates>`
de: :doc:`IP-Adresse zu Geo-Koordinaten<processors/ip_address_to_geo_coordinates>`
es: :doc:`Dirección IP a geocoordenadas<processors/ip_address_to_geo_coordinates>`
fr: :doc:`Adresse IP vers Coordonnées Géo<processors/ip_address_to_geo_coordinates>`
it: :doc:`Dall'indirizzo IP alle coordinate geografiche<processors/ip_address_to_geo_coordinates>`

source: Geocode an IP address
de: Mit diesem Prozessor können Sie eine IP-Adresse geocodieren.
es: Geocodificar una dirección IP
fr: Géocoder une adresse IP
it: Esegue la geocodifica di un indirizzo IP
nl: Geeft een geografische code van een IP-adres

source: :doc:`Nominatim geocoder <processors/nominatim_geocoder>`
es: :doc:`Geocodificador de Nominatim <processors/nominatim_geocoder>`
fr: :doc:`Géocodeur Nominatim <processors/nominatim_geocoder>`

source: Geocode full-text addresses using OpenStreetMap data
es: Geocodificar las direcciones de texto completo mediante datos de OpenStreetMap
fr: Géocoder des adresses en format texte en utilisant des données d'OpenStreetMap
nl: Volledige tekstadressen van geocodes door gebruik te maken van gegevens van OpenStreetMap

source: Produce a 3 word address with geographical coordinates
de: Mit diesem Prozessor können Sie eine 3-Wörter-Adresse mit geographischen Koordinaten erzeugen.
es: Producir una dirección de 3 palabras con coordenadas geográficas
fr: Produire une adresse 3 mots avec des coordonnées géographiques
it: Genera un indirizzo composto da 3 parole tramite coordinate geografiche
nl: Genereert een adres in drie woorden met geografische coördinaten

source: The GeoJoin processor
de: Der GeoJoin-Prozessor
es: Procesador GeoJoin
fr: Processeur de jointure géo
it: Processore GeoJoin
nl: De GeoJoin-processor

source: Retrieve administrative divisions geo shapes for a specified country and referential
de: Mit diesem Prozessor können Sie Geoformen von Verwaltungseinheiten für ein bestimmtes Land und Bezugssystem abrufen.
es: Recuperar las formas geográficas de las divisiones administrativas para un país específico y referente
fr: Récupérer les formes géo des divisions administratives d'un pays et d'un référentiel spécifié
it: Recupera le forme geografiche delle divisioni amministrative di un determinato paese e i relativi riferimenti
nl: Haalt geografische vormen van administratieve afdelingen op voor een welbepaald land en referentie

source: The Retrieve administrative divisions processor
de: Der Prozessor zum Abrufen von Verwaltungseinheiten
es: Procesador Recuperar divisiones administrativas
fr: Processeur Récupérer les divisions administratives
it: Processore Recupera divisioni amministrative
nl: De Retrieve Administrative Divisions Processor

source: :doc:`Retrieve administrative divisions<processors/retrieve_administrative_divisions>`
de: :doc:`Verwaltungseinheiten abrufen<processors/retrieve_administrative_divisions>`
es: :doc:`Recuperar divisiones administrativas<processors/retrieve_administrative_divisions>`
fr: :doc:`Récupérer les divisions administratives<processors/retrieve_administrative_divisions>`
it: :doc:`Recupera divisioni amministrative<processors/retrieve_administrative_divisions>`

source: Retrieve administrative divisions information with a geo point
de: Mit diesem Prozessor können Sie Informationen von Verwaltungseinheiten mit einem Geopunkt abrufen.
es: Recuperar la información de las divisiones administrativas con un punto geográfico
fr: Récupérer les informations associées aux divisions administratives avec un point géo
it: Recupera le informazioni delle divisioni amministrative tramite un punto geografico
nl: Haalt informatie van administratieve afdelingen op met een geografisch punt

source: Converters & Functions
de: Umwandler und Funktionen
es: Convertidores y funciones
fr: Convertisseurs et fonctions
it: Convertitori e funzioni
nl: Converters en functies

source: :doc:`Compute geo distance<processors/geo_distance>`
es: :doc:`Calcular distancia geográfica<processors/geo_distance>`
fr: :doc:`Calculer la distance géographique<processors/geo_distance>`

source: Compute the distance between 2 coordinates
de: Mit diesem Prozessor können Sie den Abstand zwischen zwei Koordinaten berechnen.
es: Calcular la distancia entre 2 coordenadas
fr: Calculer la distance entre 2 coordonnées
it: Calcola la distanza tra 2 coordinate
nl: Berekent de afstand tussen 2 coördinaten

source: :doc:`Correct geo shape<processors/correct_geo_shape>`
es: :doc:`Corregir forma geográfica<processors/correct_geo_shape>`
nl: :doc:`Corrigeer geografische vorm<processors/correct_geo_shape>`

source: Fix invalid geo shapes
es: Corregir formas geográficas no válidas
nl: Corrigeer ongeldige geografische vormen

source: :doc:`Convert degrees<processors/convert_degrees>`
de: :doc:`Grad umwandeln<processors/convert_degrees>`
es: :doc:`Convertir grados<processors/convert_degrees>`
fr: :doc:`Convertir des Degrés<processors/convert_degrees>`
it: :doc:`Converti gradi<processors/convert_degrees>`

source: Convert a degrees, minutes, seconds geo coordinate to WGS84 coordinates
de: Dieser Prozessor wandelt eine Grad-, Minuten- und Sekunden-Geokoordinate in WGS84-Koordinaten um.
es: Convertir una geocoordenada de grados, minutos y segundos en coordenadas WGS84
fr: Convertir des coordonnées géographiques en degrés, minutes, secondes vers des coordonnées WGS84
it: Converte i gradi, i minuti e i secondi delle coordinate geografiche in coordinate WGS84
nl: Zet een coördinaat in graden, minuten, seconden om naar WGS84-coördinaten

source: :doc:`Create geo point<processors/create_geopoint>`
de: :doc:`Geopunkt erstellen<processors/create_geopoint>`
es: :doc:`Crear punto geográfico<processors/create_geopoint>`
fr: :doc:`Créer un point géo<processors/create_geopoint>`
it: :doc:`Crea punto geografico<processors/create_geopoint>`

source: Create a geopoint field from a latitude field and a longitude field
de: Mit diesem Prozessor können Sie ein Geopoint-Feld aus einem Breitengrad- sowie einem Längengradfeld erstellen.
es: Crear un campo de punto geográfico a partir de un campo de latitud y un campo de longitud
fr: Créer un champ point géo à partir d'un champ latitude et d'un champ longitude
it: Crea un campo punto geografico da un campo latitudine e un campo longitudine
nl: Maakt een veld "geografisch punt" aan op basis van een veld "lengtegraad" en van een veld "breedtegraad"

source: :doc:`Decode a Google polyline <processors/decode_google_polyline>`
es: :doc:`Descodificar una polilínea Google <processors/decode_google_polyline>`
fr: :doc:`Décoder un polyline Google <processors/decode_google_polyline>`

source: Transform an encoded Google polyline into a GeoJSON LineString
es: Transformar una polilínea Google codificada en una cadena de línea GeoJSON
fr: Transformer un polyline Google encodé en LineString GeoJSON
nl: Een geëncodeerde Google polyline omzetten naar een GeoJSON LineString

source: :doc:`GeoHash to GeoJSON <processors/geohash_to_geojson>`
es: :doc:`GeoHash en GeoJSON <processors/geohash_to_geojson>`
fr: :doc:`GeoHash en GeoJSON <processors/geohash_to_geojson>`

source: Convert GeoHash values to GeoJSON
es: Convertir valores GeoHash en GeoJSON
fr: Convertir des valeurs GeoHash en GeoJSON
nl: GeoHash-waarden omzetten naar GeoJSON

source: :doc:`Geomasking<processors/geomasking>`
es: :doc:`Geomáscara<processors/geomasking>`
fr: :doc:`Masquage géographique<processors/geomasking>`
it: :doc:`Mascheramento geografico<processors/geomasking>`

source: Provides privacy protection by approximating a geographical location within a specific radius
de: Bietet Datenschutz durch Annäherung an einen geografischen Standort innerhalb eines bestimmten Radius.
es: Aporta protección de privacidad por aproximación a una ubicación geográfica dentro de un radio específico.
fr: Offrir une protection de la vie privée en indiquant la position approximative d'un lieu géographique dans un rayon donné
it: Questo processore tutela la privacy, indicando in modo approssimato una località geografica in un raggio specifico
nl: Biedt privacybescherming door een geografische locatie binnen een specifieke straal te benaderen

source: :doc:`Normalize projection reference<processors/normalize_projection_reference>`
de: :doc:`Projektionsreferenz normalisieren<processors/normalize_projection_reference>`
es: :doc:`Normalizar referencia de proyección<processors/normalize_projection_reference>`
fr: :doc:`Normaliser le Système de Projection<processors/normalize_projection_reference>`
it: :doc:`Normalizza il riferimento di proiezione<processors/normalize_projection_reference>`

source: Replace a geopoint with its WGS84 representation
es: Sustituir un punto geográfico por su representación WGS84
nl: Vervangt een geografisch punt met zijn WGS84-tegenhanger

source: :doc:`Polygon filtering <processors/polygon_filtering>`
es: :doc:`Filtros de polígono <processors/polygon_filtering>`
fr: :doc:`Filtrage du polygone <processors/polygon_filtering>`

source: Remove points that are not in a polygon
es: Eliminar puntos que no están en un polígono
fr: Supprimer des points qui ne sont pas dans un polygone
nl: Punten verwijderen die niet in een polygon zitten

source: :doc:`Simplify geo shape<processors/simplify_geo_shape>`
de: :doc:`Geoform vereinfachen<processors/simplify_geo_shape>`
es: :doc:`Simplificar forma geográfica<processors/simplify_geo_shape>`
fr: :doc:`Simplifier les formes géo<processors/simplify_geo_shape>`
it: :doc:`Semplifica GeoShape<processors/simplify_geo_shape>`

source: Simplify a geo shape to reduce processing time and dataset size
de: Vereinfachen Sie eine Geoform, um die Bearbeitungszeit und die Datensatzgröße zu reduzieren.
es: Simplificar una forma geográfica para reducir el tiempo de procesamiento y el tamaño del conjunto de datos
fr: Simplifier une forme géo afin de réduire le temps de traitement et la taille du jeu de données
it: Semplifica una forma geografica per ridurre il tempo di elaborazione e le dimensioni del dataset
nl: Vereenvoudigt een geografische vorm om de verwerkingstijd en de omvang van de dataset te verkleinen
