Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/adding_processors_to_a_dataset.po
Languages: de, es, fr, it, nl

source: Replace a geopoint with its its WGS84 representation
de: Mit diesem Prozessor können Sie einen Geopunkt durch seine WGS84-Darstellung ersetzen.
fr: Remplacer un point géo par sa représentation WGS84
it: Sostituisce un punto geografico con la relativa rappresentazione WGS84

source: :doc:`Normalize unicode values<processors/normalize_unicode_values>`
de: :doc:`Unicode-Werte normalisieren<processors/normalize_unicode_values>`
fr: :doc:`Normaliser les valeurs Unicode<processors/normalize_unicode_values>`
it: :doc:`Normalizza i valori Unicode<processors/normalize_unicode_values>`

source: Normalize unicode content using the Normalization Form Canonical Composition (NFC)
de: Mit diesem Prozessor können Sie den Unicode-Inhalt mithilfe der Normalform der kanonischen Komposition (NFC) normalisieren.
fr: Normaliser le contenu Unicode à l'aide de la composition par équivalence canonique (NFC)
it: Normalizza il contenuto Unicode tramite NFC (Normalization Form Canonical Composition).

source: Add a new empy field in a dataset
de: Mit diesem Prozessor können Sie einem Datensatz ein neues leeres Feld hinzufügen.
fr: Ajouter un champ vide dans un jeu de données
it: Aggiunge un nuovo campo vuoto in un dataset

source: :doc:`Delete record by ID<processors/delete_record_by_id>`
de: :doc:`Eintrag nach ID löschen<processors/delete_record_by_id>`
fr: :doc:`Supprimer enregistrement par ID<processors/delete_record_by_id>`
it: :doc:`Elimina record per ID<processors/delete_record_by_id>`

source: Remove an existing record, based on its unique ID, from a dataset
de: Mit diesem Prozessor können Sie einen vorhandenen Eintrag auf Grundlage seiner eindeutigen ID aus einem Datensatz entfernen.
fr: Supprimer un enregistrement d'un jeu de données , sur la base de son ID unique
it: Rimuove da un dataset un record esistente, in base al suo ID univoco

source: Processors are tools that can be used in order to modify, improve or enrich the data of a dataset. In the OpenDataSoft platform, processors are classified in 4 different categories:
de: Prozessoren sind Tools zum Ändern, Verbessern und Anreichern der Daten eines Datensatzes. Die OpenDataSoft-Plattform unterteilt Prozessoren in 4 Kategorien:
it: I processori sono strumenti che permettono di modificare, migliorare e arricchire i dati di un dataset. Nella piattaforma OpenDataSoft, i processori sono classificati in 4 diverse categorie:

source: **Geocoders**: to convert a human readable address into a geo point. There are 10 geocoders.
de: **Geocoder**: zur Umwandlung einer menschlich lesbaren Adresse in einen Geopunkt. Es gibt 10 Geocoder.
it: **Geocodificatori**: per convertire un indirizzo comprensibile in un punto geografico. Sono disponibili 10 geocodificatori.

source: **Converters & Functions**: to simplify, convert or normalize geographical data, or run computations based on them. There are 7 processors in this category.
de: **Umwandler und Funktionen**: zur Vereinfachung, Umwandlung oder Normalisierung geografischer Daten oder Durchführung von Berechnungen auf ihrer Grundlage. Diese Kategorie umfasst 7 Prozessoren.
it: **Convertitori e funzioni**: per semplificare, convertire o normalizzare dati geografici, oppure eseguire calcoli basati su di essi. Questa categoria include 7 processori.

source: :doc:`Geocode with BAN<processors/geocode_with_ban>`
de: :doc:`Geocode mit BAN<processors/geocode_with_ban>`
it: :doc:`Geocodifica con BAN<processors/geocode_with_ban>`

source: :doc:`Geocode with Google<processors/geocode_with_google>`
de: :doc:`Geocode mit Google<processors/geocode_with_google>`
it: :doc:`Geocodifica con Google<processors/geocode_with_google>`

source: Geocode full text addresses by using the Google geocoding API
de: Mit diesem Prozessor können Sie Volltext-Adressen mit der Google Geocoding-API geocodieren.
it: Esegue la geocodifica degli indirizzi full-text mediante l'API di geocodifica Google

source: :doc:`Country code to geo coordinates<processors/country_code_to_geo_coordinates>`
de: :doc:`Ländercode zu Geokoordinaten<processors/country_code_to_geo_coordinates>`
it: :doc:`Dal codice paese alle coordinate geografiche<processors/country_code_to_geo_coordinates>`

source: Produce a geo coordinate with a country ISO code
de: Mit diesem Prozessor können Sie eine Geo-Koordinate mit einem Länder-ISO-Code erzeugen.
it: Genera una coordinata geografica con il codice ISO del paese

source: :doc:`INSEE code to geo coordinates<processors/insee_code_to_geo_coordinates>`
de: :doc:`INSEE-Code zu Geo-Koordinaten<processors/insee_code_to_geo_coordinates>`
it: :doc:`Dal codice INSEE alle coordinate geografiche<processors/insee_code_to_geo_coordinates>`

source: Produce a geo coordinate with a French INSEE code
de: Mit diesem Prozessor können Sie eine Geo-Koordinate mit einem französischen INSEE-Code erzeugen.
it: Genera una coordinata geografica con il codice INSEE francese

source: :doc:`Zip code to geo coordinates<processors/zip_code_to_geo_coordinates>`
de: :doc:`Postleitzahl zu Geo-Koordinaten<processors/zip_code_to_geo_coordinates>`
it: :doc:`Dal CAP alle coordinate geografiche<processors/zip_code_to_geo_coordinates>`

source: Produce a geo coordinate with a French postal code
de: Mit diesem Prozessor können Sie eine Geo-Koordinate mit einer französischen Postleitzahl erzeugen.
it: Genera una coordinata geografica con un codice postale francese

source: :doc:`Geo coordinates from a 3 word address<processors/get_coordinates_from_3_word_address>`
de: :doc:`Geo-Koordinaten aus einer 3-Wörter-Adresse erzeugen<processors/get_coordinates_from_3_word_address>`
it: :doc:`Da un indirizzo di 3 parole alle coordinate geografiche<processors/get_coordinates_from_3_word_address>`

source: :doc:`Geo distance<processors/geo_distance>`
de: :doc:`Geo-Distanz<processors/geo_distance>`
it: :doc:`Distanza geografica<processors/geo_distance>`

source: :doc:`Replace via Regexp<processors/replace_via_regexp>`
de: :doc:`Ersetzen mittels RegExp<processors/replace_via_regexp>`
it: :doc:`Sostituisci tramite Regexp<processors/replace_via_regexp>`

source: :doc:`Expand from JSON array<processors/expand_json_array>`
de: :doc:`Erweitern aus JSON-Array<processors/expand_json_array>`
it: :doc:`Espandi dall'array JSON<processors/expand_json_array>`

source: :doc:`Join dataset<processors/join_dataset>`
de: :doc:`Datensätze verbinden<processors/join_dataset>`
it: :doc:`Unisci dataset<processors/join_dataset>`

source: :doc:`Transform boolean columns to multivalues fields<processors/transform_boolean_columns_to_multivalued_field>`
de: :doc:`Boolesche Spalten in mehrwertige Felder umwandeln<processors/transform_boolean_columns_to_multivalued_field>`
it: :doc:`Trasforma le colonne booleane in campi multivalore<processors/transform_boolean_columns_to_multivalued_field>`

source: :doc:`Transpose fields<processors/transpose_fields>`
de: :doc:`Felder umwandeln<processors/transpose_fields>`
it: :doc:`Trasponi i campi<processors/transpose_fields>`

source: Extract an arbitrary bit range from an hexadecimal content
it: Estrae un intervallo di bit arbitrario da un contenuto esadecimale
