Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/defining_a_dataset_schema.po
Languages: de, es, fr, it, nl

source: Item counting (ascending): entries are ordered from the one with the most records to the one with the less
de: Elementzählung (aufsteigend): Felder werden von demjenigen mit den meisten Einträgen zu dem mit den wenigsten Einträgen geordnet
es: Número de elementos (ascendente): Entradas ordenadas de aquella con más registros a aquella con menos
it: Numero voce (crescente): le voci vengono ordinate, da quella con più record a quella con meno record
nl: Tellen van items (in stijgende volgorde): entries worden gerangschikt in volgorde van diegene met het meest aantal records tot diegene met het minst aantal records

source: Name (descending): entries are ordered in an alphabetical order
de: Name (absteigend): Felder werden in alphabetischer Reihenfolge geordnet
es: Nombre (descendente): Entradas ordenadas alfabéticamente
fr: Valeur décroissante : les entrées sont triées par ordre alphabétique (A-Z).
it: Nome (decrescente): le voci vengono ordinate in ordine alfabetico
nl: Naam (in dalende volgorde): entries worden in alfabetische volgorde gerangschikt

source: Name (ascending): entries are ordered in a reverse alphabetical order
de: Name (aufsteigend): Felder werden in umgekehrter alphabetischer Reihenfolge geordnet
es: Nombre (ascendente): Entradas ordenadas alfabéticamente en sentido inverso
fr: Valeur croissante : les entrées sont triées dans l'ordre alphabétique inverse (Z-A).
it: Nome (crescente): le voci vengono ordinate in ordine alfabetico inverso
nl: Naam (in stijgende volgorde): entries worden in omgekeerd alfabetische volgorde gerangschikt

source: Allow multiple selection in filters
de: Mehrfachauswahl in Filtern erlauben
es: Permitir selección múltiple en filtros
fr: Sélection multiple dans les filtres
it: Consenti selezione multipla nei filtri
nl: Meervoudige selectie in filters mogelijk maken

source: By default, after clicking on a filter entry, the others disappear. With the multiple selection option, it is possible to select several filter entries.
de: Nach dem Klicken auf einen Filtereintrag werden die anderen Filtereinträge standardmäßig ausgeblendet. Mit der Option Mehrfachauswahl können mehrere Filtereinträge ausgewählt werden.
es: De forma predeterminada, al hacer clic en una entrada de filtro, las demás desaparecen. Con la opción de selección múltiple, se pueden seleccionar varias entradas de filtros.
fr: Par défaut, après avoir cliqué sur une entrée de filtre, les autres disparaissent. L'option de sélection multiple permet de sélectionner plusieurs entrées de filtre.
it: Per impostazione predefinita, dopo aver cliccato su una voce del filtro, le altre non vengono più visualizzate. Con l'opzione di selezione multipla è possibile selezionare più voci per il filtro.
nl: Standaard, wanneer op een filterentry wordt geklikt, verdwijnen de andere. Met de optie "Meervoudige selectie", is het mogelijk om verschillende filterentries te selecteren.

source: To allow multiple selection in filters: Tick the "Allow multiple selection in filters" box.
de: Um eine Mehrfachauswahl in Filtern zu erlauben: Markieren Sie das Kontrollkästchen "Mehrfachauswahl in Filtern erlauben".
es: Para permitir la selección múltiple en filtros: Marque la casilla "Permitir selección múltiple en filtros".
fr: Pour autoriser la sélection multiple dans les filtres : cochez la case "Sélection multiple dans les filtres".
it: Per consentire la selezione multipla nei filtri: Seleziona la casella "Consenti le selezioni multiple nei filtri".
nl: Om een meervoudige selectie in filters mogelijk te maken: vink het vakje "Meervoudige selectie in filters mogelijk maken" aan.

source: Ordering fields in datasets
de: Felder in Datensätzen ordnen
es: Ordenar los campos de los conjuntos de datos
fr: Trier les champs dans les jeux de données
it: Ordinamento dei campi nei dataset
nl: Velden in datasets rangschikken

source: Dataset fields can be reordered in their dataset. It can have 2 kinds of impact:
de: Datensatzfelder können in dem jeweiligen Datensatz neu angeordnet werden. Das kann zwei Auswirkungen haben:
es: Los campos de un conjunto de datos se pueden reordenar dentro del conjunto de datos. Esto puede tener 2 tipos de efectos:
fr: Les champs de jeu de données peuvent être réordonnés dans leur jeu de données. Deux conséquences sont possibles :
it: È possibile riordinare i campi di un dataset, ottenendo così 2 tipi di effetti:
nl: Velden van datasets kunnen opnieuw gerangschikt worden in hun dataset. Dit kan 2 soorten gevolgen hebben:

source: In the filters section of the dataset, in the front office. Changing the order of the fields in the dataset also changes the order of the filters. The first facetted field of the dataset becomes the first displayed filter, and so on.
de: Im Filterbereich des Datensatzes im Front-Office. Durch das Ändern der Anordnung der Felder im Datensatz wird die Anordnung der Filter verändert. Das erste Feld mit Facets des Datensatzes wird zum ersten angezeigten Filter usw.
es: En la sección de filtros del conjunto de datos, en el front office. Al cambiar el orden de los campos del conjunto de datos también se cambia el orden de los filtros. El primer campo de facetas del conjunto de datos pasa a ser el primer filtro visualizado, etc.
fr: Dans la section dédiée aux filtres du jeu de données, dans la plateforme. Modifier l'ordre des champs du jeu de données a également une incidence sur l'ordre des filtres. Le premier champ avec des facettes du jeu de données devient le premier filtre affiché, et ainsi de suite.
it: Nella sezione dei filtri del dataset dell'interfaccia di front-office. Modificando l'ordine dei campi nel dataset si modifica anche l'ordine dei filtri. Il primo campo facet del dataset diventa il primo filtro visualizzato e così via.
nl: In de filterssectie van de dataset, in de front office. Wanneer de volgorde van de velden in de dataset wordt gewijzigd, wordt ook de volgorde van de filters gewijzigd. Het eerst gefacetteerde veld van de dataset wordt de eerst weergegeven filter, enzovoort.

source: In case the dataset contains geo shape fields. The Map view cannot display more than one layer of geo shapes, the geo shapes layer displayed by default must thus be defined. To do so, the field containing the geo shapes to be displayed by default on the map must the ordered before all other geo shapes fields.
de: Für den Fall, dass der Datensatz Geoformfelder enthält. Die Kartenansicht kann maximal eine Geoformebene anzeigen. Deshalb muss die standardmäßig angezeigte Geoformebene bestimmt werden. Dazu muss das Feld mit den Geoformen, das standardmäßig auf der Karte angezeigt werden soll, vor allen anderen Geoformfeldern angeordnet werden.
es: En el caso de que el conjunto de datos contenga campos de forma geográfica. La vista de mapa no puede visualizar más de una capa de formas geográficas, por lo que debe definirse la capa de formas geográficas visualizada de forma predeterminada. Para ello, el campo que contiene las formas geográficas que se visualizarán de forma predeterminada en el mapa debe estar ordenado antes que todos los demás campos de formas geográficas.
it: Nel caso in cui il dataset contenga campi di forme geografiche. La visualizzazione su mappa non può mostrare più di un livello di forme geografiche, pertanto è necessario definire il livello che verrà visualizzato per impostazione predefinita. A questo scopo, il campo contenente le forme geografiche da visualizzare per impostazione predefinita sulla mappa deve essere ordinato prima di tutti gli altri campi contenenti forme geografiche.
nl: Wanneer de dataset geoshape-velden bevat. De kaartweergave kan niet meer dan één laag van geoshapes weergeven. Dit houdt in dat de laag met geoshapes die standaard wordt weergegeven, gedefinieerd moet worden. Om dit te doen moet het veld dat de geoshapes bevat die standaard moeten worden weergegeven, gerangschikt moet worden vóór alle andere geoshapes-velden.

source: To reorder a field in a dataset:
de: Um ein Feld in einem Datensatz neu anzuordnen:
es: Para reordenar un campo en un conjunto de datos:
fr: Pour réordonner un champ dans un jeu de données :
it: Per riordinare un campo in un dataset:
nl: Om een veld in een dataset opnieuw te rangschikken:

source: In the preview area of the Processing tab, click on the |icon-order| button of the field you want to reorder in the dataset.
de: Klicken Sie im Vorschaubereich der Registerkarte "Verarbeitung" auf den Button |icon-configuration| des Feldes, das Sie im Datensatz neu anordnen möchten.
es: En el área de vista previa de la ficha Procesadores, haga clic en el botón |icon-order| del campo que desea reordenar en el conjunto de datos.
fr: Dans la zone d'aperçu de l'onglet Traitement, cliquez sur le bouton |icon-order| du champ à réordonner dans le jeu de données.
it: Nell'area dell'anteprima della scheda Elaborazione, clicca sul pulsante |icon-order| del campo da riordinare nel dataset.
nl: Klik in de voorbeeldweergave van het tabblad Verwerken op de knop |icon-order| van het veld dat u opnieuw in de dataset wilt rangschikken.

source: While maintaining the click on the Reorder button, drag the field to its new position in the dataset.
de: Halten Sie die Maustaste auf dem Button "Neu ordnen" geklickt und ziehen Sie das Feld auf die neue Position im Datensatz.
es: A la vez que hace clic en el botón Reordenar, arrastre el campo a su posición nueva en el conjunto de datos.
fr: Tout en cliquant sur le bouton Réordonner, faites glisser le champ vers son nouvel emplacement dans le jeu de données.
it: Tenendo premuto il pulsante del mouse sul pulsante Riordina, trascina il campo nella nuova posizione all'interno del dataset.
nl: Terwijl u de muisknop ingedrukt houdt op de knop "Opnieuw rangschikken", sleept u het veld naar zijn nieuwe positie in de dataset.

source: Once the field in its new position in the dataset, stop maintaining the click.
de: Sobald sich das Feld an der neuen Position im Datensatz befindet, können Sie die Maustaste loslassen.
es: Una vez que el campo esté en su posición nueva en el conjunto de datos, suelte la presión del ratón.
fr: Une fois que le champ se trouve à son nouvel emplacement, vous pouvez cesser de cliquer sur le bouton.
it: Quando il campo si trova nella nuova posizione nel dataset, rilascia il pulsante del mouse.
nl: Eenmaal het veld zich op zijn nieuwe positie in de dataset bevindt, kunt u de muisknop loslaten.

source: Discarding fields from datasets
de: Felder aus Datensätzen entfernen
es: Descartar campos del conjuntos de datos
fr: Supprimer des champs des jeux de données
it: Eliminazione di campi dai dataset
nl: Velden uit datasets verwijderen

source: Dataset fields can be discarded from the dataset. It does not mean that the field is completely removed from the dataset but only deleted from the output. This is why, once the dataset is published, the discarded field will not be displayed in any visualization and if the dataset is exported, the discarded field will not be in the export.
de: Datensatzfelder können aus dem Datensatz entfernt werden. Das bedeutet nicht, dass das Feld vollständig aus dem Datensatz gelöscht wird, es wird nur aus der Ausgabe entfernt. So wird das entfernte Feld in keiner Datensatz-Visualisierung angezeigt, wenn der Datensatz veröffentlicht wird. Wird der Datensatz exportiert, ist das entfernte Feld kein Teil des Exports.
es: Los campos de un conjunto de datos se pueden descartar del conjunto de datos. Esto no significa que el campo se elimine por completo del conjunto de datos sino que se suprime de la salida. De este modo, una vez publicado el conjunto de datos, el campo descartado no aparecerá en ninguna visualización y, si se exporta el conjunto de datos, el campo descartado no se incluirá en la exportación.
it: È possibile eliminare i campi in un dataset. Così facendo, non si rimuove completamente il campo dal dataset, ma lo si elimina solo dall'output. In tal modo, una volta pubblicato il dataset, il campo eliminato non sarà incluso in alcuna visualizzazione e, qualora il dataset venisse esportato, non sarà presente nell'esportazione.
nl: Velden van een dataset kunnen uit de dataset worden verwijderd. Dit betekent niet dat het veld volledig uit de dataset wordt verwijderd, maar enkel verwijderd wordt uit de output. Dit is de reden waarom het verwijderde veld niet meer zal worden weergegeven in een weergave eenmaal de dataset wordt gepubliceerd en dat, wanneer de dataset wordt geëxporteerd, het verwijderde veld niet in de export zal zitten.

source: To discard a field from a dataset: Click on the |icon-delete| button of the field you want to discard from the dataset.
de: Um ein Feld aus einem Datensatz zu entfernen: Klicken Sie auf den Button |icon-configuration| des Feldes, das Sie aus dem Datensatz entfernen möchten.
es: Para descartar un campo de un conjunto de datos: Haga clic en el botón |icon-delete| del campo que desea descartar del conjunto de datos.
fr: Pour supprimer un champ d'un jeu de données : cliquez sur le bouton |icon-delete| du champ à supprimer du jeu de données.
it: Per eliminare un campo da un dataset: clicca sul pulsante |icon-delete| del campo che desideri eliminare.
nl: Om een veld uit een dataset te verwijderen: klik op de knop |icon-delete| van het veld dat u uit de dataset wilt verwijderen.

source: Since discarded fields are not completely removed from the dataset, they can be restored at any time.
de: Da entfernte Felder nicht vollständig aus dem Datensatz gelöscht werden, können sie jederzeit wiederhergestellt werden.
es: Puesto que los campos descartados no se eliminan por completo del conjunto de datos, se pueden restaurar en cualquier momento.
fr: Puisque les champs supprimés ne sont pas définitivement effacés du jeu de données, ils peuvent être restaurés à tout moment.
it: Poiché i campi eliminati non vengono rimossi completamente dal dataset, è possibile ripristinarli in qualsiasi momento.
nl: Aangezien verwijderde velden niet volledig uit de dataset worden verwijderd, kunnen ze te allen tijde worden hersteld.

source: To restore a discarded field from a dataset:
de: Um ein entferntes Feld wiederherzustellen:
es: Para restaurar un campo descartado de un conjunto de datos:
fr: Pour restaurer un champ supprimé d'un jeu de données :
it: Per ripristinare un campo eliminato da un dataset:
nl: Om een verwijderd veld uit een dataset te herstellen:

source: In the preview area of the Processing tab, swipe to the right to go to the last fields of the datasets.
de: Fahren Sie im Vorschaubereich der Registerkarte "Verarbeitung" nach rechts, um zu den letzten Feldern der Datensätze zu gelangen.
es: En el área de vista previa de la ficha Procesadores, pase a la derecha para ir a los últimos campos de los conjuntos de datos.
fr: Dans la zone d'aperçu de l'onglet Traitement, balayez vers la droite pour accéder aux derniers champs des jeux de données.
it: Nell'area dell'anteprima della scheda Elaborazione, scorri verso destra fino agli ultimi campi dei dataset.
nl: Swipe in de voorbeeldweergave van het tabblad Verwerken naar rechts om naar de laatste velden van de datasets te gaan.

source: The discarded fields of the dataset appear at the very end of the dataset, they look like blank, grey columns named by their technical identifiers. Find those you want to restore.
de: Die entfernten Felder des Datensatzes erscheinen am Ende des Datensatzes. Sie sehen aus wie leere, graue Spalten, die nach ihren technischen Kennungen benannt sind. Suchen Sie nach denjenigen, die Sie wiederherstellen möchten.
es: Los campos descartados del conjunto de datos aparecen al final del conjunto de datos en forma de columnas en blanco, de color gris y con sus identificadores técnicos como nombres. Localice los que desee restaurar.
it: I campi eliminati dal dataset sono riportati alla fine sotto forma di colonne vuote di colore grigio, con il nome dei relativi identificatori tecnici. Identifica i campi che desideri ripristinare.
nl: De verwijderde velden van de dataset verschijnen helemaal op het einde van de dataset. Ze zien eruit als blanco, grijze kolommen die de naam hebben gekregen van hun technische identifiers. Hier kunt u diegene terugvinden die u wilt herstellen.

source: Click on the |icon-retrieve_discarded| button.
de: Klicken Sie auf den Button |icon-retrieve_discarded|.
es: Haga clic en el botón |icon-retrieve_discarded|.
fr: Cliquez sur le bouton |icon-retrieve_discarded|.
it: Clicca sul pulsante |icon-retrieve_discarded|.
nl: Klik op de knop |icon-retrieve_discarded|.

source: The Opendatasoft platform retrieves the default field labels found in the source dataset. However, it is possible to change each dataset field label.
fr: La plateforme Opendatasoft récupère les labels de champ par défaut qui se trouvent dans le jeu de données source. Néanmoins, il est possible de modifier chaque label de champ de jeu de données.

source: We highly recommend to choose well-written, explicit labels. We highly recommend to choose well-written, explicit labels. Also, keep in mind that, since these labels will be displayed in the front office for all portal users, it might be preferable to choose simple labels instead of business-specific terms to make sure that a wider audience can understand the data.
fr: Nous vous recommandons fortement d'opter pour des labels explicites et bien écrits. Gardez également à l'esprit que, comme ces labels seront affichés dans l'interface de navigation pour tous les utilisateurs du portail, il est préférable de choisir des labels simples plutôt que du jargon spécifique, afin de faciliter la compréhension des données par un public plus large.

source: There are 8 different types: date, datetime, decimal, integer, geopoint, geoshape, text, and file.
fr: 8 types différents sont disponibles : date, datetime, décimal, entier, point géo, forme géo, texte et fichier.

source: Field values are dates. The ideal format is the ISO 8601 format, which is ``YYYY-mm-dd``. Other formats are also understood by the platform, such as ``YYYY/mm/dd`` or ``dd/mm/YYYY``.
fr: Les valeurs du champ sont des dates. Le format ISO 8601, c'est-à-dire ``AAAA-mm-jj``, est idéal. D'autres formats également pris en charge par la plateforme sont : ``AAAA/mm/jj`` ou ``jj/mm/AAAA``.

source: Field values are a combination of a date and a time. The ideal format is the ISO 8601 format, which is ``YYYY-mm-ddTHH:MM:ss+00:00``, ``YYYY-mm-ddTHH:MM:ssZ`` or ``YYYYmmddTHHMMssZ``. Other formats are also understood by the platform, such as ``YYYY-mm-dd-HH:MM:ss`` or or ``YYYY-mm-dd HH:MM:ss``.
fr: Les valeurs du champ sont une date et une heure combinées. Le format ISO 8601, c'est-à-dire ``AAAA-mm-jjTHH:MM:ss+00:00``, ``AAAA-mm-jjTHH:MM:ssZ`` ou ``AAAAmmjjTHHMMssZ,``est idéal. D'autres formats également pris en charge par la plateforme sont : ``AAAA-mm-jj-HH:MM:ss`` ou ``AAAA-mm-jj HH:MM:ss``.

source: By default, time records are in the UTC timezone. To change the timezone, use the :doc:`Set Timezone processor<processors/set_timezone>`.
fr: Par défaut, les enregistrements d'heure sont définis sur le fuseau horaire UTC. Pour modifier le fuseau horaire, utilisez le :doc:`processeur Définir le fuseau horaire<processors/set_timezone>`.

source: Field values are a single geographical location expressed in the format ``<LAT>,<LON>``, for example, ``45.8,2.5``.
fr: Les valeurs du champ sont un emplacement géographique simple, exprimé au format ``<LAT>,<LON>``, par exemple ``45.8,2.5``.

source: Field values are geographical shapes expressed in `GeoJSON <https://geojson.org/geojson-spec.html>`_. For example :
fr: Les valeurs du champ sont des formes géographiques exprimées en `GeoJSON <https://geojson.org/geojson-spec.html>`_. Par exemple :

source: Field values are integer numbers. If a floating-point value is found, it is automatically cast to its integer part.
fr: Les valeurs du champ sont des nombres entiers. S'il existe une partie non entière, la valeur est automatiquement transformée en une valeur entière.

source: Text
es: Texto
fr: Texte
it: Testo
nl: Tekst

source: Field values are files sourced with one of the available methods to :doc:`create a dataset with media files<../01_creating_a_dataset/creating_dataset_with_images>` (with the File processor, through an archive file, or with a specific extractor), creating a field which default type is file. This field type is only available in that case.
fr: Les valeurs du champ sont des fichiers collectés à l'aide de l'une des méthodes disponibles pour :doc:`créer un jeu de données avec des fichiers média<../01_creating_a_dataset/creating_dataset_with_images>` (avec le processeur de fichiers, via un fichier d'archive ou avec un extracteur spécifique), ce qui permet d'obtenir un champ de type fichier par défaut. Ce type de champ est uniquement disponible dans ce cas.

source: Facets define the filters of a dataset, which are displayed on the left of the dataset's visualization in the front office. These filters have several purposes: they allow the users to find specific, precise records into a dataset, but they also allow the creation of charts afterward (if a field's records are other than numbers, they will be usable in the Chart Builder and in the Analyze view only if they are set up as facets).
fr: Les facettes définissent les filtres d'un jeu de données, qui s'affichent à gauche de la visualisation du jeu de données, dans l'interface de navigation. Ces filtres peuvent être utilisés de diverses façons : ils permettent aux utilisateurs de rechercher des enregistrements précis et spécifiques dans un jeu de données, mais offrent également la possibilité de créer des graphes plus tard (si les enregistrements d'un champ ne sont pas des nombres, ils pourront être utilisés dans l'Éditeur de graphes et dans la vue Analyse, uniquement s'ils sont paramétrés en tant que facettes).

source: Name
es: Nombre
fr: Nom
it: Nome
nl: Naam

source: Technical identifier of the field. In contrary to the label, the technical identifier does not have aesthetic purposes and thus cannot contain special characters, including spaces. Technical identifiers can be used, for example, when creating a custom tooltip with HTML.
fr: Identifiant technique du champ. Contrairement au label, l'identifiant technique n'a aucun but esthétique et ne peut donc contenir de caractères spéciaux, même des espaces. Les identifiants techniques peuvent par exemple être utilisés pour la création d'une infobulle personnalisée avec HTML.

source: Changing the technical identifier of a field could break reuses of the related dataset (custom tooltip, custom tab, or pages). It could also be a problem if the source of the dataset is (regularly) updated: when replacing a source with a newer one, the platform checks the technical identifier of the fields of both sources in order to find a match between the two -then replacing the old data with the new ones. If technical identifiers are not the same anymore, the dataset cannot be updated.
fr: La modification de l'identifiant technique d'un champ peut altérer les réutilisations du jeu de données associé (infobulle personnalisée, vue personnalisée ou pages). Cette opération peut également poser un problème si la source du jeu de données est (régulièrement) mise à jour : lorsque vous remplacez une source par une nouvelle, la plateforme vérifie l'identifiant technique des champs des deux sources, afin de trouver une correspondance entre les deux, puis remplace les anciennes données par les nouvelles. Si les identifiants techniques ne sont plus les mêmes, le jeu de données ne peut pas être mis à jour.

source: Type a new technical identifier. It mustn't contain special characters.
fr: Saisissez un nouvel identifiant technique. Les caractères spéciaux ne sont pas autorisés.
