Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/defining_a_dataset_schema.po
Languages: de, es, fr, it, nl

source: Each record is uniquely identified by its identifier, which is by default computed as the fingerprint of all the record's field values. If the Unique ID option is activated for a field, records with the same identifier (or value) are deleted for only the last/oldest one to stay in the dataset. It is most useful for real-time datasets to make sure that instead of adding new records every time the dataset is updated, new values replace the old ones.
fr: Chaque enregistrement est identifié de façon unique par son identifiant, qui est par défaut généré à partir de l'empreinte de toutes les valeurs des champs de l'enregistrement. Si l'option ID unique est activée pour un champ, les enregistrements avec le même identifiant (ou la même valeur) sont supprimés pour que seules les dernières valeurs et les valeurs les plus anciennes restent dans le jeu de données. Cette option est plus pertinente pour les jeux de données en temps réel, puisqu'elle permet de vous assurer que lors de chaque mise à jour du jeu de données, au lieu d'ajouter de nouveaux enregistrements, ce sont les nouvelles valeurs qui remplacent les anciennes.

source: day: the full date (day, month, and year) is displayed in the dataset
fr: jour : la date complète (jour, mois et année) est affichée dans le jeu de données.

source: Choose the right unit from the list.
fr: Choisissez l'unité appropriée dans la liste.

source: The chosen number of decimals for all values of the field.
fr: Nombre de décimales choisi pour toutes les valeurs du champ.

source: By default, only numerical fields (decimals and integers) are sortable. This option activates sorting on textual fields. In the Table view of the dataset in the front office, it is then possible to sort text fields alphabetically.
fr: Par défaut, seuls les champs numériques (décimal et entier) sont triables. Cette option permet de trier les champs textuels. Dans la vue Tableau du jeu de données dans l'interface de navigation, vous avez alors la possibilité de trier les champs texte par ordre alphabétique.

source: This option is for multivalued records separated by one same separator. Example: *France,UK,USA* When set up as a facet, each of the field's records values appears as a separate entry in the filters section. When clicking on one of the entry, all the other entries which are not related (meaning the entries which never appear in the same record as part of a multivalues combination) automatically disappear -only the related entries remain as available filter entries.
fr: Cette option est destinée aux enregistrements multivalués, dont les valeurs sont séparées par un même séparateur. Par exemple, *France,UK,USA*. Lorsqu'elles sont paramétrées en tant que facettes, chaque valeur d'enregistrement du champ s'affiche sous la forme d'une entrée distincte dans la section dédiée aux filtres. Lorsque vous cliquez sur l'une des entrées, toutes les autres entrées qui n'y sont pas associées (c'est-à-dire les entrées qui ne s'affichent jamais dans le même enregistrement dans le cadre d'une combinaison de plusieurs valeurs) disparaissent automatiquement. Seules les entrées associées restent en tant qu'entrées de filtre disponibles.

source: This option is for multivalued records, separated by one same separator and which have a hierarchical relation. Example: *France/Ile-de-France/Paris* When set up as a facet, each first value of each record's multivalues combination appears as a separate entry in the filters section. When clicking on one entry, all second-level values related to that entry appear, and so on. Example: After clicking on the filter entry *France*, the related second-level entry *Ile-de-France* appears. After clicking on *Ile-de-France*, the related third-level entry *Paris* appears.
fr: Cette option est destinée aux enregistrements multivalués, dont les valeurs sont séparées par un même séparateur et qui ont une relation hiérarchique. Par exemple, *France/Ile-de-France/Paris*. Lorsqu'elle est paramétrée en tant que facette, la première valeur d'une combinaison avec plusieurs valeurs de chaque enregistrement s'affiche sous la forme d'une entrée distincte dans la section dédiée aux filtres. Lorsque vous cliquez sur une entrée, toutes les valeurs de deuxième niveau associées à cette entrée s'affichent, et ainsi de suite. Par exemple : après avoir cliqué sur l'entrée de filtre *France*, l'entrée de deuxième niveau *Ile-de-France* associée s'affiche. Après avoir cliqué sur *Ile-de-France*, l'entrée de troisième niveau *Paris* associée s'affiche.

source: To activate the hierarchical option:
fr: Pour activer l'option Hiérarchique :

source: This option is only available for domains that support more than one language. It allows to choose whether a field should be displayed for any language or only specific ones. The configuration of this option affects neither the data itself nor the API. It only affects visualizations in the front office of the platform.
fr: Cette option est seulement disponible pour les domaines prenant en charge plusieurs langues. Elle permet de choisir si un champ doit être affiché pour toutes les langues ou uniquement pour des langues spécifiques. La configuration de cette option n'a aucune incidence sur les données ni l'API, et concerne uniquement les visualisations dans l'interface de navigation de la plateforme.

source: From the list of languages available for the domain, tick those for which the field should be displayed.
fr: Dans la liste des langues disponibles pour le domaine, cochez celles pour lesquelles le champ doit être affiché.

source: Item counting (descending): entries are ordered from the one with the fewer records to the one with the most
fr: Nombre de résultats décroissant : les entrées sont triées en allant de l'entrée avec le moins d'enregistrements à celle avec le plus d'enregistrements.

source: Item counting (ascending): entries are ordered from the one with the most records to the one with the fewer
fr: Nombre de résultats croissant : les entrées sont triées en allant de l'entrée avec le plus d'enregistrements à celle avec le moins d'enregistrements.

source: In case the dataset contains geo shape fields. The Map view cannot display more than one layer of geo shapes. The geo shapes layer displayed by default must thus be defined. To do so, the field containing the geo shapes to be displayed by default on the map must the ordered before all other geo shapes fields.
fr: Si le jeu de données comprend des champs de forme géo. La vue Carte ne peut pas afficher plus d'une couche de formes géo ; la couche de forme géo par défaut doit donc être définie. Pour ce faire, le champ contenant les formes géo à afficher par défaut sur la carte doit être trié avant tous les autres champs de formes géo.

source: Dataset fields can be discarded from the dataset. It does not mean that the field is completely removed from the dataset but only deleted from the output. This is why, once the dataset is published, the discarded field will not be displayed in any visualization, and if the dataset is exported, the discarded field will not be in the export.
fr: Des champs de jeu de données peuvent être supprimés du jeu de données. Cela ne signifie pas que le champ est définitivement supprimé du jeu de données, mais qu'il est supprimé de la sortie. C'est pour cette raison que, une fois le jeu de données publié, le champ supprimé ne sera pas affiché dans les visualisations, et en cas d'exportation du jeu de données, le champ supprimé n'apparaîtra pas non plus.

source: The discarded fields of the dataset appear at the very end of the dataset. They look like blank, grey columns named by their technical identifiers. Find those you want to restore.
fr: Les champs supprimés du jeu de données s'affichent tout en bas du jeu de données : ils ressemblent à des colonnes grises et vides portant le nom de leurs identifiants techniques. Recherchez les champs que vous souhaitez restaurer.

source: DateTime
es: Fecha y hora
it: Data/ora
nl: DatumTijd

source: minute
es: minuto
it: minuti
nl: minuut

source: The OpenDataSoft platform retrieves the default field labels found in the source dataset. It is however possible to change each dataset field label.
it: La piattaforma OpenDataSoft recupera le etichette predefinite dei campi che si trovano nel dataset di origine, ma è comunque possibile modificarle.
