Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/defining_a_dataset_schema.po
Languages: de, es, fr, it, nl

source: By default, time records are in UTC timezone. To change the timezone, use the :doc:`Set Timezone processor<processors/set_timezone>`.
de: Standardmäßig beziehen sich die Zeiteinträge auf die UTC-Zeitzone. Um die Zeitzone zu ändern, verwenden Sie den Prozessor :doc:`Zeitzone einstellen<processors/set_timezone>`.
es: De forma predeterminada, los registros de hora están en la zona horaria UTC. Para cambiar la zona horaria, utilice el :doc:`procesador Establecer zona horaria<processors/set_timezone>`.
it: Per impostazione predefinita, i record orari sono espressi nel fuso orario UTC. Per modificare il fuso orario, utilizza il :doc:`processore Imposta fuso orario<processors/set_timezone>`.
nl: Standaard zijn de tijdstiprecords in de UTC tijdzone. Om de tijdzone te wijzen, gebruik het :doc:`Set Timezone processor<processors/set_timezone>`.

source: Decimal
de: Dezimal
fr: Décimal
it: Decimale
nl: Decimaal

source: Field values are decimal numbers. Valid separators for the decimal part are ``.`` or ``,``.
de: Feldwerte sind Dezimalzahlen. Gültige Trennzeichen für den Dezimalteil sind "." oder ",".
es: Los valores de campo son números decimales. Los separadores válidos de la parte decimal son ``.`` y``,``.
fr: Les valeurs de champ sont des nombres décimaux. Les séparateurs valides pour la partie décimale sont : ``.`` ou ``,``.
it: I valori dei campi sono numeri decimali. I separatori validi per la parte decimale sono "." o ",".
nl: Veldwaarden zijn decimale getallen. Geldige scheidingstekens voor het decimale gedeelte zijn "." of ",".

source: Geo point
de: Geopunkt
es: Punto geográfico
fr: Point géo
it: Punto geografico

source: Field values are a single geographical location expressed in the format ``<LAT>,<LON>``, for instance ``45.8,2.5``.
de: Feldwerte sind ein eindeutiger geografischer Ort, der im Format "<LAT>,<LON>" ausgedrückt wird, wie etwa "45.8,2.5".
es: Los valores de campo son una ubicación geográfica única expresada con el formato ``<LAT>,<LON>``, por ejemplo ``45.8,2.5``.
it: I valori dei campi sono un'unica località geografica espressa nel formato "<LAT>,<LON>", ad esempio "45.8,2.5".
nl: Veldwaarden zijn een enkelvoudige geografische locatie, uitgedrukt in het formaat ``<LAT>,<LON>``, bijvoorbeeld ``45.8,2.5``.

source: If your dataset contains two fields, latitude and longitude, use the :doc:`Create GeoPoint processor<processors/create_geopoint>` to create a valid geo point field.
de: Wenn Ihr Datensatz zwei Felder enthält, d. h. Breitengrad und Längengrad, nutzen Sie den Prozessor :doc:`Create Geopunkt<processors/create_geopoint>`, um ein gültiges Geopunkt-Feld zu erstellen.
es: Si el conjunto de datos contiene 2 campos, latitud y longitud, utilice el :doc:`procesador Crear punto geográfico<processors/create_geopoint>` para crear un campo de punto geográfico válido.
fr: Si votre jeu de données comprend deux champs, l'un correspondant à la latitude, l'autre à la longitude, utilisez le :doc:`processeur Créer un GeoPoint <processors/create_geopoint>` pour créer un champ de point géo valide.
it: Se il dataset contiene due campi, latitudine e longitudine, utilizza il :doc:`processore Crea geopoint<processors/create_geopoint>` per creare un campo punto geografico valido.
nl: Wanneer uw dataset twee velden, lengtegraad en breedtegraad, omvat, gebruik dan het :doc:`Create GeoPoint processor<processors/create_geopoint>` om een geldig geopoint-veld aan te maken.

source: Geo shape
de: Geoform
es: Forma geográfica
fr: Forme géo
it: Forma geografica

source: Field values are geographical shapes expressed in `GeoJSON <http://geojson.org/geojson-spec.html>`_. For example :
de: Feldwerte sind geografische Formen, ausgedrückt in `GeoJSON <http://geojson.org/geojson-spec.html>`_. Zum Beispiel:
es: Los valores de campo son formas geográficas expresadas en `GeoJSON <http://geojson.org/geojson-spec.html>`_. Por ejemplo:
it: I valori dei campi sono forme geografiche espresse in `GeoJSON <http://geojson.org/geojson-spec.html>`_. Ad esempio:
nl: Veldwaarden zijn geografische vormen, uitgedrukt in `GeoJSON <http://geojson.org/geojson-spec.html>`_. Bijvoorbeeld:

source: Feature collections are not supported.
de: Funktionsgruppen werden nicht unterstützt.
es: No se permiten las colecciones de funciones.
fr: Les collections de caractéristiques ne sont pas prises en charge.
it: Le raccolte di caratteristiche non sono supportate.
nl: Functieverzamelingen worden niet ondersteund.

source: Integer
de: Ganzzahl
es: Entero
fr: Entier
it: Intero
nl: Geheel getal

source: Field values are integer numbers. If a floating point value is found, it is automatically cast to its integer part.
de: Feldwerte sind ganze Zahlen. Sobald ein Gleitkommawert gefunden wird, wird er automatisch auf seinen ganzzahligen Teil übertragen.
es: Los valores de campo son números enteros. Si se encuentra un valor de punto flotante, automáticamente se convierte a su parte entera.
it: I valori dei campi sono numeri interi. Se viene rilevato un valore con virgola mobile, viene considerata automaticamente la parte intera.
nl: Veldwaarden zijn volledige getallen. Wanneer een vlottende puntwaarde wordt teruggevonden, wordt deze automatisch gekoppeld aan zijn volledig getalgedeelte.

source: Field values are textual data.
de: Feldwerte sind Textdaten.
es: Los valores de campo son datos de texto.
fr: Les valeurs de champ sont des données textuelles.
it: I valori dei campi sono dati testuali.
nl: Veldwaarden zijn tekstgegevens.

source: File
de: Datei
es: Archivo
fr: Fichier
nl: Bestand

source: Field values are files sourced with one of the available methods to :doc:`create a dataset with media files<../01_creating_a_dataset/creating_dataset_with_images>` (with the File processor, through an archive file or with a specific extractor), creating a field which default type is file. This field type is only available in that case.
de: Feldwerte sind Dateien, die mit einer der verfügbaren Methoden abgerufen werden, um :doc:`einen Datensatz mit Mediendateien zu erstellen<../01_creating_a_dataset/creating_dataset_with_images>` (mit dem Dateiprozessor, über eine Archivdatei oder mit einem bestimmten Extraktor). So wird ein Feld erzeugt, dessen Standardtyp die Datei ist. Dieser Feldtyp ist nur in diesem Fall verfügbar.
es: Los valores de campo son archivos obtenidos por medio de uno de los métodos disponibles para :doc:`crear un conjunto de datos con archivos multimedia<../01_creating_a_dataset/creating_dataset_with_images>` (con el procesador Archivo, un archivo archivador o un extractor específico); de forma predeterminada, el campo creado es de tipo archivo. Este tipo de campo solo está disponible en ese caso.
nl: Veldwaarden zijn bestanden die opgehaald worden met een van de beschikbare methodes om :doc:`een dataset met mediabestanden aan te maken<../01_creating_a_dataset/creating_dataset_with_images>` (met de File-processor, via een archiefbestand of met een specifieke extractor), het aanmaken van een veld met standaard type is bestand. In dat geval is enkel dit veldtype beschikbaar.

source: Setting up fields as facets
de: Felder als Facets einrichten
es: Configurar campos como facetas
fr: Paramétrer des champs en tant que facettes
it: Impostazione dei campi come facet
nl: Velden instellen als facetten

source: Facets define the filters of a dataset, which are displayed on the left of the dataset's visualization, in the front office. These filters have several purposes: they allow the users to find specific, precise records into a dataset, but they also allow the creation of charts afterward (if a field's records are other than numbers, they will be usable in the Chart Builder and in the Analyze view only if they are set up as facets).
de: Mit Facets werden Filter für einen Datensatz bestimmt. Diese Filter sind im Front-Office auf der linken Seite der Datensatzdarstellung zu sehen. Sie erfüllen unterschiedliche Zwecke: sie helfen Nutzern dabei, bestimmte Einträge in einem Datensatz zu finden, oder ermöglichen die Erstellung von Diagrammen im Nachhinein (sind die Einträge eines Feldes keine Zahlen, können sie nur dann im Diagrammersteller oder der Analyseansicht verwendet werden, wenn sie als Facets eingerichtet wurden).
es: Las facetas definen los filtros de un conjunto de datos, que se muestran a la izquierda de la visualización del conjunto de datos, en el front office. Estos filtros tienen varios fines: permiten a los usuarios encontrar con precisión registros específicos dentro de un conjunto de datos, así como crear gráficos posteriormente (si los registros de un campo son diferentes de números, se podrán utilizar en el compilador de gráficos y en la vista de análisis solo si están configurados como facetas).
it: I facet definiscono i filtri di un dataset, che sono presenti sulla parte sinistra della visualizzazione del dataset, nell'interfaccia di front-office. Questi filtri hanno diversi scopi: consentono agli utenti di trovare con precisione record specifici all'interno di un dataset e, in seguito, anche di creare grafici. Se i record di un campo non sono costituiti da numeri, potranno essere utilizzati nel Generatore di grafici e nella visualizzazione Analisi solo se sono impostati come facet.
nl: Facetten definiëren de filters van een dataset die in de front office links van de weergave van de dataset worden weergegeven. Deze filters hebben verschillende doeleinden: ze stellen gebruikers in staat om specifieke, nauwkeurige records in een dataset terug te vinden, maar ze bieden ook de mogelijkheid om daarna grafieken aan te maken (wanneer de records in een veld geen getallen zijn, zullen ze gebruikt kunnen worden in de Chart Builder en in de weergave Analyse, maar enkel wanneer ze ingesteld zijn als facetten).

source: Fields which type is either geo shape or geo point cannot be set up as facets.
de: Felder, bei denen es sich um Geoformen oder Geopunkte handelt, können nicht als Facet eingerichtet werden.
es: Los campos de tipo forma geográfica o punto geográfico no se pueden configurar como facetas.
fr: Les champs de type forme géo ou point géo ne peuvent pas être paramétrés en tant que facettes.
it: I campi di tipo forma geografica o punto geografico non sono impostabili come facet.
nl: Velden met als type ofwel geoshape of geopoint kunnen niet worden ingesteld worden als facetten.

source: To set up a field as a facet:
de: Um ein Feld als Facet einzurichten:
es: Para configurar un campo como faceta:
fr: Pour paramétrer un champ en tant que facette :
it: Per configurare un campo come facet:
nl: Om een veld in te stellen als een facet:

source: In the preview area of the Processing tab, choose the field you want to set up as a facet. Choose a field relevant enough to become a filter.
de: Wählen Sie im Vorschaubereich der Registerkarte "Verarbeitung" das Feld, das Sie als Facet einrichten möchten. Wählen Sie dazu ein Feld, das sich als Filter eignet.
es: En el área de vista previa de la ficha Procesadores, elija el campo que desea configurar como faceta. Elija un campo lo suficientemente relevante para ser un filtro.
fr: Dans la zone d'aperçu de l'onglet Traitement, choisissez le champ à paramétrer en tant que facette. Sélectionnez un champ suffisamment pertinent pour être utilisé comme filtre.
it: Nell'area dell'anteprima della scheda Elaborazione, seleziona il campo da configurare come facet tra quelli sufficientemente adatti a diventare un filtro.
nl: Kies in de voorbeeldweergave van het tabblad Verwerken het veld dat u wilt instellen als een facet. Kies een veld dat voldoende relevant is om ingesteld te worden als filter.

source: Click the |icon-facet| button.
de: Klicken Sie auf den Button |icon-facet|.
es: Haga clic en el botón |icon-facet|.
fr: Cliquez sur le bouton |icon-facet|.
it: Clicca sul pulsante |icon-facet|.
nl: Klik op de knop |icon-facet|.

source: Configuring field options
de: Feldoptionen konfigurieren
es: Configurar opciones de campos
fr: Configurer des options de champ
it: Configurazione delle opzioni del campo
nl: Veldopties configureren

source: In the preview area of the Processing tab, click the |icon-configuration| button of the field of your choice.
de: Klicken Sie im Vorschaubereich der Registerkarte "Verarbeitung" auf den Button |icon-configuration| des gewünschten Feldes.
es: En el área de vista previa de la ficha Procesadores, haga clic en el botón |icon-configuration| del campo que desee.
fr: Dans la zone d'aperçu de l'onglet Traitement, cliquez sur le bouton |icon-configuration| du champ de votre choix.
it: Nell'area dell'anteprima della scheda Elaborazione, clicca sul pulsante |icon-configuration| relativo al campo desiderato.
nl: Klik in de voorbeeldweergave van het tabblad Verwerken op de knop |icon-configuration| van het veld van uw keuze.

source: Configuration options change depending on the type of the field and on whether the field is set up as a facet or not. Follow the right instructions depending on the chosen configuration option.
de: Konfigurationsoptionen ändern sich je nach Feldtyp und abhängig davon, ob das Feld als Facet eingerichtet ist. Befolgen Sie die passenden Anweisungen je nach gewählter Konfigurationsoption.
es: Las opciones de configuración varían según el tipo del campo y si el campo está configurado como faceta o no. Siga las instrucciones apropiadas en función de la opción de configuración elegida.
fr: Les options de configuration varient en fonction du type de champ et de si le champ est paramétré en tant que facette ou non. Suivez les instructions qui correspondent à l'option de configuration choisie.
it: Le opzioni di configurazione variano a seconda del tipo di campo e del fatto che il campo sia stato impostato come facet oppure no. Segui le istruzioni appropriate a seconda dell'opzione di configurazione scelta.
nl: Configuratieopties wijzigen afhankelijk van het type veld en van het feit of het veld al dan niet is ingesteld als facet. Volg de juiste instructies afhankelijk van de gekozen configuratieoptie.

source: Configuration options available for every field
de: Konfigurationsoptionen sind für jedes Feld verfügbar
es: Opciones de configuración disponibles para todos los campos
fr: Options de configuration disponibles pour chaque champ
it: Opzioni di configurazione disponibili per ogni campo
nl: Er zijn configuratieopties beschikbaar voor elk veld

source: Configuration option
de: Konfigurationsoption
es: Opción de configuración
fr: Option de configuration
it: Opzione Configurazione
nl: Configuratieoptie

source: Technical identifier of the field. In contrary to the label, the technical identifier does not have aesthetic purposes and thus cannot contain special characters, including spaces. Technical identifiers can be used for instance when creating a custom tooltip with HTML.
de: Technische Kennung des Feldes. Im Gegensatz zur Beschriftung erfüllt die technische Kennung keinen ästhetischen Zweck und kann keine Sonderzeichen (einschließlich Leerzeichen) enthalten. Technische Kennungen können beispielsweise verwendet werden, wenn eine benutzerdefinierte QuickInfo mit HTML erstellt wird.
es: Identificador técnico del campo. A diferencia de la etiqueta, el identificador técnico no tiene una finalidad estética, de modo que no puede contener caracteres especiales (como espacios). Los identificadores técnicos se pueden emplear, por ejemplo, al crear una ayuda de herramienta personalizada con HTML.
it: Identificatore tecnico del campo. A differenza dell'etichetta, l'identificatore tecnico non ha una finalità estetica e non può contenere caratteri speciali, inclusi gli spazi. Gli identificatori tecnici servono, ad esempio, per la creazione di un tooltip personalizzato con codice HTML.
nl: Technische identifier van het veld. In tegenstelling tot het label, heeft de technische identifier geen esthetische doeleinden en bevat hij bijgevolg geen speciale karakters, waaronder spaties. Technische identifiers kunnen bijvoorbeeld gebruikt worden om een custom tooltip met HTML aan te maken.

source: Warning
de: Warnung
es: Aviso
fr: Avertissement
nl: Waarschuwing

source: Changing the technical identifier of a field could break reuses of the related dataset (custom tooltip, custom tab or pages). It could also be a problem if the source of the dataset is (regularly) updated: when replacing a source with a newer one, the platform checks the technical identifier of the fields of both sources in order to find a match between the two -then replacing the old data with the new ones. If technical identifiers are not the same anymore, the dataset cannot be updated.
de: Durch die Änderung der technischen Kennung eines Felds können die Weiterverwendungen des entsprechenden Datensatzes (benutzerdefinierte QuickInfo, benutzerdefinierte Registerkarte oder Seiten) aufgehoben werden. Es kann auch problematisch sein, wenn die Quelle des Datensatzes (regelmäßig) aktualisiert wird: wird eine Quelle durch eine Neuere ersetzt, prüft die Plattform die technische Kennung der Felder beider Quellen, um eine Übereinstimmung zwischen den beiden zu finden und anschließend die alten Daten durch die neuen zu ersetzen.
es: La modificación del identificador técnico de un campo puede romper las reutilizaciones del conjunto de datos relacionado (ayuda de herramienta, ficha o páginas personalizadas). También puede plantear un problema si se actualiza (periódicamente) el origen del conjunto de datos: al sustituir un origen por otro nuevo, la plataforma comprobará el identificador técnico de los campos de ambos orígenes en busca de una coincidencia entre ambos y sustituirá los datos antiguos por los nuevos. Si los identificadores técnicos ya no son los mismos, no podrá actualizar el conjunto de datos.
it: Se si modifica l'identificatore tecnico di un campo, i riutilizzi del relativo dataset (tooltip, schede o pagine personalizzate) potrebbero interrompersi. Un problema potrebbe sorgere anche nel caso in cui l'origine del dataset venga (periodicamente) aggiornata: quando un'origine viene sostituita con una più nuova, la piattaforma verifica gli identificatori tecnici dei campi di entrambe per individuare una corrispondenza tra le due, sostituendo infine i dati precedenti con quelli nuovi. Se gli identificatori tecnici non sono più uguali, non è possibile aggiornare il dataset.
nl: Het wijzigen van de technische identifier kan het hergebruik van de aanverwante dataset verstoren (custom tooltip, custom tab of pagina's). Het zou ook een probleem kunnen vormen wanneer de bron van de dataset (regelmatig) wordt geüpdatet: wanneer een bron wordt vervangen door een nieuwere controleert het platform de technische identifier van de velden van beide bronnen om een match te vinden tussen de twee. Vervolgens worden de oude data vervangen door de nieuwe. Wanneer technische identifiers niet meer dezelfde zijn, kan de dataset niet worden geüpdatet.

source: To change the technical identifier of a field:
de: Um die technische Kennung eines Feldes zu ändern:
es: Para cambiar el identificador técnico de un campo:
fr: Pour modifier l'identifiant technique d'un champ :
it: Per modificare l'identificatore tecnico di un campo:
nl: Om de technische identifier van een veld te wijzigen:

source: Select the current technical identifier of the field, written in the text box under "Name".
de: Wählen Sie die aktuelle technische Kennung des Feldes aus, die im Textfeld unter "Name" aufgeführt ist.
es: Seleccione el identificador técnico actual del campo, que figura en el cuadro de texto bajo "Nombre".
fr: Sélectionnez l'identifiant technique actuel du champ, écrit dans la zone de texte sous "Nom".
it: Seleziona l'identificatore tecnico del campo, riportato nella casella di testo sotto "Nome".
nl: Selecteer de huidige technische identifier van het veld die terug te vinden in het tekstvak onder "Naam".

source: Type a new technical identifier. It musn't contain special characters.
de: Geben Sie eine neue technische Kennung ein. Sie darf keine Sonderzeichen enthalten.
es: Escriba un identificador técnico nuevo. No puede contener caracteres especiales.
it: Digita il nuovo identificatore tecnico, che non deve includere caratteri speciali.
nl: Voer een nieuwe technische identifier in. Deze mag geen speciale karakters bevatten.

source: Click outside the text box or press Enter for the change to be taken into account.
de: Klicken Sie außerhalb des Textfeldes oder drücken Sie die Eingabe-Taste, um die Änderung zu übernehmen.
es: Haga clic fuera del cuadro de texto o pulse Entrar para que se tenga en cuenta el cambio.
fr: Cliquez à l'extérieur du champ de texte ou appuyez sur Entrée pour que les modifications soient prises en compte.
it: Clicca all'esterno della casella di testo o premi Invio per confermare le modifiche.
nl: Klik buiten het tekstvak of druk op Enter om de wijziging te registreren.

source: Unique ID
de: Eindeutige ID
es: ID exclusivo
fr: ID unique
it: ID univoco
nl: Uniek ID

source: Each record is uniquely identified by its identifier, which is by default computed as the fingerprint of all the record fields values. If the Unique ID option is activated for a field, records with the same identifier (or value) are deleted for only the last/oldest one to stay in the dataset. It is most useful for real-time datasets, to make sure that instead of adding new records every time the dataset is updated, new values replace the old ones.
de: Jeder Eintrag hat eine eindeutige Kennung, die standardmäßig als Fingerabdruck sämtlicher Eintragsfeldwerte berechnet wird. Ist die Option "Eindeutige ID" für ein Feld aktiviert, werden Einträge mit der gleichen Kennung/ID (oder dem gleichen Wert) gelöscht, damit nur der letzte/älteste Eintrag im Datensatz verbleibt. Diese Vorgehensweise eignet sich vor allem für Echtzeit-Datensätze. So wird gewährleistet, dass bei einem Datensatz-Update alte Werte durch neue ersetzt werden, anstatt jedes Mal neue Einträge hinzuzufügen.
es: Cada uno de los registros se identifica mediante un identificador exclusivo, que de forma predeterminada se calcula como la huella digital de todos los valores de campos de registros. Si la opción de ID exclusivo está activada para un campo, se suprimen los registros con el mismo identificador (o valor) de tal modo que solo permanezca en el conjunto de datos el registro último/más antiguo. Esto resulta especialmente útil en el caso de los conjuntos de datos en tiempo real para asegurarse de que, en lugar de añadir nuevos registros cada vez que se actualiza el conjunto de datos, los valores nuevos sustituyen a los anteriores.
it: Ogni record è individuato in modo univoco dal suo identificatore, che viene calcolato in modo predefinito come l'impronta digitale di tutti i valori dei campi del record. Se si attiva l'opzione ID univoco per un campo, i record con lo stesso identificatore o valore verranno eliminati e nel dataset saranno conservati solo i più recenti o i più vecchi. Ciò risulta particolarmente utile per i dataset in tempo reale, per fare che in modo che anziché aggiungere nuovi record, a ogni aggiornamento del dataset i nuovi valori sostituiscano quelli esistenti.
nl: Elk record wordt op unieke wijze geïdentificeerd door zijn identifier, die standaard ingesteld wordt als de vingerafdruk van alle veldwaarden van het record. Wanneer de Unieke ID-optie geactiveerd is voor een veld, worden records met dezelfde identifier (of waarde) verwijderd worden, maar enkel voor de laatste/oudste die in de dataset blijft staan. Dit is vooral nuttig voor real-time datasets om ervoor te zorgen dat nieuwe waarden de oude vervangen in plaats van telkens nieuwe records worden toegevoegd wanneer de dataset wordt geüpdatet.
