Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/defining_a_dataset_schema.po
Languages: de, es, fr, it, nl

source: To activate the Unique ID option of a field: Tick the Unique ID box.
de: Um die Option "Eindeutige ID" eines Feldes zu aktivieren: Markieren Sie das Kontrollkästchen "Eindeutige ID".
es: Para activar la opción de ID exclusivo de un campo: Marque la casilla ID exclusivo.
fr: Pour activer l'option ID unique d'un champ : cochez la case ID unique.
it: Per attivare l'opzione ID univoco di un campo: seleziona la casella ID univoco.
nl: Om de Unieke ID-optie van een veld te activeren: vink het Unieke ID-vakje aan.

source: Configuration options for date & datetime fields
de: Konfigurationsoptionen für Datums- und DateTime-Felder
es: Opciones de configuración para los campos de fecha o fecha y hora
fr: Options de configuration des champs date et datetime
it: Opzioni di configurazione per i campi di data e di data/ora
nl: Configuratieopties voor datum & datum/tijd-velden

source: Precision
de: Präzision
es: Precisión
fr: Précision
it: Precisione
nl: Verduidelijking

source: Degree of precision of the date or datetime field.
de: Genauigkeitsgrad des Datums- und DateTime-Feldes.
es: Grado de precisión del campo de fecha o fecha y hora.
fr: Degré de précision du champ date ou datetime.
it: Grado di precisione del campo di data o data/ora.
nl: Mate van duidelijkheid van het datum- of datum/tijd-veld

source: To define a degree of precision:
de: Um den Genauigkeitsgrad zu bestimmen:
es: Para definir un grado de precisión:
fr: Pour définir un degré de précision :
it: Per definire il grado di precisione:
nl: Om een mate van duidelijkheid te definiëren:

source: Click on the Precision list box of the field of your choice.
de: Klicken Sie auf das Listenfeld "Präzision" des gewünschten Feldes.
es: Haga clic en el cuadro de lista Precisión del campo que desee.
fr: Cliquez sur la zone de liste Précision du champ de votre choix.
it: Clicca nella casella di riepilogo Precisione del campo desiderato.
nl: Klik op het keuzelijst Verduidelijking van het veld van uw keuze.

source: Choose a degree of precision:
de: Wählen Sie einen Genauigkeitsgrad:
es: Elija un grado de precisión:
fr: Choisissez un degré de précision :
it: Seleziona un grado di precisione:
nl: Kies een mate van duidelijkheid:

source: For date fields:
de: Für Datumsfelder:
es: Para los campos de fecha:
fr: Pour les champs date :
it: Per i campi di data:
nl: Voor datumvelden:

source: year: only the year of the date is displayed in the dataset
de: Jahr: Nur das Jahr des Datums wird im Datensatz angezeigt
es: año: solo se visualiza el año de la fecha en el conjunto de datos
fr: année : seule l'année de la date est affichée dans le jeu de données,
it: anno: nel dataset verrà visualizzato solo l'anno della data;
nl: jaar: enkel het jaar van de datum wordt weergegeven in de dataset

source: month: only the month and year of the date are displayed in the dataset
de: Monat: Nur der Monat und das Jahr des Datums werden im Datensatz angezeigt
es: mes: solo se visualiza el mes y el año de la fecha en el conjunto de datos
fr: mois : seuls le mois et l'année de la date sont affichés dans le jeu de données,
it: mese: nel dataset verranno visualizzati solo il mese e l'anno della data;
nl: maand: enkel de maand en het jaar van de datum worden weergegeven in de dataset

source: day: the full date (day, month and year) is displayed in the dataset
de: Tag: Das vollständige Datum (Tag, Monat und Jahr) wird im Datensatz angezeigt
es: día: se visualiza la fecha completa (día, mes y año) en el conjunto de datos
it: giorno: nel dataset verrà visualizzata l'intera data (giorno, mese e anno).
nl: dag: de volledige datum (dag, maand en jaar) wordt weergegeven in de dataset

source: For datetime fields:
de: Für DateTime-Felder:
es: Para los campos de fecha y hora:
fr: Pour les champs datetime :
it: Per i campi di data/ora:
nl: Voor datum/tijd-velden:

source: hour
de: Stunde
es: hora
fr: heure
it: ora
nl: uur

source: As for the datetime precisions, the full datetime (hour and minutes) is displayed in the dataset. The difference is in the Analyze view and in the Chart Builder where the degree of precision is available to configure the chart.
de: Der Datensatz verfügt über eine vollständige DateTime-Anzeige (Stunden und Minuten). Ein Unterschied besteht für die Analyseansicht und den Diagrammersteller: hier kann der Genauigkeitsgrad zur Konfiguration des Diagramms angegeben werden.
es: Al igual que para las precisiones de fecha y hora, se visualiza la fecha y hora completa (hora y minutos) en el conjunto de datos. La diferencia está en la vista de análisis y el compilador de gráficos, donde el grado de precisión está disponible para configurar el gráfico.
fr: En ce qui concerne la précision du datetime, le datetime complet (heure et minutes) est affiché dans le jeu de données. La différence se trouve dans la vue Analyse et dans l'éditeur de graphes, où le degré de précision est disponible pour configurer le graphe.
it: Come per la precisione dei campi di data/ora, nel dataset viene visualizzata l'intera data/ora (ora e minuti). La differenza è ravvisabile nella visualizzazione Analisi e nel Generatore di grafici, in cui il grado di precisione è un parametro disponibile per la configurazione del grafico.
nl: Voor de datum/tijd-verduidelijkingen wordt de volledige datum/tijd (uur en minuten) weergegeven in de dataset. Het verschil zit hem in de weergave Analyse en in de Chart Builder waar de mate van duidelijkheid beschikbaar is om deze grafiek te configureren.

source: Configuration options for decimals & integer fields
de: Konfigurationsoptionen für Dezimal- und Ganzzahlfelder
es: Opciones de configuración para los campos de decimales y enteros
fr: Options de configuration des champs décimaux et entiers
it: Opzioni di configurazione per campi decimali e interi
nl: Configuratieopties voor decimalen- & geheel getal-velden

source: Unit
de: Einheit
es: Unidad
fr: Unité
it: Unità
nl: Eenheid

source: Unit of the field, to display along with the decimal or integer value.
de: Einheit des Feldes, die zusammen mit dem Dezimal- oder Ganzzahlwert angezeigt werden soll.
es: Unidad del campo, que se visualizará junto con el valor decimal o entero.
fr: Unité du champ, à afficher avec la valeur décimale ou entière.
it: Unità del campo, da visualizzare con il valore decimale o intero.
nl: Eenheid van het veld om samen met de decimaal- of geheel getalwaarde weer te geven.

source: To define a unit for a field:
de: Um die Einheit eines Feldes zu bestimmen:
es: Para definir una unidad para un campo:
fr: Pour définir une unité pour un champ :
it: Per definire l'unità di un campo:
nl: Om een eenheid van een veld te definiëren:

source: Click on the Unit list box of the field of your choice.
de: Klicken Sie auf das Listenfeld "Einheit" des gewünschten Feldes.
es: Haga clic en el cuadro de lista Unidad del campo que desee.
fr: Cliquez sur la zone de liste Unité du champ de votre choix.
it: Clicca sulla casella di riepilogo Unità del campo desiderato.
nl: Klik op het keuzelijst Eenheid van het veld van uw keuze.

source: Choose the right unit among the list.
de: Wählen Sie die richtige Einheit aus der Liste aus.
es: Elija la unidad apropiada de la lista.
it: Seleziona dall'elenco l'unità corretta.
nl: Kies de juiste eenheid uit de lijst.

source: Enforce the number of decimals to display
de: Anzahl der anzuzeigenden Dezimalstellen bestimmen
es: Aplicar el número de decimales al visualizar
fr: Appliquer le nombre de décimales à afficher
it: Configurazione del numero di decimali da visualizzare
nl: Voer het aantal decimalen in dat moet worden weergegeven

source: Chosen number of decimals for all values of the field.
de: Gewählte Anzahl an Dezimalstellen für alle Werte des Feldes.
es: Número de decimales seleccionado para todos los valores del campo.
it: Numero di decimali scelto per tutti i valori del campo.
nl: Kies het aantal decimalen voor alle velden van het veld.

source: To define a number of decimals for a field:
de: Um die Anzahl Dezimalstellen für ein Feld zu bestimmen:
es: Para definir un número de decimales para un campo:
fr: Pour définir un nombre de décimales pour un champ :
it: Per definire il numero di decimali per un campo:
nl: Om een aantal decimalen voor een veld te definiëren:

source: Tick the "Enforce the number of decimals to display" box.
de: Markieren Sie das Kontrollkästchen "Anzahl der anzuzeigenden Dezimalstellen bestimmen"
es: Marque la casilla "Aplicar el número de decimales al visualizar".
fr: Cochez la case "Appliquer le nombre de décimales à afficher".
it: Seleziona la casella "Applica il numero di decimali da visualizzare".
nl: Vink het vakje "Het aantal decimalen dat moet worden weergegeven, invoeren".

source: In the text area below, type the number of decimals of your choice, or use the arrows to do so.
de: Geben Sie im unteren Textfeld die Anzahl der gewünschten Dezimalstellen ein oder verwenden Sie dazu die Pfeile.
es: En el área de texto que figura a continuación, escriba el número de decimales que desee o utilice las flechas para seleccionarlo.
fr: Dans la zone de texte ci-dessous, saisissez le nombre de décimales de votre choix ou utilisez les flèches pour le choisir.
it: Nell'area di testo sottostante, digita il numero di decimali desiderato o utilizza le frecce per impostarlo.
nl: Voer in het onderstaande tekstveld het aantal decimalen van uw keuze in of gebruik de pijltoetsen hiervoor.

source: Configuration options for text fields
de: Konfigurationsoptionen für Textfelder
es: Opciones de configuración para los campos de texto
fr: Options de configuration des champs texte
it: Opzioni di configurazione per i campi di testo
nl: Configuratieopties voor tekstvelden

source: Sortable
de: Sortierbar
es: Ordenable
fr: Triable
it: Ordinabile
nl: Sorteerbaar

source: By default, only numerical fields (decimals and integers) are sortable. This option activates sorting on textual fields. It is then possible, when in the Table view of the dataset in the front office, to sort text fields in an alphabetical order.
de: Standardmäßig sind nur numerische Felder (Dezimalzahlen und ganze Zahlen) sortierbar. Mit dieser Option wird die Sortierung nach Textfeldern aktiviert. In der Tabellenansicht des Datensatzes im Front-Office ist es dann möglich, Textfelder in alphabetischer Reihenfolge zu sortieren.
es: De forma predeterminada, solo se pueden ordenar los campos numéricos (decimales y enteros). Esta opción activa la ordenación en los campos de texto. De este modo, los campos de texto se pueden ordenar alfabéticamente en la vista de tabla del conjunto de datos en el front office.
it: Per impostazione predefinita, sono ordinabili solo i campi numerici (decimali e interi). Questa opzione attiva l'ordinamento dei campi testuali, in modo che nella visualizzazione Tabella del dataset, nell'interfaccia di front-office, sia possibile disporre i campi di testo in ordine alfabetico.
nl: Standaard kunnen enkel numerieke velden (decimalen en gehele getallen) worden gesorteerd. Met deze optie wordt het sorteren op tekstvelden geactiveerd. Zo is het mogelijk om in een Tabelweergave van de dataset in de front office tekstvelden in alfabetische volgorde te sorteren.

source: To make a field sortable: Tick the "Sortable" box.
de: Um ein Feld sortierbar zu machen: Markieren Sie das Kontrollkästchen "Sortierbar".
es: Para establecer un campo como ordenable: Marque la casilla "Ordenable".
fr: Pour qu'un champ soit triable : cochez la case "Triable".
it: Per rendere ordinabile un campo: seleziona la casella "Ordinabile".
nl: Om ervoor te zorgen dat een veld kan worden gesorteerd: Vink het vakje "Sorteerbaar" aan.

source: Multivalued
de: Mehrwertig
es: Multivalor
fr: Multivalué
it: Multivalore
nl: Meerdere waarden

source: This option is for multi-valued records separated by one same separator. Example: *France,UK,USA* When set up as a facet, each of the field's records values appears as a separate entry in the filters section. When clicking on one of the entry, all the other entries which are not related (meaning the entries which never appear in the same record as part of a multi-values combination) automatically disappear -only the related entries remain as available filter entries.
de: Diese Option eignet sich für mehrwertige Einträge, die durch ein und dasselbe Trennzeichen getrennt sind. Beispiel: *France,UK,USA* Werden sie als Facet eingerichtet, erscheinen die einzelnen Feldwerte als separater Eintrag im Filterbereich. Wenn Sie auf einen der Einträge klicken, werden alle nicht dazugehörigen Einträge (d.h. die Einträge, die nie im selben Datensatz als Teil einer Kombination aus mehreren Werten auftauchen) automatisch ausgeblendet. Nur die zugehörigen Einträge bleiben als verfügbare Filtereinträge erhalten.
es: Esta opción es para los registros multivalor separados por un mismo separador. Ejemplo: *France,UK,USA*. Con la configuración como faceta, cada uno de los valores de los registros del campo aparece como una entrada independiente en la sección de filtros. Al hacer clic en una entrada, todas las demás entradas que no están relacionadas (es decir, las entradas que nunca aparecerán en el mismo registro como parte de una combinación multivalor) desaparecen automáticamente y solo se mantienen como entradas de filtros disponibles las entradas relacionadas.
it: Questa opzione si applica ai record multivalore divisi da un unico separatore. Esempio: *France,UK,USA*. Quando impostato come facet, ogni valore dei record del campo appare come voce separata nella sezione dei filtri. Facendo clic su una voce, tutte le altre voci non correlate, cioè quelle che non compaiono mai nello stesso record in una combinazione di multivalori, scompaiono automaticamente. Restano visibili solo le voci correlate come voci di filtro disponibili.
nl: Deze optie is er voor records met meerdere waarden die gescheiden worden door eenzelfde scheidingsteken. Bijvoorbeeld: "Frankrijk, VK, VS". Wanneer deze ingesteld worden als een facet verschijnen de recordwaarden van elk van de velden als een afzonderlijke entry in de filterssectie. Wanneer een van de entries wordt aangeklikt, verdwijnen alle andere entries die er geen verband mee houden (m.a.w. de entries die nooit in hetzelfde record verschijnen als onderdeel van een combinatie van meerdere waarden) automatisch en blijven enkel de aanverwante entries staan als beschikbaar filterentries.

source: To activate the multivalued option:
de: Um die Option "Mehrwertig" zu aktivieren:
es: Para activar la opción multivalor:
fr: Pour activer l'option Multivalué :
it: Per attivare l'opzione multivalore:
nl: Om de optie met meerdere waarden te activeren:

source: Tick the "Multivalued" box.
de: Markieren Sie das Kontrollkästchen "Mehrwertig".
es: Marque la casilla "Multivalor".
fr: Cochez la case "Multivalué".
it: Seleziona la casella "Multivalore".
nl: Vink het vakje "Meerdere waarden" aan.

source: In the text box below, type the separator between the values of the records.
de: Geben Sie im unteren Textfeld das Trennzeichen zwischen den Werten der Einträge ein.
es: En el cuadro de texto que figura a continuación, escriba el separador de los valores de los registros.
fr: Dans la zone de texte ci-dessous, saisissez le séparateur entre les valeurs des enregistrements.
it: Nella casella di testo sottostante, digita il separatore tra i valori dei record.
nl: Voer in het onderstaande tekstvak het scheidingsteken tussen de waarden van de records in.

source: Hierarchical
de: Hierarchisch
es: Jerárquico
fr: Hiérarchique
it: Gerarchico
nl: Hiërarchisch

source: This option is for multi-valued records, separated by one same separator and which have a hierarchical relation. Example: *France/Ile-de-France/Paris* When set up as a facet, each first value of each record's multi-values combination appears as a separate entry in the filters section. When clicking on one entry, all second-level values related to that entry appear, and so on. Example: After clicking on the filter entry *France*, the related second-level entry *Ile-de-France* appears. After clicking on *Ile-de-France*, the related third-level entry *Paris* appears.
de: Diese Option eignet sich für mehrwertige Einträge, die durch ein und dasselbe Trennzeichen getrennt sind und eine hierarchische Beziehung haben. Beispiel: *France/Ile-de-France/Paris* Werden die Einträge als Facet eingerichtet, erscheint der erste Wert jeder einzelnen Kombination aus mehreren Werten als separater Eintrag im Filterbereich. Wenn Sie auf einen der Einträge klicken, werden alle zu diesem Eintrag gehörenden Werte der zweiten Ebene usw. angezeigt. Beispiel: Nach einem Klick auf den Filtereintrag *France* erscheint der zugehörige Eintrag auf der zweiten Ebene *Ile-de-France*. Klicken Sie auf *Ile-de-France*, erscheint der zugehörige Eintrag der dritten Ebene *Paris*.
es: Esta opción es para los registros multivalor separados por un mismo separador que tienen una relación jerárquica. Ejemplo: *France/Ile-de-France/Paris*. Con la configuración como faceta, cada uno de los primeros valores de una combinación multivalor de cada uno de los registros aparece como una entrada independiente en la sección de filtros. Al hacer clic en una entrada, aparecerán todos los valores de segundo nivel relacionados con esa entrada, y así sucesivamente. Ejemplo: Al hacer clic en la entrada de filtro *France*, aparece la entrada de segundo nivel relacionada *Ile-de-France*. Al hacer clic en *Ile-de-France*, aparece la entrada de tercer nivel relacionada *Paris*.
it: Questa opzione si applica ai record multivalore, divisi da un unico separatore, che presentano una relazione gerarchica. Esempio: *France/Ile-de-France/Paris*. Quando impostato come facet, ogni primo valore della combinazione multivalore di ciascun record compare come voce separata nella sezione dei filtri. Facendo clic su una voce, compaiono tutti i valori di secondo livello correlati a tale voce e così via. Esempio: dopo aver cliccato sulla voce di filtro *France*, viene visualizzata la voce di secondo livello correlata *Ile-de-France*. Dopo aver cliccato su *Ile-de-France*, viene visualizzata la voce di terzo livello *Paris*.
nl: Deze optie is er voor records met meerdere waarden die gescheiden worden door eenzelfde scheidingsteken en die een hiërarchische relatie hebben. Voorbeeld: "Frankrijk/Ile-de-France/Parijs". Wanneer deze is ingesteld als een facet, verschijnt elke eerste waarde van de combinatie met meerdere waarden van elk record als een afzonderlijke entry in de filterssectie. Wanneer één entry wordt aangeklikt, verschijnen alle waarden van het tweede niveau die verband houden met die entry, enzovoort. Voorbeeld: Na op de filterentry "Frankrijk" te hebben geklikt, verschijnt de aanverwante entry van het tweede niveau "Ile-de-France". Na op "Ile-de-France" te hebben geklikt, verschijnt de aanverwante entry van het derde niveau "Parijs".

source: To activate the hierachical option:
de: Um die Option "Hierarchisch" zu aktivieren:
es: Para activar la opción jerárquica:
it: Per attivare l'opzione gerarchica:
nl: Om deze hiërarchische optie te activeren:

source: Tick the "Hierarchical" box.
de: Markieren Sie das Kontrollkästchen "Hierarchisch".
es: Marque la casilla "Jerárquico".
fr: Cochez la case "Hiérarchique".
it: Seleziona la casella "Gerarchico".
nl: Vink het vakje "Hiërarchisch" aan.

source: Display only for specific languages
de: Nur für bestimmte Sprachen anzeigen
fr: Afficher uniquement pour les langues choisies

source: This option is only available for domains which support more than one language. It allows to choose whether a field should be displayed for any language, or only specific ones. The configuration of this option affects neither the data itself nor the API, it only affects visualisations in the front office of the platform.
de: Diese Option ist nur für Domains verfügbar, die mehr als eine Sprache unterstützen. Mit ihr kann ausgewählt werden, ob ein Feld für jede beliebige Sprache oder nur für bestimmte Sprachen angezeigt werden soll. Die Konfiguration dieser Option wirkt sich weder auf die Daten selbst noch auf die API aus, sie betrifft lediglich die Visualisierungen im Front-Office der Plattform.

source: To make a field displayed for specific languages only:
de: Damit ein Feld nur für bestimmte Sprachen angezeigt wird:
fr: Pour qu'un champ s'affiche uniquement pour des langues spécifiques :

source: Tick the "Display only for specific language" box.
de: Kreuzen Sie das Kästchen "Nur für bestimmte Sprache anzeigen" an.
fr: Cochez la case "Afficher uniquement pour les langues choisies".

source: Among the list of languages available for the domain, tick those for which the field should be displayed.
de: Markieren Sie in der Liste der verfügbaren Sprachen der Domain diejenigen, für die das Feld angezeigt werden soll.

source: Configuration options for facets
de: Konfigurationsoptionen für Facets
es: Opciones de configuración para las facetas
fr: Options de configuration des facettes
it: Opzioni di configurazione per i facet
nl: Configuratieopties voor facetten

source: Sort facet by
de: Facet sortieren nach
es: Ordenar faceta por
fr: Trier la facette par
it: Ordina facet per
nl: Sorteer facet per

source: Chosen sorting of the field's entries in the filters section of the front office.
de: Gewählte Sortierung der Feldeinträge im Filterbereich des Front-Office.
es: Ordenación seleccionada de las entradas del campo en la sección de filtros del front office.
fr: Tri choisi pour les entrées de champ dans la section dédiée aux filtres de la plateforme.
it: Ordinamento scelto per le voci del campo nella sezione filtri dell'interfaccia di front-office.
nl: Gekozen sortering van de entries van het veld in de filterssectie van de front office.

source: To chose a sorting order for a facetted field:
de: Um eine Sortierreihenfolge für ein Feld mit Facets auszuwählen:
es: Para seleccionar un criterio de ordenación para un campo de facetas:
fr: Pour choisir un ordre de tri pour un champ avec des facettes :
it: Per selezionare l'ordinamento di un campo facet:
nl: Om een sorteervolgorde voor een gefacetteerd veld te kiezen:

source: Click on the "Sort facet by" list box of the field of your choice.
de: Klicken Sie auf das Listenfeld "Facet sortieren nach" des gewünschten Feldes.
es: Haga clic en el cuadro de lista "Ordenar faceta por" del campo que desee.
fr: Cliquez sur la zone de liste "Trier la facette par" du champ de votre choix.
it: Clicca sulla casella di riepilogo "Ordina facet per" del campo desiderato.
nl: Klik op de keuzelijst "Sorteer facet per" in het veld van uw keuze.

source: Choose a sorting order:
de: Wählen Sie eine Sortierreihenfolge:
es: Elija un criterio de ordenación:
fr: Choisissez un ordre de tri :
it: Seleziona un ordinamento:
nl: Kies een sorteervolgorde:

source: Item counting (descending): entries are ordered from the one with the less records to the one with the most
de: Elementzählung (absteigend): Felder werden von demjenigen mit den wenigsten Einträgen zu dem mit den meisten Einträgen geordnet
es: Número de elementos (descendente): Entradas ordenadas de aquella con menos registros a aquella con más
it: Numero voce (decrescente): le voci vengono ordinate da quella con meno record a quella con più record
nl: Tellen van items (in dalende volgorde): entries worden gerangschikt in volgorde van diegene met het minst aantal rechts tot diegene met het meest aantal records
