Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/defining_a_dataset_schema.po
Languages: de, es, fr, it, nl

source: Defining a dataset schema
de: Ein Datensatz-Schema definieren
es: Definir un esquema de conjunto de datos
fr: Définir un modèle de données
it: Definizione dello schema di un dataset
nl: Een datasetschema definiëren

source: Each dataset follows a schema. Fully defining and configuring a dataset schema means:
de: Jeder Datensatz folgt einem Schema. Das vollständige Festlegen und Konfigurieren eines Datensatz-Schemas bedeutet:
es: Cada uno de los conjuntos de datos sigue un esquema. Definir y configurar por completo un esquema de conjunto de datos significa:
fr: Chaque jeu de données respecte un modèle. La définition et la configuration totales d'un modèle de données signifie :
it: Ogni dataset segue uno schema. Definire e configurare completamente lo schema di un dataset significa:
nl: Elke dataset volgt een bepaald schema. Het volledig definiëren en configureren van een datasetschema betekent:

source: :ref:`Changing a dataset field label<changinglabel>` (1)
de: :ref:`Das Ändern der Beschriftung eines Datensatz-Feldes<changinglabel>` (1)
es: :ref:`Cambiar una etiqueta de campo de conjunto de datos<changinglabel>` (1)
fr: :ref:`Modifier un label de champ de jeu de données<changinglabel>` (1)
it: :ref:`modificare l'etichetta del campo di un dataset<changinglabel>` (1);
nl: :ref:`Het label van een veld in een dataset wijzigen<changinglabel>` (1)

source: :ref:`Adding a description<addingdescription>` to a dataset field (2)
de: :ref:`Einem Datensatz-Feld<addingdescription>` eine Beschreibung hinzufügen (2)
es: :ref:`Añadir una descripción<addingdescription>` a un campo de conjunto de datos (2)
fr: :ref:`Ajouter une description<addingdescription>` à un champ de jeu de données (2)
it: :ref:`aggiungere una descrizione<addingdescription>` al campo di un dataset (2);
nl: :ref:`Een beschrijving<addingdescription>` aan een veld in een dataset toevoegen (2)

source: :ref:`Choosing a type<choosingtype>` for each field (3)
de: :ref:`Einen Typ<choosingtype>` für jedes Feld auswählen (3)
es: :ref:`Elegir un tipo<choosingtype>` para cada campo (3)
fr: :ref:`Choisir un type<choosingtype>` pour chaque champ (3)
it: :ref:`scegliere il tipo<choosingtype>` per ogni campo (3);
nl: :ref:`Een type<choosingtype>` voor elk veld kiezen (3)

source: :ref:`Setting up relevant fields as facets<settingfacets>` to define filters for the dataset (4)
de: :ref:`Relevante Felder als Facets einrichten,<settingfacets>` um Filter für den Datensatz zu bestimmen (4)
es: :ref:`Configurar los campos pertinentes como facetas<settingfacets>` para definir los filtros del conjunto de datos (4)
fr: :ref:`Paramétrer les champs appropriés en tant que facettes <settingfacets>` pour définir des filtres associés au jeu de données (4)
it: :ref:`configurare i campi appropriati come facet<settingfacets>` per definire i filtri del dataset (4);
nl: :ref:`Relevante velden instellen als facetten<settingfacets>` om filters voor de dataset te definiëren (4)

source: :ref:`Configuring options<configuringoptions>` for each field, depending on their type and whether they are set up as facets or not (5)
de: :ref:`Optionen<configuringoptions>` für jedes Feld konfigurieren, abhängig vom Typ und davon, ob sie als Facets eingerichtet sind (5)
es: :ref:`Configurar las opciones<configuringoptions>` para cada uno de los campos, en función de su tipo y de si están configurados como facetas o no (5)
fr: :ref:`Configurer les options<configuringoptions>` de chaque champ en fonction de son type et de son paramétrage en facette ou non (5)
it: :ref:`configurare le opzioni<configuringoptions>` per ogni campo, a seconda del tipo e del fatto che sia o meno configurato come facet (5);
nl: :ref:`Opties voor elk veld<configuringoptions>` configureren, afhankelijk van het type en of deze al dan niet ingesteld zijn als facetten (5)

source: :ref:`Ordering the fields<orderingfields>` in the dataset (6)
de: :ref:`Die Felder<orderingfields>` im Datensatz ordnen (6)
es: :ref:`Ordenar los campos<orderingfields>` del conjunto de datos (6)
fr: :ref:`Trier les champs<orderingfields>` dans le jeu de données (6)
it: :ref:`ordinare i campi<orderingfields>` nel dataset (6);
nl: :ref:`De velden <orderingfields>` in de dataset rangschikken (6)

source: :ref:`Discarding fields<discardingfields>` from the dataset (7)
de: :ref:`Felder aus dem Datensatz<discardingfields>` entfernen (7)
es: :ref:`Descartar campos<discardingfields>` del conjunto de datos (7)
fr: :ref:`Supprimer des champs <discardingfields>` du jeu de données (7)
it: :ref:`eliminare i campi<discardingfields>` dal dataset (7).
nl: :ref:`Velden<discardingfields>` uit de dataset verwijderen (7)

source: Changing a label
de: Eine Beschriftung ändern
es: Cambiar una etiqueta
fr: Modifier un label
it: Modifica di un'etichetta
nl: Een label wijzigen

source: The Opendatasoft platform retrieves the default field labels found in the source dataset. It is however possible to change each dataset field label.
de: Die Opendatasoft-Plattform ruft die Standardfeldbeschriftungen aus dem Quelldatensatz ab. Es ist jedoch möglich, jede Beschriftung eines Datensatz-Feldes zu ändern.
es: La plataforma Opendatasoft recupera las etiquetas de campo predeterminadas que se encuentran en el conjunto de datos de origen. Sin embargo, todas las etiquetas de campo del conjunto de datos se pueden cambiar.
nl: Het Opendatasoft-platform haalt de standaard veldlabels op die teruggevonden zijn in de source dataset. Het is evenwel mogelijk om elk label van een veld in een dataset te wijzigen.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: We highly recommend to choose well-written, explicit labels. Also keep in mind that since these labels will be displayed in the front office for all portal users, it might be preferable to choose simple labels instead of business-specific terms, to make sure that the data can be understood by a wider audience.
de: Wir empfehlen, gut geschriebene, explizite Beschriftungen zu verwenden. Beachten Sie außerdem, dass diese Beschriftungen allen Portalbenutzern im Front-Office angezeigt werden. Deshalb sollten Sie möglicherweise anstelle von geschäftsspezifischen Begriffen einfache Beschriftungen auswählen, um sicherzustellen, dass die Daten von einer großen Zielgruppe verstanden werden.
es: Recomendamos vivamente elegir etiquetas explícitas y descriptivas. Además, puesto que se visualizarán en el front office de todos los usuarios del portal, es preferible elegir etiquetas sencillas antes que términos de negocio específicos a fin de que los datos sean comprensibles para un público más amplio.
it: È consigliabile utilizzare etichette esplicite e ben scritte. Poiché, infatti, verranno visualizzate nell'interfaccia di front-office per tutti gli utenti del portale, è preferibile che siano semplici, senza l'utilizzo di termini troppo settoriali. In questo modo i dati potranno essere compresi da un pubblico più ampio.
nl: We raden ten stelligste aan om duidelijk geformuleerde, expliciete labels te kiezen. Denk er ook aan dat deze labels weergegeven zullen worden in de front office voor alle gebruikers van het portaal. Het verdient dus misschien de voorkeur om eenvoudige labels te gebruiken in plaats van bedrijfsspecifieke termen om ervoor te zorgen dat de data begrepen kunnen worden door een breder publiek.

source: To change a label:
de: Um eine Beschriftung zu ändern:
es: Para cambiar una etiqueta:
fr: Pour modifier un label :
it: Per modificare un'etichetta:
nl: Om een label te wijzigen:

source: In the preview area of the Processing tab, select the current label of the field of your choice.
de: Wählen Sie im Vorschaubereich der Registerkarte "Verarbeitung" die aktuelle Beschriftung des gewünschten Feldes aus.
es: En el área de vista previa de la ficha Procesadores, seleccione la etiqueta actual del campo que desee.
fr: Dans la zone d'aperçu de l'onglet Traitement, sélectionnez le label actuel du champ de votre choix.
it: Nell'area dell'anteprima della scheda Elaborazione, seleziona l'etichetta del campo desiderato.
nl: Selecteer in de voorbeeldweergave in het tabblad Verwerken het huidige label van het veld van uw keuze.

source: Type a new label. It can contain special characters.
de: Geben Sie eine neue Beschriftung ein. Diese kann Sonderzeichen enthalten.
es: Escriba una etiqueta nueva. Puede contener caracteres especiales.
fr: Saisissez un nouveau label. Les caractères spéciaux sont autorisés.
it: Digita una nuova etichetta, che può anche contenere caratteri speciali.
nl: Voer een nieuw label in. Dit kan speciale karakters bevatten.

source: Click outside the label area or press Enter for the changes to be taken into account.
de: Klicken Sie außerhalb des Bereiches für die Beschriftung oder drücken Sie die Eingabe-Taste, um die Änderungen zu übernehmen.
es: Haga clic fuera del área de la etiqueta o pulse Entrar para que se tengan en cuenta los cambios.
fr: Cliquez à l'extérieur de la zone du label ou appuyez sur Entrée pour que les modifications soient prises en compte.
it: Clicca all'esterno dell'area delle etichette o premi Invio per confermare le modifiche.
nl: Klik buiten het label of druk op Enter om de wijzigingen te registreren.

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: Changing the label of a field does not modify in any way the technical identifier of that field, which can be found in the Configuration menu of the dataset.
de: Das Ändern der Beschriftung eines Felds ändert in keiner Weise die technische Kennung dieses Felds. Diese ist im Konfigurationsmenü des Datensatzes zu finden.
es: Al cambiar la etiqueta de un campo no se modifica en modo alguno el identificador técnico de ese campo, que se puede encontrar en el menú Configuración del conjunto de datos.
fr: La modification du label d'un champ ne modifie en aucune façon son identifiant technique qui se trouve dans le menu Configuration du jeu de données.
it: Modificando l'etichetta di un campo non si apporta alcun cambiamento al relativo identificatore tecnico, che si trova nel menu Configurazione del dataset.
nl: Wanneer u het label van een veld wijzigt, wordt er niets gewijzigd aan de technische identifier van dat veld, die kan worden teruggevonden in het configuratiemenu van de dataset.

source: Adding a description to a field
de: Einem Feld eine Beschreibung hinzufügen
es: Añadir una descripción a un campo
fr: Ajouter une description à un champ
it: Aggiunta di una descrizione a un campo
nl: Een beschrijving aan een veld toevoegen

source: Descriptions can be added to dataset fields for more context or precision.
de: Für mehr Kontext oder Genauigkeit können Datensatz-Feldern Beschreibungen hinzugefügt werden.
es: Se pueden añadir descripciones a los campos del conjunto de datos para proporcionar más contexto o precisión.
fr: Des descriptions peuvent être ajoutées aux champs d'un jeu de données pour apporter davantage de contexte ou de précision.
it: Per chiarire il contesto o migliorare la precisione, è possibile aggiungere le descrizioni ai campi del dataset.
nl: Er kunnen beschrijvingen aan velden in een dataset worden toegevoegd om zo meer context of meer verduidelijking te verschaffen.

source: To add a description to a field:
de: Um einem Feld eine Beschreibung hinzuzufügen:
es: Para añadir una descripción a un campo:
fr: Pour ajouter une description à un champ :
it: Per aggiungere una descrizione a un campo:
nl: Om een beschrijving aan een veld toe te voegen:

source: In the preview area of the Processing tab, click in the Description text box of the field of your choice.
de: Klicken Sie im Vorschaubereich der Registerkarte "Verarbeitung" auf das Textfeld für die Beschreibung des Feldes Ihrer Wahl.
es: En el área de vista previa de la ficha Procesadores, haga clic en el cuadro de texto Descripción del campo que desee.
fr: Dans la zone d'aperçu de l'onglet Traitement, cliquez dans le champ de texte Description du champ de votre choix.
it: Nell'area dell'anteprima della scheda Elaborazione, clicca sulla casella di testo Descrizione del campo desiderato.
nl: Klik in de voorbeeldweergave van het tabblad Verwerken op het tekstvak Beschrijving van het veld van uw keuze.

source: Type the related description.
de: Geben Sie die Beschreibung ein.
es: Escriba la descripción correspondiente.
fr: Saisissez la description associée.
it: Digita la relativa descrizione.
nl: Voer de aanverwante beschrijving in.

source: Click outside the Description text box for the description to be taken into account.
de: Klicken Sie außerhalb des Textfeldes für die Beschreibung, um diese zu übernehmen.
es: Haga clic fuera del cuadro de texto Descripción para que se tenga en cuenta la descripción.
fr: Cliquez à l'extérieur du champ de texte Description pour que la description soit prise en compte.
it: Clicca all'esterno della casella di testo Descrizione per confermare.
nl: Klik buiten het tekstvak Beschrijving om de beschrijving te registreren.

source: Field descriptions will then be displayed in the front office:
de: Die Feldbeschreibungen werden dann im Front-Office angezeigt:
es: Las descripciones de los campos se visualizarán en el front office:
fr: Les descriptions de champ seront ensuite affichées dans la plateforme :
it: Le descrizioni dei campi vengono poi visualizzate nell'interfaccia di front-office:
nl: Beschrijvingen van velden zullen vervolgens worden weergegeven in de front office:

source: in the Data schema section of the Information tab of the dataset
de: im Datenschema-Bereich der Registerkarte "Informationen" des Datensatzes
es: En la sección Esquema de datos de la ficha Información del conjunto de datos
fr: dans la section Schéma de données de l'onglet Informations du jeu de données,
it: nella sezione Schema di dati della scheda Informazioni del dataset;
nl: in de rubriek Dataschema van het tabblad Informatie van de dataset

source: in the tooltip of their related fields, in the Table tab
de: in der QuickInfo der entsprechenden Felder in der Registerkarte "Tabelle"
es: En la ayuda de herramienta de los campos correspondientes, dentro de la ficha de tabla
fr: dans l'infobulle de leurs champs associés, dans l'onglet Tableau.
it: nel tooltip dei relativi campi, nella scheda Tabella.
nl: in de tooltip van de aanverwante velden, in het tabblad Tabel

source: Choosing a field type
de: Eine Feldtyp auswählen
es: Elegir un tipo de campo
fr: Choisir un type de champ
it: Scelta del tipo di campo
nl: Een type veld kiezen

source: Fields are characterized by types. Depending on the chosen field type, the platform will process and display records in a specific way.
de: Felder sind durch Typen gekennzeichnet. Abhängig vom gewählten Feldtyp verarbeitet und zeigt die Plattform Datensätze in einer bestimmten Weise an.
es: Los campos se caracterizan por tipos. Según el tipo de campo elegido, la plataforma procesará y visualizará los registros de un modo concreto.
fr: Les champs sont caractérisés par des types. En fonction du type de champ choisi, la plateforme traitera et affichera les enregistrements d'une façon spécifique.
it: I campi si distinguono in diverse tipologie. A seconda del tipo di campo scelto, la piattaforma elabora e visualizza i record in modo specifico.
nl: Velden worden gekenmerkt door types. Afhankelijk van het gekozen veldtype, zal het platform records op een specifieke manier verwerken en weergeven.

source: To choose a type for a field:
de: Um ein Typ für ein Feld auszuwählen:
es: Para elegir un tipo para un campo:
fr: Pour choisir un type pour un champ :
it: Per scegliere la tipologia di un campo:
nl: Om een type voor een veld te kiezen:

source: In the preview area of the Processing tab, click on the field type list box of the field of your choice.
de: Klicken Sie im Vorschaubereich der Registerkarte "Verarbeitung" auf das Feldtyp-Listenfeld des gewünschten Feldes.
es: En el área de vista previa de la ficha Procesadores, haga clic en el cuadro de lista de tipos de campo del campo que desee.
fr: Dans la zone d'aperçu de l'onglet Traitement, cliquez dans la zone de liste de type de champ pour le champ de votre choix.
it: Nell'area dell'anteprima della scheda Elaborazione, clicca sulla casella di riepilogo del tipo di campo relativa al campo desiderato.
nl: Kiik in de voorbeeldweergave van het tabblad Verwerken op de keuzelijst met veldtypes van het veld van uw keuze.

source: Choose the right type for this field.
de: Wählen Sie den richtigen Typ für dieses Feld.
es: Elija el tipo apropiado para este campo.
fr: Choisissez le type approprié pour ce champ.
it: Scegli la tipologia appropriata per il campo.
nl: Kies het juiste type voor dit veld.

source: There are 8 different types: date, datetime, decimal, integer, geopoint, geoshape, text and file.
de: Es gibt 8 unterschiedliche Typen: Datum, DateTime, Dezimal, Integer, Geopunkt, Geoshape, Text und Datei.
es: Hay 8 tipos: Fecha, Fecha y hora, Decimal, Entero, Punto geográfico, Forma geográfica, Texto y Archivo.
it: Sono disponibili 8 diversi tipi di campo: data, data/ora, decimale, intero, punto geografico, forma geografica, testo e file.
nl: Er zijn 8 verschillende types: datum, datum/tijd, decimaal, geheel getal, geopoint, geoshape, tekst en bestand.

source: Type
de: Typ
es: Tipo
it: Tipo

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Date
de: Datum
es: Fecha
it: Data
nl: Datum

source: Field values are dates. The ideal format is the ISO 8601 format, which is ``YYYY-mm-dd``. Other formats are also understood by the platform, such as: ``YYYY/mm/dd`` or ``dd/mm/YYYY``.
de: Feldwerte sind Daten. Das ideale Format ist das ISO 8601-Format ("JJJJ-MM-TT"). Die Plattform versteht jedoch auch andere Formate, wie: "JJJJ/mm/tt" oder "tt/mm/JJJJ".
es: Los valores de campo son fechas. El formato ideal es ISO 8601, que es ``AAAA-mm-dd``. La plataforma también entiende otros formatos, como: ``AAAA/mm/dd`` o ``dd/mm/AAAA``.
it: I valori dei campi sono rappresentati da date. Il formato ideale è ISO 8601, cioè "AAAA-mm-gg". È tuttavia possibile utilizzare anche altri formati, come: "AAAA/mm/gg" o "gg/mm/AAAA".
nl: De veldwaarden zijn datums. Het ideale formaat is het ISO 8601-formaat, zijnde ``YYYY-mm-dd``. Er worden ook andere formaten begrepen door het platform, zoals ``YYYY/mm/dd`` of ``dd/mm/YYYY``.

source: The platform will try to guess as accurately as possible the input date format. However, in case of bad detection or ambiguity, use the :doc:`Normalize Date processor<processors/normalize_date>` to define the parsing format of the date field.
de: Die Plattform versucht, das Eingabedatumsformat so genau wie möglich zu erkennen. Verwenden Sie im Falle einer schlechten Erkennung oder Mehrdeutigkeit den Prozessor :doc:`Datum normalisieren<processors/normalize_date>`, um das Format des Datumsfeldes zu bestimmen.
es: La plataforma intentará averiguar con la mayor exactitud posible el formato de la fecha de entrada. Sin embargo, en caso de detección incorrecta o ambigüedad, utilice el :doc:`procesador Normalizar fecha<processors/normalize_date>` para definir el formato de análisis del campo de fecha.
fr: La plateforme va tenter de détecter le format de la date aussi précisément que possible. Cependant, si jamais la détection est fausse ou ambigüe, utilisez le :doc:`processeur Normaliser une Date<processors/normalize_date>` qui vous permet de définir le format à utiliser pour interpréter les valeurs du champ de date.
it: La piattaforma cerca di interpretare nel modo più accurato possibile il formato della data di input. In caso di ambiguità o di errore, utilizza il :doc:`processore Normalizza la data<processors/normalize_date>` per definire il formato di analisi del campo di data.
nl: Het platform zal proberen het formaat van de inputdata zo nauwkeurig mogelijk te raden. In geval het verkeerde formaat wordt gedetecteerd of in geval van dubbelzinnigheid, gebruik dan het document :doc:`Normalize Date processor<processors/normalize_date>` om het parsing-formaat van het datumveld te definiëren.

source: Field values are a combination of a date and a time. The ideal format is the ISO 8601 format, which is ``YYYY-mm-ddTHH:MM:ss+00:00``, ``YYYY-mm-ddTHH:MM:ssZ`` or ``YYYYmmddTHHMMssZ``. Other formats are also understood by the platform, such as: ``YYYY-mm-dd-HH:MM:ss`` or or ``YYYY-mm-dd HH:MM:ss``.
de: Feldwerte sind eine Kombination aus Datum und Uhrzeit. Das ideale Format ist das ISO 8601-Format, d. h.: "JJJJ-mm-ttTHH:MM:ss+00:00", "JJJJ-mm-ttTHH:MM:ssZ" oder "JJJJmmttTHHMMssZ". Die Plattform versteht jedoch auch andere Formate, wie: "JJJJ-mm-tt-HH:MM:ss" oder "JJJJ-mm-tt HH:MM:ss".
es: Los valores de campo son una combinación de fecha y hora. El formato ideal es ISO 8601, que es ``AAAA-mm-ddTHH:MM:ss+00:00``, ``AAAA-mm-ddTHH:MM:ssZ`` o ``AAAAmmddTHHMMssZ``. La plataforma también entiende otros formatos, como: ``AAAA-mm-dd-HH:MM:ss`` o ``AAAA-mm-dd HH:MM:ss``.
it: I valori dei campi sono una combinazione di data e di ora. Il formato ideale è ISO 8601, cioè "AAAA-mm-ggTHH:MM:ss+00:00", "AAAA-mm-ggTHH:MM:ssZ" o "AAAAmmggTHHMMssZ". La piattaforma è comunque in grado di comprendere anche altri formati, come: "AAAA-mm-gg-HH:MM:ss" o "AAAA-mm-gg HH:MM:ss".
nl: Veldwaarden zijn een combinatie van een datum en een tijdstip. Het ideale formaat is het ISO 8601-formaat, zijnde ``YYYY-mm-ddTHH:MM:ss+00:00``, ``YYYY-mm-ddTHH:MM:ssZ`` of ``YYYYmmddTHHMMssZ``. Er worden ook andere formaten door het platform begrepen, zoals ``YYYY-mm-dd-HH:MM:ss`` of ``YYYY-mm-dd HH:MM:ss``.

source: The platform will try to guess as accurately as possible the input datetime format. However, in case of bad detection or ambiguity, use the :doc:`Normalize Date processor<processors/normalize_date>` to define the parsing format of the datetime field.
de: Die Plattform versucht, das eingegebene DateTime-Format so genau wie möglich zu erkennen. Verwenden Sie im Falle einer schlechten Erkennung oder Mehrdeutigkeit den Prozessor :doc:`Datum normalisieren<processors/normalize_date>`, um das Format des Datetime-Feldes zu bestimmen.
es: La plataforma intentará averiguar con la mayor exactitud posible el formato de la fecha y hora de entrada. Sin embargo, en caso de detección incorrecta o ambigüedad, utilice el :doc:`procesador Normalizar fecha<processors/normalize_date>` para definir el formato de análisis del campo de fecha y hora.
fr: La plateforme va tenter de détecter le format datetime aussi précisément que possible. Cependant, si jamais la détection est fausse ou ambigüe, utilisez le :doc:`processeur Normaliser une Date<processors/normalize_date>` qui vous permet de définir le format à utiliser pour interpréter les valeurs du champ datetime.
it: La piattaforma cerca di interpretare nel modo più accurato possibile il formato della data/ora di input. In caso di ambiguità o di errore, utilizza il :doc:`processore Normalizza la data<processors/normalize_date>` per definire il formato di analisi del campo di data/ora.
nl: Het platform zal proberen het ingevoerde datum/tijd-formaat zo nauwkeurig mogelijk te raden. In geval het verkeerde formaat wordt gedetecteerd of in geval van dubbelzinnigheid, gebruik dan het document :doc:`Normalize Date processor<processors/normalize_date>` om het parsing-formaat van het datum/tijd-veld te definiëren.
