Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/odata/excel_integration.po
Languages: de, es, it, nl

source: Microsoft Excel integration
es: Integración de Microsoft Excel
it: Integrazione con Microsoft Excel
nl: Integratie van Microsoft Excel

source: The OpenDataSoft OData service makes it possible to gather data directly from Microsoft Excel, without any programming knowledge. There are 3 ways to proceed: first, for Microsoft Excel 2013, the OData native integration can be used. For Excel 2010 and Excel 2013, PowerPivot and PowerQuery extensions can be used. This article will give a detailed explanation on how to do it.
de: Mit dem OpenDataSoft-OData-Service können Daten direkt und ohne Programmierkenntnisse aus Microsoft Excel erfasst werden. Es gibt drei Vorgehensweisen: Für Microsoft Excel 2013 kann die OData native Integration genutzt werden. Für Excel 2010 und Excel 2013 können die Erweiterungen Power Pilot und PowerQuery genutzt werden. Dieser Artikel erklärt Ihnen genau, was hierfür zu tun ist.
es: El servicio OData de OpenDataSoft permite recopilar datos directamente de Microsoft Excel, sin necesidad de tener conocimientos de programación. Hay 3 formas de hacerlo: en primer lugar, para Microsoft Excel 2013, se puede emplear la integración nativa en OData. Para Excel 2010 y Excel 2013, se pueden utilizar las extensiones de PowerPivot y PowerQuery. Este artículo describirá detalladamente el procedimiento para llevarlo a cabo.
it: Il servizio OpenDataSoft OData permette di recuperare dati direttamente da Microsoft Excel, anche senza avere esperienza nella programmazione. Hai a disposizione 3 opzioni: puoi utilizzare l'integrazione nativa OData disponibile per Microsoft Excel 2013, oppure scegliere le estensioni PowerPivot e PowerQuery, compatibili sia con Excel 2010 che Excel 2013. In questo articolo troverai una descrizione dettagliata su come procedere.
nl: De OpenDataSoft OData-service maakt het mogelijk om zonder kennis van programmeren rechtstreeks data te halen uit Microsoft Excel. Er zijn 3 manieren om te werk te gaan: allereerst kan voor Microsoft Excel 2013 de oorspronkelijke OData-integratie worden gebruikt. Voor Excel 2010 en Excel 2013 kunnen PowerPivot- en PowerQuery-extensies worden gebruikt. In dit artikel wordt een gedetailleerde uitleg gegeven hoe u dit kan doen.

source: Native Integration
es: Integración nativa
it: Integrazione nativa
nl: Oorspronkelijke integratie

source: Here are the steps that will allow you to import data through the Excel native OData integration.
de: Dies sind die Schritte, mit denen Sie Daten anhand der Excel-nativen OData-Integration importieren können.
es: Estos son los pasos para importar datos a través de la integración nativa de Excel en OData.
it: Per importare i dati mediante l'integrazione nativa di OData con Excel, procedi come indicato di seguito.
nl: Hierna volgen de stappen die u zullen toelaten data te importeren via de oorspronkelijke OData-integratie van Excel.

source: Data sources supported natively by Microsoft Excel.
de: Datenquellen, die nativ von Microsoft Excel unterstützt werden.
es: Orígenes de datos permitidos de forma nativa por Microsoft Excel.
it: Origini dati supportate nativamente da Microsoft Excel
nl: Databronnen die oorspronkelijk door Microsoft Excel worden ondersteund.

source: To import data from OpenDataSoft OData service, open Microsoft Excel and click the "DATA" tab. Once done, click "From Other Source". This should let you see the list of supported data sources. Select "From OData Feed".
de: Zum Importieren von Daten aus dem OpenDataSoft-OData-Service Microsoft Excel öffnen und auf die Registerkarte "DATEN" klicken. Dann auf "Aus anderer Quelle" klicken. Nun wird Ihnen eine Liste der unterstützten Datenquellen angezeigt. Wählen Sie "Aus OData-Feed".
es: Para importar datos del servicio OData de OpenDataSoft, abra Microsoft Excel y haga clic en la ficha "DATOS". Acto seguido, haga clic en "Desde otras fuentes". Debería ver la lista de orígenes de datos permitidos. Seleccione "De la fuente de datos OData".
it: Per importare i dati dal servizio OData di OpenDataSoft, apri Microsoft Excel e clicca sulla scheda "DATI", quindi su "Da altre origini". Verrà visualizzato l'elenco delle origini dati supportate. Seleziona "Da feed di dati OData".
nl: Om data vanuit de OpenDataSoft OData-service te importeren, dient u Microsoft Excel te openen en te klikken op het tabblad *GEGEVENS*. Klik daarna om "Externe gegevens ophalen". U ziet een lijst met ondersteunde gegevensbronnen. Selecteer "Uit OData Feed".

source: Data feed connection form.
de: Data Feed-Verbindungsformular.
es: Formulario de conexión de fuente de datos.
it: Modulo di connessione con i feed di dati
nl: Data feed inlogformulier.

source: In the address bar of the window that was opened, enter the service address. This address should be "http://platform.url/api/odata". Replace the platform.URL by the actual platform URL.
de: Geben Sie die Service-Adresse in der Adressleiste des Fensters ein, das sich nun geöffnet hat. Diese Adresse muss "http://platform.url/api/odata" lauten. Ersetzen Sie die Plattform-URL durch die aktuelle Plattform-URL.
es: En la barra de dirección de la ventana abierta, especifique la dirección del servicio. Esta dirección debería ser "http://platforma.url/api/odata". Sustituya plataforma.URL por la dirección URL de la plataforma real.
it: Nella barra degli indirizzi della finestra visualizzata, inserisci l'indirizzo del servizio, cioè "http://platform.url/api/odata". Sostituisci "platform.URL" con l'URL effettivo della piattaforma.
nl: Voer in de adresbalk van het venster dat geopend werd het adres van de service in. Dit adres is "http://platform.url/api/odata". Vervang de URL van het platform door de URL van het effectieve platform.

source: Table selection window.
de: Tabellenauswahlfenster.
es: Ventana de selección de tablas.
it: Finestra di selezione della tabella
nl: Venster voor het selecteren van de tabel.

source: Select the table(s) of your choosing by clicking their checkbox.
de: Wählen Sie die gewünschte(n) Tabelle(n) aus, indem Sie die Kästchen anklicken.
es: Seleccione las tablas que desee haciendo clic en la casilla correspondiente.
it: Seleziona la tabella o le tabelle desiderate tramite le relative caselle di spunta.
nl: Selecteer de tabel(len) van uw keuze door de klikken op het aanvinkvakje ervan.

source: A table selected to become a data source.
de: Eine ausgewählte Tabelle wird zur Datenquelle.
es: Una tabla seleccionada para ser un origen de datos.
it: Tabella selezionata per diventare un'origine di dati
nl: Een tabel die geselecteerd worden om een databron te worden.

source: After validation, the "Import Data" window will open. Click "OK".
de: Nach dem Bestätigen öffnet sich das Fenster "Daten importieren". Klicken Sie auf "OK".
es: Tras la validación, se abrirá la ventana "Importar datos". Haga clic en "Aceptar".
it: Dopo la conferma verrà visualizzata la finestra "Importa dati". Clicca su "OK".
nl: Na validatie wordt het venster "Importeer gegevens" geopend. Klik op "OK".

source: The "Import Data" window.
de: Das Fenster "Daten importieren".
es: Ventana "Importar datos".
it: Finestra "Importa dati"
nl: Het venster "Importeer gegevens".

source: Your data are now displayed in the Microsoft Excel cells.
de: Ihre Daten werden nun in den Microsoft Excel Zellen angezeigt.
es: Los datos ahora se visualizan en las celdas de Microsoft Excel.
it: I dati sono ora visualizzati nelle celle di Microsoft Excel.
nl: Uw data worden nu weergeven in Microsoft Excel-cellen.

source: Imported data in Microsoft Excel.
de: Importierte Daten in Microsoft Excel.
es: Datos importados en Microsoft Excel.
it: Dati importati in Microsoft Excel
nl: Ge√Ømporteerde gegevens in Microsoft Excel.

source: Here are the steps that will allow you to import data through PowerPivot for Microsoft Excel.
de: Mit diesen Schritten können Sie Daten anhand von PowerPivot für Microsoft Excel importieren.
es: Estos son los pasos para importar datos a través de PowerPivot for Microsoft Excel.
it: Di seguito è riportata la procedura per importare i dati mediante PowerPivot per Microsoft Excel.
nl: Hierna volgen de stappen die u zullen toelaten data te importeren via PowerPivot voor Microsoft Excel.

source: "Add-Ins" tab in the Microsoft Excel settings window.
de: Registerkarte "Add-Ins" im Microsoft Excel Einstellungsfenster.
es: Ficha "Complementos" en la ventana de configuración de Microsoft Excel.
it: Scheda "Componenti aggiuntivi" della finestra Opzioni di Microsoft Excel.
nl: Tabblad "Add-Ins" in het venster met de instellingen voor Microsoft Excel.

source: Before you can use PowerPivot, you must activate it. To do so, open the "Add-ins" tab in the Microsoft Excel settings window. In the "Manage" drop down menu, select "COM Add-ins" and click "Go...".
de: Bevor PowerPivot verwendet werden kann, muss es zunächst aktiviert werden. Öffnen Sie dazu die Registerkarte "Add-ins" im Microsoft Excel Einstellungsfenster. Im Dropdown-Menü "Verwalten" "COM Add-ins" auswählen und auf "Go..." klicken.
es: Para poder usar PowerPivot, antes debe activarlo. Para ello, abra la ficha "Complementos" en la ventana de configuración de Microsoft Excel. En el menú desplegable "Administrar", seleccione "Complementos COM" y haga clic en "Ir...".
it: Per utilizzare PowerPivot, è necessario prima attivarlo. Apri la scheda "Componenti aggiuntivi" della finestra Opzioni di Microsoft Excel. Nel menu a discesa "Gestisci", seleziona "Componenti aggiuntivi COM" e clicca su "Vai...".
nl: Alvorens u PowerPivot kan gebruiken, moet u dit eerst activeren. Open hiervoor het tabblad "Add-Ins" in het venster met de instellingen voor Microsoft Excel. In het dropdownmenu "Beheren", selecteer "COM Add-Ins" en klik op "Ga ...".

source: The COM add ins selection window.
de: Das COM Add-ins Auswahlfenster.
es: Ventana de selección de complementos COM.
it: Finestra di selezione dei componenti aggiuntivi COM
nl: Het venster voor het selecteren van de COM add ins.

source: In the window that was just opened, select "Microsoft PowerPivot for Excel 2013" or "Microsoft PowerPivot for Excel 2010", whichever applies.
de: In dem nun geöffneten Fenster nach Bedarf "Microsoft PowerPivot für Excel 2013" oder "Microsoft PowerPivot für Excel 2010" auswählen.
es: En la ventana que se acaba de abrir, seleccione "Microsoft PowerPivot para Excel 2013" o "Microsoft PowerPivot para Excel 2010", según corresponda.
it: Nella finestra che si apre, seleziona "Microsoft PowerPivot per Excel 2013" o "Microsoft PowerPivot per Excel 2010", a seconda dei casi.
nl: Selecteer in het venster dat net werd geopend "Microsoft PowerPivot voor Excel 2013" of "Microsof tPowerPivot voor Excel 2010", afhankelijk van wat van toepassing is.

source: PowerPivot menu bar.
de: PowerPivot Menüleiste.
es: Barra de menús de PowerPivot.
it: Barra del menu di PowerPivot
nl: Menubalk van PowerPivot.

source: Back in Microsoft Excel main window click the "POWERPIVOT" tab to display the PowerPivot menu bar. In it, click the "Manage" button. It will open a source management window.
de: Gehen Sie nun zum Microsoft Excel Hauptfenster zurück und klicken auf die Registerkarte "POWERPIVOT"-Tab, um die PowerPivot-Menüleiste anzuzeigen. Klicken Sie darin auf die Schaltfläche "Verwalten". Nun öffnet sich ein Fenster für die Quellenverwaltung.
es: De nuevo en la ventana principal de Microsoft Excel, haga clic en la ficha "POWERPIVOT" para visualizar la barra de menús PowerPivot. En ella, haga clic en el botón "Administrar". Abrirá una ventana de administración de orígenes.
it: Una volta tornato nella finestra principale di Microsoft Excel, clicca prima sulla scheda "POWERPIVOT" per visualizzare la relativa barra del menu e poi su "Gestisci": si aprirà così la finestra di gestione delle origini.
nl: Klik in het hoofdvenster van Microsoft Excel op het tabblad "POWERPIVOT" om de menubalk van PowerPivot weer te geven. Klik op de knop "Beheren". Hierdoor wordt een venster voor het beheer van bronnen geopend.

source: Data sources management window.
de: Datenquellen-Verwaltungsfenster.
es: Ventana de administración de orígenes de datos.
it: Finestra di gestione delle origini dei dati
nl: Venster voor het beheer van databronnen.

source: In this window, click "Get External Data", and in the menu that appears, click "From Data Service". In the second menu that appears, click "From OData Data Feed"
de: Klicken sie in diesem Fenster auf "Externe Daten erhalten" und in dem darauffolgenden Menü auf "Aus Datenservice". Im zweiten darauf erscheinenden Menü klicken Sie auf "Aus OData Data Feed"
es: En esta ventana, haga clic en "Obtener datos externos" y, en el menú que aparece, haga clic en "De servicio de datos". En el segundo menú que aparece, haga clic en "De la fuente de datos OData".
it: All’interno di questa finestra, clicca su "Recupera dati esterni" > "Da servizio dati" > "Da feed di dati OData".
nl: Klik in dit venster op "Externe gegevens ophalen" en klik in het menu dat verschijnt op "Uit Data Service". Klik in het tweede menu dat verschijnt om "Uit OData Data Feed".

source: Data feed connection window.
de: Datenfeed-Verbindungsfenster.
es: Ventana de conexión de fuente de datos.
it: Finestra di collegamento al feed di dati
nl: Venster om verbinding te maken met Data feed.

source: In the import window that was opened, enter the OpenDataSoft OData service in the address bar.
de: Geben Sie in dem sich nun öffnenden Import-Fenster den OpenDataSoft-OData-Service in die Adressleiste ein.
es: En la ventana de importación abierta, especifique el servicio OData de OpenDataSoft en la barra de dirección.
it: Nella finestra di importazione che si apre, inserisci il servizio OpenDataSoft OData nella barra dell'indirizzo.
nl: Voer in het importvenster dat werd geopend de OpenDataSoft OData service in de adresbalk in.

source: In the table selection window, select the dataset(s) of your choosing by clicking their checkbox. Once done, click "Finish".
de: Wählen Sie in dem Tabellenauswahlfenster den gewünschten Datensatz (die Datensätze) durch Anklicken der entsprechenden Kästchen aus. Klicken Sie dann auf "Beenden".
es: En la ventana de selección de tablas, seleccione los conjuntos de datos que desee haciendo clic en la casilla correspondiente. Cuando haya terminado, haga clic en "Finalizar".
it: Nella finestra di scelta della tabella, seleziona i dataset desiderati tramite la relativa casella di spunta. Al termine clicca su "Fine".
nl: Selecteer in het venster voor het selecteren van de tabel de dataset(s) van uw keuze door de klikken op het aanvinkvakje ervan. Eenmaal dit gebeurd is, klik op "Voltooien".

source: Data transfer window.
de: Datenübertragungsfenster.
es: Ventana de transferencia de datos.
it: Finestra di trasferimento dei dati
nl: Datatransfervenster.

source: When the transfer window shows a success indicator, close it with the "Close" button on the bottom right.
de: Schließen Sie das Übertragungsfenster mit der "Schließen"-Schaltfläche unten rechts, sobald es einen Erfolgsindikator anzeigt.
es: Cuando la ventana de transferencia muestre un indicador de ejecucón satisfactoria, ciérrelo con el botón "Cerrar" de la parte inferior derecha.
it: Quando la finestra di trasferimento conferma che l'operazione è stata eseguita correttamente, termina cliccando sul pulsante "Chiudi" in basso a destra.
nl: Wanneer het transfervenster een succesindicator toont, sluit deze met de knop "Afsluiten" onderaan rechts.

source: Data preview.
de: Datenvorschau.
es: Vista previa de datos.
it: Anteprima dei dati
nl: Voorbeeldweergave van de data.

source: You can now verify the integrity of your data om the data source management window.
de: Sie können nun die Integrität Ihrer Daten im Datenquellen-Verwaltungsfenster prüfen.
es: Ahora ya puede verificar la integridad de los datos en la ventana de administración de orígenes de datos.
it: A questo punto puoi verificare l'integrità dei tuoi dati nella finestra di gestione dell'origine dei dati.
nl: U kan nu de integriteit van uw data controleren in het venster voor het beheer van databronnen.

source: The data import list in PowerPivot.
de: Die Datenimportliste in PowerPivot.
es: Lista de importación de datos en PowerPivot.
it: Elenco dell'importazione dati in PowerPivot
nl: De importlijst met data in PowerPivot.

source: In the Microsoft Excel main window, click "PivotTable", and in the popped up list, click "PivotTable".
de: Klicken Sie im Microsoft Excel Hauptfenster auf "PivotTable" und in der Popup-Liste erneut auf "PivotTable".
es: En la ventana principal de Microsoft Excel, haga clic en "PivotTable" y, en la lista emergente, haga clic en "PivotTable".
it: Nella finestra principale di Microsoft Excel, clicca su "Tabella pivot" e, nell'elenco a comparsa che si apre, nuovamente su "Tabella pivot".
nl: Klik in het hoofdvenster van Microsoft Excel op "PivotTable" en in de lijst die verschenen is op "PivotTable".

source: The destination selection window.
de: Das Ziel-Auswahlfenster.
es: Ventana de selección de destino.
it: Finestra di selezione della destinazione
nl: Het venster voor het selecteren van de bestemming.

source: In the destination selection window, select the worksheet of your choosing, and click "OK".
de: Wählen Sie im Ziel-Auswahlfenster das gewünschte Arbeitsblatt und klicken Sie auf "OK".
es: En la ventana de selección de destino, seleccione la hoja de trabajo que desee y haga clic en "Aceptar".
it: Nella finestra di selezione della destinazione, scegli il foglio di lavoro desiderato e clicca su "OK".
nl: Selecteer in het venster voor het selecteren van de bestemming het werkblad van uw keuze en klik op "OK".

source: Data aggregation using PowerPivot.
de: Datenaggregation mit PowerPivot.
es: Agregación de datos mediante PowerPivot.
it: Aggregazione dei dati con PowerPivot
nl: Aggregatie van data met behulp van PowerPivot.

source: Here are the steps that will allow you to import data through Power Query for Microsoft Excel.
de: Mit diesen Schritten können Sie Daten anhand von Power Query for Microsoft Excel importieren.
es: Estos son los pasos para importar datos a través de Power Query para Microsoft Excel.
it: Per importare i dati mediante Power Query per Microsoft Excel, procedi come segue.
nl: Hierna volgen de stappen die u zullen toelaten data te importeren via PowerQuery voor Microsoft Excel.

source: Before you can use Power Query, you must download and activate it. To download it, visit `this link <http://www.microsoft.com/en-us/download/details.aspx?id=39379>`_. The activation process is similar to that of PowerPivot.
de: Bevor Sie Power Query einsetzen können, müssen Sie es herunterladen und aktivieren. Klicken Sie für den Download auf den Link <http://www.microsoft.com/en-us/download/details.aspx?id=39379>`_. Der Aktivierungsvorgang entspricht dem von PowerPivot.
es: Para poder usar Power Query, antes debe descargarlo y activarlo. Para descargarlo, acceda a `este vínculo <http://www.microsoft.com/en-us/download/details.aspx?id=39379>`_. El proceso de activación es parecido al de PowerPivot.
it: Per utilizzare Power Query, è prima necessario scaricarlo e attivarlo. A tale scopo, visita `questa pagina <http://www.microsoft.com/en-us/download/details.aspx?id=39379>`_. La procedura di attivazione è simile a quella prevista per PowerPivot.
nl: Alvorens u PowerQuery kan gebruiken, moet u dit eerste downloaden en activeren. Om te downloaden, ga naar `deze koppeling link <http://www.microsoft.com/en-us/download/details.aspx?id=39379>`_. Het activatieproces is gelijkaardig aan dat van PowerPivot.

source: Data sources supported by Microsoft Power Query.
de: Datenquellen, die von Microsoft Power Query unterstützt werden.
es: Orígenes de datos permitidos por Microsoft Power Query.
it: Origini di dati supportate da Microsoft Power Query
nl: Databronnen die ondersteund worden door Microsoft Power Query.

source: Once done, return to Microsoft Excel main window, click "POWER QUERY" to display its menu bar. In the "POWER QUERY" menu bar, click "From Other Sources". You should see a list with all data sources supported by Microsoft Power Query.
de: Kehren Sie danach zum Microsoft Excel Hauptfenster zurück und klicken Sie auf "POWER QUERY", um dessen Menüleiste anzuzeigen. Klicken Sie in der "POWER QUERY" Menüleiste auf "Aus anderen Quellen". Nun erscheint eine Liste mit sämtlichen Datenquellen, die von Microsoft Power Query unterstützt werden.
es: Cuando haya terminado, vuelva a la ventana principal de Microsoft Excel y haga clic en "POWER QUERY" para visualizar la barra de menús. En la barra de menús de "POWER QUERY", haga clic en "De otras fuentes". Debería ver una lista de todos los orígenes de datos permitidos por Microsoft Power Query.
it: Al termine, torna nella finestra principale di Microsoft Excel e seleziona "POWER QUERY" per visualizzare la relativa barra del menu. Clicca su "Da altre origini" per aprire l'elenco di tutte le origini dati supportate da Microsoft Power Query.
nl: Eenmaal dit gedaan is, keer terug naar het hoofdvenster van Microsoft Excel. Klik op "POWER QUERY" om de menubalk weer te geven. Klik in de menubalk "POWER QUERY" op "Uit andere bronnen". U zou een lijst moeten zien met alle databronnen die ondersteund worden door Microsoft Power Query.

source: OData data source selection window.
de: OData-Datenquellen-Auswahlfenster.
es: Ventana de selección del origen de datos OData.
it: Finestra di selezione dell'origine dati OData
nl: Venster voor het selecteren van OData gegevensbronnen.

source: In this window, enter the OpenDataSoft OData service URL and click "OK".
de: Geben Sie in diesem Fenster die OpenDataSoft-OData-Service-URL ein und klicken Sie auf "OK".
es: En esta ventana, especifique la dirección URL del servicio OData de OpenDataSoft y haga clic en "Aceptar".
it: In questa finestra, inserisci l'URL del servizio OpenDataSoft OData e conferma con "OK".
nl: Voer in dit venster URL van de OpenDataSoft OData service in en klik op "OK".

source: Power Query navigation window.
de: Power Query Navigationsfenster.
es: Ventana de navegación de Power Query.
it: Finestra di navigazione di Power Query
nl: Power Query navigatievenster.

source: Once done, a Power Query navigation window will be displayed on the right hand side of the main window. In it, click the IDs of the table of your choosing.
de: Daraufhin wird ein Power-Query-Navigationsfenster rechts im Hauptfenster angezeigt. Klicken Sie darin die gewünschten IDs an.
es: Cuando haya terminado, se visualizará una ventana de navegación de Power Query en la parte derecha de la ventana principal. En ella, haga clic en los ID de las tablas que desee.
it: Nella parte destra della finestra principale comparirà una finestra di navigazione di Power Query: al suo interno, clicca sull'ID delle tabelle desiderate.
nl: Eenmaal dit gedaan is, wordt een Power Query navigatievenster weergeven aan de rechterzijde van het hoofdvenster. Klik in dit venster op de ID's van de tabel van uw keuze.

source: Imported data through Power Query.
de: Mit Power Query importierte Daten.
es: Datos importados a través de Power Query.
it: Dati importati mediante Power Query
nl: Ge√Ømporteerde data via Power Query.

source: Your data is now displayed in the Microsoft Excel cells.
de: Ihre Daten werden nun in den Microsoft Excel Zellen angezeigt.
es: Los datos ahora se visualizan en las celdas de Microsoft Excel.
it: I dati sono ora visualizzati nelle celle di Microsoft Excel
nl: Uw data worden nu weergegeven in de Microsoft Excel-cellen.
