Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/odata/odata_basics.po
Languages: de, es, it, nl

source: Using the OData API
de: Nutzung der OData-API
es: Utilizar la API de OData
it: Uso dell'API OData
nl: De OData API gebruiken

source: In this article, you will learn how to use the OData API to query data from the OpenDataSoft platform.
de: In diesem Artikel lernen Sie, wie Sie die OData-API nutzen können, um Daten aus der OpenDataSoft-Plattform abzufragen.
es: En este artículo, aprenderá a usar la API de OData para consultar datos de la plataforma OpenDataSoft.
it: Questo articolo descrive come utilizzare l'API OData per eseguire le query di dati dalla piattaforma OpenDataSoft.
nl: In dit artikel leert u hoe u de OData API moet gebruiken om data op te zoeken in het OpenDataSoft-portaal.

source: General points
de: Allgemeine Punkte
es: Puntos generales
it: Aspetti generali
nl: Algemene punten

source: Service address
de: Serviceadresse
es: Dirección de servicio
it: Indirizzo del servizio
nl: Service-adres

source: In this article, we will use the words "service root" or "service document" to refer to the base address of the OData service. For the OpenDataSoft platform, this URL can be found on the ``/api/odata`` path, relative to the platform hostname. Unless stated otherwise, all addresses in the rest of this article are relative to the service root.
de: In diesem Artikel nutzen wir die Bezeichnung "Service Root" bzw. "Service-Dokument", wenn wir auf die Basisadresse des OData-Services Bezug nehmen. Für die OpenDataSoft-Plattform ist diese URL auf dem Pfad ``/api/odata`` zu finden, bezogen auf den Plattform-Hostnamen. Falls nicht anders angegeben, beziehen sich alle Adressen im restlichen vorliegenden Artikel auf den Service Root.
es: En este artículo, utilizaremos los términos "raíz del servicio" o "documento del servicio" para referirnos a la dirección base del servicio OData. Para la plataforma OpenDataSoft, esta dirección URL se puede encontrar en la ruta ``/api/odata`` relativa al nombre de host de la plataforma. Salvo que se indique lo contrario, todas las direcciones restantes de este artículo son relativas a la raíz del servicio.
it: In questo articolo, i termini "radice del servizio" e "documento del servizio" si riferiscono all'indirizzo di base del servizio OData. Per la piattaforma OpenDataSoft, questo URL si trova nel percorso ``/api/odata`` relativo al nome host della piattaforma. A meno che non vi siano indicazioni diverse, nel resto dell'articolo tutti gli indirizzi si riferiscono alla radice del servizio.
nl: In dit artikel gebruiken we de woorden "service root" en "service-document" om te verwijzen naar het basisadres van de OData service. Voor het OpenDataSoft-platform kan deze URL teruggevonden worden op het pad ``/api/odata`` met betrekking tot de naam van de host van het platform. Tenzij anders vermeld, verwijzen alle adressen in de rest van dit artikel naar de service root.

source: HTTP Method
de: HTTP-Methode
es: Método HTTP
it: Metodo HTTP
nl: HTTP-methode

source: The OpenDataSoft OData service currently is read only, hence the only allowed method is GET.
de: Der OpenDataSoft-OData-Service ist momentan schreibgeschützt, folglich ist die einzige erlaubte Methode GET.
es: El servicio OData de OpenDataSoft actualmente es de solo lectura, por lo que el único método permitido es GET.
it: Attualmente, il servizio OpenDataSoft OData è disponibile in sola lettura, quindi l'unico metodo consentito è GET.
nl: De OpenDataSoft OData service is momenteel read-only, vandaar dat de enige toegelaten methode GET is.

source: Versions
de: Versionen
es: Versiones
it: Versioni
nl: Versies

source: The OpenDataSoft platform supports versions 3.0 and 4.0 of the OData protocol. Versions requirements can be communicated to the service via the following six headers:
de: Die OpenDataSoft-Plattform unterstützt die Versionen 3.0 und 4.0 des OData-Protokolls. Versionsanforderungen können dem Service über folgende sechs Überschriften kommuniziert werden:
es: La plataforma OpenDataSoft admite las versiones 3.0 y 4.0 del protocolo OData. Los requisitos de las versiones se pueden comunicar al servicio por medio de los 6 encabezados siguientes:
it: La piattaforma OpenDataSoft supporta le versioni 3.0 e 4.0 del protocollo OData. I requisiti riguardanti le versioni possono essere comunicati al servizio mediante i seguenti sei header:
nl: Het OpenDataSoft-platform ondersteunt de versies 3.0 en 4.0 van het OData-protocol. Vereisten inzake versies kunnen aan de service meegedeeld worden via de volgende zes headers:

source: This header informs the server which version of the protocol is used by the client.
de: Diese Überschrift informiert den Server darüber, welche Protokollversion vom Client genutzt wird.
es: Este encabezado informa al servidor de la versión del protocolo que utiliza el cliente.
it: Questo header comunica al server la versione del protocollo utilizzata dal client.
nl: Deze header informeert de server over welke versie van het protocol door de klant wordt gebruikt.

source: This header specifies which protocol version the service should use.
de: Diese Überschrift gibt an, welche Protokollversion der Service nutzen sollte.
es: Este encabezado especifica la versión del protocolo que debería usar el servicio.
it: Questo header specifica la versione del protocollo utilizzata dal servizio.
nl: Deze header specificeert welke protocolversie de service zou moeten gebruiken.

source: This header specifies the minimum version supported by the client.
de: Diese Überschrift gibt die niedrigste vom Client unterstützte Version an.
es: Este encabezado especifica la versión mínima que admite el cliente.
it: Questo header specifica la versione minima supportata dal client.
nl: Deze header specificeert de minimale versie die ondersteund wordt door de klant.

source: This header specifies the minimum version the service should use.
de: Diese Überschrift gibt die niedrigste Version an, die der Service nutzen sollte.
es: Este encabezado especifica la versión mínima que debería usar el servicio.
it: Questo header riporta la versione minima utilizzata dal servizio.
nl: Deze header specificeert de minimale versie die de service zou moeten gebruiken.

source: This header specifies the maximum version supported by the client.
de: Diese Überschrift gibt die höchste Version an, die der Client unterstützt.
es: Este encabezado especifica la versión máxima que admite el cliente.
it: Questo header specifica la versione massima supportata dal client.
nl: Deze header specificeert de maximale versie die ondersteund wordt door de klant.

source: This header specifies the maximum version the service should use.
de: Diese Überschrift gibt die höchste Version an, die der Service nutzen sollte.
es: Este encabezado especifica la versión máxima que debería usar el servicio.
it: Questo header specifica la versione massima utilizzata dal servizio.
nl: Deze header specificeert de maximale versie die de service zou moeten gebruiken.

source: From the next paragraph on, in order to keep things simple and relevant, all examples will illustrate protocol version 4.0. Keep in mind however that all described features work in both supported version. If version 3.0 use a specific syntax or needs special attention, it shall be described.
de: Um die Dinge einfach und themenbezogen zu halten, werden sämtliche Beispiele ab dem nächsten Abschnitt mit der Protokollversion 4.0 angezeigt. Denken Sie jedoch daran, dass alle beschriebenen Funktionen in beiden unterstützten Versionen funktionieren. Falls die Version 3.0 eine spezifische Syntax verwendet oder besonderer Aufmerksamkeit bedarf, so sollte dies beschrieben werden.
es: Del párrafo siguiente en adelante, por razones de simplificación y pertinencia, todos los ejemplos ilustrarán la versión del protocolo 4.0. No obstante, tenga en cuenta que todas las funciones descritas son válidas en las 2 versiones permitidas. Si la versión 3.0 emplea una sintaxis específica o precisa una atención especial, se indicará.
it: Per ragioni di semplicità e di chiarezza, dal prossimo paragrafo tutti gli esempi saranno riferiti alla versione 4.0 del protocollo. Tutte le funzionalità descritte, tuttavia, funzionano con entrambe le versioni supportate. Qualora la versione 3.0 utilizzi una determinata sintassi o richieda un'attenzione particolare, tale aspetto verrà specificato.
nl: Vanaf de volgende paragraaf, en om de zaken eenvoudig en relevant te houden, illustreren alle voorbeelden de protocolversie 4.0. Hou wel in het achterhoofd dat alle beschreven eigenschappen werken in de beide versies die worden ondersteund. Indien versie 3.0 een specifieke syntax gebruikt of speciale aandacht vereist, zal dit worden omschreven.

source: Metadata
de: Metadaten
es: Metadatos
it: Metadati

source: The metadata document is located on ``/$metadata``. This documents determines the complex types used by the service, then the entity types found on the platform, the entity sets offered, and finally a set of annotation about the entity sets.
de: Das Metadatendokument befindet sich in ``/$metadata``. Dieses Dokument legt die komplexen Typen fest, die der Service nutzt, außerdem die Einheitstypen, die auf der Plattform gefunden werden, die angebotenen Einheitssätze sowie mehrere Anmerkungen zu den Einheitssätzen.
es: El documento de metadatos se halla en ``/$metadata``. Este documento determina los tipos complejos que utiliza el servicio, posteriormente los tipos de entidad que se encuentran en la plataforma, los conjuntos de entidades ofrecidos y, por último, una serie de anotaciones sobre los conjuntos de entidades.
it: Il documento dei metadati si trova in ``/$metadata``. Questo documento determina i tipi complessi utilizzati dal servizio, i tipi di entità presenti sulla piattaforma, i set di entità offerti e, infine, una serie di annotazioni riguardanti i set di entità.
nl: Het metadata-document bevindt zich op ``/$metadata``. Dit document bepaalt de complexe types die gebruikt worden door de service, vervolgens de entiteitstypes die teruggevonden worden op het platform, de aangeboden entiteitreeksen en tot slot een reeks noteringen over de entiteitreeksen.

source: Formats
de: Formate
es: Formatos
it: Formati
nl: Formaten

source: The service supports ATOM and JSON formats. For the JSON formats, the "minimal" and "full" metadata levels are supported. Any request for a metadata level of "none" will be responded to with the "minimal" metadata level, as per the standard.
de: Der Service unterstützt die ATOM- und JSON-Formate. Bei den JSON-Formaten werden die Metadatenebenen "minimal" und "vollständig" unterstützt. Eine Anfrage nach der Metadatenebene "keine" wird standardmäßig mit der Metadatenebene "minimal" beantwortet.
es: El servicio admite los formatos ATOM y JSON. Para los formatos JSON, se permiten los niveles de metadatos "minimal" y "full". Toda solicitud correspondiente con el nivel de metadatos "none" se responderá con el nivel de metadatos "minimal", según el uso estándar.
it: Il servizio supporta i formati ATOM e JSON. Per i formati JSON, sono supportati i livelli di metadati "minimal" e "full". A qualsiasi richiesta di un livello di metadati "none" verrà risposto con il livello "minimal", come previsto dallo standard.
nl: De service ondersteunt ATOM- en JSON-formaten. Voor de JSON-formaten worden de "minimale" en "volledige" metadataniveaus ondersteund. Elke aanvraag voor een metadataniveau van "geen" zal een respons opleveren met het "minimale" metadataniveau, zoals bepaald door de standaard.

source: There are two main ways of requesting a specific format: in the ``Accept`` header and in the ``$format`` REST parameter.
de: Es gibt zwei Hauptmethoden zum Anfragen eines bestimmten Formats: in der Überschrift "Akzeptieren" und in dem REST Parameter ``$format``.
es: Existen principalmente 2 formas de solicitar un formato específico: en el encabezado ``Accept`` y en el parámetro REST ``$format``.
it: Vi sono principalmente due modi per richiedere un formato specifico: nell'header ``Accept`` e nel parametro REST ``$format``.
nl: Er zijn twee belangrijke manieren om een specifiek formaat in de header "Aanvaard" en in de REST-parameter ``$format`` aan te vragen.

source: The format parameter, be it in the headers or in the query string, can be either the abbreviations JSON, XML or ATOM, or the exact MIME type requested. For the JSON format, different metadata levels can be requested by using the full MIME type followed by ``;odata.metadata=<LEVEL>`` for protocol version 4.0 and ``;odata=<LEVEL>metadata`` for protocol version 3.0.
de: Der Formatparameter in den Überschriften oder in der Anfragezeichenfolge kann entweder aus den Abkürzungen JSON, XML oder ATOM bestehen, oder der genaue angefragte MIME-Typ sein. Für das JSON-Format können verschiedene Metadatenebenen angefordert werden, indem Sie den vollständigen MIME-Typ verwenden, gefolgt von ``;odata.metadata=<LEVEL>`` für die Protokollversion 4.0 und ``;odata=<LEVEL>metadata`` für die Protokollversion 3.0.
es: El parámetro de formato, ya sea en los encabezados ya sea en la cadena de consulta, puede ser o bien las abreviaciones JSON, XML o ATOM, o bien el tipo MIME exacto solicitado. Para el formato JSON, se pueden solicitar diferentes niveles de metadatos utilizando el tipo MIME completo seguido de ``;odata.metadata=<NIVEL>`` para la versión del protocolo 4.0 y ``;odata=<NIVEL>metadata`` para la versión del protocolo 3.0.
it: Tanto negli header quanto nella stringa di query, il parametro del formato può essere costituito dalle abbreviazioni JSON, XML o ATOM, oppure dall'esatto tipo MIME richiesto. Per il formato JSON, è possibile richiedere livelli di metadati diversi utilizzando il tipo MIME completo, seguito da ``;odata.metadata=<LEVEL>`` nella versione 4.0 del protocollo e da ``;odata=<LEVEL>metadata`` nella versione 3.0.
nl: De formaatparameter, zij het in de headers of in de opzoekstring, kan ofwel de afkortingen JSON, XML of ATOM zijn of het precieze MIME-type dat werd aangevraagd. Voor het JSON-formaat, kunnen verschillende metadataniveaus worden aangevraagd door gebruik te maken van het volledige MIME-type, gevolgd door ``;odata.metadata=<LEVEL>`` voor protocolversie 4.0 en ``;odata=<LEVEL>metadata`` voor protocolversie 3.0.

source: To keep things simple, the rest of this article will feature examples with the JSON format, which is the default, but keep in mind that everything will work the same in the ATOM format.
de: Um die Dinge einfach darzustellen, werden im restlichen Artikel Beispiele mit dem standardmäßigen JSON-Format aufgeführt. Denken Sie jedoch daran, dass alles genauso mit dem ATOM-Format funktioniert.
es: Por razones de simplificación, en el resto de este artículo se mostrarán ejemplos con el formato JSON, que es el predeterminado; no obstante, tenga presente que todo funcionará igual en el formato ATOM.
it: Per ragioni di semplicità, il resto di questo articolo conterrà esempi riferiti al formato JSON (che è quello predefinito), ma perfettamente validi anche per il formato ATOM.
nl: Om de zaken eenvoudig te houden, zullen in de rest van dit artikel enkel voorbeelden met het JSON-formaat, dat de standaard is, worden gebruikt, maar denk eraan dat alles op dezelfde manier werkt in het ATOM-formaat.

source: Catalog
de: Katalog
es: Catálogo
it: Catalogo
nl: Catalogus

source: The service root document displays the catalog of all datasets available through the service.
de: Das Service Root-Dokument zeigt den Katalog aller über den Service verfügbaren Datensätze an.
es: El documento raíz de servicio visualiza el catálogo de todos los conjuntos de datos disponibles en el servicio.
it: Il documento radice del servizio visualizza il catalogo di tutti i dataset disponibili con il servizio.
nl: In het service root-document staat de catalogus van alle datasets die beschikbaar zijn voor de volledige service.

source: Datasets
de: Datensätze
es: Conjuntos de datos
it: Dataset

source: The records of a dataset can be browsed on the ``/<DATASET ID>`` page. It is easy to navigate from the service root document to a dataset by following the URL attribute of the catalog items.
de: Die Einträge eines Datensatzes können auf der Seite ``/<DATASET ID>`` gebrowst werden. Wenn Sie dem URL-Attribut der Katalog-Elemente folgen, können Sie ganz einfach vom Service Root Dokument zu einem Datensatz navigieren.
es: Los registros de un conjunto de datos se pueden explorar en la página ``/<ID_CONJUNTO_DATOS>``. Es fácil navegar del documento raíz de servicio a un conjunto de datos siguiendo el atributo URL de los elementos del catálogo.
it: Per sfogliare i record di un dataset è possibile utilizzare la pagina ``/<DATASET ID>``. Per navigare dal documento radice del servizio a un dataset è sufficiente seguire l'attributo URL delle voci di catalogo.
nl: De records van een dataset kunnen doorbladerd worden op de pagina ``/<DATASET ID>``. Het is eenvoudig om te gaan van het service root-document naar een dataset door het URL-attribuut van de catalogusitems te volgen.

source: Paging
es: Paginación
nl: Paginering

source: Client-driven paging can be requested with the ``$top`` REST parameter to limit the size of the response, and the ``$skip`` REST parameter to define the first result to display. The server will ignore `$skip` results and then return the first ``$top`` items. When paging is applied, a link to the next results will be added at the end of the payload.
de: Ein client-betriebenes Paging kann über den REST Parameter ``$top`` abgefragt werden, um die Länge der Antwort zu begrenzen, sowie über den REST Parameter ``$skip``, um das erste anzuzeigende Ergebnis zu definieren. Der Server ignoriert die `$skip` Ergebnisse und gibt dann die ersten ``$top`` Elemente zurück. Bei der Verwendung des Paging wird ein Link an die nächsten Ergebnisse am Ende der Ladung angehängt.
es: La paginación controlada por el cliente se puede solicitar con el parámetro REST ``$top`` para limitar el tamaño de la respuesta y el parámetro REST ``$skip`` para definir el primer resultado que se visualizará. El servidor omitirá `$skip` resultados y después devolverá los ``$top`` primeros elementos. Cuando se aplique la paginación, se añadirá un vínculo a los resultados siguientes al final de la carga.
it: Per richiedere il paging basato sul client è possibile utilizzare il parametro REST ``$top``, che limita le dimensioni della risposta, e il parametro REST ``$skip``, che definisce il primo risultato da visualizzare. Il server ignora i risultati `$skip` e restituisce i primi elementi ``$top``. Quando si applica il paging, al termine del payload viene aggiunto un link ai risultati successivi.
nl: Klantgedreven paginering kan aangevraagd worden met de REST-parameter ``$top`` om de grootte van de respons te beperken en met de REST-parameter om het eerst weer te geven resultaat te definiÃ«ren. De server zal `$skip`-resultaten negeren en vervolgens de eerste ``$top`` items geven. Wanneer paginering wordt toegepast, zal een koppeling naar de volgende resultaten toegevoegd worden op het einde van de payload.

source: Search
de: Suchen
es: Buscar
it: Ricerca
nl: Zoeken

source: The ``$search`` parameter can be used to search data.
de: Der Parameter ``$search`` kann zum Suchen von Daten genutzt werden.
es: Se puede utilizar el parámetro ``$search`` para buscar datos.
it: Il parametro ``$search`` può essere utilizzato per ricercare i dati.
nl: De ``$search``-parameter kan gebruikt worden om data op te zoeken.

source: Restriction
de: Beschränkung
es: Restricción
it: Limitazione
nl: Beperking

source: The ``$filter`` parameter can be used to apply a restriction on results. Supported restriction operators are ``eq`` and ``ne`` for equality and inequality, ``lt`` and ``gt`` for strict inequalities and ``le`` and ``ge`` for non strict inequalities. Multiple restriction expessions can be combined into bigger expressions with the logical operators ``and`` and ``or``. Expression can be negated with the ``not`` operator.
de: Der Parameter ``$filter`` kann zur Anwendung einer Begrenzung der Ergebnisse verwendet werden. Unterstützte Begrenzungsoperatoren sind ``eq`` und ``ne`` für "Gleichheit" und "Ungleichheit", ``lt`` und ``gt`` für strenge Ungleichheiten und ``le`` und ``ge`` für nicht strikte Ungleichheiten. Mehrere Begrenzungsausdrücke können mit den logischen Operatoren ``and`` und ``or`` zu größeren Ausdrücken kombiniert werden. Ausdrücke können mit dem "not"-Operator negiert werden.
es: El parámetro ``$filter`` se puede emplear para aplicar una restricción a los resultados. Los operadores de restricción permitidos son: ``eq`` y ``ne`` para igualdad y desigualdad, ``lt`` y ``gt`` para desigualdades estrictas, y ``le`` y ``ge`` para desigualdades no estrictas. Se pueden combinar varias expresiones de restricción en expresiones más grandes con los operadores lógicos ``and`` y ``or``. La expresión puede negarse con el operador ``not``.
it: Il parametro ``$filter`` permette di applicare una limitazione ai risultati. Gli operatori di limitazione supportati sono ``eq`` e ``ne`` per uguaglianza e disuguaglianza, ``lt`` e ``gt`` per disuguaglianze strette e ``le`` e ``ge`` per disuguaglianze non strette. Le espressioni con limitazioni multiple possono essere combinate in espressioni più grandi con gli operatori logici ``and`` e ``or``. Le espressioni possono essere negate con l'operatore ``not``.
nl: De ``$filter``-parameter kan gebruikt worden om een beperking op resultaten toe te passen. De ondersteunde beperkingsoperatoren zijn ``eq`` en ``ne`` voor gelijkheid en ongelijkheid, ``lt`` en ``gt`` voor strikte ongelijkheden en ``le`` en ``ge`` voor niet-strikte ongelijkheden. Meervoudige beperkingsuitdrukkingen kunnen gecombineerd worden in grotere uitdrukkingen met de logische operatoren ``and`` en ``or``. De uitdrukking kan negatief worden gemaakt met de operator ``not``.

source: Count
de: Zählen
es: Recuento
it: Numero
nl: Tellen
