Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/odata/odata_basics.po
Languages: de, es, it, nl

source: There are two ways of obtaining the number of records in a dataset. The first way is to use the ``$count`` REST parameter (``$inlinecount`` for protocol version 3.0). The other way is to navigate to the count document for a resource. This is achieved by querying ``/<DATASET ID>/$count``. These two methods have slightly different semantics: the first one returns the count relative to the payload, taking all operations into account, except for paging and is returned along with the payload, while the second one returns the absolute resource count, irrespective of anything other than the number of records present on the server and only returns the number, without any other information.
de: Die Anzahl der Einträge in einem Datensatz kann auf zwei verschiedene Arten erhalten werden. Die erste Art besteht darin, den REST Parameter ``$count`` zu verwenden (``$inlinecount`` für die Protokollversion 3.0). Die zweite Art besteht darin, zum Zähldokument für eine Ressource zu navigieren. Dies kann durch die Abfrage ``/<DATASET ID>/$count`` erreicht werden. Die beiden Methoden haben eine leicht unterschiedliche Semantik: Die erste gibt die Zählung bezüglich der Ladung zurück und berücksichtigt dabei sämtliche Operationen außer dem Paging und wird zusammen mit der Ladung zurückgegeben, während die zweite die absolute Ressourcenzählung zurückgibt und dabei nur die Anzahl der auf dem Server vorhandenen Einträge berücksichtigt, ohne weitere Informationen.
es: Hay 2 formas de obtener el número de registros de un conjunto de datos. La primera consiste en usar el parámetro REST ``$count`` (``$inlinecount`` para la versión del protocolo 3.0). La segunda consiste en navegar al documento de recuento de un recurso. Esto se consigue mediante la consulta ``/<ID_CONJUNTO_DATOS>/$count``. Estos 2 métodos tienen algunas diferencias semánticas: el primero devuelve el recuento relativo a la carga, teniendo en cuenta todas las operaciones excepto la paginación, y el resultado se devuelve junto con la carga; en cambio, el segundo devuelve el recuento de recursos absoluto sin tener en cuenta nada más que el número de registros presentes en el servidor y devuelve tan solo el número, sin ninguna otra información.
it: Per ottenere il numero di record di un dataset è possibile procedere in due modi. Il primo consiste nell'utilizzare il parametro REST ``$count`` (``$inlinecount`` per la versione 3.0 del protocollo). L'altro consiste nel navigare fino al documento di conteggio di una risorsa, mediante la query ``/<DATASET ID>/$count``. Questi due metodi hanno una semantica leggermente diversa: il primo restituisce il conteggio relativo al payload, prendendo in considerazione tutte le operazioni, eccetto il paging, e lo restituisce insieme al payload; il secondo, invece, restituisce il numero assoluto delle risorse, considerando esclusivamente il numero dei record presenti sul server e senza aggiungere alcun'altra informazione.
nl: Er zijn twee manieren om het aantal records in een dataset te bekomen. De eerste manier is om de REST-parameter ``$count`` te gebruiken (``$inlinecount`` voor protocolversie 3.0). De andere manier is om te navigeren naar een teldocument voor een bron. dit wordt behaald door ``/<DATASET ID>/$count`` te zoeken. Deze twee methodes hebben licht verschillende semantics: de eerste levert de telling op met betrekking tot de payload, waarbij rekening wordt gehouden met alle operatoren, behalve voor de paginering en wordt gegeven samen met de payload, terwijl de tweede de absolute brontelling oplevert, ongeacht alles behalve het aantal records dat aanwezig is op de server en geeft enkel het aantal, zonder enige andere informatie.

source: Sort
de: Sortieren
es: Ordenación
it: Ordinamento
nl: Sorteren

source: Results returned by the service can be sorted by a field using the ``$orderby`` parameter. The field name can be followed by the ``asc`` and ``desc`` keywords to specify the sort order (default is ascendant).
de: Die vom Service zurückgegebenen Ergebnisse können durch ein Feld unter Verwendung des Parameters ``$orderby`` sortiert werden. Der Feldname kann durch die Schlüsselwörter ``asc`` und ``desc`` ergänzt werden, um die Sortierungsrichtung anzugeben (Standard ist die aufsteigende Richtung).
es: Los resultados que devuelve el servicio se pueden ordenar por campo mediante el parámetro ``$orderby``. El nombre de campo puede ir seguido de las palabras clave ``asc`` o ``desc`` para especificar el criterio de ordenación (el valor predeterminado es ascendente).
it: I risultati restituiti dal servizio possono essere ordinati in base a un campo mediante il parametro ``$orderby``. Il nome del campo può essere seguito dalle parole chiave ``asc`` e ``desc`` per specificare se l'ordine deve essere crescente (valore predefinito) o decrescente.
nl: De resultaten die gegeven worden door de service kunnen gesorteerd worden per veld door gebruik te maken van de parameter ``$orderby``. De veldnaam kan gevolgd worden door de kernwoorden ``asc`` en ``desc`` om te specificeren in welke volgorde de sortering moet gebeuren (standaard is in oplopende volgorde).

source: Specific record
de: Spezifischer Eintrag
es: Registro específico
it: Record specifico
nl: Specifiek record

source: To access a specific record, its record id surrounded by parenthesis, can be appended to the dataset address.
de: Um auf einen spezifischen Eintrag zuzugreifen, seine Eintrags-ID ist in Klammern eingefasst, kann an die Datensatzadresse angefügt werden.
es: Para acceder a un registro específico, se puede anexar a la dirección del conjunto de datos su ID de registro entre paréntesis.
it: Per accedere a un record specifico, il relativo ID deve essere racchiuso tra parentesi e aggiunto all'indirizzo del dataset.
nl: Om naar een specifiek record te gaan, kan het record-ID ervan tussen haakjes geplaatst, toegevoegd worden aan het adres van de dataset.

source: Projection
de: Projektion
es: Proyección
it: Proiezione
nl: Projectie

source: Results can be projected over specific fields using the `$select` parameter. For multiple fields to be subject of the projection, their names must be separated by a comma and an optional space. This parameter can be used with datasets and specific records.
de: Ergebnisse können mit dem Parameter `$select` über spezifische Felder projiziert werden. Wenn mehrere Felder Subjekt der Projektion sein sollen, müssen ihre Namen durch ein Komma und ein optionales Leerzeichen getrennt werden. Dieser Parameter kann für Datensätze und spezifische Einträge genutzt werden.
es: Los resultados se pueden proyectar a campos específicos con el parámetro `$select`. Para que la proyección se realice a varios campos, deben especificarse sus nombres separados por una coma y un espacio opcional. Este parámetro se puede emplear con conjuntos de datos y registros específicos.
it: È possibile proiettare i risultati su campi specifici mediante il parametro `$select`. Per applicare la proiezione a più campi, i relativi nomi devono essere separati da una virgola e da uno spazio facoltativo. Questo parametro può essere utilizzato con dataset e record specifici.
nl: Resultaten kunnen over specifieke velden geprojecteerd worden door gebruik te maken van de parameter `$select`. Opdat meervoudige velden het voorwerp kunnen uitmaken van de projectie, moeten de namen ervan gescheiden worden door een komma en een optionele spatie. Deze parameter kan gebruikt worden voor datasets en specifieke records.

source: OData-Version
nl: OData-versie
