Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/configuring_visualizations/calendar.po
Languages: de, es, nl

source: Configuring the calendar
de: Konfigurieren des Kalenders
es: Configurar el calendario
nl: De kalender configureren

source: The OpenDataSoft platform lets you easily create calendar views from your published datasets.
de: Die OpenDataSoft-Plattform ermöglicht die einfache Erstellung von Kalenderansichten Ihrer veröffentlichten Datensätze.
es: La plataforma OpenDataSoft permite crear fácilmente vistas de calendario a partir de los juegos de datos publicados.
nl: Het OpenDataSoft-platform laat u toe om gemakkelijk kalenderweergaves aan te maken vanuit uw gepubliceerde datasets.

source: A calendar built from a dataset containing all events from OpenAgenda
de: Ein von einem Datensatz erstellter Kalender mit allen Ereignissen von OpenAgenda
es: Un calendario creado a partir de un juego de datos con todos los eventos de OpenAgenda
nl: Een kalender die is opgebouwd vanuit een dataset die alle evenementen uit OpenAgenda bevat

source: Datasets requirements
de: Datensatzanforderungen
es: Requisitos de los juegos de datos
nl: Vereisten betreffende datasets

source: For the calendar view, each record of your dataset is a different event. These events must contain a start time, an end time and a title. Which means your dataset must have two datetime fields and a text field for the calendar view to be available.
de: Für die Kalenderansicht ist jeder Eintrag Ihres Datensatzes ein anderes Ereignis. Diese Ereignisse müssen eine Start- und eine Endzeit sowie einen Titel beinhalten. Das heißt, Ihr Datensatz muss zwei datetime-Felder und ein Textfeld haben, damit die Kalenderansicht verfügbar ist.
es: Para la vista de calendario, cada uno de los registros del juego de datos es un evento distinto. Estos eventos deben contener una hora de inicio, una hora de finalización y un título. Esto significa que el juego de datos debe tener 2 campos de fecha y hora y 1 campo de texto para que la vista de calendario esté disponible.
nl: Voor een kalenderweergave is elk record van uw dataset een ander evenement. Deze evenementen moeten een begintijdstip, een eindtijdstip en een titel hebben. Dit betekent dat uw dataset twee datumtijdvelden en een tekstveld moet hebben opdat de kalenderweergave beschikbaar kan zijn.

source: 2 fields set as datetime
de: 2 als datetime eingerichtete Felder
es: 2 campos establecidos como fecha y hora
nl: 2 velden ingesteld als datumtijd

source: Records without titles will be displayed on the calendar as titleless events, but missing either the start or end time will cause the view to simply ignore the record.
de: Einträge ohne Titel werden im Kalender als titellose Ereignisse angezeigt. Eine fehlende Start- oder Endzeit führt jedoch dazu, dass die Ansicht den Eintrag einfach ignoriert.
es: Los registros sin título se visualizarán en el calendario como eventos sin título; sin embargo, si carecen de hora de inicio o finalización, la vista simplemente los omitirá.
nl: Records zonder titels zullen op de kalender worden weergegeven als evenementen zonder titel, maar wanneer ofwel het begintijdstip of het eindtijdstip ontbreekt, zal dit ervoor zorgen dat bij de weergave het record gewoon wordt genegeerd.

source: Full day events
de: Ganztagsereignisse
es: Eventos de todo el día
nl: Evenementen die een volledige dag in beslag nemen

source: Though very simple, the "two datetime fields and a text field" requirement forces you to setup full day events as events ~ starting at 12AM on the given day and finishing a second before midnight on the same day (00:00:00 to 23:59:59).
de: Obwohl äußerst simpel, zwingt Sie die Anforderung "zwei datetime-Felder und ein Textfeld" dazu, Ganztagsereignisse als Ereignisse einzurichten, ~ die am gegebenen Tag um 12 Uhr morgens starten und eine Sekunde vor Mitternacht des gleichen Tags enden (00:00:00 bis 23:59:59).
es: Aunque es muy sencillo, el requisito de "2 campos de fecha y hora y 1 campo de texto" obliga a configurar los eventos de todo el día como eventos con la hora de inicio aproximada a las 12 am del día en cuestión y la hora de finalización un segundo antes de esa misma medianoche (de 00:00:00 a 23:59:59).
nl: Hoewel het zeer eenvoudig is, dwingen de verplichte "twee datumtijdvelden en een tekstveld" u om evenementen van een volledige dag in te stellen als evenementen "die beginnen om 12u00 op de welbepaalde dag en eindigen een seconde voor middernacht op diezelfde dag (00:00:00 to 23:59:59)".

source: Configuration
de: Konfiguration
es: Configuración
nl: Configuratie

source: Enabling the calendar view
de: Aktivieren der Kalenderansicht
es: Activar vista de calendario
nl: De kalenderweergave activeren

source: Once you have configured two of your dataset's fields as datetimes and another field as text, you'll see the calendar tab become available.
de: Nach der Konfiguration zweier Ihrer Datensatzfelder als datetime und eines weiteren Feldes als Text wird das Kalenderregister verfügbar.
es: Una vez configurados 2 campos del juego de datos como fecha y hora y 1 campo como texto, verá que la ficha de calendario ya está disponible.
nl: Eenmaal u twee van de velden van uw dataset hebt geconfigureerd als datumtijden en een ander veld als tekst, ziet u het tabblad "kalender" verschijnen.

source: Calendar tab unavailable
de: Kalenderregister nicht verfügbar
es: Ficha de calendario no disponible
nl: Tabblad "kalender" verschijnt niet

source: Calendar tab available
de: Kalenderregister verfügbar
es: Ficha de calendario disponible
nl: Tabblad "kalender" verschijnt wel

source: It doesn't mean that your dataset is fully configured though. The view is available but not enabled by default. You'll have to manually enable it.
de: Das heißt jedoch nicht, dass Ihr Datensatz vollständig konfiguriert ist. Die Ansicht ist verfügbar, aber nicht standardmäßig aktiviert. Daher müssen Sie sie manuell aktivieren.
es: No obstante, esto no significa que el juego de datos esté totalmente configurado. La vista está disponible, pero no se activa de forma predeterminada. Tendrá que activarla manualmente.
nl: Dit betekent evenwel niet dat uw dataset volledig geconfigureerd is. De weergave is beschikbaar maar niet standaard geactiveerd. U moet deze handmatig activeren.

source: This checkbox will enable the calendar view
de: Die Kalenderansicht können Sie über dieses Kontrollkästchen aktivieren.
es: Esta casilla activará la vista de calendario.
nl: Met dit aanvinkvakje kan de kalenderweergave worden geactiveerd

source: Setting up events' fields
de: Einrichten von Ereignisfeldern
es: Configurar campos de eventos
nl: De velden "evenementen" instellen

source: Once the calendar is enabled, you'll need to make sure the events' fields are well configured. You'll see that the first text field has been selected for the title, the first datetime for the start time and the second datetime for the end time. You may have multiple other text/datetime fields in your dataset, select here which one determine the events' properties.
de: Nach der Aktivierung des Kalenders müssen Sie sicherstellen, dass die Ereignisfelder richtig konfiguriert sind. Sie werden feststellen, dass das erste Feld für den Titel, das erste datetime für die Startzeit und das zweite datetime für die Endzeit ausgewählt wurden. Unter Umständen haben Sie diverse andere Text-/datetime-Felder in Ihrem Datensatz. Wählen Sie hier aus, welche die Ereigniseigenschaften bestimmen.
es: Una vez activado el calendario, deberá comprobar que los campos de los eventos están bien configurados. Verá que el primer campo de texto se ha seleccionado para el título; el primer campo de fecha y hora, para la hora de inicio; y el segundo campo de fecha y hora, para la hora de finalización. Puede que tenga otros campos de fecha y hora/texto en el juego de datos; seleccione aquí los que determinen las propiedades de los eventos.
nl: Eenmaal de kalender is geactiveerd, moet u er ook voor zorgen dat de velden "evenementen" goed zijn geconfigureerd. U zal zien dat het eerste tekstveld werd geselecteerd voor de titel, de eerste datumtijd voor het begintijdstip en de tweede datumtijd voor het eindtijdstip. Er kunnen meerdere andere tekst/datumtijdvelden in uw dataset staan. Selecteer hier welke ervan de eigenschappen van het evenement bepalen.

source: This is also where you'll be able to select the events' color.
de: Hier können Sie auch die Ereignisfarbe auswählen.
es: Aquí también podrá seleccionar el color de los eventos.
nl: Dit is ook waar u de kleur van het evenement kan selecteren.

source: Default configuration for my calendar. The event's fields are pre-selected but not correct.
de: Standardkonfiguration für meinen Kalender. Die Ereignisfelder sind vorgewählt, stimmen aber nicht.
es: Configuración predeterminada del calendario. Los campos de los eventos están preseleccionados, pero no son correctos.
nl: Standaardconfiguratie voor mijn kalender. De velden van het evenement zijn vooraf geselecteerd maar zijn niet juist

source: Corrected settings
de: Korrigierte Einstellungen
es: Configuración corregida
nl: Juiste instellingen

source: Setting up the tooltip
de: Einrichten der QuickInfo
es: Configurar la ayuda de herramienta
nl: De tooltip instellen

source: In the calendar view, a click on a event will bring forward a tooltip containing more information about the events.
de: In der Kalenderansicht wird durch das Klicken auf ein Ereignis eine QuickInfo mit weiteren Informationen über das Ereignis eingeblendet.
es: En la vista de calendario, al hacer clic en un evento se muestra una ayuda de herramienta con más información acerca del evento.
nl: Wanneer u in de kalenderweergave op een evenement klikt, verschijnt een tooltip die meer informatie verschaft over de evenementen.

source: You can :doc:`configure the tooltip</sourcing_and_processing_data/configuring_visualizations/tooltip>` in exactly the same way than for the map or the images.
de: Sie können :doc:`die QuickInfo</sourcing_and_processing_data/configuring_visualizations/tooltip>` auf genau die gleiche Weise wie Karten oder Bilder konfigurieren.
es: Puede :doc:`configurar la ayuda de herramienta</sourcing_and_processing_data/configuring_visualizations/tooltip>` exactamente igual que para el mapa o las imágenes.
nl: U kan :doc:`de tooltip configureren</sourcing_and_processing_data/configuring_visualizations/tooltip>` op precies dezelfde manier als voor de kaart of de afbeeldingen.

source: Sharing
de: Teilen
es: Compartir
nl: Delen

source: Once your dataset is correctly setup and published, you can of course share this calendar with anyone having the rights to view the calendar.
de: Nachdem Sie Ihren Datensatz richtig eingerichtet und veröffentlicht haben, können Sie diesen Kalender natürlich mit jedem teilen, der über die Rechte zum Anzeigen des Kalenders verfügt.
es: Después de configurar y publicar correctamente el juego de datos, por supuesto puede compartir este calendario con cualquier usuario que tenga los derechos adecuados para ver el calendario.
nl: Eenmaal uw dataset correct is ingesteld en gepubliceerd, kan u natuurlijk de kalender delen met iedereen die over de rechten beschikt om de kalender te bekijken.

source: To do so, you can always copy/paste the url from your browser's address bar, but you can also use any of the 3 options offered below the calendar itself.
de: Dazu können Sie entweder die URL aus der Adressleiste Ihres Browsers kopieren/einfügen oder eine der 3 unter dem Kalender angebotenen Optionen verwenden.
es: Para ello, siempre puede copiar/pegar la dirección URL de la barra de dirección del explorador, pero también puede usar cualquiera de las 3 opciones que se ofrecen debajo del mismo calendario.
nl: Hiervoor kan u altijd de URL kopiëren/plakken vanuit de adresbalk van uw browser, maar u kan ook een van de 3 opties gebruiken die onderaan de kalender zelf worden aangeboden.

source: Share the url
de: Die URL teilen
es: Compartir la dirección URL
nl: Deel de URL

source: The 3 sharing options, with first and foremost the url
de: Die 3 Optionen zum Teilen, mit zuallererst der URL
es: Las 3 opciones de compartir, en primer lugar mediante la dirección URL.
nl: De 3 opties om te delen, met als eerste en belangrijkste de URL

source: Code snippet to embed the view inside any other website
de: Codeschnipsel zum Einbetten der Ansicht in einer anderen Website
es: Fragmento de código para incrustar la vista en cualquier otro sitio web
nl: Code snippet om de weergave in te voegen in een andere website

source: Embed this code into any other page to display your calendar there
de: Zum Anzeigen Ihres Kalenders auf einer beliebigen Seite diesen Code dort einbetten
es: Incruste este código en cualquier otra página para visualizar en ella el calendario.
nl: Voeg deze code in in een andere pagina om uw kalender daar weer te geven

source: Code snippet to include in any of your dashboard or page on the platform.
de: In ein/e beliebige/s Dashboard oder Seite auf der Plattform einzufügender Codeschnipsel.
es: Fragmento de código para incluir en cualquier panel o página de la plataforma.
nl: Code snippet om deze op te nemen in één van uw dashboards of pagina's op het platform.

source: Copy this code to one your dashboard on the platform
de: Diesen Code in eins Ihrer Dashboards auf der Plattform kopieren
es: Copie este código en uno de sus paneles de la plataforma.
nl: Kopieer deze code naar één van uw dashboards op het platform.
