Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/configuring_visualizations/custom.po
Languages: it

source: Configuring the custom view
it: Configurazione della visualizzazione personalizzata

source: Standard views allow your users to dive further into your datasets, but they are tools. They do not provide additional context and do not highlight what you think are the key facts to take away. And while the *description* metadata adds a bit of context, it is limited to pure text.
it: Le visualizzazioni standard permettono all'utente di esaminare in maggior dettagli i dataset ma sono solo strumenti. Non forniscono ulteriore contesto e non evidenziano gli elementi principali che desideri mettere in evidenza. Se, d'altro canto, i metadati della *descrizione* aggiungono un certo contesto, si limitano però al solo testo.

source: The custom view is an additional tab that lives alongside the other tabs on the dataset's page. It is an empty space that you can use as you wish. An HTML and CSS editor enables you to write a dashboard as simple or as complex as you may want (for more information about writing beautiful dashboard, see the :doc:`dedicated documentation </editing_pages/index>`) and you can even customize the title and icon of this additional tab.
it: La visualizzazione personalizzata è una scheda aggiuntiva che si trova accanto alle altre schede nella pagina del dataset. Si tratta di uno spazio vuoto che puoi gestire secondo le tue esigenze. Tramite un editor HTML e CSS potrai creare un dashboard semplice o più complesso, esattamente come desideri. Per ulteriori informazioni sulla creazione di un utile dashboard, leggi la :doc:`documentazione dedicata </editing_pages/index>`. È inoltre possibile personalizzare il titolo e l'icona di questa scheda aggiuntiva.

source: The custom view editor
it: Editor della visualizzazione personalizzata

source: Tab icon and title
it: Icona e titolo della scheda

source: The custom title and icon will show up within your catalog page on the related dataset's card, and you'll be able to search for datasets having a custom view set up with the *View* filter (select the *Custom view* option).
it: Il titolo e l'icona personalizzati saranno riportati nella pagina del tuo catalogo, nella scheda del dataset, e potrai eseguire ricerche dei dataset per i quali è stata configurata una visualizzazione personalizzata mediante il filtro *Visualizza*, selezionando l'opzione *Visualizzazione personalizzata*.

source: Icons are taken from the `Font awesome 4.7 icon set <http://fontawesome.io/icons/>`_ and must be specified through their name (omitting the ``fa-`` prefix). For example, to use the `bar chart <http://fontawesome.io/icon/bar-chart/>`_ icon, whose name is ``fa-bar-chart``, you should input ``bar-chart`` in the icon field. You can also leave this field empty, in which case it will default to the `tachometer icon <http://fontawesome.io/icon/tachometer/>`_.
it: Le icone sono tratte dal `set di icone Font awesome 4.7 <http://fontawesome.io/icons/>`_ e devono essere specificate inserendo il relativo nome, senza il prefisso ``fa-``. Ad esempio, per utilizzare l'icona `grafico a barre <http://fontawesome.io/icon/bar-chart/>`_ icon, il cui nome è ``fa-bar-chart``, dovrai inserire ``bar-chart`` nel campo dell'icona. È anche possibile lasciare vuoto questo campo, in tal caso verrà impostato in modo predefinito sull'`icona del tachimetro <http://fontawesome.io/icon/tachometer/>`_.

source: Tab content
it: Contenuto della scheda

source: The HTML and CSS code you'll be writing for the tab content isn't isolated from the rest of the page. It is integrated within an already rich interface and can take advantage of the existing dataset context to interact with the filters.
it: Il codice HTML e CSS da scrivere per il contenuto della scheda non è isolato dal resto della pagina ma è integrato nella già ricca interfaccia e può sfruttare il contesto esistente dei dataset per interagire con i filtri.

source: In order to illustrate the different possibilities, we'll use a dataset listing all `new power plant installations in 2015 in france <https://rte.opendatasoft.com/explore/dataset/registre_parc_prod_rpt/>`_ alongside their respective power capacity, breaking them down by nature (nuclear, wind, solar...) and region.
it: Per illustrare le diverse possibilità, utilizzeremo un dataset che elenca tutte le `nuove installazioni di centrali di energia elettrica nel 2015 in Francia <https://rte.opendatasoft.com/explore/dataset/registre_parc_prod_rpt/>`_, completo della loro capacità energetica e suddiviso per tipologia (nucleare, eolica, solare...) e regione.

source: To illustrate the relative importance of the various sources of energy within these new installations, we'll build a treemap with the analyse tab and set this visualization in the custom tab.
it: Per descrivere l'importanza relativa delle varie fonti di energia di queste nuove installazioni, creeremo un treemap con la scheda Analisi e imposteremo questa visualizzazione nella scheda personalizzata.

source: The treemap we want to see.
it: Treemap da visualizzare

source: The share panel at the bottom of the analyze tab gives us the following widget code for this treemap.
it: Il pannello Condividi in fondo alla scheda Analisi contiene il seguente codice widget per questo treemap.

source: We can of course copy/paste this code into the custom view's HTML code editor and it will give us the requested treemap. However, since we're creating an independant dataset context (named `registreparcprodrpt` in this case), this treemap will be independant from the rest of the dataset's page, and especially independant from the active filters.
it: Naturalmente, possiamo copiare e incollare questo codice nell'editor del codice HTML della visualizzazione personalizzata e ottenere il treemap desiderato. Poiché, tuttavia, stiamo creando un contesto di dataset indipendente (in questo caso denominato `registreparcprodrpt`), questo treemap dovrà essere indipendente dal resto della pagina del dataset e in particolare dai filtri che vi sono attivi.

source: This means that we can't take advantage of the existing *producer* filter to refine the treemap and see what technology such and such company is more investing in.
it: Ciò significa che non è possibile utilizzare il filtro *producer* esistente per affinare il treemap e vedere in quale tecnologia sta investendo ogni azienda.

source: The treemap in the custom view is not affected by the active filter
it: Il treemap nella visualizzazione personalizzata non è influenzato dal filtro attivo

source: In order to work with the existing dataset context, we just have to plug the ``ods-chart`` widget not on a custom context defined within the custom view but directly on the global context set for the page, which is named ``ctx``, as such.
it: Per lavorare con il contesto del dataset esistente, è sufficiente collegare il widget ``ods-chart`` non a un contesto personalizzato definito nella visualizzazione personalizzata ma direttamente al contesto globale impostato per la pagina, in questo caso denominato ``ctx``.

source: This time, the treemap will be actualized depending on the current filters, which allows for more in-depth exploring.
it: Questa volta, il treemap verrà attualizzato in base ai filtri correnti e permetterà un esame più approfondito.

source: The treemap in the custom view is now taking into account active filters
it: Il treemap nella visualizzazione personalizzata tiene ora in considerazione i filtri attivi

source: Depending on your analysis, you may want to have both static and dynamic visualizations within your custom view, and nothing prevents you from doing so. You'll just have to plug the dynamic ones onto the ``ctx`` context and define new ``ods-dataset-context`` for static ones.
it: A seconda dell'analisi, la visualizzazione personalizzata può includere, a seconda delle esigenze, viste sia statiche sia dinamiche. Per far ciò è necessario collegare le viste dinamiche al contesto ``ctx`` e definire un nuovo ``ods-dataset-context`` per quelle statiche.
