Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/configuring_visualizations/map.po
Languages: de, es, nl

source: Configuring the map view
de: Konfigurieren der Kartenansicht
es: Configurar la vista de mapa
nl: De kaartweergave configureren

source: The map view is only available to datasets containing at least one geo field (geo point or geo shape).
de: Die Kartenansicht ist nur für Datensätze verfügbar, die mindestens ein Geofeld enthalten (Geopunkt oder Geoform).
es: La vista de mapa solo está disponible para los juegos de datos que contienen como mínimo un campo geográfico (punto geográfico o forma geográfica).
nl: De kaartweergave is enkel beschikbaar voor datasets die minstens één geo-veld (geo point of geo shape) bevatten

source: You can configure the appearance of the map itself:
de: Sie können die Darstellung der Karte an sich konfigurieren:
es: Puede configurar la apariencia del mapa en sí:
nl: U kan de manier waarop de kaart zelf wordt weergegeven configureren:

source: If a tooltip displays more than one item (when multiple records have the same location for example), you can set their relative order
de: Zeigt eine QuickInfo mehr als ein Element an (z. B. wenn mehrere Einträge den gleichen Ort haben), können Sie ihre relative Reihenfolge festlegen.
es: Si una ayuda de herramienta visualiza varios elementos (por ejemplo, cuando varios registros tienen la misma ubicación), puede configurar su orden relativo.
nl: Wanneer een tooltip meer dan één item weergeeft (bijvoorbeeld wanneer meerdere records dezelfde locatie hebben), kan u de relatieve volgorde ervan instellen

source: If you have more than one basemap on your domain, you can set which one is selected by default for this dataset (otherwise it is the first one in the list)
de: Haben Sie mehr als eine Grundkarte auf Ihrer Domain, können Sie festlegen, welche standardmäßig für diesen Datensatz ausgewählt wird (ansonsten ist es die erste in der Liste).
es: Si tiene varios mapas de base en el dominio, puede establecer cuál se selecciona de forma predeterminada para este juego de datos (de lo contrario, será el primero de la lista).
nl: Wanneer u meer dan één basiskaart hebt op uw domein, kan u instellen welke standaard voor deze dataset worden geselecteerd (anders is het de eerste in de lijst)

source: The color of the shapes and points displayed on the map
de: Die Farbe der in der Karte angezeigten Formen und Punkte
es: El color de las formas y los puntos que se visualizan en el mapa.
nl: De kleur van de vormen en punten die weergegeven worden op de kaart

source: If the data is represented as points, you can configure how it is displayed: a simple icon, little dots, or a familiar marker
de: Werden Daten als Punkte dargestellt, können Sie konfigurieren, wie sie angezeigt werden: als einfaches Symbol, kleine Punkte oder klassische Marker.
es: Si los datos se representan como puntos, puede configurar cómo se visualizan: con simples iconos, pequeños puntos o marcadores habituales.
nl: Wanneer de data worden weergegeven als punten, kan u configureren hoe deze worden weergegeven: een gewoon pictogram, kleine puntjes of een vertrouwd merkteken

source: The map view options
de: Die Optionen für die Kartenansicht
es: Opciones de la vista de mapa
nl: De weergaveopties van de kaart

source: Setting up the tooltip
de: Einrichten der QuickInfo
es: Configurar la ayuda de herramienta
nl: De tooltip instellen

source: On a map, a click on a point will bring forward a tooltip containing more information
de: Auf einer Karte wird durch das Anklicken eines Punkts eine QuickInfo mit weiteren Angaben eingeblendet.
es: En un mapa, al hacer clic en un punto se muestra una ayuda de herramienta con más información.
nl: Wanneer u op een kaart op een punt klikt, verschijnt een tooltip die meer informatie verschaft

source: You can :doc:`configure the tooltip</sourcing_and_processing_data/configuring_visualizations/tooltip>` in exactly the same way than for the image gallery or the calendar.
de: Sie können :doc:`die QuickInfo</sourcing_and_processing_data/configuring_visualizations/tooltip>` auf genau die gleiche Weise wie die Bildergalerie oder den Kalender konfigurieren.
es: Puede :doc:`configurar la ayuda de herramienta</sourcing_and_processing_data/configuring_visualizations/tooltip>` exactamente igual que para la galería de imágenes o el calendario.
nl: U kan :doc:`de tooltip configureren</sourcing_and_processing_data/configuring_visualizations/tooltip>` op precies dezelfde manier als voor de galerij met afbeeldingen of de kalender.
