Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/01_branding_portal/branding.po
Languages: de, es, fr, nl

source: Branding the portal
de: Das Portal branden
es: Personalizar la marca del portal
fr: Personnalisation du portail
nl: Het portaal van een merk voorzien

source: Opendatasoft portals can be customized according to a chosen corporate branding. Go to the **Look & feel > Branding** subsection of the back office to choose a portal name, write a portal description, choose a page title prefix, define the brand name and add a portal favicon or logo.
de: Opendatasoft-Portale können an das ausgewählte Unternehmensbranding angepasst werden. Gehen Sie in den Unterabschnitt **Aussehen & Eindruck > Branding** im Back-Office, um einen Portal-Namen zu wählen, eine Portal-Beschreibung zu verfassen, einen Seitentitel-Präfix auszuwählen, den Markennamen zu definieren und ein Portal-Favicon oder -Logo hinzuzufügen.
es: Los portales de Opendatasoft se pueden personalizar conforme a una identidad de marca determinada. Vaya a la subsección **Apariencia > Personalización de marca** del back office para elegir un nombre de portal, escribir una descripción del portal, elegir un prefijo de título de página, definir el nombre de marca y añadir un favicono o logotipo del portal.
fr: Les portails Opendatasoft peuvent être personnalisés aux couleurs d'une entreprise. Rendez-vous dans la sous-section **Apparence > Personnalisation** de l'interface d'administration pour choisir un nom de portail, rédiger une description, sélectionner un préfixe de titre de page, définir le nom de la marque et ajouter un logo ou une favicon de portail.
nl: Opendatasoft-portalen kunnen gepersonaliseerd worden volgens een gekozen bedrijfsmerk. Ga naar de subafdeling **Look & feel > Branding** van de back-office om een portaalnaam te kiezen, schrijf een portaalbeschrijving, kies een prefix van de paginatitel, definieer de merknaam en voeg een portaalfavicon of -logo toe.

source: Metadata is not stripped from uploaded files. The tags may expose sensitive information, such as geolocation data or device information.
de: Die Metadaten werden nicht aus den hochgeladenen Dateien isoliert. Die Tags könnten sensible Informationen preisgeben, wie etwa Geolokalisierungsdaten oder Geräteinformationen.
es: No se han quitado los metadatos de los archivos cargados. Las etiquetas pueden exponer información confidencial, como datos de geolocalización o información de dispositivos.

source: Before uploading files, make sure you strip metadata you want to keep private.
de: Stellen Sie vor dem Hochladen sicher, dass Sie vertrauliche Metadaten isolieren.
es: Antes de cargar los archivos, quite los metadatos que desee mantener en privado.

source: Choosing a portal name
de: Einen Portal-Namen wählen
es: Elegir un nombre de portal
fr: Choisir d'un nom de portail
nl: Een portaalnaam kiezen

source: The portal name is used throughout the platform (login page, domain configurations, etc.) as well as in domain-related notifications sent by email. By default, the portal name is the domain identifier, that is, the name written in the URL of the portal.
de: Der Portal-Name wird auf der gesamten Plattform verwendet (Anmeldeseite, Domain-Konfigurationen usw.) sowie in per E-Mail versendeten Benachrichtigungen mit Bezug zur Domain. Standardmäßig entspricht der Portal-Name dem Domainbezeichner, also dem in der URL des Portals angegebenen Namen.
es: El nombre de portal se usa en toda la plataforma (página de inicio de sesión, configuraciones de dominio, etc.) y en las notificaciones de dominios enviadas por correo electrónico. Por defecto, el nombre de portal es el identificador de dominio (es decir, el nombre escrito en la dirección URL del portal).
nl: De portaalnaam wordt doorheen het volledige platform gebruikt (inlogpagina, domeinconfiguraties, enz.), alsook in kennisgevingen met betrekking tot het domein die via e-mail worden verstuurd. Standaard is de portaalnaam de identifier van het domein (bijv. de naam die in de URL van het portaal staat).

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Opendatasoft domain URLs can be customized using aliases (see :doc:`Customizing domain URL </configuring_domain/06_customizing_domain_url/custom_urls>` for more information).
de: Opendatasoft-Domain-URLs können durch die Verwendung von Aliasen angepasst werden (für weitere Informationen siehe :doc:`Domain-URL anpassen </configuring_domain/06_customizing_domain_url/custom_urls>`).
es: Las direcciones URL de dominio de Opendatasoft se pueden personalizar con alias (consulte :doc:`Personalizar URL de dominio </configuring_domain/06_customizing_domain_url/custom_urls>` para obtener más información).
fr: Les URL de domaine Opendatasoft peuvent être personnalisées à l'aide d'alias (voir :doc:`Personnaliser l'URL de votre domaine</configuring_domain/06_customizing_domain_url/custom_urls>` pour plus d'informations).
nl: URL's van een Opendatasoft-domein kunnen worden gepersonaliseerd door middel van aliassen (zie :doc:`De URL van een domein personaliseren </configuring_domain/06_customizing_domain_url/custom_urls>` voor meer informatie).

source: To choose a new portal name:
de: Auswahl eines neuen Portal-Namens:
es: Para elegir un nombre de portal nuevo:
fr: Pour choisir un nouveau nom de portail :
nl: Om een nieuwe portaalnaam te kiezen:

source: In the **Branding** configuration interface, look for the **Portal name** configuration.
de: Suchen sie die Konfiguration für den **Portal-Namen** in der **Branding**-Konfigurationsoberfläche.
es: En la interfaz de configuración **Personalización de marca**, busque la configuración **Nombre de portal**.
fr: Dans l'interface de configuration **Personnalisation**, recherchez la configuration **Nom du portail**.
nl: Zoek in de configuratie-interface **Branding** naar de configuratie **Portaalnaam**.

source: In the textbox, write a new portal name.
de: Schreiben Sie einen neuen Portal-Namen in die Textbox.
es: Escriba un nuevo nombre de portal en el cuadro de texto.
fr: Dans la zone de texte, indiquez un nouveau nom de portail.
nl: Noteer in het tekstvak een nieuwe portaalnaam.

source: Click on the Save button in the top right corner.
de: Klicken Sie oben rechts auf den Button Speichern.
es: Haga clic en el botón Guardar en la esquina superior derecha.
fr: Cliquez sur le bouton Enregistrer en haut à droite.
nl: Klik op de knop Opslaan in de rechter bovenhoek.

source: Writing a portal description
de: Verfassen Sie eine Portal-Beschreibung.
es: Escribir una descripción de portal
fr: Rédiger une description de portail
nl: Een portaalomschrijving schrijven

source: The portal description helps search engines and social networks understand the content of the Opendatasoft portal. It may also show up in search results and link descriptions.
de: Die Portal-Beschreibung hilft Suchmaschinen und sozialen Netzwerken dabei, den Inhalt des Opendatasoft-Portals zu verstehen. Sie taucht eventuell auch in Suchergebnissen und Link-Beschreibungen auf.
es: La descripción del portal ayuda a los motores de búsqueda y redes sociales a entender el contenido del portal de Opendatasoft. También puede aparecer en resultados de búsquedas y descripciones de vínculos.
nl: De portaalomschrijving helpt zoekmotoren en sociale netwerken om de content van het Opendatasoft-portaal te begrijpen. Ze kunnen ook opduiken in zoekresultaten en beschrijvingen van koppelingen.

source: To write a new portal description:
de: Verfassen einer neuen Portal-Beschreibung:
es: Para escribir una nueva descripción del portal:
fr: Pour rédiger une nouvelle description de portail :
nl: Om een nieuwe portaalomschrijving te schrijven:

source: In the **Branding** configuration interface, look for the **Portal description** configuration.
de: Suchen sie die Konfiguration für die **Portal-Beschreibung** in der **Branding**-Konfigurationsoberfläche.
es: En la interfaz de configuración **Personalización de marca**, busque la configuración **Descripción del portal**.
fr: Dans l'interface de configuration **Personnalisation**, recherchez la configuration **Description du portail**.
nl: Zoek in de configuratie-interface **Branding** naar de configuratie **Portaalomschrijving**.

source: In the expandable textbox, write a new portal description.
de: Schreiben Sie einen neuen Portal-Namen in die vergrößerbare Textbox.
es: Escriba una nueva descripción del portal en el cuadro de texto ampliable.
fr: Dans la zone de texte pouvant être développée, rédigez une nouvelle description de portail.
nl: Schrijf in het uitvouwbaar tekstvak een nieuwe portaalomschrijving.

source: Choosing a page title prefix
de: Wählen Sie einen Seitentitel-Präfix
es: Elegir un prefijo de título de página
fr: Sélectionner un préfixe de titre de page
nl: Een prefix van een paginatitel kiezen

source: The page title prefix is displayed in the browser's tab. It is usually preceded by the name of the page that is currently visited, both being separated with a dash ``—``.
de: Der Seitentitel-Präfix wird im Tab des Browsers angezeigt. Davor steht im Allgemeinen der Name der aktuell besuchten Seite mit einem Trennstrich ``—`` zwischen den beiden Informationen.
es: El prefijo de título de página se muestra en la ficha del explorador. Suele ir precedido del nombre de la página visitada en ese momento, ambos elementos separados por un guión largo ``—``.
fr: Le préfixe de titre de page est affiché dans l'onglet du navigateur. En règle générale, il est précédé du nom de la page actuellement consultée, tous deux séparés par un tiret ``—``.
nl: Het prefix van de paginatitel wordt weergegeven in het tabblad van de browser. Deze wordt meestal voorafgegaan door de naam van de paginatitel die momenteel wordt bezocht, waarbij beide worden gescheiden door middel van een liggend streepje ``—``.

source: To choose a page title prefix:
de: Einen Seitentitel-Präfix auswählen:
es: Para elegir un prefijo de título de página:
fr: Pour sélectionner un préfixe de titre de page :
nl: Om een prefix van een paginatitel te kiezen:

source: In the **Branding** configuration interface, look for the **Page title prefix** configuration.
de: Suchen sie die Konfiguration für den **Seitentitel-Präfix** in der **Branding**-Konfigurationsoberfläche.
es: En la interfaz de configuración **Personalización de marca**, busque la configuración **Prefijo de título de página**.
fr: Dans l'interface de configuration **Personnalisation**, recherchez la configuration **Préfixe de titre de page**.
nl: Zoek in de configuratie-interface **Branding** naar de configuratie **Prefix van een paginatitel**.

source: In the textbox, write a page title prefix.
de: Schreiben Sie einen Seitentitel-Präfix in die Textbox.
es: Escriba un prefijo de título de página en el cuadro de texto.
fr: Dans la zone de texte, indiquez un préfixe de titre de page.
nl: Schrijf in het tekstvak een prefix van de paginatitel.

source: Defining a brand name
de: Einen Markennamen definieren
es: Definir un nombre de marca
fr: Définir un nom de marque
nl: Een merknaam definiëren

source: The brand name is used throughout the platform, in every header.
de: Der Markenname wird auf der gesamten Plattform in jeder Kopfzeile verwendet.
es: El nombre de marca se usa en toda la plataforma, en todos los encabezados.
fr: Le nom de la marque est utilisé dans l'ensemble de la plateforme, dans tous les en-têtes.
nl: De merknaam wordt doorheen het volledige platform gebruikt in elke header.

source: To define the brand name:
de: Bestimmung eines Markennamens:
es: Para definir un nombre de marca:
fr: Pour définir le nom de la marque :
nl: Om de merknaam te definiëren:

source: In the **Branding** configuration interface, look for the **Brand** configuration.
de: Suchen sie die Konfiguration der **Marke** in der **Branding**-Konfigurationsoberfläche.
es: En la interfaz de configuración **Personalización de marca**, busque la configuración **Marca**.
fr: Dans l'interface de configuration **Personnalisation**, recherchez la configuration **Marque**.
nl: Zoek in de configuratie-interface **Branding** naar de configuratie **Merk**.

source: In the textbox, write the brand name.
de: Schreiben Sie den Markennamen in die Textbox.
es: Escriba el nombre de marca en el cuadro de texto.
fr: Dans la zone de texte, indiquez le nom de la marque.
nl: Schrijf in het tekstvak de merknaam:

source: Adding a portal favicon
de: Ein Portal-Favicon hinzufügen
es: Añadir un favicono del portal
fr: Ajouter une favicon de portail
nl: Een portaalfavicon toevoegen

source: The favicon is the small image displayed in the browser's tab, next to the page title. The default favicon is Opendatasoft's logo. It should be replaced with images that are either 16x16px or 32x32px.
de: Bei dem Favicon handelt es sich um die kleine Grafik, die im Browser-Tab neben dem Seitentitel angezeigt wird. Das Opendatasoft-Logo fungiert als Standard-Favicon. Es sollte durch eine Bilddatei von entweder 16x16px oder 32x32px ersetzt werden.
es: El favicono es la pequeña imagen que se visualiza junto al título de página en la ficha del explorador. El favicon predeterminado es el logotipo de Opendatasoft. Debe sustituirse por imágenes de 16x16 px o 32x32 px.
fr: La favicon est la petite image affichée dans l'onglet du navigateur, en regard du titre de la page. Le logo d'Opendatasoft correspond à la favicon par défaut. Il doit être remplacé par des images aux dimensions suivantes : 16 x 16 px ou 32 x 32 px.
nl: De favicon is de kleine afbeelding die weergegeven wordt in het tabblad van de browser naast de paginatitel. De standaardfavicon is het logo van Opendatasoft. Dit zou vervangen moeten worden door afbeeldingen die ofwel 16x16px ofwel 32x32px groot zijn.

source: We recommend to opt for quality and modern formats such as .svg rather than formats like .ico.
de: Wir empfehlen, eine gute Qualität und ein modernes Format wie .svg statt Formate wie .ico zu verwenden.
es: Le recomendamos usar formatos modernos de calidad como .svg en lugar de formatos como .ico.
fr: Nous vous recommandons de privilégier les formats récents et de qualité, tel que .svg, plutôt que des formats comme .ico.
nl: We raden aan om te kiezen voor kwalitatieve en moderne formaten, zoals .svg, in plaats van formaten zoals .ico.

source: To add a new portal favicon:
de: Hinzufügen eines neuen Portal-Favicons:
es: Para añadir un favicono del portal nuevo:
fr: Pour ajouter une nouvelle favicon de portail :
nl: Om een nieuw portaalfavicon toe te voegen:

source: In the **Branding** configuration interface, look for the **Portal favicon** configuration.
de: Suchen sie die Konfiguration für das **Portal-Favicon** in der **Branding**-Konfigurationsoberfläche.
es: En la interfaz de configuración **Personalización de marca**, busque la configuración **Favicono del portal**.
fr: Dans l'interface de configuration **Personnalisation**, recherchez la configuration **Favicon du portail**.
nl: Zoek in de configuratie-interface **Branding** naar de configuratie **Portaalfavicon**.

source: Click on the Upload an image button.
de: Klicken Sie auf den Button zum Hochladen einer Grafik.
es: Haga clic en el botón Cargar una imagen.
fr: Cliquez sur le bouton Ajouter une image.
nl: Klik op de knop "Een afbeelding uploaden".

source: Choose a favicon using the file finder.
de: Wählen Sie in der Dateisuche ein Favicon aus.
es: Elija un favicono mediante el selector de archivos.
fr: Choisissez une favicon avec l'outil de recherche de fichiers.
nl: Kies een favicon met behulp van de File Finder.

source: Once the favicon has been selected, click on the Save button in the top right corner.
de: Klicken Sie nach der Auswahl des Favicons auf den Speichern-Button in der rechten oberen Ecke.
es: Una vez seleccionado el favicon, haga clic en el botón Guardar de la esquina superior derecha.
fr: Une fois la favicon sélectionnée, cliquez sur le bouton Enregistrer en haut à droite.
nl: Eenmaal de favicon is geselecteerd, klik op de knop "Opslaan" in de rechter bovenhoek.

source: Adding a portal logo
de: Ein Portal-Logo hinzufügen
es: Añadir un logotipo del portal
fr: Ajouter un logo de portail
nl: Een portaallogo toevoegen

source: The logo is displayed in every header throughout the platform. The addition of a portal logo is optional. If one is added, for a default header, we advise to upload an image which height is 40px maximum.
de: Das Logo wird in jeder Kopfzeile auf der gesamten Plattform angezeigt. Das Hinzufügen eines Logos ist nicht obligatorisch. Wenn ein Logo hinzugefügt wird, empfehlen wir den Upload einer Grafik mit einer Höhe von maximal 40px.
es: El logotipo se visualiza en todos los encabezados de toda la plataforma. La adición de un logotipo del portal es opcional. Si va a añadir alguno, para un encabezado predeterminado, le aconsejamos cargar una imagen con una altura máxima de 40 px.
nl: Het logo wordt doorheen het volledige platform weergegeven in elke header. Het toevoegen van een portaallogo is optioneel. Wanneer er een wordt toegevoegd voor een standaard header, raden we aan om een afbeelding te uploaden met een maximale hoogte van 40px.

source: To add a new portal logo:
de: Hinzufügen eines neuen Portal-Logos:
es: Para añadir un logotipo del portal nuevo:
fr: Pour ajouter un nouveau logo de portail :
nl: Om een nieuw portaallogo toe te voegen:

source: In the **Branding** configuration interface, look for the **Portal logo** configuration.
de: Suchen sie die Konfiguration für das **Portal-Logo** in der **Branding**-Konfigurationsoberfläche.
es: En la interfaz de configuración **Personalización de marca**, busque la configuración **Logotipo del portal**.
fr: Dans l'interface de configuration **Personnalisation**, recherchez la configuration **Logo du portail**.
nl: Zoek in de configuratie-interface **Branding** naar de configuratie **Portaallogo**.

source: Make sure the *Display portal logo* toggle button is activated.
de: Vergewissern Sie sich, dass die Schaltfläche *Portal-Logo anzeigen* aktiviert ist.
es: Compruebe que el botón de alternancia *Visualizar logotipo de portal* esté activado.
fr: Vérifiez que le bouton *Afficher le logo du portail* est activé.
nl: Zorg ervoor dat de toggle-knop *Portaallogo weergeven* is geactiveerd.

source: Choose a logo using the file finder.
de: Wählen Sie in der Dateisuche ein Logo aus.
es: Elija un logotipo mediante el selector de archivos.
fr: Choisissez un logo avec l'outil de recherche de fichiers.
nl: Kies een logo met behulp van de File Finder.

source: Once the logo has been selected, click on the Save button in the top right corner.
de: Klicken Sie nach der Auswahl des Logos auf den Speichern-Button in der rechten oberen Ecke.
es: Una vez seleccionado el logotipo, haga clic en el botón Guardar de la esquina superior derecha.
fr: Une fois le logo sélectionné, cliquez sur le bouton Enregistrer en haut à droite.
nl: Eenmaal het logo is geselecteerd, klik op de knop "Opslaan" in de rechter bovenhoek.

source: Adding a login page logo
de: Ein Logo für die Anmeldeseite hinzufügen
es: Añadir un logotipo de página de inicio de sesión
fr: Ajouter un logo de page de connexion
nl: Een logo voor de inlogpagina toevoegen

source: The login page logo is displayed on the page where users can log in to the portal. By default, Opendatasoft's logo is displayed. It should be replaced with an image which width is 450px maximum.
de: Das Logo der Anmeldeseite wird auf der Seite angezeigt, auf der Nutzer sich bei dem Portal anmelden können. Standardmäßig wird das Opendatasoft-Logo angezeigt. Es sollte durch eine Bilddatei mit einer Breite von maximal 450px ersetzt werden.
es: El logotipo de página de inicio de sesión se visualiza en la página donde los usuarios pueden iniciar la sesión en el portal. Por defecto, se muestra el logotipo de Opendatasoft. Debe sustituirse por una imagen con un ancho máximo de 450 px.
nl: Het logo voor de inlogpagina wordt weergegeven in de pagina waar gebruikers kunnen inloggen op de pagina. Standaard wordt het logo van Opendatasoft weergegeven. Het zou vervangen moeten worden door een afbeelding met een maximale breedte van 450px.

source: To add a new login page logo:
de: Hinzufügen eines neuen Logos für die Anmeldeseite:
es: Para añadir un logotipo de página de inicio de sesión nuevo:
fr: Pour ajouter un nouveau logo de page de connexion :
nl: Om een nieuw logo voor de inlogpagina toe te voegen:

source: In the **Branding** configuration interface, look for the **Login page logo** configuration.
de: Suchen sie die Konfiguration für das **Logo der Anmeldeseite** in der **Branding**-Konfigurationsoberfläche.
es: En la interfaz de configuración **Personalización de marca**, busque la configuración **Logotipo de página de inicio de sesión**.
fr: Dans l'interface de configuration **Personnalisation**, recherchez la configuration **Logo de la page de connexion**.
nl: Zoek in de configuratie-interface **Branding** naar de configuratie **Logo inlogpagina**.

source: The portal name is used throughout the platform (login page, domain configurations, etc.) as well as in domain-related notifications sent by email. By default, the portal name is the domain identifier (i.e. the name written in the URL of the portal).
fr: Le nom du portail est utilisé dans toute la plateforme (page de connexion, configurations de domaines, etc.), ainsi que dans les notifications relatives au domaine, envoyées par e-mail. Par défaut, le nom du portail est l'identifiant du domaine (c.-à-d. le nom indiqué dans l'URL du portail).

source: The portal description helps search engines and social networks understand the content of the Opendatasoft portal. It may also show up in search results and links descriptions.
fr: La description du portail aide les réseaux sociaux et les moteurs de recherche à comprendre le contenu du portail Opendatasoft. Elle peut également apparaître dans les résultats de recherche et les descriptions de liens.

source: The logo is displayed in every header, throughout the platform. The addition of a portal logo is optional. If one is added, for a default header, we advise to upload an image which height is 40px maximum.
fr: Le logo est affiché dans tous les en-têtes, dans l'ensemble de la plateforme. L'ajout d'un logo au portail est optionnel. Si vous en ajoutez un, nous vous conseillons de charger une image d'une hauteur de 40 px maximum pour un en-tête par défaut.

source: The login page logo is displayed in the page where users can log in the portal. By default, Opendatasoft's logo is displayed. It should be replaced with an image which width is 450px maximum.
fr: Le logo de page de connexion s'affiche sur la page permettant aux utilisateurs de se connecter au portail. Le logo d'Opendatasoft est le logo affiché par défaut. Il doit être remplacé par une image avec une largeur de 450 px maximum.
