Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/api/odata/excel_integration.po
Languages: fr

source: Microsoft Excel integration
fr: Intégration dans Microsoft Excel

source: The OpenDataSoft OData service makes it possible to gather data directly from Microsoft Excel, without any programming knowledge. There are 3 ways to proceed: first, for Microsoft Excel 2013, the OData native integration can be used. For Excel 2010 and Excel 2013, PowerPivot and PowerQuery extensions can be used. This article will give a detailed explanation on how to do it.
fr: Dans le présent article, nous allons voir comment récupérer les données d'un service OData OpenDataSoft dans Microsoft Excel. Pour cela, il existe 3 façons de faire. Tout d'abord, pour la version 2013 de Microsoft Excel, il est possible d'utiliser l'intégration OData native pour récupérer les données. Ensuite, pour les versions 2010 et 2013, il est possible d'utiliser les extensions Microsoft PowerPivot et Microsoft PowerQuery pour récupérer ces données.

source: Native Integration
fr: Intégration native

source: Here are the steps that will allow you to import data through the Excel native OData integration.
fr: Voici les étapes permettant d'importer des données à partir de l'intégration OData native de Microsoft Excel.

source: Data sources supported natively by Microsoft Excel.
fr: La liste des sources de données supportées.

source: To import data from OpenDataSoft OData service, open Microsoft Excel and click the "DATA" tab. Once done, click "From Other Source". This should let you see the list of supported data sources. Select "From OData Feed".
fr: Pour importer des données depuis le service OData, ouvrez Microsoft Excel, et cliquez sur l'onglet nommé "DATA". Ceci fait, cliquez sur le bouton "From Other Source" pour voir la liste des sources de données supportées. Choisissez "From OData Feed".

source: Data feed connection form.
fr: Formulaire d'entrée de service.

source: In the address bar of the window that was opened, enter the service address. This address should be "http://platform.url/api/odata". Replace the platform.URL by the actual platform URL.
fr: Entrez ensuite l'adresse du service dans la barre d'adresse de la fenêtre qui s'est ouverte. Dans la plateforme OpenDataSoft, l'adresse relative du service OData est "/api/odata/".

source: Table selection window.
fr: Fenêtre de selection de table.

source: Select the table(s) of your choosing by clicking their checkbox.
fr: Choisissez ensuite la ou les tables qui serviront de source de données en cliquant sur le petit carré à gauche de l'identifiant du ou des jeu(x) de données qui vous intéresse(nt).

source: A table selected to become a data source.
fr: Une table sélectionnée pour utilisation comme source de données.

source: After validation, the "Import Data" window will open. Click "OK".
fr: Après validation, la fenêtre de sélection de destination s'ouvrira, cliquez sur "Ok".

source: The "Import Data" window.
fr: La fenêtre de selection de destination.

source: Your data are now displayed in the Microsoft Excel cells.
fr: Vos données apparaissent maintenant dans les cellules de Microsoft Excel.

source: Imported data in Microsoft Excel.
fr: Exemple de données importées.

source: Here are the steps that will allow you to import data through PowerPivot for Microsoft Excel.
fr: Voici les étapes permettant d'importer des données à partir de PowerPivot pour Microsoft Excel.

source: "Add-Ins" tab in the Microsoft Excel settings window.
fr: L'onglet "Add-Ins" de la fenêtre d'options de Microsoft Excel.

source: Before you can use PowerPivot, you must activate it. To do so, open the "Add-ins" tab in the Microsoft Excel settings window. In the "Manage" drop down menu, select "COM Add-ins" and click "Go...".
fr: Avant d'utiliser PowerPivot, il est nécessaire de l'activer. Pour cela, rendez vous dans les options de Microsoft Excel, dans l'onglet "Add-Ins". Dans la boîte de sélection multiple nommée "Manage", choisissez "COM Add-ins" et cliquez sur "Go...".

source: The COM add ins selection window.
fr: La fenêtre de selection d'add-ins COM.

source: In the window that was just opened, select "Microsoft PowerPivot for Excel 2013" or "Microsoft PowerPivot for Excel 2010", whichever applies.
fr: Dans la fenêtre qui s'ouvre, sélectionnez "Microsoft PowerPivot for Excel 2013" si vous utilisez Microsoft Excel 2013, ou "Microsoft PowerPivot for Excel 2010" si vous utilisez Microsoft Excel 2010.

source: PowerPivot menu bar.
fr: La barre de menu PowerPivot.

source: Back in Microsoft Excel main window click the "POWERPIVOT" tab to display the PowerPivot menu bar. In it, click the "Manage" button. It will open a source management window.
fr: De retour dans la fenêtre principale de Microsoft Excel, cliquez sur l'onglet "POWERPIVOT" pour afficher la barre de menu PowerPivot. Dans celui-ci, cliquez sur le bouton "Manage" pour afficher la fenêtre de gestion des sources de données PowerPivot.

source: Data sources management window.
fr: La fenêtre de gestion des sources de données PowerPivot.

source: In this window, click "Get External Data", and in the menu that appears, click "From Data Service". In the second menu that appears, click "From OData Data Feed"
fr: Dans la fenêtre de gestion des sources de données PowerPivot, cliquez sur "Get External Data", puis, dans le menu qui apparaît, sur "From Data Service", et dans le deuxième menu qui apparaît, sur "From OData Data Feed".

source: Data feed connection window.
fr: Fenêtre d'import de tables de PowerPivot.

source: In the import window that was opened, enter the OpenDataSoft OData service in the address bar.
fr: Dans la fenêtre d'import qui s'ouvre, entrez l'adresse du service OData de OpenDataSoft dans la barre d'adresse.

source: In the table selection window, select the dataset(s) of your choosing by clicking their checkbox. Once done, click "Finish".
fr: Dans la fenêtre de sélection de tables, sélectionnez la ou les jeu(x) de données qui vous intéressent en cliquant sur le carré à droite de l'identifiant de celle(s)-ci, et cliquez sur "Finish".

source: Data transfer window.
fr: La fenêtre de transfert de données.

source: When the transfer window shows a success indicator, close it with the "Close" button on the bottom right.
fr: Lorsque la fenêtre de transfert montre un indicateur de succès, fermez la en cliquant sur le bouton "Close" en bas à droite.

source: Data preview.
fr: L'aperçu des données dans la fenêtre de gestion des sources de données.

source: You can now verify the integrity of your data om the data source management window.
fr: Vous pouvez vérifier l'intégrité de vos données dans la fenêtre de gestion des sources de données, qui montre maintenant les données importées du service OData OpenDataSoft.

source: The data import list in PowerPivot.
fr: La liste des types d'import de données de PowerPivot.

source: In the Microsoft Excel main window, click "PivotTable", and in the popped up list, click "PivotTable".
fr: Cliquez sur "PivotTable", puis, dans la liste qui apparaît, sur "PivotTable" pour afficher vos données dans la fenêtre principale de Microsoft Excel.

source: The destination selection window.
fr: La fenêtre de selection de destination.

source: In the destination selection window, select the worksheet of your choosing, and click "OK".
fr: Dans la fenêtre de sélection de destination qui apparaît, choisissez la feuille de calcul de destination dans laquelle importer vos données.

source: Data aggregation using PowerPivot.
fr: Exemple d'agrégation de données dans Microsoft Excel en utilisant l'intégration PowerPivot.

source: Here are the steps that will allow you to import data through Power Query for Microsoft Excel.
fr: Voici les étapes permettant d'importer des données à partir de Power Query pour Microsoft Excel.

source: Before you can use Power Query, you must download and activate it. To download it, visit `this link <http://www.microsoft.com/en-us/download/details.aspx?id=39379>`_. The activation process is similar to that of PowerPivot.
fr: Avant de pouvoir utiliser Microsoft Power Query pour Microsoft Excel, il est nécessaire de le télécharger et de l'activer. Son téléchargement peut être fait sur le site officiel de Microsoft à `cette adresse <http://www.microsoft.com/en-us/download/details.aspx?id=39379>`_. Pour l'activation de l'add-in, veuillez suivre les instructions des points 1.2.1 et 1.2.2.

source: Data sources supported by Microsoft Power Query.
fr: La liste des sources de données supportées par Microsoft Power Query.

source: Once done, return to Microsoft Excel main window, click "POWER QUERY" to display its menu bar. In the "POWER QUERY" menu bar, click "From Other Sources". You should see a list with all data sources supported by Microsoft Power Query.
fr: Une fois l'add-in téléchargé et activé, retournez sur la fenêtre principale de Microsoft Excel, cliquez sur l'onglet "POWER QUERY" pour afficher la barre de menu Power Query. Dans celle-ci, cliquez sur le bouton "From Other Sources" pour afficher la liste des sources de données supportées dans Power Query.

source: OData data source selection window.
fr: La fenêtre de selection du service de données OData.

source: In this window, enter the OpenDataSoft OData service URL and click "OK".
fr: Dans la fenêtre qui s'affiche, entrez l'adresse du service OData d'OpenDataSoft et cliquez sur "OK".

source: Power Query navigation window.
fr: La fenêtre de navigation de Microsoft Power Query.

source: Once done, a Power Query navigation window will be displayed on the right hand side of the main window. In it, click the IDs of the table of your choosing.
fr: Ceci fait, une fenêtre de navigation Power Query s'affiche sur la droite de la fenêtre principale de Microsoft. Dans celle ci, cliquez sur l'identifiant de la table qui vous intéresse.

source: Imported data through Power Query.
fr: Exemple de données importées dans Microsoft Excel en utilisant Microsoft Power Query.

source: Your data is now displayed in the Microsoft Excel cells.
fr: Vos données apparaissent maintenant dans les cellules de Microsoft Excel.
