Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/02_configuring_navigation/navigation.po
Languages: de, es, fr, nl

source: Configuring the navigation
de: Die Navigation konfigurieren
es: Configurar la navegación
fr: Configurer la navigation
nl: De navigatie configureren

source: Users generally start their discovery of an Opendatasoft domain with the root page and then navigate to other available pages using the header located at the top of any interface in the front office. Both are configurable via the **Look and feel > Navigation** subsection of the back office.
de: Nutzer lernen eine Opendatasoft-Domain im Allgemeinen über die Startseite kennen und navigieren dann über die Kopfzeile, die sich auf jeder Oberfläche im Frontoffice ganz oben befindet, zu anderen verfügbaren Seiten. Beide Bereiche lassen sich über den Unterabschnitt **Aussehen & Eindruck > Navigation** im Backoffice konfigurieren.
fr: En général, les utilisateurs commencent à découvrir un domaine Opendatasoft avec la page racine. Ils parcourent ensuite les autres pages disponibles à l'aide de l'en-tête situé en haut de chaque page de l'interface de navigation. Ces éléments peuvent être configurés dans la sous-section **Apparence > Navigation** de l'interface d'administration.
nl: Over het algemeen starten gebruikers met hun ontdekking van een Opendatasoft-domein met de startpagina en vervolgens navigeren ze naar andere beschikbare pagina's door gebruik te maken van de header die bovenaan elke interface in de front-office staat. Beide kunnen worden geconfigureerd via de subafdeling **Look and feel > Navigatie** van de back-office.

source: Choosing a root page
de: Eine Startseite auswählen
es: Elegir una página raíz
fr: Choisir une page racine
nl: Een startpagina kiezen

source: The root page is the default page on which a user lands when accessing the portal via its main URL (for example, ``domainname.opendatasoft.com``). By default, the root page is the Explore page, which displays the catalog of datasets of the portal. It can be replaced with any other page available within the domain, such as a home page build with HTML & CSS using the Pages section of the back office (see :doc:`Creating content </creating_content/index>`).
de: Die Startseite ist die Standardseite, die dem Nutzer angezeigt wird, wenn er über die Haupt-URL auf das Portal zugreift (z.B. ``domainname.opendatasoft.com``). Standardmäßig ist die Startseite auch die Seite zum Durchsuchen, die den Datensatzkatalog des Portals anzeigt. Sie kann durch eine beliebige andere verfügbare Seite der Domain ersetzt werden, etwa eine mit HTML & CSS im Backoffice-Bereich "Seiten" erstellte Homepage (siehe :doc:`Inhalt erstellen </creating_content/index>`).
fr: La page racine est la page par défaut sur laquelle un utilisateur atterrit lorsqu'il accède au portail via son URL principale (par exemple, ``domainname.opendatasoft.com``). La page Explorer, qui contient le catalogue de jeux de données du portail, est la page racine par défaut. Elle peut être remplacée par une autre page disponible au sein du domaine, comme une page d'accueil créée avec HTML et CSS, via la section Pages de l'interface d'administration (voir :doc:`Créer du contenu </creating_content/index>`).
nl: De startpagina is de standaard pagina waarop een gebruiker terechtkomt wanneer hij naar het portaal gaat via zijn hoofd-URL (bijv. ``domainname.opendatasoft.com``). De startpagina is standaard de Explore-pagina waarin de catalogus van datasets van het portaal staat weergegeven. Deze kan vervangen worden door elke andere pagina die beschikbaar is binnen het domein, zoals een homepagina die gebouwd is met HTML & CSS met behulp van de afdeling Pagina's van de back-office (zie :doc:`Content aanmaken </creating_content/index>`).

source: To change the root page:
de: Änderung der Startseite:
es: Para cambiar la página raíz:
fr: Pour changer la page racine :
nl: Om de startpagina te wijzigen:

source: In the **Navigation** configuration interface, look for the **Root page** configuration.
de: Suchen Sie die Konfiguration für die **Startseite** in der Konfigurationsoberfläche **Navigation**.
es: En la interfaz de configuración **Navegación**, busque la configuración **Página raíz**.
fr: Dans l'interface de configuration **Navigation**, recherchez la configuration **Page racine**.
nl: Zoek in de configuratie-interface **Navigatie** naar de configuratie **Startpagina**.

source: Click on the drop-down menu to choose a page among the list.
de: Klicken Sie auf das Dropdown-Menü, um eine Seite aus der Liste auszuwählen.
es: Haga clic en el menú desplegable para elegir una página de la lista.
fr: Cliquez sur le menu déroulant pour choisir une page dans la liste.
nl: Klik op het drop-down menu om een pagina te kiezen uit de lijst.

source: Click on the Save button in the top right corner.
de: Klicken Sie oben rechts auf den Button Speichern.
es: Haga clic en el botón Guardar en la esquina superior derecha.
fr: Cliquez sur le bouton Enregistrer en haut à droite.
nl: Klik op de knop Opslaan in de rechter bovenhoek.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: All available pages are displayed in the drop-down list, but private pages are grayed out. Only public pages can indeed be chosen as the root page.
de: Alle verfügbaren Seiten werden in der Dropdown-Liste angezeigt, private Seiten allerdings inaktiv in grau, da nur öffentliche Seiten als Startseite ausgewählt werden können.
fr: Toutes les pages disponibles sont répertoriées dans la liste déroulante, mais les pages privées sont grisées. En effet, seules les pages publiques peuvent être choisies en tant que pages racines.
nl: Alle beschikbare pagina's staan weergegeven in de drop-down lijst maar private pagina's worden in het grijs weergegeven. Het is immers zo dat enkel publieke pagina's gekozen kunnen worden als startpagina.

source: Configuring the navigation header
de: Die Kopfzeile der Navigation konfigurieren
es: Configurar el encabezado de navegación
fr: Configurer l'en-tête de navigation
nl: De navigatieheader configureren

source: The navigation header located at the very top of any page of the front office contains items that link to either chosen pages of the portal or external websites. The default menu items of the navigation header are:
de: Die Kopfzeile der Navigation, die sich ganz oben auf allen Seiten des Frontoffice befindet, enthält Elemente, die entweder auf ausgewählte Seiten des Portals oder externe Websites verweisen. Folgende Elemente sind standardmäßig Teil der Kopfzeile der Navigation:
fr: L'en-tête de navigation, situé tout en haut de chaque page de l'interface de navigation, contient des éléments qui renvoient vers des pages données du portail ou des sites Web externes. Les éléments du menu par défaut de l'en-tête de navigation sont :
nl: De navigatieheader die helemaal bovenaan elke pagina van de front-office staat, bevat items die ofwel de koppeling vormen naar gekozen pagina's van het portaal, ofwel naar externe websites. De standaard menu-items van de navigatieheader zijn:

source: Data, with a link to the Explore page
de: Daten, mit einem Link zur Durchsuchungsseite
es: Datos, con un vínculo a la página Explorar
fr: Données, avec un lien vers la page Explorer
nl: Data, met een link naar de Explore-pagina

source: Maps, with a link to the Map Builder
de: Karten, mit einem Link zum Kartenersteller
es: Mapas, con un vínculo al compilador de mapas
fr: Cartes, avec un lien vers l'éditeur de cartes
nl: Kaarten, met een link naar de Map Builder

source: Charts, with a link to the Chart Builder
de: Diagramme, mit einem Link zum Diagrammersteller
es: Gráficos, con un vínculo al compilador de gráficos
fr: Graphes, avec un lien vers l'éditeur de graphes
nl: Grafieken, met een link naar de Chart Builder

source: API, with a link to the Search API console
de: API, mit einem Link zur Such-API-Konsole
es: API, con un vínculo a la consola de API de búsqueda
fr: API, avec un lien vers la console d'API de recherche
nl: API, met een link naar de Search API-console

source: Documentation, with a link to the Opendatasoft Help Hub
de: Dokumentation, mit einem Link zum Opendatasoft-Hilfe-Center
es: Documentación, con un vínculo a la central de ayuda de Opendatasoft
fr: Documentation, avec un lien vers Help Hub Opendatasoft
nl: Documentatie, met een link naar de Help Hub van Opendatasoft

source: We highly advise to keep in the navigation header the link to the Explore page that contains the datasets catalog of the portal.
de: Wir empfehlen dringend, den Link zur Suchseite, die den Datensatzkatalog des Portals enthält, in der Kopfzeile der Navigation zu belassen.
es: Recomendamos vivamente mantener en el encabezado de navegación el vínculo a la página Explorar que contiene el catálogo de conjuntos de datos del portal.
fr: Nous vous recommandons vivement de conserver le lien vers la page Explorer, qui contient le catalogue de jeux de données du portail, dans l'en-tête de navigation.
nl: We adviseren sterk om in de navigatieheader de link naar de Explore-pagina te behouden die de catalogus met datasets van het portaal bevat.

source: To configure the navigation header, look for the **Header** configuration in the **Navigation** configuration interface.
de: Um die Kopfzeile der Navigation anzupassen, suchen Sie die Konfiguration für die **Kopfzeile** in der Konfigurationsoberfläche **Navigation**.
es: Para configurar el encabezado de navegación, busque la configuración **Encabezado** en la interfaz de configuración **Navegación**.
fr: Pour configurer l'en-tête de navigation, recherchez la configuration **Menu d'en-tête** dans l'interface de configuration **Navigation**.
nl: Om de navigatieheader te configureren, zoek in de configuratie-interface **Navigatie** naar de configuratie **Header**.

source: Adding a new menu item
de: Hinzufügen eines neuen Menü-Elements
es: Añadir un nuevo elemento de menú
fr: Ajouter un nouvel élément de menu
nl: Een nieuw menu-item toevoegen

source: Click on the + Add menu item button.
de: Klicken Sie auf den Button + Menü-Item hinzufügen
es: Haga clic en el botón + Añadir elemento de menú.
fr: Cliquez sur le bouton + Ajouter un élément au menu.
nl: Klik op de knop "Menu-item toevoegen".

source: In the textbox of the Page URL column, write or paste the link to the new item. External links must start with ``http://`` or ``https://``
de: Notieren oder kopieren Sie den Link des neuen Elements in die Textbox der Seiten-URL-Spalte. Externe Links müssen mit ``http://`` oder ``https://`` beginnen
fr: Dans la zone de texte de la colonne URL de page, saisissez ou collez le lien du nouvel élément. Les liens externes doivent commencer par ``http://`` ou ``https://``.
nl: Schrijf of plak in het tekstvak van de kolom Pagina URL de link naar het nieuwe item. Externe links moeten beginnen met ``http://`` of ``https://``

source: (optional) If the link is an external one, tick the *Open link in a new tab/window* option box for it to do so.
de: (optional) Wenn es sich um einen externen Link handelt, markieren Sie, sofern Sie es wünschen, das Kontrollkästchen *Link in neuem Tab/Fenster öffnen*.
es: (Opcional) Si el vínculo es externo, seleccione el cuadro de opcíon *Abrir vínculo en una ficha/ventana nueva* para hacerlo.
fr: (optionnel) Si le lien est un lien externe, cochez l'option *Ouvrir le lien dans une nouvelle fenêtre / un nouvel onglet* pour appliquer ce comportement.
nl: (Optioneel) Wanneer de link een externe link is, vink het keuzevakje *Open link in een nieuw tabblad/venster* aan.

source: In the textbox(es) of the Label column, write the label of the menu item that will be displayed in the navigation header. There should be one label per language available on the portal.
de: Notieren Sie die Beschriftung des Menü-Elements, die in der Kopfzeile der Navigation angezeigt werden soll, in der/den Textbox(en) der Beschriftungsspalte. Für jede auf dem Portal verfügbare Sprache sollte eine Beschriftung vorliegen.
fr: Dans les zones de texte de la colonne Label, entrez le label de l'élément de menu qui s'affichera dans l'en-tête de navigation. Un label doit être saisi par langue disponible sur le portail.
nl: Schrijf in het/de tekstvak(ken) van de kolom Label het label van het menu-item dat weergegeven zal worden in de navigatieheader. Er dient één label per taal beschikbaar te zijn op het portaal.

source: (optional) Click on the reordering icon |icon-reorder| to place the menu item in a chosen position among the other menu items.
de: (optional) Klicken Sie auf das Icon zur erneuten Anordnung |icon-reorder|, um das Menü-Element an der gewünschten Position innerhalb der anderen Menü-Elemente zu platzieren.
es: (Opcional) Haga clic en el icono de reordenar |icon-reorder| para colocar el elemento de menú en una posición determinada entre los demás elementos de menú.
fr: (optionnel) Cliquez sur l'icône de réorganisation |icon-reorder| pour placer l'élément de menu à un emplacement donné parmi les autres éléments de menu.
nl: (optioneell) Klik op het icoon |icon-reorder| om het menu-item in een gekozen positie tussen de andere menu-items te plaatsen.

source: Deleting a menu item
de: Löschen eines Menü-Elements
es: Suprimir un elemento de menú
fr: Supprimer un élément de menu
nl: Een menu-item wissen

source: Click on the trash icon |icon-trash| to delete a menu item.
de: Klicken Sie auf das Papierkorb-Icon |icon-trash|, um ein Menü-Element zu löschen.
es: Haga clic en el icono de papelera |icon-trash| para suprimir un elemento de menú.
fr: Cliquez sur l'icône de suppression |icon-trash| pour supprimer un élément de menu.
nl: Klik op het icoon |icon-trash| om een menu-item te wissen.

source: Users generally start their discovery of an Opendatasoft domain with the root page, and then navigate to other available pages using the header located at the top of any interface in the front office. Both are configurable via the **Look and feel > Navigation** subsection of the back office.
es: Los usuarios suelen iniciar el descubrimiento de un dominio de Opendatasoft con la página raíz, para después navegar a otras páginas disponibles a partir del encabezado que se encuentra en la parte superior de cualquier interfaz del front office. Ambos elementos se pueden configurar en la subsección **Apariencia > Navegación** del back office.

source: The root page is the default page on which a user lands when accessing the portal via its main URL (e.g. ``domainname.opendatasoft.com``). By default, the root page is the Explore page, which displays the catalog of datasets of the portal. It can be replaced with any other page available within the domain, such as a home page build with HTML & CSS using the Pages section of the back office (see :doc:`Creating content </creating_content/index>`).
es: La página raíz es la página predeterminada a la que accede un usuario al introducirse en el portal a través de su URL principal (p. ej. ``domainname.opendatasoft.com``). Por defecto, la página raíz es la página Explorar, que muestra el catálogo de conjuntos de datos del portal. Se puede sustituir por cualquier otra página disponible en el dominio, como una página de inicio construida con HTML y CSS en la sección Páginas del back office (consulte :doc:`Crear una página de contenido </creating_content/index>`).

source: All available pages are displayed in the drop-down list, but private pages are grayed out. Only public pages can indeed be chosen as root page.
es: Todas las páginas disponibles aparecen en la lista, pero las páginas privadas están atenuadas. En realidad, solo es posible elegir como página raíz una página pública.

source: The navigation header located at the very top of any page of the front office contains items that link to either chosen pages of the portal, or external websites. The default menu items of the navigation header are:
es: El encabezado de navegación de la parte superior de cualquier página del front office contiene elementos que vinculan o bien a unas páginas determinadas del portal o bien a sitios web externos. Los elementos de menú predeterminados del encabezado de navegación son:

source: In the textbox of the Page URL column, write or paste the link of the new item. External links must start with ``http://`` or ``https://``
es: En el cuadro de texto de la columna Dirección URL de página, escriba o pegue el vínculo del nuevo elemento. Los vínculos externos deben empezar por ``http://`` o ``https://``.

source: In the textbox(es) of the Label column, write the label of the menu item, that will be displayed in the navigation header. There should be one label per language available on the portal.
es: En los cuadros de texto de la columna Etiqueta, escriba la etiqueta del elemento de menú que se mostrará en el encabezado de navegación. Debe haber una etiqueta por idioma disponible en el portal.
