Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/06_customizing_domain_url/custom_urls.po
Languages: de, es, fr, nl

source: Customizing your domain URL
de: Anpassen Ihrer Domain-URL
es: Personalizar la dirección URL de dominio
fr: Personnaliser l'URL de votre domaine
nl: De URL van uw domein aanpassen

source: A new Opendatasoft domain has one URL, in the form ``<domain>.opendatasoft.com``.
de: Eine neue Opendatasoft-Domain hat eine URL im Format "<domain>.opendatasoft.com".
es: Un dominio de Opendatasoft nuevo tiene una dirección URL con el formato ``<domain>.opendatasoft.com``.
nl: Een nieuw Opendatasoft-domein heeft één URL onder de vorm ``<domain>.opendatasoft.com``.

source: As the domain URL is a very important tool for discoverability, branding and ease of access, there will often be a need to customize this URL. As such, the Opendatasoft platform allows for adding additional names to a domain. These customization options are currently not exposed in the back office, and must be requested by using the support form in the back office. The customization options are detailed below.
de: Da eine Domain-URL ein äußerst wichtiges Mittel für die Auffindbarkeit, Markenbildung und leichte Zugänglichkeit ist, muss diese URL oft angepasst werden. Die Opendatasoft-Plattform ermöglicht es, Namen zu einer Domain hinzuzufügen. Diese Anpassungsoptionen werden gegenwärtig nicht im Back-Office bereitgestellt und müssen über das Support-Formular im Back-Office angefordert werden. Im Folgenden werden die Anpassungsoptionen beschrieben.
es: Dado que la dirección URL de dominio es una herramienta muy importante en términos de detectabilidad, personalización de marca y accesibilidad, a menudo será necesario personalizar esta dirección URL. De ahí que la plataforma Opendatasoft permita añadir direcciones URL a un dominio. Actualmente estas opciones de personalización no están expuestas en el back office, y deben solicitarse a través del formulario de soporte del back office. A continuación se describen las opciones de personalización.
nl: Aangezien de URL van een domein een zeer belangrijke tool is met het oog op onderzoekbaarheid, branding en het feit er gemakkelijk toegang toe te hebben, zal deze URL vaak moeten worden aangepast. Als dusdanig biedt het Opendatasoft-platform de mogelijkheid om extra namen aan een domein toe te voegen. Deze aanpassingsopties zijn momenteel niet beschikbaar in de back office en moeten aangevraagd worden met het ondersteuningsformulier in de back office. De aanpassingsopties staan hieronder gedetailleerd uiteengezet.

source: In the following, the domain *name* will represent the first, base name of an Opendatasoft domain, and we will call any additional names *aliases*. The names are actually the host part of the URLs used to access the domain.
de: Im Folgenden stellt die Domain *name* den ersten Basisnamen einer Opendatasoft-Domain dar. Alle weiteren Namen nennen wir *aliases*. Die Namen sind der Host-Teil der URLs, die für den Zugriff auf die Domain verwendet werden.
es: En adelante, el *nombre* de dominio representará el nombre base de un dominio de Opendatasoft, y todos los nombres adicionales se llamarán *alias*. Los nombres realmente son la parte del host de las direcciones URL utilizadas para acceder al dominio.
nl: In onderstaande tekst zal het domein "naam" de eerste, basisnaam van een Opendatasoft-domein vertegenwoordigen en zullen we eventuele extra namen "aliassen" noemen. De namen zijn immers het host-gedeelte van de URL's die gebruikt worden om toegang te hebben tot het domein.

source: Opendatasoft aliases
de: Aliase von Opendatasoft
es: Alias de Opendatasoft
nl: Opendatasoft-aliassen

source: It is possible to add additional Opendatasoft domain aliases that will be used to access the domain. It is in the form ``<alias>.opendatasoft.com``, where ``alias`` is a word composed of lowercase alphanumeric characters and hyphens. Some names are reserved and not available as domain names or aliases. Ambiguous names should be avoided in order to prevent possible confusion with other Opendatasoft domains.
de: Sie können eine zusätzliche Opendatasoft-URL hinzufügen, die dem Zugriff auf die Domain dient. Sie hat das Format "<alias>.opendatasoft.com", wobei "alias" für ein Wort steht, das aus kleingeschriebenen alphanumerischen Zeichen und Bindestrichen besteht. Einige Namen sind vorbehalten und nicht als Domainnamen oder Aliase geeignet. Mehrdeutige Namen sollten vermieden werden, um mögliche Verwechslungen mit anderen Opendatasoft-Domains zu vermeiden.
es: Se pueden añadir alias de dominios de Opendatasoft que servirán para acceder al dominio. El formato es ``<alias>.opendatasoft.com``, donde ``alias`` es una palabra formada por caracteres alfanuméricos en minúsculas y guiones. Algunos nombres están reservados y no están disponibles como nombres o alias de dominios. Recomendamos no emplear nombres ambiguos para evitar la confusión con otros dominios de Opendatasoft.
nl: Het is mogelijk om bijkomende Opendatasoft-domeinaliassen toe te voegen die gebruikt zullen worden om toegang te hebben tot het domein. Deze zijn terug te vinden onder de vorm ``<alias>.opendatasoft.com``, waarbij "alias" een woord is dat samengesteld is uit alfanumerieke karakters in kleine letters en koppeltekens. Sommige namen zijn voorbehouden en zijn niet beschikbaar als domeinnamen of aliassen. Dubbelzinnige namen dienen te worden vermeden om mogelijke verwarring met andere Opendatasoft-domeinen te voorkomen.

source: Customer-provided DNS aliases
de: Vom Kunden bereitgestellte DNS-Aliase
es: Alias de DNS facilitados por clientes
fr: Alias DNS fournis par le client
nl: Door klanten voorziene DNS-aliassen

source: It is also possible to change the base URL of an Opendatasoft domain to a custom domain name whose authoritative DNS server one controls. For instance, a company called "Example" has an Opendatasoft domain named ``example``. Its main URL is ``example.opendatasoft.com``, but this customer might want to set up their domain in order to use the alias ``data.example.com``.
de: Sie können die Basis-URL einer Opendatasoft-Domain auch durch einen benutzerdefinierten Domainnamen ersetzen, dessen autoritativer DNS-Server Ihrer Kontrolle unterliegt. So könnte etwa eine Firma mit dem Namen "Muster" eine Opendatasoft-Domain mit der Bezeichnung "muster" haben. Die Haupt-URL lautet "muster.opendatasoft.com", doch der Kunde möchte seine Domain so einrichten, dass der Alias "data.muster.com" verwendet wird.
es: También puede cambiar la dirección URL base de un dominio de Opendatasoft para un nombre de dominio personalizado cuyo servidor DNS autoritativo esté bajo su control. Por ejemplo, una empresa denominada "Example" tiene un dominio de Opendatasoft llamado ``example``. Su dirección URL principal es ``example.opendatasoft.com``, pero ese cliente desea configurar su dominio para utilizar el alias ``data.example.com``.
nl: Het is ook mogelijk om de basis-URL van een Opendatasoft-domein te wijzigen naar een aangepaste domeinnaam waarvan de autoritatieve DNS-server er één controleert. Bijvoorbeeld: een onderneming met de naam "Voorbeeld" heeft een Opendatasoft-domein met de naam "voorbeeld". De hoofd-URL ervan is ``example.opendatasoft.com``, maar i het is mogelijk dat deze klant zijn domein wil instellen om het alias ``data.example.com`` te gebruiken.

source: This can be done in 2 steps:
de: Das kann in 2 Schritte erfolgen:
es: Puede realizar esta operación en 2 pasos:
fr: Cela peut être fait en 2 étapes :
nl: Dit kan in 2 stappen gebeuren:

source: Create a DNS record of the ``CNAME`` type for the desired name with the default name of one's Opendatasoft domain as a value.
de: Erstellen Sie zunächst einen DNS-Eintrag des Typs "CNAME" für den gewünschten Namen mit dem Standardnamen einer Opendatasoft-Domain als Wert.
es: Cree un registro DNS del tipo ``CNAME`` para el nombre deseado con el nombre predeterminado del dominio de Opendatasoft propio como valor.
nl: Een DNS-record van het type ``CNAME`` aanmaken voor de gewenste naam met de standaard naam van iemands Opendatasoft-domein als waarde.

source: A trailing dot after after a DNS name means an absolute name, instead of a relative one. In DNS configuration, names are usually relative by default, so ``data.example.com`` would actually mean ``data.example.com.example.com.``, which is generally not wanted.
de: Ein nachgestellter Punkt nach einem DNS-Namen bedeutet einen absoluten Namen und keinen relativen. In der DNS-Konfiguration sind die Namen normalerweise relativ, d. h. "data.muster.com" würde eigentlich "data.muster.com.example.com." bedeuten, was in der Regel nicht erwünscht ist.
es: El punto final tras un nombre DNS significa que es un nombre absoluto, en lugar de uno relativo. En la configuración DNS, los nombres suelen ser relativos de forma predeterminada, por lo que ``data.example.com`` en realidad significaría ``data.example.com.example.com.``, lo que en general no es deseable.
fr: Un point final après un nom DNS signifie un nom absolu, au lieu d'un nom relatif. Dans la configuration DNS, les noms sont généralement relatifs par défaut, donc ``data.exemple.com`` signifierait réellement ``data.exemple.com.exemple.com.``, ce qui n'est généralement pas souhaité.
nl: Een trailing dot na een DNS-naam betekent een absolute naam in plaats van een relatieve naam. In de DNS-configuratie zijn namen standaard meestal relatief. Dus zou ``data.example.com`` in feite betekenen ``data.example.com.example.com.``, wat over het algemeen niet gewild is.

source: The DNS record for the above example would look like this: ``data.example.com. IN CNAME example.opendatasoft.com.``
de: Der DNS-Eintrag für das obige Beispiel würde so aussehen: "data.muster.com. IN CNAME muster.opendatasoft.com."
es: El registro DNS del ejemplo anterior tendría este aspecto: ``data.example.com. IN CNAME example.opendatasoft.com.``
fr: L'enregistrement DNS pour l'exemple ci-dessus ressemblerait à ceci: ``data.exemple.com. IN CNAME exemple.opendatasoft.com.``
nl: Het DNS-record voor bovenstaand voorbeeld zou er als volgt uitzien: ``data.example.com. IN CNAME example.opendatasoft.com.``

source: If one's DNS provider uses relative names, it can look like this: ``data IN CNAME example.opendatasoft.com.``
de: Wenn der eigene DNS-Provider relative Namen verwendet, könnte er so aussehen: "data IN CNAME muster.opendatasoft.com."
es: Si el proveedor DNS propio utiliza nombres relativos, puede tener este aspecto: ``data IN CNAME example.opendatasoft.com.``
fr: Si le fournisseur DNS utilise des noms relatifs, il peut ressembler à ceci: ``data IN CNAME exemple.opendatasoft.com.``
nl: Wanneer iemands DNS-provider relatieve namen gebruikt, kan deze er als volgt uitzien: ``data IN CNAME example.opendatasoft.com.``

source: One's DNS provider will usually have documentation explaining how to setup custom entries using their interface.
de: Der eigene DNS-Provider bietet in der Regel eine Dokumentation, in der erklärt wird, wie man benutzerdefinierte Einträge über seine Schnittstelle einrichtet.
es: El proveedor DNS propio normalmente tendrá documentación que explique cómo configurar las entradas personalizadas mediante su interfaz.
fr: Votre fournisseur DNS disposera généralement d'une documentation expliquant comment configurer des entrées personnalisées à l'aide de son interface.
nl: Iemands DNS-provider zal meestal over documentatie beschikken waarin staat uitgelegd hoe aangepaste items kunnen worden ingesteld met behulp van hun interface.

source: The new name must be registered as an alias of the main domain on the Opendatasoft platform. To do so, please contact the Opendatasoft support by using the support form in the back office.
de: Der neue Name muss als Alias der Hauptdomain auf der Opendatasoft-Plattform registriert werden. Kontaktieren Sie dazu den Support von Opendatasoft unter Verwendung des Support-Formulars im Back-Office.
es: El nombre nuevo debe registrarse como un alias del dominio principal en la plataforma Opendatasoft. Para ello, póngase en contacto con el equipo de soporte de Opendatasoft a través del formulario de soporte del back office.
nl: De nieuwe naam moet geregistreerd worden als een alias van het hoofddomein van het Opendatasoft-platform. Om dit te doen, gelieve contact op te nemen met het support team van Opendatasoft door het gebruik te maken van het ondersteuningsformulier in de back office.

source: Any number of distinct DNS names can be added to an Opendatasoft domain. Though all domain names and aliases can be used to access the domain simultaneously, the first alias will be used by default for URLs generated to access the site from outside (in a notification email for example). User login sessions are also specific to a domain name, so it is possible for a user to be authenticated when accessing a domain via one alias and unauthenticated (anonymous) on another alias or the main name.
de: Einer Opendatasoft-Domain können beliebig viele unterschiedliche DNS-Namen hinzugefügt werden. Obwohl alle Domainnamen und Aliase gleichzeitig für den Zugriff auf die Domain verwendet werden können, wird der erste Alias standardmäßig für URLs verwendet, die für den Zugriff auf die Website von außen generiert werden (z. B. in einer Benachrichtigungs-E-Mail). Auch sind Benutzer-Login-Sitzungen spezifisch für einen Domainnamen: so ist es möglich, dass ein Benutzer beim Zugriff auf eine Domain über einen Alias und unauthentifiziert (anonym) über einen anderen Alias oder den Hauptnamen authentifiziert wird.
es: Puede añadir cualquier número de nombres DNS a un dominio de Opendatasoft. Aunque se pueden usar simultáneamente todos los nombres y alias de dominio para acceder al dominio, de forma predeterminada el primer alias se usará para las direcciones URL generadas para acceder al sitio desde el exterior (por ejemplo, en un correo electrónico de notificación). Las sesiones de inicio de sesión del usuario también son específicas de un nombre de dominio, de modo que puede suceder que un usuario sea autenticado al acceder a un dominio a través de un alias y no sea autenticado (anónimo) con otro alias o nombre principal.
nl: Er kan een onbeperkt aantal afzonderlijke DNS-namen worden toegevoegd aan een Opendatasoft-domein. Hoewel alle domeinnamen en aliassen gebruikt worden om gelijktijdig toegang te krijgen tot het domein, zal het eerste alias standaard gebruikt worden voor URL's die zijn gegenereerd om van buitenaf toegang te krijgen tot de site (bijvoorbeeld in een kennisgevingse-mail). Inlogsessies van gebruikers zijn ook specifiek voor een domeinnaam. Het is dus mogelijk dat een gebruiker kan worden geauthentificeerd wanneer hij zich via één alias toegang verschaft tot een domein en dat hij niet wordt geauthentificeerd (anoniem) voor een ander alias of de hoofdnaam.

source: Some DNS providers offer web redirections as a means to change a site's URL. However, a web redirection is not the same as a DNS CNAME, and cannot be used to customize an Opendatasoft domain's URL.
de: Einige DNS-Anbieter bieten Web-Weiterleitungen, um die URL einer Website zu ändern. Doch ist eine Web-Weiterleitung nicht das gleiche wie ein DNS CNAME und kann nicht dazu verwendet werden, die URL einer Opendatasoft-Domain anzupassen.
es: Algunos proveedores DNS ofrecen redirecciones web como forma de cambiar la dirección URL de un sitio. Sin embargo, una redirección web no es igual que un registro DNS CNAME, y no se puede emplear para personalizar la dirección URL de un dominio de Opendatasoft.
nl: Sommige DNS-providers bieden doorverwijsmogelijkheden naar het internet als een middel om de URL van een site te wijzigen. Het doorverwijzen naar het internet is evenwel niet hetzelfde als een DNS CNAME en kan niet gebruikt om de URL van een Opendatasoft-domein aan te passen.

source: ``A`` or ``AAAA`` types records are not supported by the Opendatasoft platform as the IP address of one's domain is susceptible to change.
de: Einträge vom Typ "A" oder "AAAA" werden von der Plattform nicht unterstützt, da sich die IP-Adresse einer Domain ändern kann.
es: Los tipos de registros ``A`` y ``AAAA`` no están permitidos por la plataforma Opendatasoft ya que la dirección IP del dominio propio puede cambiar.
nl: Records van het type "A" of "AAAA" worden niet ondersteund door het Opendatasoft-Platform aangezien het IP-adres van iemands domein mogelijk kan worden gewijzigd.

source: HTTPS and TLS (SSL) certificates
de: HTTPS- und TLS-Zertifikate (SSL)
es: HTTPS y certificados TLS (SSL)
fr: Certificats HTTPS et TLS (SSL)
nl: HTTPS- en TLS (SSL)-certificaten

source: HTTPS is a widely used protocol which aims at ensuring privacy and integrity of the exchanges between a website and its users by providing HTTP over a secure communication layer. For these safety and integrity reasons, the Opendatasoft platform enforces the use of HTTPS throughout its services, and as such, requests made to Opendatasoft domains and all their aliases are HTTPS enabled. TLS is the actual protocol used to secure HTTPS today, which replaced the original, deprecated, SSL protocol.
de: HTTPS ist ein gängiges Protokoll, das durch die Bereitstellung von HTTP über eine sichere Kommunikationsschicht auf die Gewährleistung des Datenschutzes und der Integrität des Austauschs zwischen einer Website und ihren Benutzern abzielt. Aus diesen Sicherheits- und Integritätsgründen erzwingt die Opendatasoft-Plattform die Verwendung von HTTPS über ihre Dienste, sodass Anforderungen an Opendatasoft-Domains und alle dazugehörigen Aliase HTTPS-fähig sind. TLS ist das Protokoll, das heutzutage zur Sicherung von HTTPS verwendet wird und das ursprüngliche, veraltete SSL-Protokoll ersetzt.
es: HTTPS es un protocolo de uso muy extendido que tiene como finalidad asegurar la privacidad e integridad de los intercambios entre un sitio web y sus usuarios proporcionando HTTP a través de una capa de comunicación segura. Por estos motivos de seguridad e integridad, la plataforma Opendatasoft implementa el uso de HTTPS en sus servicios, y como tal, las solicitudes realizadas a direcciones URL de Opendatasoft y subdominios personalizados tienen HTTPS activado. TLS es el protocolo utilizado realmente para proteger HTTPS hoy en día, en sustitución del protocolo SSL original, ya obsoleto.
nl: HTTPS is een algemeen gebruikt protocol dat erop gericht is de privacy en de integriteit te waarborgen van uitwisselingen tussen een website en de gebruikers ervan door HTTP over een veilige communicatielaag te voorzien. Omwille van deze veiligheids- en integriteitsredenen, dwingt het Opendatasoft-platform het gebruik af van HTTPS doorheen haar diensten en als dusdanig zijn verzoeken die gedaan worden aan Opendatasoft-domeinen en al hun aliassen HTTPS-enabled. TLS is het effectieve protocol dat tegenwoordig gebruikt wordt om HTTPS te beveiligen en vervangt het oorspronkelijke, ouderwetse SSL-protocol.

source: If one chose to add an Opendatasoft alias to the domain (``<alias>.opendatasoft.com``), the TLS configuration is the same as for the main name. However, if one chose to use a custom domain name (``data.example.com``), the TLS certificate will be generated by Opendatasoft on one's behalf using `Let's Encrypt <https://letsencrypt.org/>`_'s services. Certificate generation and renewal is handled by Opendatasoft transparently, and the renewal process is completely automated, as long as the DNS entry is setup and stays valid. Let's Encrypt certificates provide the same level of security as any other Domain-Validated TLS certificates, and their short lifecycle (3 months) ensures a constantly updated security level. Let's Encrypt certificates are free of charge for Opendatasoft customers.
de: Wenn Sie sich dazu entschließen, der Domain ("<alias>.opendatasoft.com") einen Opendatasoft-Alias hinzuzufügen, so entspricht die TLS-Konfiguration derjenigen des Hauptnamens. Wenn Sie sich jedoch zur Verwendung eines benutzerdefinierten Domainnamens ("data.muster.com") entschließen, so wird das TLS-Zertifikat von Opendatasoft über den Dienst "Let's Encrypt <https://letsencrypt.org/>`_" generiert. Die Generierung und Erneuerung von Zertifikaten wird von Opendatasoft transparent durchgeführt; der Erneuerungsvorgang ist vollständig automatisiert, solange der DNS-Eintrag eingerichtet ist und gültig bleibt. "Let's Encrypt"-Zertifikate bieten das gleiche Sicherheitsniveau wie alle anderen Domain Validated TLS-Zertifikate. Ihr kurzer Lebenszyklus (3 Monate) gewährleistet ein ständig aktualisiertes Sicherheitsniveau. "Let's Encrypt"-Zertifikate sind für Opendatasoft-Kunden kostenlos.
es: Si decide añadir un alias Opendatasoft al dominio (``<alias>.opendatasoft.com``), la configuración TLS es la misma que para el nombre principal. No obstante, si decide utilizar un nombre de dominio personalizado (``data.example.com``), Opendatasoft generará el certificado TLS en nombre propio a través de los servicios `Let's Encrypt <https://letsencrypt.org/>`_. Opendatasoft gestiona la generación y la renovación de certificados de manera transparente, y el proceso de renovación es totalmente automatizado, mientras que la entrada DNS esté configurada y siga siendo válida. Los certificados Let's Encrypt proporcionan el mismo nivel de seguridad que cualquier otro certificado TLS validado por el dominio, y su ciclo de vida corto (3 meses) asegura un nivel de seguridad constantemente actualizado. Los certificados Let's Encrypt son gratuitos para los clientes de Opendatasoft.
nl: Wanneer iemand ervoor kiest om een Opendatasoft-alias aan het domein toe te voegen (``<alias>.opendatasoft.com``), is de TLS-configuratie dezelfde als voor de hoofdnaam. Wanneer iemand er echter voor kiest om een aangepaste domeinnaam te gebruiken (``data.example.com``), zal het TLS-certificaat door Opendatasoft namens iemand worden gegenereerd door gebruik te maken van de diensten van `Let's Encrypt <https://letsencrypt.org/>`_. Het genereren en hernieuwen van certificaten gebeurt op transparante wijze door Opendatasoft en het hernieuwingsproces verloopt volledige automatisch zolang de DNS-entry ingesteld is en geldig blijft. Let's Encrypt-certificaten bieden hetzelfde veiligheidsniveau als alle andere Domain-Validated TLS-certificaten en de korte levenscyclus ervan (3 maanden) waarborgt dat het veiligheidsniveau voortdurend wordt bijgewerkt. Let's Encrypt-certificaten zijn gratis voor Opendatasoft-klanten.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: If the configuration of one's own DNS includes a CAA entry (Certificate Authority Authorization), it will be necessary to add Let's Encrypt to the list of authorized CAs. The required identifier is ``letsencrypt.org``.
de: Wenn die Konfiguration Ihrer eigenen DNS einen CAA-Eintrag (Certificate Authority Authorization) enthält, muss "Let's Encrypt" zur Liste der zulässigen CAs hinzugefügt werden. Der erforderliche Bezeichner lautet "letsencrypt.org`".
es: Si la configuración DNS propia incluye una entrada CAA (autorización de autoridades certificadoras), será necesario añadir Let's Encrypt a la lista de las CA autorizadas. El identificador necesario es ``letsencrypt.org``.
fr: Si la configuration de son propre DNS inclut une entrée CAA (Autorisation d'autorité de certification), il sera nécessaire d'ajouter Let's Encrypt à la liste des autorités de certification autorisées. L'identificateur requis est ``letsencrypt.org``.
nl: Wanneer de configuratie van iemands eigen DNS een CAA-entry omvat (Certificate Authority Authorization), zal het noodzakelijk zijn om Let's Encrypt toe te voegen aan de lijst met toegelaten CA's. De vereiste identifier is ``letsencrypt.org``.

source: Language handling
de: Sprachenhandling
es: Administración de idiomas
fr: Gestion des langues
nl: Taalbehandeling
