Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/06_customizing_domain_url/custom_urls.po
Languages: de, es, fr, nl

source: If one has multiple languages on the Opendatasoft domain and uses language-specific domain aliases, one can request each alias to be linked to a specific language. For instance, if there are 2 aliases ``data.example.co.uk`` and ``daten.example.de``, if can be requested that users accessing the domain through the first alias be served english content ; and those accessing it through the second alias be served german content by default. Users can then switch language as usual.
de: Falls Sie mehrere Sprachen auf Ihrer Opendatasoft-Domain haben und sprachspezifische Domain-Aliase verwenden, können Sie festlegen, dass jeder Alias mit einer bestimmten Sprache verknüpft wird. Wenn Sie zum Beispiel die beiden Aliase "data.muster.co.uk" und "daten.muster.de" haben, können Sie bestimmen, dass Benutzer, die über den ersten Alias auf die Domain zugreifen, englische Inhalte angezeigt bekommen und diejenigen, die über den zweiten Alias darauf zugreifen, deutsche Inhalte. Die Benutzer können dann wie gewohnt die Sprache ändern.
es: Si tiene varios idiomas en el dominio de Opendatasoft y utiliza alias de dominios específicos para los idiomas, puede solicitar que cada uno de los alias se vincule a un idioma específico. Por ejemplo, si hay 2 alias ``data.example.co.uk`` y ``daten.example.de``, puede solicitar que los usuarios que accedan al dominio a través del primer alias reciban el contenido en inglés, y los que accedan al dominio a través del segundo alias reciban el contenido en alemán de forma predeterminada. Después los usuarios podrán cambiar de idioma como de costumbre.
nl: Wanneer iemand meerdere talen hanteert op het Opendatasoft-domein en taalspecifieke domeinaliassen gebruikt, kan iemand vragen dat elk alias gekoppeld wordt aan een specifieke taal. Bijvoorbeeld: wanneer er 2 aliassen zijn, ``data.example.co.uk`` en ``daten.example.de``, ikan gevraagd worden dat het zich toegang verschaffen tot het domein via het eerste alias gebeurt met behulp van Engelstalige content en dat het zich toegang verschaffen tot het domein via het tweede alias stnadaard gebeurt met behulp van Duitstalige content. Zoals gebruikelijk kunnen gebruikers vervolgens van taal veranderen.

source: A new OpenDataSoft domain has one URL, in the form ``<domain>.opendatasoft.com``.
fr: Un nouveau domaine OpenDataSoft dispose d'une URL, de la forme ``<domain>.opendatasoft.com``.

source: As the domain URL is a very important tool for discoverability, branding and ease of access, there will often be a need to customize this URL. As such, the OpenDataSoft platform allows for adding additional names to a domain. These customization options are currently not exposed in the back office, and must be requested by using the support form in the back office. The customization options are detailed below.
fr: Comme l'URL du domaine est un outil très important pour la découverte, l'image de marque et la facilité d'accès, il sera souvent nécessaire de personnaliser cette URL. En tant que tel, la plate-forme OpenDataSoft permet d'ajouter des noms supplémentaires à un domaine. Ces options de personnalisation ne sont actuellement pas exposées dans le back office et doivent être demandées en utilisant le formulaire de support dans le back-office. Les options de personnalisation sont détaillées ci-dessous.

source: In the following, the domain *name* will represent the first, base name of an OpenDataSoft domain, and we will call any additional names *aliases*. The names are actually the host part of the URLs used to access the domain.
fr: Dans ce qui suit, le nom de domaine *name* représentera le premier, nom de base d'un domaine OpenDataSoft, et nous appellerons tous les noms supplémentaires *alias*. Les noms sont en fait la partie hôte des URL utilisées pour accéder au domaine.

source: OpenDataSoft aliases
fr: Alias OpenDataSoft

source: It is possible to add additional OpenDataSoft domain aliases that will be used to access the domain. It is in the form ``<alias>.opendatasoft.com``, where ``alias`` is a word composed of lowercase alphanumeric characters and hyphens. Some names are reserved and not available as domain names or aliases. Ambiguous names should be avoided in order to prevent possible confusion with other OpenDataSoft domains.
fr: Il est possible d'ajouter des alias de domaine OpenDataSoft supplémentaires qui seront utilisés pour accéder au domaine. Il se présente sous la forme ``<alias>.opendatasoft.com``, où ``alias`` est un mot composé de caractères alphanumériques minuscules et de traits d'union. Certains noms sont réservés et ne sont pas disponibles en tant que noms de domaine ou alias. Les noms ambigus doivent être évités afin d'empêcher toute confusion avec d'autres domaines OpenDataSoft.

source: It is also possible to change the base URL of an OpenDataSoft domain to a custom domain name whose authoritative DNS server one controls. For instance, a company called "Example" has an OpenDataSoft domain named ``example``. Its main URL is ``example.opendatasoft.com``, but this customer might want to set up their domain in order to use the alias ``data.example.com``.
fr: Il est également possible de changer l'URL de base d'un domaine OpenDataSoft en un nom de domaine personnalisé dont on contrôle le serveur DNS faisant autorité. Par exemple, une société appelée "Exemple" a un domaine OpenDataSoft nommé ``exemple``. Son URL principale est ``exemple.opendatasoft.com``, mais ce client pourrait vouloir configurer son domaine pour utiliser l'alias ``data.exemple.com``.

source: Create a DNS record of the ``CNAME`` type for the desired name with the default name of one's OpenDataSoft domain as a value.
fr: Créez un enregistrement DNS du type ``CNAME`` pour le nom désiré avec le nom par défaut de son domaine OpenDataSoft comme valeur.

source: The new name must be registered as an alias of the main domain on the OpenDataSoft platform. To do so, please contact the OpenDataSoft support by using the support form in the back office.
fr: Le nouveau nom doit être enregistré en tant qu'alias du domaine principal sur la plateforme OpenDataSoft. Pour ce faire, contactez le support OpenDataSoft en utilisant le formulaire de support dans le back-office.

source: Any number of distinct DNS names can be added to an OpenDataSoft domain. Though all domain names and aliases can be used to access the domain simultaneously, the first alias will be used by default for URLs generated to access the site from outside (in a notification email for example). User login sessions are also specific to a domain name, so it is possible for a user to be authenticated when accessing a domain via one alias and unauthenticated (anonymous) on another alias or the main name.
fr: N'importe quel nombre de noms DNS distincts peut être ajouté à un domaine OpenDataSoft. Bien que tous les noms de domaine et alias puissent être utilisés pour accéder simultanément au domaine, le premier alias sera utilisé par défaut pour les URL générées pour accéder au site depuis l'extérieur (dans un e-mail de notification par exemple). Les sessions de connexion utilisateur sont également spécifiques à un nom de domaine, il est donc possible qu'un utilisateur soit authentifié lors de l'accès à un domaine via un alias et non authentifié (anonyme) sur un autre alias ou le nom principal.

source: Some DNS providers offer web redirections as a means to change a site's URL. However, a web redirection is not the same as a DNS CNAME, and cannot be used to customize an OpenDataSoft domain's URL.
fr: Certains fournisseurs DNS proposent des redirections Web pour modifier l'URL d'un site. Toutefois, une redirection Web n'est pas la même chose qu'une DNS CNAME et ne peut pas être utilisée pour personnaliser l'URL d'un domaine OpenDataSoft.

source: ``A`` or ``AAAA`` types records are not supported by the OpenDataSoft platform as the IP address of one's domain is susceptible to change.
fr: Les enregistrements de type ``A`` ou ``AAAA`` ne sont pas supportés par la plateforme OpenDataSoft car l'adresse IP de son domaine est susceptible de changer.

source: HTTPS is a widely used protocol which aims at ensuring privacy and integrity of the exchanges between a website and its users by providing HTTP over a secure communication layer. For these safety and integrity reasons, the OpenDataSoft platform enforces the use of HTTPS throughout its services, and as such, requests made to OpenDataSoft domains and all their aliases are HTTPS enabled. TLS is the actual protocol used to secure HTTPS today, which replaced the original, deprecated, SSL protocol.
fr: HTTPS est un protocole largement utilisé qui vise à assurer la confidentialité et l'intégrité des échanges entre un site Web et ses utilisateurs en fournissant HTTP sur une couche de communication sécurisée. Pour ces raisons de sécurité et d'intégrité, la plate-forme OpenDataSoft impose l'utilisation de HTTPS à travers ses services, et à ce titre, les requêtes faites aux domaines OpenDataSoft et à tous leurs alias sont activées HTTPS. TLS est le protocole utilisé pour sécuriser HTTPS aujourd'hui, qui a remplacé le protocole SSL, obsolète.

source: If one chose to add an OpenDataSoft alias to the domain (``<alias>.opendatasoft.com``), the TLS configuration is the same as for the main name. However, if one chose to use a custom domain name (``data.example.com``), the TLS certificate will be generated by OpenDataSoft on one's behalf using `Let's Encrypt <https://letsencrypt.org/>`_'s services. Certificate generation and renewal is handled by OpenDataSoft transparently, and the renewal process is completely automated, as long as the DNS entry is setup and stays valid. Let's Encrypt certificates provide the same level of security as any other Domain-Validated TLS certificates, and their short lifecycle (3 months) ensures a constantly updated security level. Let's Encrypt certificates are free of charge for OpenDataSoft customers.
fr: Si l'on choisit d'ajouter un alias OpenDataSoft au domaine (``<alias> .opendatasoft.com``), la configuration TLS est la même que pour le nom principal. Cependant, si vous choisissez d'utiliser un nom de domaine personnalisé (``data.exemple.com``), le certificat TLS sera généré par OpenDataSoft pour son compte en utilisant le service `Let's Encrypt <https://letsencrypt.org/>`_. La génération et le renouvellement des certificats sont gérés par OpenDataSoft de manière transparente, et le processus de renouvellement est entièrement automatisé, tant que l'entrée DNS est configurée et reste valide. Les certificats Let's Encrypt offrent le même niveau de sécurité que les autres certificats TLS validés par domaine, et leur cycle de vie court (3 mois) garantit un niveau de sécurité constamment mis à jour. Les certificats Let's Encrypt sont gratuits pour les clients OpenDataSoft.

source: If one has multiple languages on the OpenDataSoft domain and uses language-specific domain aliases, one can request each alias to be linked to a specific language. For instance, if there are 2 aliases ``data.example.co.uk`` and ``daten.example.de``, if can be requested that users accessing the domain through the first alias be served english content ; and those accessing it through the second alias be served german content by default. Users can then switch language as usual.
fr: Si l'on a plusieurs langues sur le domaine OpenDataSoft et utilise des alias de domaine spécifiques à la langue, on peut demander à chaque alias d'être lié à une langue spécifique. Par exemple, s'il y a 2 alias ``data.example.co.uk`` et ``daten.example.de``, si on peut demander que les utilisateurs accédant au domaine via le premier alias soient servis en anglais; et ceux qui y accèdent via le second alias reçoivent par défaut du contenu allemand. Les utilisateurs peuvent ensuite changer de langue comme d'habitude.
