Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/07_configuring_visualizations/02_configuring_map_view/map.po
Languages: de, es, fr, nl

source: Configuring the Map visualization
de: Konfigurieren der Kartenvisualisierung
es: Configurar la visualización Mapa
fr: Configurer la visualisation Carte
nl: De kaartweergave configureren

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: For the Map visualization to be available, the dataset must contain at least one geographical field (:ref:`Geo point or Geo shape<choosingtype>`).
de: Die Kartenvisualisierung ist nur für Datensätze verfügbar, die mindestens ein Geofeld enthalten (:ref:`Geopunkt oder Geoform<choosingtype>`).
es: Para que la visualización Mapa esté disponible, el conjunto de datos debe contener al menos un campo geográfico (:ref:`punto geográfico o forma geográfica<choosingtype>`).
fr: Pour que la visualisation Carte soit disponible, le jeu de données doit contenir au moins un champ géographique (:ref:`Point géo ou Forme géo<choosingtype>`).
nl: De kaartweergave is enkel beschikbaar voor datasets die minstens één geo-veld (:ref:`geo point of geo shape<choosingtype>`) bevatten.

source: In the edition interface of a dataset, the Visualizations > Map tab allows to configure the Map visualization displayed in the front office once the dataset is published on the portal.
de: In der Bearbeitungsoberfläche eines Datensatzes ermöglicht die Registerkarte Visualisierungen > Karten die Konfiguration der im Front-Office angezeigten Kartenvisualisierung, sobald der Datensatz im Portal veröffentlicht wurde.

source: The Map visualization, when available, is optional. It can be enabled or disabled using the tick box displayed right under the visualizations tabs.
de: Die Kartenvisualisierung, sofern verfügbar, ist optional. Sie kann über das Kontrollkästchen aktiviert oder deaktiviert werden, das direkt unter den Registerkarten für Visualisierungen angezeigt wird.
es: La visualización Mapa, cuando está disponible, es opcional. Puede activarse o desactivarse mediante la casilla de debajo de las fichas de visualizaciones.
fr: La visualisation Carte, quand elle est disponible, est facultative. Elle peut être activée ou désactivée en cochant/décochant la case située en dessous des onglets de visualisation.
nl: De kaartweergave, wanneer deze beschikbaar is, is optioneel. Deze kan worden geactiveerd of gedeactiveerd via het aanvinkvakje dat rechts onder de weergavetabs staat.

source: Customizing the tooltip
de: Anpassen der QuickInfo
es: Personalizar la ayuda de herramienta
fr: Personnalisation de l'infobulle
nl: De tooltip instellen

source: The "Tooltip customization" section contains a variety of options to customize the tooltips that can be displayed on the Map visualization of a dataset. A tooltip is a box that appears when clicking on an element of the map that represents data (for example, a map marker, a geographical shape). The tooltip displays information about its related data.
de: Der Bereich "Anpassen der QuickInfo" enthält unterschiedliche Optionen zur Anpassung der QuickInfos, die in der Kartenvisualisierung eines Datensatzes angezeigt werden können. Eine QuickInfo ist ein Kästchen, das erscheint, wenn Sie auf ein Element der Karte klicken, das Daten darstellt (z.B. eine Kartenmarkierung, eine geografische Form). Die QuickInfo zeigt Informationen über die entsprechenden Daten an.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: For more information about tooltips and how to configure both Standard and Custom HTML tooltips, see :doc:`Configure the tooltip</publishing_data/07_configuring_visualizations/02_configuring_map_view/tooltip>` documentation.
de: Weitere Informationen über QuickInfos und die Konfiguration von Standard- bzw. benutzerdefinierten HTML-QuickInfos finden Sie in der Dokumentation :doc:`Konfigurieren der QuickInfo</publishing_data/07_configuring_visualizations/02_configuring_map_view/tooltip>`.
es: Para obtener más información acerca de las ayudas de herramientas y cómo configurar tanto las ayudas de herramientas HTML estándar como las personalizadas, consulte la documentación :doc:`Configurar la ayuda de herramienta</publishing_data/07_configuring_visualizations/02_configuring_map_view/tooltip>`.
fr: Pour plus d'infomrations sur les infobulles et la configuration des infobulles Standard et Personnalisées en HTML, veuillez consulter la documentation :doc:`Configurer l'infobulle</publishing_data/07_configuring_visualizations/02_configuring_map_view/tooltip>`.
nl: Voor meer informatie over tooltips en over hoe u zowel standaard als aanpasbare HTML-tooltips kunt configureren, raadpleeg de documentatie :doc:`De tooltip configureren</publishing_data/07_configuring_visualizations/02_configuring_map_view/tooltip>` .

source: To customize the tooltips of the Map visualization, follow the instructions from the tables below.
de: Befolgen Sie die Anweisungen der unteren Tabellen, um die QuickInfos der Kartenvisualisierung anzupassen.
es: Para personalizar las ayudas de herramientas de la visualización Mapa, siga las instrucciones de estas tablas.
fr: Pour configurer les infobulles de la visualisation Carte, suivez les indications des tableaux ci-dessous.
nl: Om de tooltips van de kaartweergave in te stellen, volg de instructies uit de onderstaande tabellen.

source: Option name
de: Optionsname
es: Nombre de la opción
fr: Nom de l'option
nl: Naam van de optie

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
nl: Gebruik

source: Tooltip type
de: QuickInfo-Art
es: Tipo de ayuda de herramienta
fr: Type d'infobulle
nl: Soort tooltip

source: 3 tooltip types:
de: 3 QuickInfo-Arten:
es: Hay tres tipos de ayudas de herramientas:
fr: 3 types d'infobulle :
nl: 3 soorten tooltips:

source: Standard tooltip (default): allows the choice of a title and of the fields displayed in the tooltip.
de: Standard-QuickInfo (Standardeinstellung): ermöglicht die Auswahl eines Titels und der in der QuickInfo angezeigten Felder.
es: Ayuda de herramienta estándar (predeterminada): Permite elegir un título y los campos visualizados en la ayuda de herramienta.
fr: L'infobulle standard (par défaut) : permet de choisir un titre et les champs qui s'affichent dans l'infobulle.
nl: Standaard tooltip (default): deze laat toe een titel van de velden die in de tooltip worden weergegeven te kiezen.

source: Custom HTML tooltip: allows a further customization of the tooltip, using HTML.
de: Benutzerdefinierte HTML-QuickInfo: ermöglicht die weitere Anpassung der QuickInfo unter Verwendung von HTML.
es: Ayudas de herramientas HTML personalizadas: Permite llevar a cabo una mayor personalización de la ayuda de herramienta, mediante HTML.
fr: Infobulle personnalisée en HTML : permet une personnalisation plus poussée de l'infobulle grâce au langage HTML.
nl: Aanpasbare HTML-tooltip: hiermee kunt u de tooltip verder instellen via HTML.

source: No tooltip: disables the tooltips for the Map visualization of the dataset.
de: Keine QuickInfo: für die Kartenvisualisierung des Datensatzes werden QuickInfos deaktiviert.
es: No hay ninguna ayuda de herramienta: Desactiva las ayudas de herramientas para la visualización Mapa del conjunto de datos.
fr: Aucune infobulle : désactive les infobulles pour la visualisation Carte du jeu de données.
nl: Geen tooltip: hiermee worden de tooltips voor de kaartweergave van de dataset gedeactiveerd.

source: Click on the "Tooltip type" list box.
de: Klicken Sie auf das Listenfeld "QuickInfo-Art".
es: Haga clic en el cuadro de lista "Tipo de ayuda de herramienta".
fr: Cliquez sur le menu déroulant "Type d'infobulle".
nl: Klik op het lijstvak "Soort tooltip".

source: Choose a tooltip type.
de: Wählen Sie eine QuickInfo-Art.
es: Elija un tipo de ayuda de herramienta.
fr: Choisissez un type d'infobulle.
nl: Kies een soort tooltip.

source: **Standard tooltip options**
de: **Standard-QuickInfo-Optionen**
es: **Opciones de Ayuda de herramienta estándar**
fr: **Options de l'infobulle standard**
nl: **Opties voor standaard tooltips**

source: Tooltip title
de: QuickInfo-Titel
es: Título de ayuda de herramienta
fr: Titre de l'infobulle
nl: Titel van de tooltip

source: Title of the tooltip based on a chosen field from the dataset.
de: Titel der QuickInfo auf Grundlage eines ausgewählten Feldes des Datensatzes.
es: Título de la ayuda de herramienta basado en un campo seleccionado del conjunto de datos.
fr: Titre de l'infobulle, basé sur un champ spécifique du jeu de données.
nl: Titel van de tooltip op basis van een gekozen veld uit de dataset.

source: Click on the "Tooltip title" list box.
de: Klicken Sie auf das Listenfeld "QuickInfo-Titel".
es: Haga clic en el cuadro de lista "Título de ayuda de herramienta".
fr: Cliquez sur le menu déroulant "Titre de l'infobulle".
nl: Klik op het lijstvak "Titel van de tooltip".

source: Choose a field from the dataset on which the title will be based.
de: Wählen Sie ein Feld aus dem Datensatz, auf dem der Titel basieren soll.

source: Displayed fields
de: Angezeigte Felder
es: Campos visualizados
fr: Champs affichés
nl: Weergegeven velden

source: Fields from the dataset which values will be displayed in the tooltip. In the list, the fields with a grey background are those that will be displayed in the tooltip, whereas those without a colored background will be hidden from the tooltip.
de: Felder aus dem Datensatz, deren Werte in der QuickInfo angezeigt werden. Die grau hinterlegten Felder in der Liste werden in der QuickInfo angezeigt. Diejenigen ohne farbigen Hintergrund werden aus der QuickInfo ausgeblendet.
es: Campos del conjunto de datos cuyos valores se mostrarán en la ayuda de herramienta. En la lista, los campos con fondo gris son los que se visualizarán en la ayuda de herramienta, y los campos sin fondo de color se ocultarán en la ayuda de herramienta.
fr: Les champs du jeu de données dont les valeurs figureront dans l'infobulle. Dans la liste, les champs sur fond gris sont ceux qui s'afficheront, tandis que ceux sur fond coloré seront masqués pour l'infobulle.
nl: Velden uit de dataset waarvan de waarden in de tooltip zullen worden weergegeven. In de lijst zijn de velden met een grijze achtergrond diegene die in de tooltip zullen worden weergegeven, terwijl die zonder een gekleurde achtergrond verborgen zullen zijn voor de tooltip.

source: To add a field in the tooltip:
de: Um ein Feld zur QuickInfo hinzuzufügen:
es: Para añadir un campo en la ayuda de herramienta:
fr: Pour ajouter un champ dans l'infobulle :
nl: Om een veld in de tooltip toe te voegen:

source: Find the field among the list.
de: Suchen Sie das Feld in der Liste.
es: Localice el campo en la lista.
fr: Cherchez le champ dans la liste.
nl: Zoek het veld in de lijst.

source: Click on the |icon-plus| icon at the right of the field.
de: Klicken Sie auf das Symbol |icon-plus| rechts im Feld.
es: Haga clic en el icono |icon-plus| situado a la derecha del campo.
fr: Cliquez sur l'icône |icon-plus| à droite du champ.
nl: Klik op het pictogram |icon-plus| rechts van het veld.

source: To hide a field from the tooltip:
de: Um ein Feld in der QuickInfo zu verbergen:
es: Para ocultar un campo en la ayuda de herramienta:
fr: Pour masquer un champ de l'infobulle :
nl: Om een veld uit de tooltip te verbergen:

source: Click on the |icon-cross| icon at the right of the field.
de: Klicken Sie auf das Symbol |icon-cross| rechts im Feld.
es: Haga clic en el icono |icon-cross| situado a la derecha del campo.
fr: Cliquez sur l'icône |icon-cross| à droite du champ.
nl: Klik op het pictogram |icon-cross| rechts van het veld.

source: To reorder the fields:
de: Um die Felder neu zu ordnen:
es: Para reordenar los campos:
fr: Pour modifier l'ordre des champs :
nl: Om de velden in een andere volgorde te plaatsen:

source: Click on a field among the list.
de: Klicken Sie auf ein Feld in der Liste.
es: Haga clic en un campo de la lista.
fr: Cliquez sur un champ dans la liste.
nl: Klik op een veld uit de lijst.

source: Drag and drop the field above or below another one.
de: Ziehen Sie das Feld mittels Drag & Drop über oder unter ein anderes.
es: Arrastre y suelte el campo encima o debajo de otro.
fr: Glisser/déposer pour placer ce champ au-dessus ou en dessous d'un autre.
nl: Plaats en sleep het veld boven of onder een ander veld.

source: Sort in tooltips
de: Sortierung in QuickInfos
es: Orden en ayudas de herramientas
fr: Trier les infobulles
nl: Sorteren in tooltips

source: When there is more than one element at a single place on the map, clicking it will display a single tooltip, but where it is possible to browse information about all these elements. It is possible to define a sort to order that information.
de: Wenn sich mehrere Elemente an einer einzigen Stelle der Karte befinden, wird mit einem Klick darauf eine einzige QuickInfo angezeigt, in der jedoch Informationen über alle entsprechenden Elemente durchsucht werden können. Für diese Informationen kann eine Sortierung bestimmt werden.
es: Si hay más de un elemento en un mismo lugar del mapa, al hacer clic en él se mostrará una única ayuda de herramienta que permitirá explorar la información de todos esos elementos. Se puede definir el orden de aparición de esa información.
fr: Si plus d'un élément est présent à la fois sur un même emplacement de la carte, alors cliquer sur le marqueur n'affiche qu'une seule infobulle, qui permet néanmoins de parcourir les informations associées à ces divers éléments. Il est possible de définir un critère de tri afin d'ordonner ces informations.
nl: Wanneer er meer dan één element op een enkele plaats op de kaart staat, zal er één enkele tooltip verschijnen wanneer u erop klikt, maar het is mogelijk om informatie over al deze elementen te doorbladeren. Het is mogelijk om een sortering te definiëren om die informatie te ordenen.

source: Click on the "Sort in tooltips" list box.
de: Klicken Sie auf das Listenfeld "Sortierung in QuickInfos".
es: Haga clic en el cuadro de lista "Orden en ayudas de herramientas".
fr: Cliquez sur le menu déroulant "Trier dans les infobulles".
nl: Klik op het lijstvak "Sorteren in tooltips".

source: Choose a field from the dataset on which the sorting will be based.
de: Wählen Sie ein Feld aus dem Datensatz, auf dem die Sortierung basieren soll.

source: Click on the second list box, displayed below the first one.
de: Klicken Sie auf das zweite Listenfeld, das unterhalb des ersten angezeigt wird.
es: Haga clic en el segundo cuadro de lista, que se muestra bajo el primero.
fr: Cliquez sur la deuxième zone de liste qui s'affiche sous la première.
nl: Klik op het tweede vakje in de lijst dat onder het eerste vakje staat weergegeven.

source: Choose a sort type.
de: Wählen Sie einen Sortierungstyp.
es: Elija un tipo de ordenación:
fr: Choisissez une règle de tri.
nl: Kies een volgordetype

source: **Custom HTML tooltip options**
de: **Benutzerdefinierte HTML-QuickInfo-Optionen**
es: **Opciones de Ayudas de herramientas HTML personalizadas**
fr: **Options des infobulles personnalisées en HTML**
nl: **Opties voor aanpasbare HTML-tooltips**

source: Custom HTML tooltip
de: Benutzerdefinierte HTML-QuickInfo
es: Ayudas de herramientas HTML personalizadas
fr: Infobulle personnalisée en HTML

source: HTML area to write the content of the tooltip. 3 buttons above the text area allow to reindent a selection, reindent the whole HTML text, and/or to wrap the lines.
de: HTML-Bereich, um den Inhalt der QuickInfo zu schreiben. Mit den 3 Buttons über dem Textfeld können Sie eine Auswahl oder den gesamten HTML-Text neu einrücken und/oder die Zeilen umbrechen.

source: Write the content of the tooltip in HTML.
de: Schreiben Sie den Inhalt der QuickInfo in HTML.
es: Escriba el contenido de la ayuda de herramienta en HTML.
fr: Rédigez le contenu de l'infobulle en HTML.
nl: De inhoud van de tooltip in HTML schrijven.

source: When more than one tooltip is related to the same element on the map, it is possible to define a sort to order these tooltips.
de: Ist mehr als eine QuickInfo mit einem Element auf der Karte verknüpft, können auch diese QuickInfos sortiert werden.

source: Customizing the map
de: Anpassen der Karte
es: Personalizar el mapa
fr: Personnaliser la carte
nl: De kaart aanpassen

source: The "Map customization" section contains a variety of options to customize both the map itself (the basemap) and the elements that represent the data (map markers, geographical shapes).
de: Der Bereich "Anpassen der Karte" enthält unterschiedliche Optionen zur Anpassung der Karte (die Grundkarte) und der Elemente, die die Daten darstellen ( Kartenmarkierung, geografische Form).
es: La sección "Personalización del mapa" incluye varias opciones para personalizar tanto el mapa en sí (mapa de base) como los elementos que representan los datos (marcadores de mapa y formas geográficas).
fr: La section "Personnalisation de la carte" contient une variété d'options pour personnaliser la carte (le fond de carte) et les éléments servant à représenter les données (marqueurs, formes géographiques).
nl: In de rubriek "Aanpassen kaart" staan verschillende opties om zowel de kaart zelf (de basiskaart) als de elementen die de data weergeven (kaartmarkeringen, geografische vormen) aan te passen.

source: To configure the map of the Map visualization, follow the instructions from the table below.
de: Befolgen Sie die Anweisungen der unteren Tabelle, um die Karte der Kartenvisualisierung anzupassen.
es: Para configurar el mapa de la visualización Mapa, siga las instrucciones de esta tabla.
fr: Pour configurer la carte de la visualisation Carte, suivez les indications du tableau ci-dessous.
nl: Om de kaart van de kaartweergave te configureren, volg de instructies uit onderstaande tabel.

source: Basemap
de: Grundkarte
es: Mapa de base
fr: Fond de carte
nl: Basiskaart

source: Basemap that will be used by default for the Map visualization. To appear in the list, the basemaps should be configured in the Look & feel > Data visualizations section of the back office (see :ref:`Adding basemaps<basemaps>` documentation).
de: Die Grundkarte, die standardmäßig für die Kartenvisualisierung verwendet wird. Um in der Liste aufgeführt zu werden, müssen die Grundkarten in dem Bereich Aussehen & Eindruck > Datenvisualisierungen des Back Office konfiguriert werden (beachten Sie die Dokumentation :ref:`Grundkarten hinzufügen<basemaps>`).
es: Mapa de base que se usará de forma predeterminada para la visualización Mapa. Para que aparezcan en la lista, los mapas de base deben configurarse en la sección Apariencia > Visualizaciones de datos del back office (consulte la documentación :ref:`Añadir mapas de base<basemaps>`).
nl: Basiskaart die standaard gebruikt zal worden voor de Kaartweergave. Om in deze lijst te verschijnen, dienen de basiskaarten geconfigureerd te zijn in de rubriek "Look & Feel > Dataweergaven" van de back-office (zie documentatie: :ref:`Basiskaarten toevoegen<basemaps>`).

source: Click on the "Basemap" list box.
de: Klicken Sie auf das Listenfeld "Grundkarte".
es: Haga clic en el cuadro de lista "Mapa de base".
fr: Cliquez sur le menu déroulant "Fond de carte".
nl: Klik op het lijstvak "Basiskaart"

source: Choose a basemap from the list.
de: Wählen Sie eine Grundkarte aus der Liste aus.
es: Elija un mapa base de la lista.
fr: Choisissez un fond de carte dans la liste.
nl: Kies een basiskaart uit de lijst.

source: Marker & shape color
de: Farbe von Markierung & Form
es: Color de forma y marcador
fr: Couleur du repère et de la forme
nl: Kleur van het merkteken & vorm

source: Color of the marker or shape on the Map visualization.
de: Die Farbe der Markierung oder Form der Kartenvisualisierung.
es: Color del marcador o la forma en la visualización Mapa.
fr: Couleur du repère ou de la forme dans la visualisation Carte.
nl: Kleur van het merkteken of vorm op de kaartweergave.

source: Click on the color menu.
de: Klicken Sie auf das Farbmenü.
es: Haga clic en el menú de color.
fr: Cliquez sur le menu couleur.
nl: Klik op het menu met de kleuren.

source: Choose a color from the Nice colors or with the Color picker.
de: Wählen Sie die gewünschte Farbe aus den Farbvorschlägen oder mit dem Farbwähler.
es: Elija un color en Colores bonitos o con el Selector de color.
fr: Choisissez une couleur dans les jolies couleurs ou à l'aide du sélecteur de couleur.
nl: Kies een kleur uit de Leuke kleuren of met de kleur picker.

source: Click on the Select color button.
de: Klicken Sie auf den Button "Farbe wählen".
es: Haga clic en el botón Seleccionar color.
fr: Cliquez sur le bouton **Sélectionner une couleur**.
nl: Klik op de knop Kleur selecteren.

source: Marker display
de: Markierungsanzeige
es: Visualización de marcador
fr: Affichage des marqueurs
nl: Weergave merkteken

source: 3 possible ways to display markers:
de: Es gibt 3 Möglichkeiten, um Markierungen anzuzeigen:
es: Hay tres formas de mostrar los marcadores:
fr: 3 façons d'afficher les marqueurs :
nl: 3 mogelijke manieren om merktekens weer te geven:

source: as Dots,
de: als Punkte,
es: Como puntos.
fr: sous forme de points,
nl: als stippen,

source: as map Markers (by default, with a simple dot inside, but there can be an icon instead),
de: als Kartenmarkierungen (standardmäßig mit einem einfachen Punkt im Inneren, es kann jedoch auch ein Symbol verwendet werden),

source: as an Icon.
de: als Symbol.
es: Como un icono.
fr: sous forme d'icône.
nl: als een pictogram.

source: To choose a marker display, tick the box related to the chosen one.
de: Markieren Sie das Kästchen der entsprechenden Markierungsanzeige, um es auszuwählen.
es: Para elegir una visualización de marcador, seleccione la casilla correspondiente.
fr: Pour choisir un mode d'affichage des marqueurs, cochez la case correspondante.
nl: Om de weergave van een merkteken te kiezen, klik op het vakje dat verband houdt met het gekozen merkteken.

source: To choose an Icon (either for the map Markers or the Icons displays):
de: Um ein Symbol zu wählen (sei es für die Kartenmarkierungen oder die Symbolanzeige):
es: Para elegir un icono (tanto para las visualizaciones de marcadores de mapas como para las de iconos):
fr: Pour choisir une icône (pour l'affichage des marqueurs de carte ou des icônes)
nl: Om een pictogram te kiezen (ofwel voor de kaartmarkeringen of de weergaven van pictogrammen):

source: Click on the Icon menu.
de: Klicken Sie auf das Symbolmenü.
es: Haga clic en el menú Icono.
fr: Cliquez sur le menu Icône.
nl: Klik op het menu Pictogram.

source: Choose an icon.
de: Wählen Sie ein Symbol.
es: Seleccione un icono.
fr: Choisissez une icône.
nl: Kies een pictogram.

source: Click on the Select icon button.
de: Klicken Sie auf den Button "Symbol wählen".
es: Haga clic en el botón Seleccionar icono.
fr: Cliquez sur le bouton Sélectionner une icône.
nl: Klik op de knop Pictogram selecteren.

source: In the edition interface of a dataset, the Visualizations > Map tab allows to configure the Map visualization displayed in the front office, once the dataset is published on the portal.
es: En la interfaz de edición de un conjunto de datos, la ficha Visualizaciones > Mapa permite configurar la visualización Mapa que se muestra en el front office, una vez publicado el conjunto de datos en el portal.
fr: Dans l'interface d'édition d'un jeu de données, l'onglet Visualisations > Carte permet de configurer la visualisation Carte qui s'affiche dans l'interface de navigation après la publication du jeu de données sur le portail.
nl: In de bewerkingsinterface van een dataset kunt u met de tab Weergaves > Kaart de kaartweergave die wordt weergegeven in de front office configureren eenmaal de dataset op het portaal is gepubliceerd.
