Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/07_configuring_visualizations/02_configuring_map_view/map.po
Languages: de, es, fr, nl

source: The "Tooltip customization" section contains a variety of options to customize the tooltips that can be displayed on the Map visualization of a dataset. A tooltip is a box that appears when clicking on an element of the map that represents data (e.g. a map marker, a geographical shape). The tooltip displays information about its related data.
es: La sección "Personalización de la ayuda de herramienta" incluye varias opciones para personalizar las ayudas de herramientas que se pueden mostrar en la visualización Mapa de un conjunto de datos. Una ayuda de herramienta es un cuadro que aparece al hacer clic en un elemento del mapa que representa los datos (por ejemplo, un marcador de mapa o una forma geográfica). La ayuda de herramienta muestra información sobre los datos a que hace referencia.
fr: La section "Personnalisation des infobulles" contient une variété d'options permettant de personnaliser les infobulles qui s'affichent dans la visualisation Carte d'un jeu de données. Une infobulle est une bulle qui apparaît lorsqu'on clique sur un élément de la carte représentant des données (par exemple, un marqueur ou une forme géographique). L'infobulle intègre des informations sur les données associées à cet élément.
nl: In de rubriek "Tooltip instellen" staan verschillende opties om de tooltips in te stellen die kunnen worden weergegeven op de kaartweergave van een dataset. Een tooltip is een vakje dat verschijnt wanneer op een element van de kaart wordt geklikt dat gegevens vertegenwoordigt (bijv. een merkteken op de kaart, een geografische vorm). De tooltip verschaft informatie over de data die eraan verbonden zijn.

source: Choose a field from the dataset, on which the title will be based.
es: Seleccione un campo del conjunto de datos en que se basará el título.
fr: Choisissez le champ du jeu de données sur lequel le titre doit être basé.
nl: Kies een veld uit de dataset waarop de titel gebaseerd zal zijn.

source: Choose a field from the dataset, on which the sorting will be based.
es: Seleccione un campo del conjunto de datos en el que se basará la ordenación.
fr: Choisissez le champ du jeu de données sur lequel le tri doit être basé.
nl: Kies een veld uit de dataset waarop de sortering gebaseerd zal zijn.

source: HTML area to write the content of the tooltip. 3 buttons above the text area allow to reindent a selection, reindent the whole HTML text and/or to wrap the lines.
es: Área HTML para escribir el contenido de la ayuda de herramienta. Los tres botones sobre el área de texto volver a aplicar la sangría a una selección o a todo el texto HTML, y/o ajustar las líneas.
fr: Zone de texte HTML pour écrire le contenu de l'infobulle. 3 boutons situés au-dessus de la zone de texte permettent de ré-indenter une sélection, ré-indenter l'ensemble du texte HTML et/ou d'ajuster le texte à la largeur de la fenêtre.
nl: HTML-ruimte om de inhoud van de tooltip te noteren. Met 3 knoppen boven de tekstzone kunt u een selectie opnieuw laten inspringen, de volledige HTML-tekst opnieuw laten inspringen en/of de lijnen inwikkelen.

source: When more than one tooltip is related to one same element on the map, it is possible to define a sort to order these tooltips.
es: Si hay más de una ayuda de herramienta relacionada con un mismo elemento del mapa, se puede definir un orden de aparición de esas ayudas de herramientas.
fr: Si plus d'une infobulle est associée au même élément sur la carte, il est possible de définir un critère de tri afin d'ordonner ces infobulles.
nl: Wanneer er meer dan één tooltip verband houdt met één zelfde element op de kaart is het mogelijk om de volgorde van deze tooltips in te stellen.

source: as map Markers (by default, with a simple dot inside, but there can be any icon instead),
es: Como marcadores de mapa (por defecto, con un simple punto en el interior, aunque puede mostrarse cualquier icono en su lugar).
fr: sous forme de marqueurs de carte (par défaut, avec un point à l'intérieur, mais une icône peut y être insérée à la place),
nl: als merktekens op de kaart (standaard met een gewone stip erbinnen, maar in plaats ervan kan er om het even welk pictogram staan),

source: Basemap that will be used by default for the Map visualization. To appear in the list, the basemaps should be configured in the Look & feel > Data visualizations section of the back office (see :doc:`Adding basemaps</customizing_look_and_feel/04_configuring_data_visualizations/basemaps>` documentation).
fr: Le fond de carte utilisé par défaut pour la visualisation Carte. Pour figurer dans la liste, les fonds de carte devraient être configurés dans la section Affichage > Visualisations des données de l'interface d'administration (voir la documentation :doc:`Ajouter des fonds de carte</customizing_look_and_feel/04_configuring_data_visualizations/basemaps>`).
