Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/07_configuring_visualizations/02_configuring_map_view/tooltip.po
Languages: de, es, it, nl

source: Configuring the tooltip
de: Konfigurieren der QuickInfo
es: Configurar la ayuda de herramienta
it: Configurazione dei tooltip
nl: De tooltip configureren

source: In order to display information on a map, on a image or in a calendar, you can configure a tooltip. You can use, and configure, the standard tooltip or customize it more precisely using a custom HTML tooltip. A custom tooltip is slightly more time consuming but it is a good way to leverage your data. To switch from the standard tooltip configuration interface to this custom tooltip view, select Custom HTML template from the tooltip type dropdown menu.
de: Zum Anzeigen von Informationen auf einer Karte oder in einem Bild bzw. einem Kalender können Sie eine QuickInfo konfigurieren. Entweder können Sie dazu die Standard-QuickInfo verwenden und konfigurieren oder sie mithilfe einer benutzerdefinierten HTML-QuickInfo individueller gestalten. Eine benutzerdefinierte QuickInfo ist etwas zeitaufwendiger, aber ein guter Weg zur Nutzung Ihrer Daten. Zum Wechseln von der standardmäßigen QuickInfo-Konfigurationsschnittstelle zu dieser benutzerdefinierten QuickInfo-Ansicht wählen Sie im Dropdownmenü QuickInfo-Typ die Option Benutzerdefiniertes HTML.
it: Configurando un tooltip, è possibile visualizzare informazioni relative a una mappa, un'immagine o un calendario. Puoi impostare e utilizzare un tooltip standard, oppure scegliere un tooltip HTML personalizzato. In questo caso, l'operazione richiede un po' più di tempo, ma permette di valorizzare al meglio i tuoi dati. Per passare dall'interfaccia di configurazione standard a quella di personalizzazione, apri il menu a discesa “Tipo di tooltip” e seleziona il modello “Tooltip HTML personalizzato”.
nl: Om informatie op een kaart, op een afbeelding of in een kalender weer te geven, kan u een tooltip configureren. U kan de standaard tooltip gebruiken en configureren of deze nauwkeuriger personaliseren door gebruik te maken van een aanpasbare HTML-tooltip. Een aanpasbare tooltip is meer tijdrovend maar is een goede manier om uw data in de kijker te plaatsen. Om over te schakelen van de configuratie-interface voor standaard tooltips naar deze aanpasbare weergave van de tooltip, selecteer de Custom HTML template in het afrolmenu met types tooltips.

source: Setting up the tooltip
de: Einrichten der QuickInfo
es: Configurar la ayuda de herramienta
it: Configurazione dei tooltip
nl: De tooltip instellen

source: No tooltip
de: Keine QuickInfo
es: No hay ninguna ayuda de herramienta.

source: You can choose not to display any tooltip. This can be useful, for example, when you want to display several layers on a map and to have only one layer with tooltips.
de: Sie können festlegen, dass keine QuickInfos angezeigt werden. Dies kann beispielsweise nützlich sein, wenn Sie mehrere Ebenen auf einer Karte anzeigen, jedoch nur eine Ebene mit QuickInfos haben möchten.
es: Puede elegir no visualizar ninguna ayuda de herramienta. Esto puede ser útil, por ejemplo, cuando quiere visualizar varias capas en un mapa y tener solo una capa con ayudas de herramientas.

source: Standard tooltip
de: Standard-QuickInfo
es: Ayuda de herramienta estándar
it: Tooltip standard
nl: Standaard tooltip

source: You can of course configure which fields will appear in the tooltip and their relative order. A live preview is available on the right side.
de: Natürlich können Sie konfigurieren, welche Felder in welcher relativen Reihenfolge in der QuickInfo erscheinen werden. Auf der rechten Seite ist eine Livevorschau verfügbar.
it: In questa modalità, puoi naturalmente definire i campi che verranno visualizzati all'interno del tooltip e il loro ordine. Sulla destra, è presente un'anteprima dinamica.
nl: Vanzelfsprekend kan u configureren welke velden in de tooltip verschijnen en wat de relatieve volgorde ervan is. Een live voorbeeldweergave is beschikbaar aan de rechterzijde.

source: For each of the tooltip's fields, the 3 following actions are available :
de: Für jedes QuickInfo-Feld sind die folgenden 3 Aktionen verfügbar:
es: Para cada uno de los campos de la ayuda de herramienta, puede llevar a cabo las 3 acciones siguientes:
it: Per ogni campo, sono disponibili 3 azioni:
nl: Voor elk van de velden van de tooltip, zijn de 3 volgende acties beschikbaar:

source: Tooltip's fields' actions
de: Aktionen für QuickInfo-Felder
es: Acciones de los campos de la ayuda de herramienta
it: Azioni possibili sui campi del tooltip
nl: Acties met betrekking tot velden van de tooltip

source: Drag and drop to move field within tooltip
de: Drag & Drop zum Verschieben von Feldern in der QuickInfo
es: Arrastrar y soltar para ver el campo dentro de la ayuda de herramienta
it: Trascina e rilascia per spostare un campo del tooltip
nl: Sleep en plaats om een veld binnen de tooltip te verplaatsen

source: Click to remove field from tooltip
de: Klick zum Entfernen eines Felds aus der QuickInfo
es: Hacer clic para eliminar el campo de la ayuda de herramienta
it: Clicca per rimuovere il campo dal tooltip
nl: Klik om het veld uit de tooltip te verwijderen

source: Click to add field to tooltip
de: Klick zum Hinfügen eines Felds zur QuickInfo
es: Hacer clic para añadir el campo a la ayuda de herramienta
it: Clicca per aggiungere un campo al tooltip
nl: Klik om een veld aan de tooltip toe te voegen

source: The associated live preview
de: Die zugeordnete Livevorschau
es: Vista previa dinámica asociada
it: Anteprima dinamica associata
nl: De eraan verbonden live voorbeeldweergave

source: Custom HTML tooltip
de: Benutzerdefinierte HTML-QuickInfo
es: Ayudas de herramientas HTML personalizadas
it: Tooltip HTML personalizzato

source: When you select `Custom HTML tooltip` an HTML editor appears. This is very similar to writing "pages" in your domain; you have access to every `ODS Widget <http://opendatasoft.github.io/ods-widgets/docs/>`_ and you can even integrate other visualizations inside the tooltip.
de: Wenn Sie `Benutzerdefinierte HTML-QuickInfo` auswählen, erscheint ein HTML-Editor. Das ist eng mit dem Schreiben von "Seiten" in Ihrer Domain verwandt; Sie haben Zugriff auf jedes `ODS-Widget <http://opendatasoft.github.io/ods-widgets/docs/>`_ und können sogar andere Visualisierungen in Ihre QuickInfo integrieren.

source: An example of a custom tooltip.
de: Beispiel einer benutzerdefinierten QuickInfo.
es: Ejemplo de una ayuda de herramienta personalizada.
it: Esempio di tooltip personalizzato
nl: Een voorbeeld van een aanpasbare tooltip.

source: When the tooltip is displayed, it can access a specific ``record`` variable that is "injected" in the tooltip. This ``record`` object contains the following properties:
de: Wird eine QuickInfo angezeigt, kann sie auf eine bestimmte ``record``-Variable zugreifen, die in die QuickInfo "eingespeist" wird. Dieses ``record``-Objekt hat folgende Eigenschaften:
es: Cuando se visualiza la ayuda de herramienta, esta puede acceder a una variable ``record`` específica que se "inserta" en la ayuda de herramienta. Este objeto ``record`` contiene las propiedades siguientes:
it: Quando viene visualizzato, il tooltip può accedere a una specifica variabile ``record`` inserita al suo interno. Questo oggetto ``record`` include le seguenti proprietà:
nl: Wanneer de tooltip wordt weergegeven, kan deze toegang krijgen tot een specifieke "record" variabele die wordt "geïnjecteerd" in de tooltip. Dit "record"-voorwerp bevat de volgende eigenschappen:

source: ``record.fields``: object containing all the values (e.g. ``record.fields.tree_height``)
de: ``record.fields``: alle Werte enthaltendes Objekt (z. B. ``record.fields.tree_height``)
es: ``record.fields``: El objeto que contiene todos los valores (p. ej. ``record.fields.tree_height``).
it: ``record.fields``: oggetto contenente tutti i valori, ad esempio ``record.fields.tree_height``;
nl: ``record.fields``: voorwerp dat alle waarden bevat (bijv.``record.fields.tree_height``)

source: ``record.recordid``: unique identifier for the record
de: ``record.recordid``: eindeutiger Bezeichner für den Eintrag
es: ``record.recordid``: El identificador único del registro.
it: ``record.recordid``: identificatore univoco del record;
nl: ``record.recordid``: unieke identifier voor het record

source: ``record.datasetid``: identifier of the dataset
de: ``record.datasetid``: Bezeichner des Datensatzes
es: ``record.datasetid``: El identificador del juego de datos.
it: ``record.datasetid``: identificatore del dataset.
nl: ``record.datasetid``: identifier van de dataset

source: Using these properties, you can display directly values in the tooltip, or even use them to display data from other datasets.
de: Durch die Verwendung dieser Eigenschaften können Sie direkt Werte in der QuickInfo anzeigen oder sie sogar zur Anzeige von Daten anderer Datensätze verwenden.
it: Grazie a queste proprietà, è possibile visualizzare i valori direttamente nel tooltip o utilizzarli per mostrare i dati di altri dataset.
nl: Door gebruik te maken van deze eigenschappen, kan u rechtstreeks waarden in de tooltip weergeven of deze zelfs gebruiken om data uit andere datasets weer te geven.

source: The schema of the dataset is also injected as a ``fields`` variable, which is an array of field objects (you can use ``ng-repeat`` to loop over the fields). A field object contains the following properties:
de: Das Schema des Datensatzes wird ebenfalls als eine ``Feld``variable eingespeist, bei der es sich um ein Array von Feldobjekten handelt (Sie können ``ng-repeat`` verwenden, um eine Schleife über die Felder auszuführen). Ein Feldobjekt hat folgende Eigenschaften:
es: El esquema del juego de datos también se inserta a modo de variable ``fields``, que es una matriz de objetos de campo (puede utilizar ``ng-repeat`` para efectuar un bucle por los campos). Un objeto de campo contiene las propiedades siguientes:
it: Anche lo schema del dataset viene inserito come variabile ``fields``, sotto forma di un array di oggetti campo (per eseguire un ciclo sui campi utilizza ``ng-repeat``). Un oggetto campo include le seguenti proprietà:
nl: Het schema van de dataset wordt ook geïnjecteerd als een variabele "velden". Dit is een waaier aan veldvoorwerpen (u kan ``ng-repeat`` om de velden te overlopen). Een veldvoorwerp bevat de volgende eigenschappen:

source: ``field.name``: the identifier of the field, for example to find a value within ``record.fields``
de: ``field.name``: der Bezeichner des Felds, um beispielsweise einen Wert in ``record.fields`` zu finden
it: ``field.name``: identificatore del campo, ad esempio per trovare un valore in ``record.fields``;
nl: ``field.name``: de identifier van het veld. Bijvoorbeeld om een waarde te vinden in ``record.fields``

source: ``field.type``: the type of the field (``text``, ``decimal``, ``integer``, ``date``, ``datetime``, ``geo_point_2d``, ``geo_shape``)
de: ``field.type``: der Typ des Felds (``Text``, ``Dezimalzahl``, ``Ganzzahl``, ``Datum``, ``datetime``, ``geo_point_2d``, ``geo_shape``)
es: ``field.type``: El tipo del campo (``text``, ``decimal``, ``integer``, ``date``, ``datetime``, ``geo_point_2d``, ``geo_shape``).
it: ``field.type``: tipo del campo (``text``, ``decimal``, ``integer``, ``date``, ``datetime``, ``geo_point_2d``, ``geo_shape``);
nl: ``field.type``: het type veld (``tekst``, ``decimaal``, ``geheel getal``, ``datum``, ``datumtijd``, ``geo_point_2d``, ``geo_shape``)

source: ``field.label``: a human-friendly label
de: ``field.label``: eine für Menschen klare Beschriftung
es: ``field.label``: Una etiqueta en formato legible.
it: ``field.label``: etichetta descrittiva.
nl: ``field.label``: een mensvriendelijk label

source: Here is the code from the example above:
de: Hier ist der Code des obigen Beispiels:
es: Este es el código del ejemplo anterior:
it: Ecco il codice relativo al nostro esempio:
nl: Hier is de code uit het bovenstaande voorbeeld:

source: If you want to display an image from one of your dataset's ``file`` fields, you can use the ``ods-record-image`` widget.
de: Möchten Sie ein Bild von einem ``Datei``feld Ihres Datensatzes anzeigen, können Sie das Widget ``ods-record-image`` verwenden.
es: Si quiere visualizar una imagen de uno de los campos ``file`` del juego de datos, puede usar el widget ``ods-record-image``.
it: Per visualizzare l'immagine di uno dei campi ``file`` del dataset, puoi utilizzare il widget ``ods-record-image``.
nl: Indien u een afbeelding uit een van de "bestand"-velden van uw dataset wil weergeven, kan u de widget ``ods-record-image`` gebruiken.

source: You can use a ``<ods-dataset-context>`` to display a visualization from another dataset; in the following example, the data is taken from another dataset and filtered using one of the values of the selected record.
de: Zum Anzeigen einer Visualisierung eines anderen Datensatzes können Sie einen ``<ods-dataset-context>`` verwenden. Im folgenden Beispiel werden die Daten von einem anderen Datensatz genommen und mithilfe eines Wertes des ausgewählten Eintrags gefiltert.
es: Puede utilizar ``<ods-dataset-context>`` para mostrar una visualización de otro juego de datos; en el ejemplo siguiente, los datos se toman de otro juego de datos y se filtran con uno de los valores del registro seleccionado.
it: ``<ods-dataset-context>`` fornisce la visualizzazione di un altro dataset. Nell'esempio seguente, i dati provengono da un altro dataset e sono filtrati in base a uno dei valori del record selezionato.
nl: U kan een ``<ods-dataset-context>`` gebruiken om een weergave uit een andere dataset weer te geven; in het volgende voorbeeld is de data genomen uit een andere dataset en gefilterd op basis van één van de waarden van het geselecteerde record.

source: In order to display information on a map, on an image, or in a calendar, you can configure a tooltip. You can use and configure the standard tooltip or customize it more precisely using a custom HTML tooltip. A custom tooltip is slightly more time consuming, but it is a good way to leverage your data. To switch from the standard tooltip configuration interface to this custom tooltip view, select Custom HTML template from the tooltip type dropdown menu.
es: Para visualizar información en un mapa, una imagen o un calendario, puede configurar una ayuda de herramienta. Puede usar y configurar la ayuda de herramienta estándar o personalizarla con más precisión mediante una ayuda de herramienta HTML personalizada. A pesar de suponer un poco más de tiempo, una ayuda de herramienta personalizada es una buena manera de obtener el máximo rendimiento de los datos. Para cambiar de la configuración de la ayuda de herramienta estándar a esta vista de ayuda de herramienta personalizada, seleccione Ayudas de herramientas HTML personalizadas en el menú desplegable de tipos de ayudas de herramientas.

source: You can configure which fields will appear in the tooltip and their relative order. A live preview is available on the right side.
es: Puede configurar qué campos aparecerán en la ayuda de herramienta y su orden relativo. En la parte derecha dispone de una vista previa dinámica.

source: When you select `Custom HTML tooltip`, an HTML editor appears. This is very similar to writing "pages" in your domain; you have access to every `ODS Widget <http://opendatasoft.github.io/ods-widgets/docs/>`_, and you can even integrate other visualizations inside the tooltip.
es: Al seleccionar `Ayudas de herramientas HTML personalizadas` aparece un editor HTML. Es muy parecido a escribir "páginas" en el dominio; tiene acceso a cada uno de los `widgets de ODS <http://opendatasoft.github.io/ods-widgets/docs/>`_ y hasta puede integrar otras visualizaciones en la ayuda de herramienta.

source: Using these properties, you can directly display values in the tooltip or even use them to display data from other datasets.
es: Con estas propiedades, puede visualizar directamente valores en la ayuda de herramienta o incluso usarlas para visualizar datos de otros conjuntos de datos.

source: ``field.name``: the identifier of the field, for example, to find a value within ``record.fields``
es: ``field.name``: El identificador del campo, por ejemplo, para encontrar un valor en ``record.fields``.

source: When you select `Custom HTML tooltip` an HTML editor appears. This is very similar to writing "pages" in your domain; you have access to every `ODS Widget <http://opendatasoft.github.io/ods-widgets/docs/>`_ and you can even integrate other visualizations inside the tooltip. You can even use the :doc:`grid layout classes</customizing_look_and_feel/07_designing_responsive_portal/responsive>`.
nl: Wanneer u `Custom HTML tooltip` selecteert, verschijnt een HTML editor. Dit vertoont veel gelijkenissen met het schrijven van "pagina's" in uw domein; u heeft toegang tot elke `ODS Widget <http://opendatasoft.github.io/ods-widgets/docs/>`_ en u kunt zelfs andere weergaves in de tooltip integreren. U kunt zelfs de :doc:`raster lay-out klassen</customizing_look_and_feel/07_designing_responsive_portal/responsive>` gebruiken.
