Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/03_adding_assets/assets.po
Languages: de, es, fr, nl

source: Adding assets
de: Hinzufügen von Anlagen
es: Añadir activos
fr: Ajouter des ressources
nl: Eigenschappen toevoegen

source: Assets are files that are uploaded in an Opendatasoft domain in order to be usable throughout that same domain (for example, in the domain :ref:`stylesheet <stylesheet>`, in :doc:`content pages </creating_content/index>`, etc.). Either images or font files can be added as assets in the domain.
de: Anlagen sind Dateien, die auf eine Opendatasoft-Domain hochgeladen werden, um innerhalb dieser Domain verfügbar zu sein (z.B. in der Domain :ref:`Stylesheet <stylesheet>` , in :doc:`Inhaltsseiten </creating_content/index>` usw.). Sowohl Bilder als auch Schriftart-Dateien können als Anlagen zu der Domain hinzugefügt werden.
es: Los activos son archivos que se cargan en un dominio de Opendatasoft para que se puedan usar en todo ese dominio (por ejemplo, en la :ref:`hoja de estilos <stylesheet>` del dominio, en las :doc:`páginas de contenido </creating_content/index>`, etc.). Se pueden añadir archivos de fuentes o imágenes como activos del dominio.
fr: Les ressources sont des fichiers chargés dans un domaine Opendatasoft et destinés à être utilisés dans celui-ci (par exemple, dans la :ref:`feuille de style <stylesheet>` du domaine, dans des :doc:`pages de contenu </creating_content/index>`, etc.). Vous pouvez ajouter des images ou des fichiers de police de caractères en tant que ressources dans le domaine.

source: This feature is available in the **Assets** section of the back office of an Opendatasoft domain.
de: Diese Funktion ist im Bereich **Anlagen** des Back-Office einer Opendatasoft-Domain verfügbar.
es: Esta función está is disponible en la sección **Activos** del back office de un dominio de Opendatasoft.
fr: Cette fonctionnalité se trouve dans la section **Ressources** de l'interface d'administration d'un domaine Opendatasoft.
nl: Deze functionaliteit is beschikbaar in de rubriek **Eigenschappen** van de back-office van een Opendatasoft-domein.

source: Metadata is not stripped from uploaded files. The tags may expose sensitive information, such as geolocation data or device information.
de: Die Metadaten werden nicht aus den hochgeladenen Dateien entfernt. Die Tags könnten sensible Informationen preisgeben, wie etwa Geolokalisierungsdaten oder Geräteinformationen.
es: No se han quitado los metadatos de los archivos cargados. Las etiquetas pueden exponer información confidencial, como datos de geolocalización o información de dispositivos.
fr: Les métadonnées ne sont pas retirées des fichiers chargés. Les tags peuvent exposer des informations sensibles, telles que des données de géolocalisation ou des informations sur l'appareil.

source: Before uploading files, make sure you strip metadata you want to keep private.
de: Stellen Sie vor dem Hochladen sicher, dass Sie vertrauliche Metadaten isolieren.
es: Antes de cargar los archivos, quite los metadatos que desee mantener en privado.
fr: Veillez à retirer les métadonnées que vous souhaitez garder confidentielles avant de charger des fichiers.

source: Adding an image as an asset
de: Hinzufügen eines Bildes als Anlage
es: Añadir una imagen como activo
fr: Ajouter une image en tant que ressource
nl: Een afbeelding toevoegen als een eigenschap

source: All image files formats are accepted as assets: .gif, .png, .jpeg, .jpg, .tiff, .bmp and .svg.
de: Alle Bilddatei-Formate werden als Anlagen akzeptiert: .gif, .png, .jpeg, .jpg, .tiff, .bmp und .svg.
es: Se admiten todos los formatos de archivos de imagen como activos: .gif, .png, .jpeg, .jpg, .tiff, .bmp y .svg.
fr: Tous les formats de fichiers images sont acceptés en tant que ressources : gif, .png, .jpeg, .jpg, .tiff, .bmp et .svg.
nl: Alle bestandsformaten voor afbeeldingen worden aanvaard als eigenschappen: .gif, .png, .jpeg, .jpg, .tiff, .bmp en .svg.

source: Added files must not exceed 2.0 MB. For larger files, an external file-hosting service should be used.
de: Hinzugefügte Dateien dürfen eine maximale Größe von 2 MB nicht überschreiten. Für größere Dateien sollten externe Filehosting-Dienstleister verwendet werden.
es: Los archivos añadidos no pueden superar los 2 MB. Para los archivos más grandes, hay que recurrir a un servicio de alojamiento de archivos externo.
fr: La taille des fichiers ajoutés ne doit pas dépasser 2,0 Mo. Pour les fichiers plus volumineux, un service d'hébergement de fichiers externe doit être utilisé.
nl: Toegevoegde bestanden mogen niet groter zijn dan 2.0 MB. Voor grotere bestanden dient een externe bestand-hosting service worden gebruikt.

source: Go to the **Assets** section of the back office.
de: Gehen Sie in den Bereich **Anlagen** des Back-Office.
es: Vaya a la sección **Activos** del back office.
fr: Rendez-vous dans la section **Ressources** de l'interface d'administration.
nl: Ga naar de rubriek **Eigenschappen** van de back-office.

source: Make sure the Images tab (default) is selected.
de: Stellen Sie sicher, dass der Bilder-Tab (Standardauswahl) ausgewählt ist.
es: Compruebe que esté seleccionada la ficha Imágenes (predeterminada).
fr: Vérifiez que l'onglet Images (par défaut) est sélectionné.
nl: Zorg ervoor dat het tabblad Afbeeldingen (standaard) is geselecteerd.

source: Either drag and drop the image file in the corresponding area or click on "browse" to select the image file using a file picker.
de: Verschieben Sie entweder die Bilddatei über Drag & Drop in den entsprechenden Bereich oder klicken Sie auf "Durchsuchen", um die Bilddatei im Dateimanager auszuwählen.
es: Arrastre y suelte el archivo de imagen al área correspondiente, o haga clic en "Explorar" para seleccionar el archivo de imagen con el selector de archivos.
fr: Glissez/déposez le fichier image dans la zone correspondante ou cliquez sur "consulter" pour choisir le fichier image à l'aide d'un sélecteur de fichiers.

source: Adding a font as an asset
de: Hinzufügen einer Schriftart als Anlage
es: Añadir una fuente como activo
fr: Ajouter une police de caractères en tant que ressource
nl: Een lettertype toevoegen als een eigenschap

source: The following font files formats are accepted as assets:
de: Die folgenden Formate für Schriftart-Dateien werden als Anlagen akzeptiert:
es: Se admiten los siguientes formatos de archivos de fuente:
fr: Les formats de fichiers de polices de caractères suivants sont acceptés en tant que ressources :
nl: De volgende bestandformaten met lettertypes worden aanvaard als eigenschappen:

source: Added files must not exceed 700.0 KB. For larger files, an external file-hosting service should be used.
de: Hinzugefügte Dateien dürfen eine maximale Größe von 700,0 KB nicht überschreiten. Für größere Dateien sollten externe Filehosting-Dienstleister verwendet werden.
es: Los archivos añadidos no pueden superar los 700 KB. Para los archivos más grandes, hay que recurrir a un servicio de alojamiento de archivos externo.
fr: La taille des fichiers ajoutés ne doit pas dépasser 700,0 Ko. Pour les fichiers plus volumineux, un service d'hébergement de fichiers externe doit être utilisé.
nl: Toegevoegde bestanden mogen niet groter zijn dan 700.0 KB. Voor grotere bestanden zou een externe file-hosting service moeten worden gebruikt.

source: Click on the Fonts tab.
de: Klicken Sie auf den Schriftarten-Tab.
es: Haga clic en la ficha Fuentes.
fr: Cliquez sur l'onglet Polices de caractères.
nl: Klik op het tabblad Lettertypes.

source: Either drag and drop the font file in the corresponding area or click on "browse" to select the font file using a file picker.
de: Verschieben Sie entweder die Schriftart-Datei über Drag & Drop in den entsprechenden Bereich oder klicken Sie auf "Durchsuchen", um die Schriftart-Datei im Dateimanager auszuwählen.
es: Arrastre y suelte el archivo de fuente al área correspondiente, o haga clic en "Explorar" para seleccionar el archivo de fuente con el selector de archivos.
fr: Glissez/déposez le fichier de police de caractères dans la zone correspondante ou cliquez sur "consulter" pour choisir le fichier de police de caractères à l'aide d'un sélecteur de fichiers.

source: Assets are files that are uploaded in an Opendatasoft domain, in order to be usable throughout that same domain (e.g. in the domain :ref:`stylesheet <stylesheet>`, in :doc:`content pages </creating_content/index>`, etc.). Either images or fonts files can be added as assets in the domain.
nl: Eigenschappen zijn bestanden die worden ge√ºploaded in een Opendatasoft-domein zodat deze op datzelfde domein gebruikt kunnen worden (bijv. in het domein :ref:`stijlblad <stylesheet>`, in :doc:`contentpagina's </creating_content/index>`, enz.). Zowel afbeeldingen als bestanden met lettertypes kunnen als eigenschap toegevoegd worden in het domein.

source: Either drag and drop the image file in the corresponding area, or click on "browse" to select the image file using a file picker.
nl: Sleep en plaats het afbeeldingenbestand in de overeenkomstige ruimte of klik op *browse* om het afbeeldingenbestand te selecteren met behulp van een bestand picker.

source: Either drag and drop the font file in the corresponding area, or click on "browse" to select the font file using a file picker.
nl: Sleep en plaats het fontbestand in de overeenkomstige ruimte of klik op *browse* om het bestand met lettertypes te selecteren met behulp van een bestand picker.
