Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/01_looking_up_the_catalog/catalog.po
Languages: de, es, fr, it, nl

source: Navigating the catalog
de: Navigieren im Katalog
es: Navegar por el catálogo
fr: Naviguer dans le catalogue
nl: De catalogus aan het doorbladeren

source: The dataset catalog of an OpenDataSoft portal is accessible from the front office for all users allowed on the portal (i.e. for open portals it could be anyone wheareas for private portals it should be only authenticated users).
de: Alle zugelassenen Benutzer können über das Front Office auf den Datensatzkatalog eines OpenDataSoft-Portals zugreifen (d. h. bei offenen Portalen kann jeder darauf zugreifen, bei privaten Portalen nur authentifizierte Benutzer).
es: El catálogo de conjuntos de datos de un portal OpenDataSoft está accesible desde el front office para todos los usuarios permitidos en el portal (es decir, en el caso de los portales abiertos, cualquier usuario; y en los portales privados, solo los usuarios autenticados).
fr: Le catalogue d'un jeu de données d'un portail OpenDataSoft est accessible depuis l'interface de navigation, pour tous les utilisateurs autorisés sur le portail (par exemple, pour les portails ouverts, l'accès est autorisé à tout le monde, tandis que pour les portails privés, seuls les utilisateurs authentifiés ont une permission d'accès).
nl: De datasetcatalogus van een OpenDataSoft-portaal is voor alle gebruikers die toelating hebben tot het portaal toegankelijk vanuit de front office (m.a.w. voor open portalen zou het iedereen kunnen zijn, terwijl voor private portalen enkel gemachtigde gebruikers er toegang toe hebben).

source: On most portals, the catalog is the landing page. However, if the default landing page has been changed to a custom page, the link to the catalog can often be found in the navigation bar at the very top of the front office. Since this navigation bar is fully customizable, the label of the link to access the catalog can be different from one portal to another (very often, "Data", "Catalog", "Explore" or "Datasets" are used as labels).
de: Bei den meisten Portalen ist der Katalog die Landingpage. Wurde die standardmäßige Landingpage jedoch in eine benutzerdefinierte Seite geändert, kann der Link zum Katalog oft in der Navigationsleiste ganz oben im Front Office gefunden werden. Da diese Navigationsleiste komplett anpassbar ist, kann die Bezeichnung des Links zum Zugriff auf den Katalog von einem Portal zum anderen unterschiedlich sein (es werden sehr häufig die Beschriftungen "Daten", "Katalog", "Durchsuchen" oder "Datensätze" verwendet).
es: En la mayoría de los portales, el catálogo es la página de destino. Sin embargo, si la página de destino predeterminada se ha cambiado a una página personalizada, el vínculo con el catálogo a menudo se puede encontrar en la barra de navegación arriba del todo en el front office. Como esta barra de navegación es totalmente personalizable, la etiqueta del vínculo para acceder al catálogo puede variar de un portal a otro (muy a menudo, se usa "Datos", "Catálogo", "Explorar" o "Conjuntos de datos" como etiqueta).
fr: Sur la plupart des portails, le catalogue correspond à la page de renvoi. Toutefois, si la page de renvoi par défaut a été remplacée par une page personnalisée, le lien vers le catalogue se trouve souvent dans la barre de navigation, tout en haut de l'interface de navigation. La barre de navigation étant totalement personnalisable, le label du lien d'accès au catalogue peut varier d'un portail à l'autre (très souvent, les labels "Données", "Catalogue", "Explorer" ou "Jeux de données" sont utilisés).
nl: Om de meeste portalen is de catalogus de bestemmingspagina. Wanneer de standaard bestemmingspagina echter gewijzigd wordt naar een gepersonaliseerde pagina, kan de link naar de catalogus vaak worden teruggevonden in de navigatiebalk helemaal bovenaan de front office. Aangezien deze navigatiebalk volledig kan worden gepersonaliseerd, kan het label van de link om naar de catalogus te gaan van het ene portaal naar een ander verschillen (zeer vaak worden "Data", "Catalogus", "Explore" of "Datasets" gebruikt als labels).

source: The structure of a dataset catalog remains the same no matter the portal.
de: Die Struktur eines Datensatzkatalogs bleibt unabhängig vom Portal gleich.
es: La estructura de un catálogo de conjunto de datos es la misma para todos los portales.
fr: Quel que soit le portail, la structure d'un catalogue de jeu de données est toujours la même.
nl: Ongeacht het portaal blijft de structuur van een datasetcatalogus dezelfde.

source: On the left side (1), are displayed:
de: Auf der linken Seite (1) wird Folgendes dargestellt:
es: A la izquierda (1), se visualiza:
fr: À gauche (1), les éléments suivants sont affichés :
nl: Aan de linkerzijde (1), wordt het volgende weergegeven:

source: the number of available datasets,
de: die Anzahl der verfügbaren Datensätze,
es: Número de conjuntos de datos disponibles.
fr: le nombre de jeux de données disponibles ;
nl: het aantal beschikbare datasets,

source: a catalog sort option to change the order of the datasets,
de: eine Katalog-Sortieroption, um die Reihenfolge der Datensätze zu ändern,
es: Opción de ordenación del catálogo para cambiar el orden de los conjuntos de datos.
fr: une option de tri du catalogue, pour modifier l'ordre des jeux de données ;
nl: een optie om de catalogus te sorteren om de volgorde van de datasets te wijzigen,

source: a variety of catalog filters to find specific datasets,
de: unterschiedliche Katalogfilter, um nach bestimmten Datensätze zu suchen,
es: Diversos filtros de catálogo para buscar conjuntos de datos específicos.
fr: divers filtres de catalogue, pour rechercher des jeux de données spécifiques ;
nl: een aantal catalogusfilters om specifieke datasets terug te vinden,

source: different possibilities to download the catalog.
de: verschiedene Möglichkeiten, den Katalog herunterzuladen.
es: Diferentes posibilidades de descargar el catálogo.
fr: différentes options pour télécharger le catalogue.
nl: verschillende mogelijkheden om de catalogus te downloaden.

source: On the right side (2), are displayed the datasets. Each dataset is represented by a rectangle called a "catalog card". On each card, the dataset's main metadata are displayed, along with quick links to visualize the data.
de: Auf der rechten Seite (2) werden die Datensätze angezeigt. Jeder Datensatz wird durch ein Rechteck dargestellt, das als "Katalogkarte" bezeichnet wird. Auf jeder Karte werden die wichtigsten Metadaten des jeweiligen Datensatzes zusammen mit Direktlinks zur Visualisierung der Daten angezeigt.
es: A la derecha (2), se visualizan los conjuntos de datos. Cada uno de los conjuntos de datos se representa mediante un rectángulo denominado "tarjeta de catálogo". En cada una de las tarjetas, se muestran los metadatos principales del conjunto de datos así como unos vínculos rápidos para visualizar los datos.
fr: À droite (2), les jeux de données sont affichés. Chacun d'entre eux est représenté par un rectangle appelé "fiche de catalogue". Les métadonnées principales du jeu de données, ainsi que des liens rapides pour visualiser les données figurent sur chacune des fiches.
nl: Aan de rechterzijde (2) worden de datasets weergegeven. Elke dataset wordt vertegenwoordigd door een rechthoek die een "cataloguskaart" wordt genoemd. Op elke kaart worden de belangrijkste metadata van de dataset weergegeven, samen met snelkoppelingen om de data te bekijken.

source: Sorting the catalog
de: Den Katalog sortieren
es: Ordenar el catálogo
fr: Trier le catalogue
nl: De catalogus sorteren

source: By default, a dataset catalog is sorted by last modification date (i.e. the most recently modified datasets are displayed in first position, at the top of the catalog).
de: Standardmäßig wird ein Datensatzkatalog nach dem letzten Änderungsdatum sortiert (d. h. die zuletzt geänderten Datensätze werden an erster Stelle im Katalog angezeigt).
es: De forma predeterminada, un catálogo de conjunto de datos está ordenado por la fecha de la última modificación (es decir, los últimos conjuntos de datos modificados aparecen en primera posición, en la parte superior del catálogo).
fr: Par défaut, un catalogue de jeu de données est trié par date de dernière modification (c'est-à-dire que les jeux de données ayant été modifiés le plus récemment se trouvent en première place, au début du catalogue).
nl: Standaard wordt een datasetcatalogus gesorteerd op de laatste datum van wijziging (m.a.w. de meest recent gewijzigde datasets worden eerst weergegeven bovenaan de catalogus).

source: It is possible to change in which order the catalog cards are displayed with the catalog sorting option below the number of datasets, on the left side of the interface.
de: Die Anzeigereihenfolge der Katalogkarten kann über die Katalog-Sortieroption geändert werden. Diese befindet sich auf der linken Seite unter der Anzahl der Datensätze.
es: Se puede cambiar el orden de visualización de las tarjetas de catálogo con la opción de ordenación del catálogo situada bajo el número de conjuntos de datos, a la izquierda de la interfaz.
fr: L'option de tri du catalogue, qui se situe en dessous du nombre de jeux de données, dans la partie gauche de l'interface, vous permet de modifier l'ordre d'affichage des fiches de catalogue.
nl: Het is mogelijk om de volgorde waarin de cataloguskaarten worden weergegeven te wijzigen door middel van de sorteeroptie voor de catalogus onderaan het aantal datasets aan de linkerzijde van de interface.

source: The catalog can be sorted by a total of 10 methods. These methods are based on 5 sorting criterias, each being available in both increasing and decreasing order.
de: Der Katalog kann nach insgesamt 10 Methoden sortiert werden. Diese Methoden basieren auf 5 Sortierkriterien, die jeweils in aufsteigender und absteigender Reihenfolge zur Verfügung stehen.
es: El catálogo se puede ordenar por un total de 10 métodos. Estos métodos se basan en 5 criterios de ordenación, cada uno de ellos disponible en orden creciente o decreciente.
fr: Le catalogue peut être trié de 10 manières différentes. Elles reposent sur 5 critères de tri, chacun disponible dans l'ordre croissant et l'ordre décroissant.
nl: De catalogus kan op 10 verschillende methodes worden gesorteerd. Deze methodes zijn gebaseerd op 5 sorteercriteria die elk beschikbaar zijn in zowel oplopende als dalende volgorde.

source: Dataset title: to sort the datasets in alphabetical order or reverse alphabetical order
de: Datensatztitel: zum Sortieren der Datensätze in alphabetischer oder umgekehrt alphabetischer Reihenfolge
es: Título del conjunto de datos: Para ordenar los conjuntos de datos alfabéticamente o invertir el orden alfabético
fr: Titre du jeu de données : pour trier les jeux de données par ordre alphabétique (A-Z) ou par ordre alphabétique inverse (Z-A)
nl: Titel van de dataset: om de datasets te sorteren in alfabetische of omgekeerd alfabetische volgorde

source: Modification date: to sort the datasets by most recent or oldest modification date
de: Änderungsdatum: zum Sortieren der Datensätze nach dem letzten oder ältesten Änderungsdatum
es: Fecha de modificación: Para ordenar los conjuntos de datos por la última fecha de modificación o la más antigua
fr: Date de modification : pour trier les jeux de données par date de modification plus récente ou plus ancienne
nl: Wijzigingsdatum: om de datasets te sorteren op de meest recente of oudste datum van wijziging

source: Number of records: to sort the datasets by biggest or fewest number of records
de: Anzahl der Einträge: zum Sortieren der Datensätze nach der größten oder kleinsten Anzahl der Einträge
es: Número de registros: Para ordenar los conjuntos de datos por mayor o menor número de registros
fr: Nombre d'enregistrements : pour trier les jeux de données par nombre d'enregistrements plus important ou moins important
nl: Aantal records: om de datasets te sorteren op basis van het grootste of kleinste aantal records

source: Number of downloads: to sort the datasets by biggest or fewest number of downloads
de: Anzahl der Downloads: zum Sortieren der Datensätze nach der größten oder kleinsten Anzahl der Downloads
es: Número de descargas: Para ordenar los conjuntos de datos por mayor o menor número de descargas
fr: Nombre de téléchargements : pour trier les jeux de données par nombre de téléchargements plus important ou moins important
nl: Aantal downloads: om de datasets te sorteren op basis van het grootste of kleinste aantal downloads

source: Popularity: to sort the datasets from the most or least popular
de: Beliebtheit: zum Sortieren der Datensätze nach Beliebtheitsgrad
es: Popularidad: Para ordenar los conjuntos de datos a partir del más o el menos popular
fr: Popularité : pour trier les jeux de données du plus populaire au moins populaire, ou inversement
nl: Populariteit: om de datasets te sorteren op basis van de meest of minst populaire datasets

source: To modify the sorting method, 2 possibilities:
de: Es gibt 2 Möglichkeiten, um die Sortieroptionen zu ändern:
es: Para modificar el método de ordenación, hay 2 posibilidades:
fr: 2 possibilités s'offrent à vous pour modifier la méthode de tri :
nl: Om de sorteermethode te wijzigen, zijn er 2 mogelijkheden:

source: Click one of the 3 most popular methods: "Modified", "Popular", "A-Z".
de: Klicken Sie auf eine der 3 beliebtesten Optionen: "Geändert", "Beliebt", "A-Z".
es: Haga clic en uno de los 3 métodos más populares: "Modificado", "Popular" y "A-Z".
fr: Cliquez sur l'une des 3 méthodes les plus utilisées : "Modifiés", "Populaires", "De A à Z".
nl: Klik op een van de 3 meest populaire methodes: "Gewijzigd", "Populair" "A-Z".

source: Use one of the other methods:
de: Verwenden Sie eine der anderen Optionen:
es: Utilice uno de los otros métodos:
fr: Utilisez l'une des autres méthodes :
nl: Gebruik een van de andere methodes:

source: Click the |icon-seemore| button to display all available sorting methods.
de: Klicken Sie auf die Schaltfläche |icon-seemore|, um alle verfügbaren Sortieroptionen zu sehen.
es: Haga clic en el botón |icon-seemore| para visualizar todos los métodos de ordenación disponibles.
fr: Cliquez sur le bouton |icon-seemore| pour afficher toutes les méthodes de tri disponibles.
nl: Klik op de knop |icon-seemore| om alle beschikbare sorteermethodes weer te geven.

source: Click the chosen sorting method in the list.
de: Klicken Sie auf die gewünschte Sortieroption in der Liste.
es: Haga clic en el método de ordenación que desee de la lista.
fr: Dans la liste, cliquez sur la méthode de tri souhaitée.
nl: Klik op de gekozen sorteermethode in de lijst.

source: Once the new sorting method is chosen, the catalog automatically updates.
de: Sobald die neue Sortieroption gewählt wurde, wird der Katalog automatisch aktualisiert.
es: Una vez seleccionado el nuevo método de ordenación, el catálogo se actualiza automáticamente.
fr: Dès que la nouvelle méthode de tri est sélectionnée, le catalogue se met automatiquement à jour.
nl: Eenmaal de nieuwe sorteermethode is gekozen, wordt de catalogus automatische up-to-date gebracht.

source: Filtering the catalog
de: Filtern des Katalogs
es: Filtrar el catálogo
fr: Filtrer le catalogue
it: Filtro del catalogo
nl: De catalogus filteren

source: When navigating a catalog with only a few datasets, it is easy to scroll down and check all the datasets available. But when navigating catalogs with dozens, even hundreds of datasets, scrolling down isn't an option. As an end-user on an open data portal, the reason for visiting that portal may not be just curiosity. The reason for being on the portal may be for a precise purpose ; to find specific data or to search for data from a specific topic, time period or even geographic area.
de: Wenn Sie in einem Katalog mit nur wenigen Datensätzen navigieren, können Sie ganz einfach nach unten scrollen, um alle verfügbaren Datensätze zu sehen. Bei der Navigation in Katalogen mit Dutzenden oder Hunderten Datensätzen ist das Scrollen nach unten nicht möglich. Für einen Endnutzer ist der Grund für den Besuch eines Open-Data-Portals vielleicht nicht allein reine Neugierde. Er verfolgt möglicherweise ein gewisses Ziel: bestimmte Daten zu finden oder nach bestimmten Daten aus einem speziellen Thema, Zeitraum oder geographischem Gebiet zu suchen.
es: Al navegar por un catálogo con solo unos cuantos conjuntos de datos, es fácil desplazarse hacia abajo para examinar todos los conjuntos de datos disponibles. Pero al navegar por catálogos con decenas o centenares de conjuntos de datos, es imprescindible desplazarse hacia abajo. Como usuario final de un portal de datos abiertos, la razón de visitar el portal posiblemente no sea la simple curiosidad. El motivo para visitar el portal puede ser un objetivo concreto: encontrar unos datos específicos o unos datos de un tema, un periodo de tiempo o incluso un área geográfica en concreto.
fr: Lorsque vous parcourez un catalogue contenant uniquement quelques jeux de données, vous pouvez facilement défiler vers le bas et consulter tous les jeux de données disponibles. En revanche, quand vous parcourez des catalogues avec des dizaines, voire des centaines de jeux de données, faire défiler le curseur n'est même pas envisageable. En tant qu'utilisateur final d'un portail de données ouvertes, votre visite sur ce portail n'est pas une histoire de curiosité : vous y avez accédé dans un but bien précis, pour trouver des données spécifiques ou encore pour rechercher des données en lien avec une période, une zone géographique ou un sujet particuliers.
nl: Wanneer een catalogus met slechts enkele datasets wordt doorbladerd, is het eenvoudig om naar beneden te scrollen en alle beschikbare datasets te controleren. Maar wanneer catalogi met tientallen of zelfs honderden datasets worden doorbladerd, is naar beneden scrollen geen optie meer. Als eindgebruiker op een open dataportaal, kan de reden waarom dat portaal bezocht wordt louter nieuwsgierigheid zijn. Maar de reden waarom men het portaal bezoekt kan ook zeer specifiek zijn; om specifieke gegevens terug te vinden of om data over een specifiek onderwerp, een specifieke tijdperiode of zelfs een geografische zone op te zoeken.

source: For these reasons and more, a variety of filtering options are available, below the number of datasets and the catalog sorting option, on the left side of the interface.
de: Aus diesen und weiteren Gründen stehen auf der linken Seite der Benutzeroberfläche unter der Anzahl der Datensätze und der Katalog-Sortieroption verschiedene Filtermöglichkeiten zur Verfügung.
es: Por estos y otros motivos, hay disponibles varias opciones de filtro bajo el número de conjuntos de datos y la opción de ordenación del catálogo, a la izquierda de la interfaz.
fr: C'est pour ces raisons, et bien d'autres encore, que diverses options de filtres sont disponibles. Vous pouvez les trouver sous le nombre de jeux de données et l'option de tri du catalogue, dans la partie gauche de l'interface.
nl: Omwille van deze en nog veel meer redenen, is er een grote verscheidenheid aan filteropties beschikbaar onderaan het aantal datasets en de sorteeroptie voor de catalogus aan de linkerzijde van de interface.

source: It is possible to filter:
de: Es gibt folgende Filtermöglichkeiten:
es: Se puede filtrar:
fr: Vous avez la possibilité de filtrer par :
nl: Het is mogelijk om te filteren:

source: by textual research, using the search bar
de: Textsuche über die Suchleiste
es: Por búsqueda textual, mediante la barra de búsqueda
fr: recherche textuelle, à l'aide de la barre de recherche ;
nl: op basis van tekst door gebruik te maken van de zoekbalk

source: by geographic area, using the mini map
de: Suche nach geografischem Gebiet mit der Minikarte
es: Por área geográfica, mediante el minimapa
fr: zone géographique, à l'aide de la mini-carte ;
nl: op geografische zone door gebruik te maken van de minikaart

source: by metadata, using the available metadata-based filters
de: Suche nach Metadaten unter Verwendung der verfügbaren Metadaten-Filter
es: Por metadatos, mediante los filtros basados en metadatos disponibles
fr: métadonnées, à l'aide des filtres basés sur des métadonnées disponibles.
nl: op metadata door gebruik te maken van de beschikbare op metadata gebaseerde filters

source: Using the search bar
de: Verwendung der Suchleiste
es: Mediante la barra de búsqueda
fr: Utiliser la barre de recherche
nl: De zoekbalk gebruiken

source: The search bar should be used to make textual searches in the catalog. When doing a textual search, the platform will look for a match between the search and the metadata from all the available datasets (title, description, keywords etc.). The catalog will be filtered to only display those matching datasets.
de: Die Suchleiste kann für die Textsuche im Katalog verwendet werden. Bei einer Textsuche sucht die Plattform nach einer Übereinstimmung zwischen dem Suchbegriff und den Metadaten aller verfügbaren Datensätze (Titel, Beschreibung, Schlüsselwörter usw.). Der Katalog wird so gefiltert, dass nur die passenden Datensätze angezeigt werden.
es: La barra de búsqueda está destinada a hacer búsquedas textuales en el catálogo. Al efectuar una búsqueda textual, la plataforma tratará de encontrar una coincidencia entre la búsqueda y los metadatos de todos los conjuntos de datos disponibles (título, descripción, palabras clave, etc.). El catálogo se filtrará para visualizar tan solo los conjuntos de datos coincidentes.
fr: La barre de recherche doit être utilisée pour effectuer des recherches textuelles dans le catalogue. Quand vous effectuez une recherche textuelle, la plateforme recherchera une correspondance entre la recherche formulée et les métadonnées présentes dans tous les jeux de données disponibles (titre, description, mots-clés, etc.). Le catalogue sera filtré pour afficher uniquement les jeux de données correspondants.
nl: De zoekbalk wordt gebruikt om in de catalogus op basis van tekst te zoeken. In dit geval gaat het platform in alle beschikbare datasets op zoek naar een match tussen de zoektekst en de metadata (titel, beschrijving, trefwoorden, enz.). De catalogus wordt zodanig gefilterd dat enkel de overeenkomstige datasets worden weergegeven.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking
