Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/01_looking_up_the_catalog/catalog.po
Languages: de, es, fr, it, nl

source: If there is no match after the textual search, the information "Your search didn't match any dataset." will be displayed instead of the catalog cards. Each textual search being recorded, the administrators of an OpenDataSoft portal know about each search without a match. That way, knowing the interests and needs of their end-users, they might publish new datasets in the future to answer these interests and needs.
de: Findet die Textsuche keine Übereinstimmung, wird anstelle der Katalogkarten die folgende Nachricht angezeigt: "Ihre Suche ergab keine Übereinstimmung mit einem Datensatz". Jede Textsuche wird registriert und die Administratoren eines OpenDataSoft-Portals erfahren über jede ergebnislose Suche. Auf diese Weise können sie in Kenntnis der Interessen und Bedürfnisse ihrer Endbenutzer in Zukunft neue Datensätze veröffentlichen, um diesen Interessen und Bedürfnissen gerecht zu werden.
es: Si no hay ninguna coincidencia después de la búsqueda textual, se visualizará la información "La búsqueda no coincide con ningún conjunto de datos." en lugar de las tarjetas de catálogo. Dado que todas las búsquedas textuales quedan registradas, los administradores de un portal OpenDataSoft tienen conocimiento de cada una de las búsquedas sin coincidencia. De este modo, al estar informados de los intereses y las necesidades de los usuarios finales, pueden publicar nuevos conjuntos de datos para darles respuesta.
fr: Si la recherche textuelle ne donne aucun résultat, le message "Aucun jeu de données trouvé pour votre recherche." apparaîtra au lieu des fiches de catalogue. Toutes les recherches textuelles étant enregistrées, les administrateurs d'un portail OpenDataSoft ont connaissance des recherches sans correspondance. Ainsi ils peuvent, à l'avenir, publier des jeux de données en adéquation avec les centres d'intérêt et les besoins de leurs utilisateurs finaux.
nl: Wanneer er geen match wordt gevonden na de zoekopdracht op basis van tekst, wordt de melding "Uw zoekopdracht stemde met geen enkele dataset overeen" weergegeven in plaats van de cataloguskaarten. Aangezien elke zoekopdracht op basis van tekst opgeslagen wordt, hebben de beheerders van een OpenDataSoft-portaal weet van elke zoekopdracht zonder een match. Op die manier en wetende welke de interesses en noden zijn van hun eindgebruikers kunnen ze in de toekomst nieuwe datasets publiceren om aan deze interesses en noden te beantwoorden.

source: To make a textual search:
de: Nach einem Text suchen:
es: Para hacer una búsqueda textual:
fr: Pour effectuer une recherche textuelle :
nl: Om een zoekopdracht op basis van tekst aan te maken:

source: Click on the search bar area.
de: Klicken Sie auf die Suchleiste.
es: Haga clic en el área de la barra de búsqueda.
fr: Cliquez sur la zone de barre de recherche.
nl: Klik op de zoekbalk.

source: Type the word to search in the datasets.
de: Geben Sie den Begriff ein, nach dem die Datensätze durchsucht werden sollen.
es: Escriba la palabra que desea buscar en los conjuntos de datos.
fr: Saisissez le mot à rechercher dans les jeux de données.
nl: Typ het woord dat opgezocht moet worden in de datasets.

source: Press enter for the search to be taken into account, and the catalog filtered according to the typed word.
de: Drücken Sie die Eingabetaste, um die Suche zu starten und den Katalog nach dem eingegebenen Wort zu filtern.
es: Pulse Entrar para que se tenga en cuenta la búsqueda y se filtre el catálogo en función de la palabra escrita.
fr: Appuyez sur Entrée pour lancer la recherche et filtrer le catalogue en fonction du mot saisi.
nl: Druk op Enter om de zoekopdracht uit te voeren en de catalogus wordt gefilterd op basis van het ingetypte woord.

source: It is possible to make more advanced searches with the search bar, using Query language (more info in the :doc:`Searching the data documentation </exploring_catalog_and_datasets/03_searching_the_data/search>`).
de: Mithilfe der Abfragesprache kann eine erweiterte Suche über die Suchleiste durchgeführt werden (weitere Informationen finden Sie in der :doc:`Dokumentation zum Durchsuchen der Daten </exploring_catalog_and_datasets/03_searching_the_data/search>`).
es: Se pueden efectuar búsquedas más avanzadas con la barra de búsqueda, mediante el lenguaje de consulta (consulte más información en la documentación acerca de :doc:`Buscar en los datos </exploring_catalog_and_datasets/03_searching_the_data/search>`).
fr: L'option Langage de requête vous permet d'effectuer des recherches plus poussées (plus d'informations dans le :doc:`document Effectuer une recherche dans les données</exploring_catalog_and_datasets/03_searching_the_data/search>`).
nl: Het is mogelijk om met de zoekbalk meer geavanceerde zoekopdrachten uit te voeren door gebruik te maken van de Query-taal (meer info is terug te vinden in het :doc:`Documentatie over de data zoeken </exploring_catalog_and_datasets/03_searching_the_data/search>`).

source: Using the mini map
de: Verwendung der Minikarte
es: Mediante el minimapa
fr: Utiliser la mini-carte
nl: De minikaart gebruiken

source: Under the search bar is a mini map that should be used to make geographic searches in the catalog. When doing a geographic search, the platform will look for a match between the geographic area drawn on the mini map and the geographic area metadata set for all available datasets. The catalog will be filtered to only display those matching datasets.
de: Unter der Suchleiste befindet sich eine Minikarte, die für die geografische Suche im Katalog verwendet werden kann. Bei einer geografischen Suche sucht die Plattform nach einer Übereinstimmung zwischen dem auf der Minikarte gezeichneten geografischen Gebiet und den Metadaten aller verfügbaren Datensätze. Der Katalog wird so gefiltert, dass nur die passenden Datensätze angezeigt werden.
es: Bajo la barra de búsqueda se encuentra un minimapa destinado a efectuar búsquedas geográficas en el catálogo. Al hacer una búsqueda geográfica, la plataforma tratará de encontrar una coincidencia entre el área geográfica dibujada en el minimapa y los metadatos del área geográfica establecidos para todos los conjuntos de datos disponibles. El catálogo se filtrará para visualizar tan solo los conjuntos de datos coincidentes.
fr: En dessous de la barre de recherche, vous trouverez une mini-carte qui vous permet d'effectuer des recherches géographiques dans le catalogue. Dans le cas d'une recherche géographique, la plateforme recherchera une correspondance entre la zone géographique sélectionnée sur la mini-carte et les métadonnées de zone géographique définies pour tous les jeux de données disponibles. Le catalogue sera filtré pour afficher uniquement les jeux de données correspondants.
nl: Onder de zoekbalk staat een minikaart die gebruikt kan worden om geografische zoekopdrachten uit te voeren. Wanneer een geografische zoekopdracht wordt uitgevoerd, gaat het platform op zoek naar een match tussen de geografische zone die getekend wordt op de minikaart en de metadata van de geografische zone die ingesteld staat voor alle beschikbare datasets. De catalogus wordt zodanig gefilterd dat enkel de overeenkomstige datasets worden weergegeven.

source: By default, datasets for which the geographic area metadata has not been set cannot be found when doing a geographic search with the mini map. Furthermore, the mini map is only available and displayed on the catalog if at least one of the datasets has this geographic area metadata set.
de: Standardmäßig können nur solche Datensätze über die geografische Suche mit der Minikarte gefunden werden, für die geografische Metadaten festgelegt wurden. Außerdem ist die Minikarte nur dann verfügbar und wird im Katalog angezeigt, wenn mindestens einer der Datensätze über geografische Metadaten verfügt.
es: De forma predeterminada, los conjuntos de datos para los cuales no se han establecido metadatos de área geográfica no se encontrarán al hacer una búsqueda geográfica con el minimapa. Además, el minimapa solo está disponible y visible en el catálogo si al menos uno de los conjuntos de datos tiene establecidos los metadatos de área geográfica.
fr: Par défaut, les jeux de données pour lesquels les métadonnées de zone géographique n'ont pas été définies ne peuvent pas apparaître dans les résultats d'une recherche géographique effectuée avec la mini-carte. En outre, la mini-carte est uniquement disponible et affichée dans le catalogue si au moins un des jeux de données a ces métadonnées de zone géographique définies.
nl: Standaard kunnen datasets waarvoor de metadata voor de geografische zone niet zijn ingesteld, niet worden teruggevonden wanneer een geografische zoekopdracht wordt uitgevoerd met de minikaart. Bovendien is de minikaart enkel beschikbaar en wordt ze enkel weergegeven op de catalogus wanneer voor minstens één van de datasets de metadata voor deze geografische zone zijn ingesteld.

source: To make a geographic search:
de: Eine geografische Suche durchführen:
es: Para hacer una búsqueda geográfica:
fr: Pour effectuer une recherche géographique :
nl: Om een geografische zoekopdracht uit te voeren:

source: Click on the little rectangle button on the top left of the mini map, which is a drawing tool.
de: Klicken Sie auf die kleine rechteckige Schaltfläche oben links auf der Minikarte. Hierbei handelt es sich um ein Zeichentool.
es: Haga clic en el pequeño botón de rectángulo situado en la parte superior izquierda del minimapa, que es una herramienta de dibujo.
fr: Cliquez sur le petit bouton rectangulaire en haut à gauche de la mini-carte, qui est un outil de dessin.
nl: Klik op de kleine rechthoekige knop links bovenaan de minikaart. Dit is een tekeninstrument.

source: Draw a rectangle on the chosen area of the mini map. The catalog directly updates to only display datasets matching the geographic filter applied.
de: Zeichnen Sie ein Rechteck in dem ausgewählten Bereich der Minikarte. Der Katalog wird sofort aktualisiert, um nur die Datensätze anzuzeigen, die dem verwendeten geografischen Filter entsprechen.
es: Dibuje un rectángulo en el área elegida del minimapa. El catálogo se actualiza directamente para visualizar tan solo los conjuntos de datos que coinciden con el filtro geográfico aplicado.
fr: Dessinez un rectangle sur la zone souhaitée de la mini-carte. Le catalogue se met instantanément à jour pour afficher uniquement les jeux de données correspondant au filtre géographique appliqué.
nl: Teken een rechthoek op het gekozen gebied op de minikaart. De catalogus wordt meteen bijgewerkt zodat enkel de datasets worden weergegeven die overeenstemmen met de toegepaste geografische filter.

source: To cancel a selection, and draw on another area:
de: Um eine Auswahl aufzuheben und auf einen anderen Bereich zu zeichnen:
es: Para cancelar una selección y dibujar en otra área:
fr: Pour annuler une sélection et dessiner une autre zone :
nl: Om een selectie te annuleren en een andere zone te tekenen:

source: Click on the rectangle button again. The previous shape diseappears.
de: Klicken Sie erneut auf die Rechteck-Schaltfläche. Die zuvor gezeichnete Form verschwindet.
es: Vuelva a hacer clic en el botón de rectángulo. La forma anterior desaparece.
fr: Cliquez une nouvelle fois sur le bouton rectangulaire : la forme précédente est effacée.
nl: Klik opnieuw op de rechthoekige knop. De vorige vorm verdwijnt.

source: Draw a rectangle on the newly chosen area of the mini map. The catalog directly updates to only display datasets matching the geographic filter newly applied.
de: Zeichnen Sie ein Rechteck auf einem anderen Bereich der Minikarte. Der Katalog wird sofort aktualisiert, um nur die Datensätze anzuzeigen, die dem neuen geografischen Filter entsprechen.
es: Dibuje un rectángulo en la nueva área elegida del minimapa. El catálogo se actualiza directamente para visualizar tan solo los conjuntos de datos que coinciden con el nuevo filtro geográfico aplicado.
fr: Dessinez un rectangle sur la nouvelle zone souhaitée de la mini-carte. Le catalogue se met instantanément à jour pour afficher uniquement les jeux de données correspondant au nouveau filtre géographique appliqué.
nl: Teken een rechthoek op het nieuw gekozen gebied op de minikaart. De catalogus wordt meteen bijgewerkt zodat enkel de datasets worden weergegeven die overeenstemmen met de nieuw toegepaste geografische filter.

source: Using the selectable filters
de: Verwendung der auswählbaren Filter
es: Mediante los filtros seleccionables
fr: Utiliser les filtres sélectionnables
nl: De filters gebruiken die geselecteerd kunnen worden

source: Under the mini map is a list of selectable filters sorted by categories based on the datasets metadata. These filters should be used to filter the datasets by view (visualizations such as Analyze, Map, Calendar etc.), date, publisher, keyword, theme, language, and any other metadata available as filter category. When searching with the selectable filters, the platform will look for a match between the selected values from the filter categories and the values set in the metadata of the available datasets. The catalog will be filtered to only display those matching datasets.
de: Unter der Minikarte befindet sich eine nach Kategorien sortierte Liste mit auswählbaren Filtern basierend auf den Metadaten der Datensätze. Diese Filter können verwendet werden, um die Datensätze nach Ansicht (Visualisierungen wie Analysieren, Karte, Kalender usw.), Datum, Veröffentlicher, Schlüsselwort, Thema, Sprache und anderen als Filterkategorie verfügbaren Metadaten zu filtern. Bei der Suche mit den auswählbaren Filtern sucht die Plattform nach einer Übereinstimmung zwischen den in den Filterkategorien ausgewählten Werten und den Werten in den Metadaten der verfügbaren Datensätze. Der Katalog wird so gefiltert, dass nur die passenden Datensätze angezeigt werden.
es: Bajo el minimapa se encuentra una lista de filtros seleccionables ordenados por categorías en función de los metadatos de los conjuntos de datos. Estos filtros están destinados a filtrar los conjuntos de datos por vista (visualizaciones como Analizar, Mapa, Calendario, etc.), fecha, publicador, palabra clave, tema, lenguaje y demás metadatos disponibles como categoría de filtro. Al buscar con los filtros seleccionables, la plataforma tratará de encontrar una coincidencia entre los valores seleccionados de las categorías de filtro y los valores establecidos en los metadatos de los conjuntos de datos disponibles. El catálogo se filtrará para visualizar tan solo los conjuntos de datos coincidentes.
fr: Sous la mini-carte, vous pouvez trouver une liste de filtres sélectionnables, triés par catégories en fonction des métadonnées des jeux de données. Ces filtres doivent être utilisés pour filtrer les jeux de données par vue (visualisations comme Analyse, Carte, Calendrier, etc.), date, producteur, mot-clé, thème, langue et toutes les autres métadonnées disponibles dans la catégorie de filtre. Lorsque vous effectuez une recherche avec les filtres sélectionnables, la plateforme recherchera une correspondance entre les valeurs sélectionnées des catégories de filtre et les valeurs définies dans les métadonnées des jeux de données disponibles. Le catalogue sera filtré pour afficher uniquement les jeux de données correspondants.
nl: Onder de minikaart staat een lijst met filters die geselecteerd kunnen worden. Deze filters zijn gesorteerd op basis van categorieën gebaseerd op metadata van de datasets. Deze filters dienen gebruikt te worden om de datasets te filteren op basis van weergave (weergaven zoals Analyze, Map, Calendar, enz.), datum, uitgever, trefwoord, thema, taal en alle andere metadata die beschikbaar zijn als filtercategorie. Wanneer een zoekopdracht wordt uitgevoerd met de filters die geselecteerd kunnen worden, gaat het platform op zoek naar een match tussen de geselecteerde waarden uit de filtercategorieën en de waarden die ingesteld staan in de metadata van de beschikbare datasets. De catalogus wordt zodanig gefilterd dat enkel die overeenkomstige datasets worden weergegeven.

source: To use the selectable filters:
de: Zur Suche mit auswählbaren Filtern:
es: Para utilizar los filtros seleccionables:
fr: Pour utiliser les filtres sélectionnables :
nl: Om de filters te gebruiken die geselecteerd kunnen worden:

source: Choose a category of filters.
de: Wählen Sie eine Filterkategorie.
es: Elija una categoría de filtros.
fr: Choisissez une catégorie de filtre.
nl: Kies een categorie van filters.

source: Under the name of the category of filters are listed values (which are the metadata set for the datasets). Click one of the values. The other values disappear and the catalog directly updates to only display datasets matching the newly applied filter.
de: Unter dem Namen der Filterkategorie werden Werte aufgelistet (hierbei handelt es sich um die Metadaten für die Datensätze). Klicken Sie auf einen der Werte. Die anderen Werte werden ausgeblendet und der Katalog wird sofort aktualisiert, um nur die Datensätze anzuzeigen, die dem neu angewandten Filter entsprechen.
es: Bajo el nombre de la categoría de filtros figuran los valores (que son los metadatos establecidos para los conjuntos de datos). Haga clic en los valores. Los demás valores desaparecen y el catálogo se actualiza directamente para visualizar tan solo los conjuntos de datos que coinciden con el nuevo filtro aplicado.
fr: Sous le nom de la catégorie de filtre se trouvent les valeurs répertoriées (qui correspondent aux métadonnées définies pour les jeux de données). Cliquez sur l'une des valeurs ; les autres valeurs sont effacées et le catalogue se met instantanément à jour pour afficher uniquement les jeux de données correspondant au nouveau filtre appliqué.
nl: Onder de naam van de categorie van filters staat een lijst met waarden (dit zijn de metadata die ingesteld staan voor de datasets). Klik op een van de waarden. De andere waarden verdwijnen en de catalogus wordt meteen up-to-date gebracht zodat enkel de datasets worden weergegeven die overeenstemmen met de nieuw toegepaste filter.

source: For some categories, it can be possible to select more than one value. In this case, after clicking on a value, the others do not disappear. Click on any other value to filter even more.
de: Für einige Kategorien kann mehr als nur ein Wert ausgewählt werden. In diesem Fall werden die anderen Werte nicht ausgeblendet, nachdem Sie auf einen Wert geklickt haben. Klicken Sie auf einen beliebigen anderen Wert, um eine weitere Filterung vorzunehmen.
es: Algunas categorías permiten seleccionar varios valores. En ese caso, después de hacer clic en un valor, los demás no desaparecen. Haga clic en cualquier otro valor para seguir filtrando.
fr: En fonction des catégories, vous pouvez sélectionner plusieurs valeurs. Dans ce cas, après avoir cliqué sur une valeur, les autres resteront affichées. Cliquez sur une autre valeur pour appliquer un filtre supplémentaire.
nl: Voor sommige categorieën kunnen meer dan één waarde worden geselecteerd. In dat geval, wanneer op een waarde wordt geklikt, verdwijnen de andere waarden niet. Klik op elke andere waarde om nog meer te filteren.

source: For other categories, such as "Modification", the values are sorted in a hierarchical way. It means that the year must be selected first, then the months are displayed. Once the month is selected, the days are displayed in order to be selected as well.
de: Für andere Kategorien, wie z. B. "Änderung" werden die Werte hierarchisch sortiert. Das bedeutet, dass zuerst das Jahr ausgewählt werden muss, dann werden die Monate angezeigt. Sobald der Monat ausgewählt wurde, werden die auswählbaren Tage angezeigt.
es: En el caso de las demás categorías, como "Modificación", los valores se ordenan de forma jerárquica. Esto significa que primero se debe seleccionar el año y después se muestran los meses. Una vez seleccionado el mes, también se muestran los días para poder seleccionarlos.
fr: Pour d'autres catégories comme "Modification", les valeurs sont triées de façon hiérarchique. Cela signifie que l'année doit d'abord être sélectionnée pour que les mois s'affichent. Une fois le mois sélectionné, les jours s'affichent pour être à leur tour sélectionnés.
nl: Voor andere categorieën, zoals "Wijziging", worden de waarden op hiërarchische manier gesorteerd. Dit betekent dat eerst het jaar moet worden geselecteerd. Vervolgens worden de maanden weergegeven. Eenmaal de maand is geselecteerd, worden de dagen in volgorde weergegeven zodat deze ook geselecteerd kunnen worden.

source: Downloading the catalog
de: Den Katalog herunterladen
es: Descargar el catálogo
fr: Télécharger le catalogue
nl: De catalogus downloaden

source: Under all the filters are different possibilities to download the catalog. This does not allow to download all of the datasets from the catalog (or the filtered ones), but it allows to download an index of the datasets from the catalog along with their main metadata.
de: Unter allen Filtern gibt es verschiedene Möglichkeiten, den Katalog herunterzuladen. Dies ermöglicht nicht das Herunterladen aller Datensätze aus dem Katalog (oder den gefilterten), sondern das Herunterladen eines Index der Datensätze aus dem Katalog gemeinsam mit ihren wichtigsten Metadaten.
es: En todos los filtros existen varias posibilidades de descargar el catálogo. Esto no permite descargar todos los conjuntos de datos del catálogo (o los filtrados), sino que permite descargar un índice de los conjuntos de datos del catálogo junto con sus metadatos principales.
fr: En dessous de tous les filtres, vous avez différentes options pour télécharger le catalogue. Celles-ci ne vous permettent pas de télécharger tous les jeux de données du catalogue (ou ceux filtrés), mais de télécharger un index de tous les jeux de données du catalogue, ainsi que leurs métadonnées principales.
nl: Onder alle filters staan er verschillende mogelijkheden om de catalogus te downloaden. Hiermee kunnen niet alle datasets van een catalogus (of de gefilterde catalogi) worden gedownload, maar kan wel een index van de datasets vanuit de catalogus samen met de belangrijkste metadata ervan worden gedownload.

source: It is possible to download the catalog in the following formats:
de: Der Katalog kann in folgenden Formaten heruntergeladen werden:
es: Se puede descargar el catálogo en los formatos siguientes:
fr: Il est possible de télécharger le catalogue aux formats suivants :
nl: Het is mogelijk de catalogus te downloaden in de volgende formaten:

source: RSS feed
es: Fuente RSS
fr: flux RSS.

source: Using the `OpenDataSoft Search API <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets>`_, it is possible to download the catalog in other formats, such as JSON, data.json but also DCAT-AP (for Germany and Switzerland).
de: Mithilfe der `OpenDataSoft Search API <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets>`_, ist es möglich, den Katalog in anderen Formaten herunterzuladen, wie etwa JSON, data.json oder DCAT-AP (für Deutschland und Schweiz).
es: Con la API de búsqueda de OpenDataSoft <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets>_ es posible descargar el catálogo en otros formatos, como puede ser JSON, data.json, así como DCAT-AP (para Alemania y Suiza).
fr: Avec `l'API OpenDataSoft Search <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets>`_, vous pouvez télécharger le catalogue dans d'autres formats, tels que JSON, data.json mais aussi DCAT-AP (pour l'Allemagne et la Suisse).

source: Exploring a dataset from the catalog
de: Einen Datensatz aus dem Katalog untersuchen
es: Explorar un conjunto de datos del catálogo
fr: Explorer un jeu de données depuis le catalogue
nl: Een dataset uit de catalogus onderzoeken
