Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/01_looking_up_the_catalog/catalog.po
Languages: de, es, fr, it, nl

source: Once the right dataset has been found in the catalog, through the searching and filtering options or by scrolling down, it should be time to explore this dataset to see the data and their visualizations.
de: Nachdem Sie den richtigen Datensatz im Katalog gefunden haben (über die Such- und Filteroptionen oder durch Scrollen nach unten), ist es an der Zeit, diesen Datensatz zu erkunden, um die Daten und ihre Visualisierungen zu sehen.
es: Una vez encontrado el conjunto de datos adecuado en el catálogo, o bien mediante las opciones de búsqueda y filtro o bien mediante el desplazamiento, correspondería explorar este conjunto de datos para consultar los datos y sus visualizaciones.
fr: Une fois que vous avez trouvé le jeu de données souhaité dans le catalogue, grâce aux options de filtres et de recherche ou en faisant défiler, il est temps d'explorer ce jeu de données pour découvrir les données et leurs visualisations.
nl: Eenmaal de juiste dataset in de catalogus is teruggevonden dankzij de zoekopdracht en de filteropties of door naar beneden te scrollen, is het tijd om deze dataset te onderzoeken om de data en de weergaven ervan te zien.

source: From the catalog interface, only the catalog card of the dataset is displayed. The catalog card should show the following information:
de: Auf der Katalogoberfläche wird nur die Katalogkarte des Datensatzes angezeigt. Die Katalogkarte sollte folgende Informationen enthalten:
es: Desde la interfaz del catálogo, solo se visualiza la tarjeta de catálogo del conjunto de datos. La tarjeta de catálogo debería mostrar la información siguiente:
fr: Dans l'interface du catalogue, seule la fiche de catalogue du jeu de données est affichée. Elle doit présenter les informations suivantes :
nl: Vanuit de catalogusinterface wordt enkel de cataloguskaart van de dataset weergegeven. De cataloguskaart zou de volgende informatie moeten bevatten:

source: a pictogram, to represent the theme of the dataset
de: ein Piktogramm zur Darstellung des Datensatz-Themas
es: Un pictograma, para representar el tema del conjunto de datos
fr: un pictogramme, qui représente le thème du jeu de données ;
nl: een pictogram om het thema van de dataset weer te geven

source: the title of the dataset
de: den Titel des Datensatzes
es: Título del conjunto de datos
fr: le titre du jeu de données ;
nl: de titel van de dataset

source: the description of the dataset
de: die Beschreibung des Datensatzes
es: Descripción del conjunto de datos
fr: la description du jeu de données ;
nl: de beschrijving van de dataset

source: the name of the publisher
de: den Namen des Veröffentlichers
es: Nombre del publicador
fr: le nom du producteur ;
nl: de naam van de uitgever

source: the license of the dataset
de: die Lizenz des Datensatzes
es: Licencia del conjunto de datos
fr: la licence du jeu de données ;
nl: de licentie van de dataset

source: the keywords of the dataset
de: die Schlüsselwörter des Datensatzes
es: Palabras clave del conjunto de datos
fr: les mots-clés du jeu de données ;
nl: de trefwoorden van de dataset

source: links to the available visualizations of the dataset (e.g. Table, Map, etc.)
de: Links zu den verfügbaren Visualisierungen des Datensatzes (z. B. Tabelle, Karte usw.)
es: Vínculos a las visualizaciones del conjunto de datos disponibles (p. ej., Tabla, Mapa, etc.)
fr: des liens vers les visualisations disponibles du jeu de données (par exemple Table, Carte, etc.) ;
nl: koppelingen naar de beschikbare weergaven van de dataset (bijv. tabel, kaart, enz.)

source: links to tabs to share or reuse the dataset (e.g. Export, API)
de: Links zu Registerkarten zur Freigabe oder Weiterverwendung des Datensatzes (z. B. Export, API)
es: Vínculos a las pestañas para compartir o reutilizar el conjunto de datos (p. ej. Exportar, API, etc.)
fr: des liens vers des onglets pour partager ou réutiliser le jeu de données (par exemple Export, API).
nl: koppelingen naar tabs om de dataset te delen of te hergebruiken (bijv. exporteren, API)

source: Less information can be displayed: it depends on which metadata have been set before the dataset was published. For the links to the visualizations and tabs of the dataset, more or less can be available: it depends on which visualizations and tabs are available for the dataset.
de: Möglicherweise werden weniger Informationen angezeigt: es hängt davon ab, welche Metadaten vor der Veröffentlichung des Datensatzes angelegt wurden. Es kann auch eine unterschiedliche Anzahl an Links zu den Visualisierungen und Registerkarten des Datensatzes verfügbar sein: es kommt darauf an, welche Visualisierungen und Registerkarten für den Datensatz verfügbar sind.
es: Se puede visualizar menos información: depende de qué metadatos se han establecido antes de publicar el conjunto de datos. En el caso de los vínculos a las visualizaciones y pestañas del conjunto de datos, puede haber más o menos disponibles: depende de qué visualizaciones y pestañas están disponibles para el conjunto de datos.
fr: Moins d'informations peuvent être affichées : cela dépend des métadonnées qui ont été définies avant la publication du jeu de données. Le nombre de liens vers les visualisations et d'onglets du jeu de données peut varier : cela dépend des visualisations et onglets disponibles pour le jeu de données.
nl: Het is mogelijk dat minder informatie wordt weergegeven: dit hangt af van welke metadata werden ingesteld alvorens de dataset werd gepubliceerd. Voor de koppelingen naar de weergaven en tabs van de dataset kan er meer of minder beschikbaar zijn: dit hangt af van welke weergaven en tabs er beschikbaar zijn voor de dataset.

source: Note also that the catalog cards can be completely customized by the portal administrators.
de: Beachten Sie auch, dass die Katalogkarten von den Portal-Administratoren vollständig angepasst werden können.
es: Tenga en cuenta también que las tarjetas de catálogo pueden ser personalizadas íntegramente por los administradores del portal.
fr: Notez également que les fiches de catalogue peuvent être totalement personnalisées par les administrateurs du portail.
nl: Merk ook op dat de cataloguskaarten volledig kunnen worden gepersonaliseerd door de beheerders van het portaal.

source: To see more of the dataset, either click the catalog card or any of the links to directly access a precise visualization or tab. From the interface dedicated to the dataset, it is possible to:
de: Um mehr von dem Datensatz zu sehen, klicken Sie entweder auf die Katalogkarte oder auf einen der Links, um direkt zu einer präzisen Visualisierung oder Registerkarte zu gelangen. Über die Benutzeroberfläche des jeweiligen Datensatzes ist Folgendes möglich:
es: Para ver más información del conjunto de datos, haga clic en la tarjeta de catálogo o cualquiera de los vínculos para acceder directamente a una visualización o pestaña determinada. Desde la interfaz específica del conjunto de datos, se pueden llevar a cabo las tareas siguientes:
fr: Pour explorer davantage le jeu de données, cliquez sur la fiche de catalogue ou sur les liens pour accéder instantanément à une visualisation ou un onglet précis. Depuis l'interface dédiée au jeu de données, vous avez la possibilité d'effectuer les opérations suivantes :
nl: Om meer van de dataset te zien, klik ofwel op de cataloguskaart of op een van de koppelingen om rechtstreeks toegang te hebben tot de precieze weergave of tab. Van uit de speciale interface van de dataset is het mogelijk om:

source: visualize the data,
de: Visualisierung der Daten,
es: Visualizar los datos
fr: visualiser les données ;
nl: de data te bekijken,

source: search the data,
de: Durchsuchen der Daten,
es: Buscar en los datos
fr: effectuer une recherche dans les données ;
nl: de data op te zoeken,

source: share and reuse the data,
de: Freigabe und Weiterverwendung der Daten,
es: Compartir y reutilizar los datos
fr: partager et réutiliser les données ;
nl: de data te delen en te hergebruiken

source: react and subscribe to the dataset.
de: Reagieren und den Datensatz abonnieren.
es: Reaccionar y suscribirse al conjunto de datos.
fr: réagir par rapport au jeu de données et vous y abonner.
nl: te reageren en zich te abonneren op de dataset.

source: Using the `OpenDataSoft API <https://help.opendatasoft.com/en/apis/>`_, it is possible to download the catalog in JSON and data.json.
nl: Wanneer de `OpenDataSoft API <https://help.opendatasoft.com/en/apis/>`_ wordt gebruikt, is het mogelijk om de catalogus in JSON en data.json te downloaden.

source: Looking up the catalog
it: Ricerca nel catalogo

source: OpenDataSoft lets you find datasets with a rich search based experience. The catalog is often accessible via the **Explore** or **Datasets** link on the header menu. It allows to filter through all the portal's datasets by keyword, publisher, date or theme, among others.
it: La piattaforma OpenDataSoft mette a disposizione un raffinato strumento di ricerca per i dataset. Il catalogo è di solito accessibile nel menu dell'header cliccando su **Esplora** o **Dataset**. Inoltre, è possibile filtrare tutti i dataset di un portale per parola chiave, entità di pubblicazione, data, tema e altro ancora.

source: Navigating in the catalog
it: Navigazione del catalogo

source: The main part of the catalog shows a series of cards representing each dataset available on the platform. On each card, the dataset's metadata are displayed, along with quick links to visualize the data.
it: La parte principale del catalogo presenta le schede dei vari dataset disponibili nella piattaforma. Ogni scheda contiene i metadati del dataset e alcuni collegamenti rapidi per visualizzare i dati.

source: On this example, the card is split in two parts. On the left part, there is a theme pictogram, the title, a description, the language and license, keywords and the original publisher. On the right part, there are links to access the data table, a map and analysis tools, and to export or access the API of the dataset.
it: In questo esempio, le schede si dividono in due parti. Quella di sinistra contiene il pittogramma del tema, il titolo, la descrizione, la lingua, la licenza, le parole chiave e l'entità di pubblicazione originaria. Quella di destra propone alcuni link diretti alla tabella dei dati, alla mappa, agli strumenti di analisi, alla sezione di esportazione e a quella dell'API del dataset.

source: Like most of the catalog's elements, this card is fully customizable.
it: Come la maggior parte degli elementi che compongono il catalogo, questa scheda è totalmente personalizzabile.

source: On the left hand side of the catalog sits the filtering menu. It allows the user to sort the dataset list by date or title, and to filter it with precision.
it: Sul lato sinistro del catalogo si trova il menu dei filtri, che consente all'utente di ordinare l'elenco dei dataset per data o titolo, o ancora di filtrarlo nel dettaglio.

source: Full text search
it: Ricerca full-text

source: The text box filters the list thanks to a full text search across all the datasets. It means it will show any dataset that contains the searched text in any of its metadata.
it: La casella di ricerca testuale filtra l'elenco dei dataset mediante una ricerca full-text, restituendo tutti quelli che nei propri metadati contengono il testo digitato.

source: Type the searched text in the box and click on the magnifying glass pictogram to filter the list via a full text search.
it: Per filtrare l'elenco in questo modo, inserisci il testo nella casella e clicca sull'icona della lente d'ingrandimento.

source: Geographic search
it: Ricerca geografica

source: Datasets are often closely related to a geographic area, be it a country, a city, a district, etc.
it: I dataset contengono spesso riferimenti a un'area geografica: un paese, una città, un quartiere, ecc.

source: The map filters the list by location. It will only show datasets that contain geographic data (geopoints or geoshapes mainly) inside the selected rectangle on the map.
it: La mappa filtra l'elenco in base alla posizione geografica e visualizza unicamente i dataset che, all'interno del rettangolo selezionato, contengono dati di questo tipo (per lo più, punti geografici e forme geografiche).

source: The mini-map used for filtering on the catalog page.
it: Mini-mappa utilizzata per filtrare la pagina del catalogo

source: Click on the little rectangle button on the top left of the map to select the drawing tool, and draw a rectangle on the area you want on the map to activate the filter. To cancel a selection, just click on the rectangle button again.
it: Per disegnare l'area tramite cui filtrare i dataset, clicca sull'icona raffigurante il piccolo riquadro nell'angolo in alto a sinistra della mappa: vedrai così comparire lo strumento di disegno. Per eliminare una selezione, basta semplicemente cliccare ancora una volta sull'icona del riquadro.

source: Filters
it: Filtri

source: Under the geographic search map, there is a list of selectable filters sorted by category. They are constructed from the datasets metadata and enable the user to filter all the datasets that have the same attributes like language, theme, keywords, publisher, date, among others.
it: Sotto la barra di ricerca geografica della mappa, è presente un elenco di filtri basati sui metadati dei dataset e organizzati per categorie. Una volta selezionati, questi consentono all'utente di filtrare i dataset per lingua, tema, parole chiave, entità di pubblicazione, data e altro ancora.

source: Click on the values you want to use to filter the dataset list. For some categories like keywords and themes, it is possible to select multiple values, and for some others like modification date, the selection is hierarchical. For example, selecting a year will let you to choose the month.
it: Per fare ciò, clicca sui valori con cui desideri filtrare l'elenco. Alcune categorie come le parole chiave e i temi permettono selezioni multiple, mentre altre come la data di modifica offrono una scelta di tipo gerarchico: ad esempio, selezionando un anno avrai la possibilità di specificare il mese.

source: In the case of keywords, you can also click on them directly on a dataset card to filter the catalog on that keyword.
it: Nel caso delle parole chiave, puoi anche selezionarle direttamente dalla scheda del dataset, filtrando così il catalogo in base alla parola desiderata.

source: The catalog filters of a portal can be customized, including which filters are proposed, the order of the filters, and how to order the suggested values. Please contact us for more information.
it: I filtri del catalogo di un portale possono essere personalizzati, scegliendo tra le altre cose il tipo di filtri da proporre, il loro ordine e quello dei valori suggeriti. Per maggiori informazioni, ti invitiamo a contattarci.

source: Exploring a dataset
it: Esplorazione di un dataset

source: Once you find your dataset, it is time to explore the data by clicking on the card title or description to switch to the `dataset page`__.
it: Una volta individuato il dataset che ti interessa, clicca sul titolo o sulla descrizione della sua scheda ed accederai così alla `pagina del dataset`__.
