Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/10_checking_dataset_history/checking_dataset_history.po
Languages: de, es, fr, nl

source: Checking dataset history
de: Überprüfung der Historie von Datensätzen
es: Comprobar el historial del conjunto de datos
fr: Consulter l'historique du jeu de données
nl: De historiek van een dataset controleren

source: The History tab displays the list of items representing all modifications operated on the dataset since its creation.
de: In der Registerkarte "Historie" wird eine Liste der Elemente angezeigt, die Änderungen an dem Datensatz seit seiner Erstellung darstellen.
es: La pestaña Historial muestra la lista de elementos que representan todas las modificaciones realizadas en el conjunto de datos desde que se creó.
fr: L'onglet Historique contient la liste des éléments représentant toutes les modifications effectuées sur le jeu de données depuis sa création.
nl: De tab Historiek geeft de lijst weer van de items die alle wijzigingen weergeven die zijn uitgevoerd op de dataset sinds deze werd aangemaakt.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: The actions operated on both the Security and Scheduling tabs are never taken into account to update the dataset history, thus never displayed in the History tab.
de: Die unter den Registerkarten "Sicherheit" und "Planung" vorgenommenen Aktionen werden bei der Aktualisierung der Datensatz-Historie niemals berücksichtigt und daher nicht unter der Registerkarte "Historie" angezeigt.
es: Las acciones ejecutadas en las pestañas Seguridad y Planificación no se tienen nunca en cuenta al actualizar el historial del conjunto de datos, por lo que nunca figuran en la pestaña Historial.
fr: Les actions effectuées sur les onglets Sécurité et Planification ne sont jamais prises en compte pour la mise à jour de l'historique du jeu de données et, par conséquent, ne figurent jamais dans l'onglet Historique.
nl: Er wordt nooit rekening gehouden met de acties die zijn uitgevoerd op de tabs Veiligheid en Scheduling om de historiek van een dataset te updaten. Deze worden dus ook nooit weergegeven in de tab Historiek.

source: Each listed item gives the following information:
de: Jedes aufgelistete Element enthält die folgenden Informationen:
es: Cada uno de los elementos de la lista facilita la información siguiente:
fr: Chaque élément de la liste apporte les informations suivantes :
nl: Elk item in de lijst verschaft de volgende informatie:

source: name of the user who operated the action(s)
de: Name des Benutzers, der die Aktion(en) ausgeführt hat
es: Nombre del usuario que llevó a cabo la acción
fr: nom de l'utilisateur ayant effectué la/les action(s),
nl: naam van de gebruiker die de actie(s) heeft uitgevoerd

source: date when the modification was operated
de: Datum, an dem die Änderung durchgeführt wurde
es: Fecha en que se llevó a cabo la modificación
fr: date à laquelle la modification a été apportée,
nl: datum waarop de wijziging werd uitgevoerd

source: nature of the modification
de: Art der Änderung
es: Naturaleza de la modificación llevada a cabo
fr: nature de la modification.
nl: aard van de wijziging

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: The only item without any modification description should be at the bottom of the history: it corresponds to the creation of the dataset.
de: Das einzige Element ohne Änderungsbeschreibung sollte sich am Ende der Historie befinden: hierbei handelt es sich um die Erstellung des Datensatzes.
es: El único elemento que aparece sin descripción de modificación alguna, y figura en la parte inferior del historial, corresponde a la creación del conjunto de datos.
fr: Le seul élément sans description de modification se trouve en bas de l'historique. Il correspond à la création du jeu de données.
nl: Het enige item zonder beschrijving van de wijziging zou onderaan de historiek moeten staan: dit stemt overeen met het aanmaken van de dataset.

source: Reverting to a former configuration
de: Zurücksetzen auf eine frühere Konfiguration
es: Revertir a una configuración anterior
fr: Rétablir une configuration antérieure
nl: Terugkeren naar een vorige configuratie

source: It is possible to revert to a former version of the dataset by clicking on an item from the History tab.
de: Durch Anklicken eines Elements in der Registerkarte "Historie" kann eine frühere Version des Datensatzes wiederhergestellt werden.
es: Se puede volver a una versión anterior del conjunto de datos haciendo clic en un elemento de la pestaña Historial.
fr: Il est possible de rétablir une version antérieure du jeu de données en cliquant sur un élément de l'onglet Historique.
nl: Het is mogelijk om terug te keren naar een vorige versie van de dataset door op een item in de tab Historiek te klikken

source: Instead of erasing items from the list, it creates a new item indicating which modifications were operated to revert to the chosen former configuration.
de: Dabei werden keine Elemente aus der Liste gelöscht. Stattdessen wird ein neues Element erstellt. Es gibt an, welche Änderungen durchgeführt wurden, um zur ausgewählten früheren Konfiguration zurückzukehren.
es: En lugar de borrar los elementos de la lista, se crea un nuevo elemento que indica qué modificaciones se han llevado a cabo para volver a la configuración anterior en cuestión.
fr: Au lieu d'effacer les éléments de la liste, cette option crée un nouvel élément indiquant quelles modifications ont été effectuées afin de rétablir la configuration antérieure choisie par l'utilisateur.
nl: In plaats van items uit de lijst te wissen, maakt deze een nieuw item aan dat aangeeft welke wijzigingen werden uitgevoerd om terug te keren naar de gekozen vorige configuratie.

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: Use this feature with caution, as it can be risky for the dataset when it comes to more important configurations. We especially would not advise to go back to a configuration that was operated before a source change.
de: Verwenden Sie diese Funktion mit Vorsicht: im Fall von wichtigen Konfigurationen kann sie riskant für den gesamten Datensatz sein. Insbesondere raten wir davon ab, zu einer Konfiguration zurückzukehren, die vor einem Quellenwechsel verwendet wurde.
es: Use esta función con cuidado, puesto que puede poner en riesgo el conjunto de datos en el caso de configuraciones importantes. En concreto, se recomienda no volver a una configuración previa a un cambio de origen.
fr: Utilisez cette fonctionnalité avec prudence : elle entraîne des risques pour le jeu de données si les éléments les plus importants de la configuration sont modifiés. Nous déconseillons particulièrement de rétablir une configuration précédant une modification de la source.
nl: Gebruik deze functie met de nodige omzichtigheid aangezien deze risico's kan inhouden voor de dataset wanneer het belangrijkere configuraties betreft. We zouden vooral niet aanraden om terug te keren naar een configuratie die gebruikt werd voor een bronwijziging.

source: Note also that in case the dataset was duplicated: it isn't possible to revert to a former version if the dataset source was added by another user.
de: Falls der Datensatz dupliziert wurde: es ist nicht möglich, zu einer früheren Version zurückzukehren, wenn die Datensatz-Quelle von einem anderen Benutzer hinzugefügt wurde.
es: Además, si se hubiera duplicado el conjunto de datos, no se podría recuperar una versión anterior si el origen del conjunto de datos hubiera sido añadido por otro usuario.
fr: Veuillez également noter que, lorsque le jeu de données a été dupliqué, il n'est pas possible de restaurer une version précédente si la source du jeu de données n'a pas été ajoutée par un autre utilisateur.
