Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/arcgis_opendata.po
Languages: de, es, nl

source: ArcGIS Hub Portals harvester
de: ArcGIS Hub Portal Harvester
es: Recolector de portales ArcGIS Hub

source: Retrieve datasets from portals listed on ArcGIS Hub.
de: Datensätze von Portalen abrufen, die bei ArcGIS Hub aufgeführt sind.
es: Recuperar conjuntos de datos de portales que figuran en ArcGIS Hub.
nl: Datasets ophalen uit portalen die opgesomd staan op ArcGIS Hub.

source: Parameters
de: Parameter
es: Parámetros

source: Name
es: Nombre
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Example
de: Beispiel
es: Ejemplo
nl: Voorbeeld

source: API url (portal_url)
es: Dirección URL de la API (portal_url)

source: The base URL of the portal
de: Die Basis-URL des Portals
es: Dirección URL base del portal.
nl: De basis-URL van het portaal

source: Compute geographical area (compute_geo_area)
de: Geografischen Bereich berechnen (compute_geo_area)
es: Calcular área geográfica (compute_geo_area)
nl: Geografisch gebied berekenen (compute_geo_area)

source: If set, automatically computes the geographic area covered by the dataset ("Geographic area" option in the publish interface information tab)
de: Berechnet, wenn eingerichtet, automatisch den vom Datensatz abgedeckten geografischen Bereich (Option "Geographic area" im Informationsregister der Publikationsschnittstelle)
es: Si se establece, calcula automáticamente el área geográfica cubierta por el conjunto de datos (opción "Área geográfica" en la ficha de información de la interfaz de publicación).
nl: Indien ingesteld, wordt het geografisch gebied automatisch berekend dat bestreken wordt door de dataset (optie "Geografisch gebied" in het informatietabblad publiceer interface)

source: Process data (fetch_data)
de: Daten verarbeiten (fetch_data)
es: Procesar datos (fetch_data)
nl: Verwerk data (fetch_data)

source: Download the data if true, else only download metadata and link to actual data
de: Daten herunterladen, wenn 'wahr', sonst nur Download der Metadaten und Verknüpfung zu den aktuellen Daten
es: Si el valor es true, descargar los datos; de lo contrario, descargar únicamente los metadatos y vincular a los datos reales.
nl: Download de data indien waar. Zo niet, download enkel metadata en koppel deze aan effectieve data

source: True/False
de: Wahr/Falsch
nl: Waar/Onwaar
