Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/ckan.po
Languages: de, fr, it, nl

source: Retrieve datasets from a CKAN portal.
de: Datensätze von einem CKAN-Portal abrufen.
fr: Récupérer les jeux de données d'un portail CKAN
it: Richiama i dataset da un portale CKAN.
nl: Haal datasets op uit een CKAN-portaal.

source: Parameters
de: Parameter
fr: Paramètres
it: Parametri

source: Description
de: Beschreibung
it: Descrizione
nl: Omschrijving

source: Example
de: Beispiel
fr: Exemple
it: Esempio
nl: Voorbeeld

source: CKAN root URL (url)
de: CKAN-Wurzel-URL (url)
fr: URL racine CKAN (url)
it: URL radice CKAN (url)

source: The base url of the portal
de: Die Basis-URL des Portals
fr: L'URL de base du portail
it: URL base del portale
nl: De basis-URL van het portaal

source: Maximum results to harvest (limit)
de: Maximal zu sammelnde Ergebnisse (Limit)
fr: Nombre maximum de jeux de données à moissonner (limit)
it: Numero massimo di risultati per l'harvesting (limit)
nl: Maximale resultaten om te harvesten (limiet)

source: Only retrieve a certain amount of datasets.
de: Nur eine bestimmte Datensatzmenge abrufen.
fr: Ne récupérer qu'une certaine quantité de jeux de données
it: Richiama solo un certo numero di dataset.
nl: Haal enkel een bepaalde hoeveelheid datasets op.

source: Number of results to skip before starting the harvest (offset)
de: Anzahl der vor dem Start der Sammlung zu überspringenden Ergebnisse (Versatz)
fr: Nombre de jeux de données à ignorer avant de commencer le moissonnage (offset)
it: Numero di risultati da ignorare prima di iniziare l'harvesting (offset)
nl: Aantal resultaten dat moet worden overgeslagen alvorens de harvest te beginnen (offset)

source: Skip a certain amount of datasets before starting to harvest.
de: Eine bestimmte Datenmenge überspringen, bevor das Sammeln beginnt.
fr: Ignore une certaine quantité de jeux de données avant de commencer le moissonnage
it: Ignora un certo numero di dataset prima di iniziare l'harvesting.
nl: Sla een bepaald aantal datasets over alvorens de harvest te beginnen.

source: Sort parameter (sort)
de: Sortierparameter (sort)
fr: Paramètre de tri (sort)
it: Parametro di ordinamento (sort)
nl: Sorteer parameter (sorteer)

source: Sorting of the CKAN search results. Default: 'relevance asc, metadata_modified desc'. This is a comma-separated string of field names and sort-orderings.
de: Sortierung der CKAN-Suchergebnisse. Standardmäßig: 'relevance asc, metadata_modified desc'. Dies ist eine durch ein Komma getrennte Zeichenfolge von Feldnamen und Sortierreihenfolgen.
fr: Trier les résultats de la recherche CKAN. Par défaut : 'relevance asc, metadata_modified desc'. Liste de chaines de caractères séparées par des virgules contenant le nom du champs et l'ordre de tri.
it: Ordina i risultati della ricerca CKAN. Valore predefinito: 'relevance asc, metadata_modified desc'. Questa Ã¨ una stringa di nomi di campo e ordinamenti separati da virgola.
nl: Bezig met sorteren van de CKAN-zoekresultaten. Standaard: 'relevance asc, metadata_modified desc'. Dit is een door komma's gescheiden string van veldnamen en plaatsingen in volgorde op basis van de soort.

source: relevance desc
de: Relevanz abst.

source: CKAN API Key (api_key)
de: CKAN-API-Schlüssel (api_key)
fr: Clé d'API CKAN (api_key)
it: Chiave API CKAN (api_key)
nl: CKAN API-sleutel (api_key)

source: If the portal requires authentication, your API Key.
de: Ihr API-Schlüssel, falls das Portal eine Authentifizierung erfordert.
fr: Si le portail requiert une authentification, votre clé d'API
it: Chiave API, se il portale richiede l'autenticazione.
nl: Indien het portaal moet worden geverifieerd, uw API-sleutel.

source: CKAN Group (group)
de: CKAN-Gruppe (group)
fr: Groupe CKAN (group)
it: Gruppo CKAN (group)
nl: CKAN-groep (groep)

source: Name of the group you want to harvest.
de: Name der zu sammelnden Gruppe.
fr: Nom du groupe que vous souhaitez moissonner.
it: Nome del gruppo su cui eseguire l'harvesting.
nl: Naam van de groep die u wil harvesten.

source: education
de: Bildung
nl: opleiding

source: CKAN harvester
fr: Moissonneur CKAN
it: Harvester CKAN

source: Name
fr: Nom
it: Nome
nl: Naam
