Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/csw.po
Languages: de, es, nl

source: CSW harvester
es: Recolector de CSW

source: Retrieve datasets from a Catalog Service for the Web (CSW portal).
de: Datensätze von einem Catalog Service for the Web abrufen (CSW-Portal).
es: Recuperar conjuntos de datos de un portal CSW (Catalog Service for the Web).
nl: Haal datasets op uit een Catalog Service voor het internet (CSW-portaal).

source: The CSW server must provide the following capabilities:
de: Der CSW-Server muss folgende Fähigkeiten besitzen:
es: El servidor CSW debe proporcionar las funciones siguientes:
nl: De CSW-server moet de volgende mogelijkheden voorzien:

source: CSW version: 2.0.2
es: Versión de CSW: 2.0.2
nl: CSW-versie: 2.0.2

source: This harvester is not available by default. If you need to use it, please contact Opendatasoft support team.
de: Dieser Harvester ist nicht standardmäßig verfügbar. Sollten Sie ihn benötigen, wenden Sie sich bitte an das Opendatasoft-Supportteam.
es: Este recolector no está disponible de forma predeterminada. Si necesita usarlo, póngase en contacto con el equipo de soporte de Opendatasoft.
nl: Deze harvester is standaard niet beschikbaar. Indien u deze moet gebruiken, neem dan contact op met het Support Team van Opendatasoft.

source: Parameters
de: Parameter
es: Parámetros

source: Name
es: Nombre
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Example
es: Ejemplo
nl: Voorbeeld

source: Csw url (cswurl)
es: Dirección URL de CSW (cswurl)

source: The base URL of the CSW geoportal
es: Dirección URL base del geoportal CSW.
nl: De basis-URL van het CSW-geoportaal

source: Theme thesaurus (theme_thesaurus)
es: Sinónimos de temas (theme_thesaurus)
nl: Themathesaurus (theme_thesaurus)

source: The name of the thesaurus used to fill the themes metadata
de: Name des zum Befüllen der Thema-Metadaten verwendeten Thesaurus
es: El nombre del recurso de sinónimos utilizado para rellenar los metadatos de temas.
nl: De naam van de thesaurus die gebruikt wordt om de metadata van de thema's in te vullen

source: Constraint language to CQL_TEXT (constraint_language)
es: Restringir lenguaje a CQL_TEXT (constraint_language)
nl: Verplichte taal voor CQL_TEXT (constraint_language)

source: Set this option to True if the portal requires to constraint the language to CQL_TEXT
es: Establecer esta opción en True si el portal necesita restringir el lenguaje para CQL_TEXT.
nl: Stel deze optie in op Waar indien het portaal vereist om te taal voor CQL_TEXT te verplichten

source: User (username)
es: Usuario (username)
nl: Gebruiker (gebruikersnaam)

source: The username if the CSW service needs authentication
es: El nombre de usuario si el servicio CSW necesita autenticación.
nl: De gebruikersnaam indien de CSW-service geverifieerd moet worden

source: Password (password)
es: Contraseña (password)
nl: Wachtwoord (wachtwoord)

source: The password if the CSW service needs authentication
es: La contraseña si el servicio CSW necesita autenticación.
nl: Het wachtwoord indien de CSW-service geverifieerd moet worden

source: True/False
nl: Waar/Onwaar

source: The base URL of the CSW geoportal, for example: https://infogeo.grandpoitiers.fr/geoportal/csw
de: Die Basis-URL des CSW-Geoportals, zum Beispiel: https://infogeo.grandpoitiers.fr/geoportal/csw

source: User
de: Benutzer

source: The username if the CSW service requires authentication
de: Der Benutzername, falls der CSW-Dienst die Authentifizierung erfordert

source: Password
de: Passwort

source: The password if the CSW service requires authentication
de: Das Kennwort, falls der CSW-Dienst die Authentifizierung erfordert

source: Theme thesaurus
de: Thema des Thesaurus

source: Constraint language
de: Sprache der Einschränkung

source: Select the check box if the portal requires to constraint the language to CQL_TEXT
de: Aktivieren Sie das Kontrollkästchen, wenn das Portal die Beschränkung der Sprache auf CQL_TEXT erfordert

source: Invert coordinates
de: Koordinaten umkehren

source: Select the check box to enforce coordinate inversion in generated datasets
de: Aktivieren Sie das Kontrollkästchen, um die Koordinatenumkehr in den erzeugten Datensätzen zu erzwingen.
