Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/datagouv.po
Languages: de, es, fr, nl

source: data.gouv.fr harvester
es: Recolector de data.gouv.fr
fr: Moissonneur data.gouv.fr

source: Retrieve datasets from a data.gouv.fr portal.
de: Datensätze von einem Portal data.gouv.fr abrufen.
es: Recuperar juegos de datos de un portal data.gouv.fr.
fr: Récupérer les jeux de données d'un portail data.gouv.fr.
nl: Haal datasets op uit een data.gouv.fr-portaal.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: This page is about harvesting data from data.gouv.fr to an Opendatasoft platform. To learn how to harvest data from Opendatasoft to data.gouv.fr please visit |datagouvdoc|.
de: Diese Seite wird Daten von data.gouv.fr zu einer Opendatasoft-Plattform übertragen. Wenn Sie erfahren möchten, wie Daten von Opendatasoft zu data.gouv.fr übertragen werden, besuchen Sie |datagouvdoc|.
es: Esta página hace referencia a la recolección de datos de data.gouv.fr en una plataforma Opendatasoft. Para aprender a recolectar datos de Opendatasoft en data.gouv.fr, visite |datagouvdoc|.
fr: Cette page concerne la collecte de données depuis data.gouv.fr et vers une plateforme Opendatasoft. Pour apprendre à collecter des données depuis Opendatasoft et vers data.gouv.fr, veuillez consulter |datagouvdoc|.
nl: Deze pagina staat op het punt data te harvesten van data.gouv.fr naar een Opendatasoft-platform. Om te leren hoe u data harvest van Opendatasoft naar data.gouv.fr, gelieve idatagouvdocl te raadplegen.

source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples
nl: Voorbeelden

source: Organization ID (organization_id)
de: Organisation ID (Organisation_id)
es: ID de organización (organization_id)
fr: ID de l'organisation (organization_id)
nl: Organisatie-ID (organization_id)

source: The identifier of the organization you want to harvest.
de: Die Kennung der der Organisation, für die Sie einen Harvester einrichten wollen.
es: El identificador de la organización que desea recolectar.
fr: L'identifiant de l'organisation à moissonner.
nl: Het ID van de organisatie die u wilt harvesten.

source: You can find the identifier for a specific organization as follows:
de: Sie können die Kennung für eine bestimmte Organisation wie folgendermaßen finden:
es: Puede encontrar el identificador de una organización específica siguiendo este procedimiento:
fr: Vous pouvez trouver l'identifiant d'une organisation spécifique en procédant comme suit :
nl: U kunt het ID voor een specifieke organisatie als volgt terugvinden:

source: Go to https://www.data.gouv.fr/fr/organizations/.
de: Öffnen Sie https://www.data.gouv.fr/fr/organizations/.
es: Vaya a https://www.data.gouv.fr/fr/organizations/.
fr: Rendez-vous sur le site https://www.data.gouv.fr/fr/organizations/.
nl: Ga naar https://www.data.gouv.fr/fr/organizations/.

source: Search for an organization.
de: Suchen Sie nach einer Organisation.
es: Busque una organización.
fr: Recherchez une organisation.
nl: Zoek een organisatie.

source: Click on the desired result to open it.
de: Klicken Sie auf das gewünschte Ergebnis, um es zu öffnen.
es: Haga clic en el resultado deseado para abrirlo.
fr: Cliquez sur le résultat souhaité pour ouvrir la page correspondante.
nl: Klik op het gewenste resultaat om het te openen.

source: On the desired organization page, you'll find the `ID` under the "Informations techniques" section.
de: Auf der Seite der gewünschten Organisation finden Sie die "ID" unter dem Abschnitt "Informations techniques".
es: En la página de la organización en cuestión, encontrará el identificador (`ID`) bajo la sección "Informations techniques".
fr: Vous trouverez l'`ID` sous la section "Informations techniques" de la page de l'organisation souhaitée.
nl: Op de pagina van de gewenste organisatie vindt u het "ID" terug onder de rubriek "Technische informatie".

source: ``534fff75a3a7292c64a77de4`` is the identifier for etalab.
de: ``534fff75a3a7292c64a77de4`` ist die Kennung für etalab.
es: ``534fff75a3a7292c64a77de4`` es el identificador de etalab.
fr: ``534fff75a3a7292c64a77de4`` est l'identifiant d'etalab.
nl: ``534fff75a3a7292c64a77de4`` is het ID voor etalab.

source: Filter parameter name (filter_name)
es: Nombre de parámetro de filtro (filter_name)
fr: Nom du paramètre filtre (filter_name)
nl: Naam van de filterparameter (filter_name)

source: The name of the parameter you want to pass to the data.gouv.fr API to filter the request that will be performed:
de: Der Name des Parameters, den Sie an die data.gouv.fr-API übergeben wollen, um die auszuführende Anfrage zu filtern:
es: Nombre del parámetro que desea pasar a la API data.gouv.fr para filtrar la solicitud que se ejecutará:
fr: Le nom du paramètre à passer à l'API data.gouv.fr pour filtrer la requête à effectuer :
nl: De naam van de parameter die u wilt doorgeven aan data.gouv.fr API om het verzoek te filteren dat zal worden uitgevoerd:

source: ``tag`` is used to filter datasets associated with a specific keyword.
de: ``tag`` wird verwendet, um Datensätze zu filtern, die mit einem bestimmten Schlüsselwort in Zusammenhang stehen.
es: ``tag`` permite filtrar los conjuntos de datos asociados a una palabra clave específica.
fr: ``tag`` est utilisé pour filtrer les jeux de données associés à un mot-clé.
nl: ``tag`` wordt gebruikt om datasets te filteren die gekoppeld zijn aan een specifiek trefwoord.

source: ``license`` is used to filter datasets published under a specific license.
de: Mit ``license`` können Datensätze gefiltert werden, die unter einer bestimmten Lizenz veröffentlicht wurden.
es: ``license`` permite filtrar los conjuntos de datos publicados bajo una licencia específica.
fr: ``license`` est utilisé pour filtrer les jeux de données publiés sous une licence spécifique.
nl: ``license`` wordt gebruikt om datasets te filteren die gepubliceerd worden onder een specifieke licentie.

source: ``temporal_coverage`` is used to filter datasets with data covering a specific period.
de: ``temporal_coverage`` wird verwendet, um Datensätze zu filtern, deren Daten einen bestimmten Zeitraum abdecken.
es: ``temporal_coverage`` permite filtrar los conjuntos de datos con datos que cubren un periodo específico.
fr: ``temporal_coverage`` est utilisé pour filtrer les jeux de données avec des données couvrant une période spécifique.
nl: ``temporal_coverage`` wordt gebruikt om datasets te filteren waarvan de data een specifieke periode bestrijken.

source: ``geozone`` is used to filter datasets with data covering a specific geographical area.
de: ``geozone`` wird verwendet, um Datensätze mit Daten zu filtern, die ein bestimmtes geografisches Gebiet abdecken.
es: ``geozone`` permite filtrar los conjuntos de datos con datos que cubren una zona geográfica específica.
fr: ``geozone`` est utilisé pour filtrer les jeux de données avec des données couvrant une zone géographique spécifique.
nl: ``geozone`` wordt gebruikt om datasets te filteren met data die een specifiek geografisch gebied bestrijken.

source: ``granularity`` is used to filter datasets with a specific territorial coverage granularity.
de: ``granularity`` wird verwendet, um Datensätze mit einer bestimmten territorialen Granularität zu filtern.
es: ``granularity`` permite filtrar los conjuntos de datos con una granularidad de cobertura territorial específica.
fr: ``granularity`` est utilisé pour filtrer les jeux de données avec une granularité de couverture territoriale spécifique.
nl: ``granularity`` wordt gebruikt om datasets te filteren met een specifieke granulariteit van de territoriale dekking.

source: ``format`` is used to filter datasets published under a specific format.
de: ``format`` wird verwendet, um Datensätze zu filtern, die in einem bestimmten Format veröffentlicht wurden.
es: ``format`` permite filtrar los conjuntos de datos publicados con un formato específico.
fr: ``format`` est utilisé pour filtrer les jeux de données publiés sous un format spécifique.
nl: ``format`` wordt gebruikt om datasets te filteren die gepubliceerd worden onder een specifiek formaat.

source: Filter parameter value (filter_value)
de: Filterparameterwert (filter_value)
es: Valor de parámetro de filtro (filter_value)
fr: Valeur du paramètre filtre (filter_value)
nl: Waarde van de filterparameter (filter_value)

source: The value of the filter parameter
de: Der Wert des Filterparameters
es: Valor del parámetro de filtro
fr: La valeur du paramètre de filtre
nl: De waarde van de filterparameter

source: The value for some filter parameters has a very specific syntax. When performing a search on `data.gouv.fr <https://www.data.gouv.fr/fr/datasets/>`_, the URL is of the form ``data.gouv.fr/fr/datasets/?[filter_name]=[filter_value]``. You can retrieve the values from the URL to set your harvester.
de: Der Wert für einige Filterparameter hat eine sehr spezifische Syntax. Bei einer Suche auf `data.gouv.fr <https://www.data.gouv.fr/fr/datasets/>`_ hat die URL das Format ``data.gouv.fr/fr/datasets/?[filter_name]=[filter_value]``. Sie können die Werte aus der URL abrufen, um Ihren Harvester einzustellen.
es: El valor de algunos parámetros de filtro tiene una sintaxis muy concreta. Al efectuar una búsqueda en `data.gouv.fr <https://www.data.gouv.fr/fr/datasets/>`_, la dirección URL tiene el formato ``data.gouv.fr/fr/datasets/?[filter_name]=[filter_value]``. Puede recuperar los valores de la dirección URL para definir el recolector.
fr: La valeur de certains paramètres de filtres possède une syntaxe très particulière. Lorsque vous effectuez une recherche sur `data.gouv.fr <https://www.data.gouv.fr/fr/datasets/>`_, l'URL se présente sous la forme suivante : ``data.gouv.fr/fr/datasets/?[filter_name]=[filter_value]``. Vous pouvez récupérer les valeurs de l'URL pour configurer votre moissonneur.
nl: De waarde voor sommige filterparameters heeft een zeer specifieke syntax. Wanneer een zoekopdracht wordt uitgevoerd op `data.gouv.fr <https://www.data.gouv.fr/fr/datasets/>`_, heeft de URL de vorm ``data.gouv.fr/fr/datasets/?[filter_name]=[filter_value]``. U kunt de waarden uit de URL ophalen om uw harvester in te stellen.

source: ``2020-01-01-2020-12-31`` is the value for ``temporal-coverage`` if you want to filter datasets covering the period starting from 01 January 2020 to 31 December 2020.
de: ``2020-01-01-2020-12-31`` ist der Wert für ``temporal-coverage``, wenn Sie Datensätze filtern möchten, die den Zeitraum vom 01. Januar 2020 bis zum 31. Dezember 2020 abdecken.
es: ``2020-01-01-2020-12-31`` es el valor de ``temporal-coverage`` si desea filtrar los conjuntos de datos que cubren el periodo del 1 de enero de 2020 al 31 de diciembre de 2020.
fr: ``2020-01-01-2020-12-31`` est la valeur de ``temporal-coverage``, si vous souhaitez filtrer les jeux de données couvrant la période du 01 janvier 2020 au 31 décembre 2020.
nl: ``2020-01-01-2020-12-31`` is de waarde voor ``temporal-coverage`` indien u datasets wilt filteren die de periode bestrijken van 1 januari 2020 tot 31 december 2020.

source: Attachment (attachment)
de: Anhang (Anhang)
es: Asociación (attachment)
fr: Pièces jointes (pièces jointes)
nl: Bijlage (bijlage)

source: Select this checkbox to attach resources as attachments instead of using them as sources.
de: Wählen Sie dieses Kontrollkästchen, wenn Sie Ressourcen anfügen wollen, statt sie als Quellen zu verwenden.
es: Seleccione esta casilla para asociar los recursos en lugar de usarlos como orígenes.
fr: Cochez cette case pour ajouter des ressources en tant que pièces jointes et non en tant que sources.
nl: Selecteer dit aanvinkvakje om bronnen bij te voegen als bijlage in plaats van ze te gebruiken als bronnen.
