Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/dbnomics.po
Languages: de, es, fr, nl

source: DB.nomics harvester
es: Recolector de DB.nomics
fr: Moissonneur DB.nomics

source: Retrieve one or more datasets from `DB.nomics <https://db.nomics.world/>`_.
de: Einen oder mehrere Datensätze von `DB.nomics <https://db.nomics.world/>`_ abrufen.
es: Recuperar uno o varios conjuntos de datos de `DB.nomics <https://db.nomics.world/>`_.
nl: EÃ©n of meerdere datasets ophalen uit `DB.nomics <https://db.nomics.world/>`_.

source: It is possible to either fetch each of these time series as individual Opendatasoft datasets or aggregate them as a single Opendatasoft dataset. The aggregated dataset will have an additional "Concept" column with the origin of each row.
de: Es ist möglich, jede dieser Zeitserien als einzelne Opendatasoft-Datensätze abzurufen oder zu einem einzigen Opendatasoft-Datensatz zu aggregieren. Der aggregierte Datensatz enthält eine zusätzliche Spalte "Konzept" mit dem Ursprung jeder Zeile.
es: Se puede o bien capturar cada una de estas series temporales como conjuntos de datos de Opendatasoft individuales o bien agregarlos en un solo conjunto de datos de Opendatasoft. El conjunto de datos agregado tendrá una columna "Concept" adicional con el origen de cada una de las filas.
fr: Ces séries chronologiques peuvent être récupérées en tant que jeux de données Opendatasoft indépendants ou regroupées en un seul jeu de données Opendatasoft. Le jeu de données regroupé comprend une colonne supplémentaire nommée "Concept" qui contient l'origine de chaque enregistrement.
nl: Het is mogelijk om elk van deze tijdreeksen op te halen als individuele Opendatasoft-datasets of deze bij elkaar te voegen in een enkele Opendatasoft-dataset. De bijeengevoegde dataset zal een extra kolom "Concept" krijgen met de oorsprong van elke rij.

source: A dataset ID follows the following format *ProviderName-DatasetId*.
de: Eine Datensatz-ID hat folgendes Format: *ProviderName-DatasetId*.
es: Un ID de conjunto de datos sigue el formato *NombreProveedor-IdConjuntoDatos*.
fr: Un identifiant de jeu de données suivant le format suivant : *ProviderName-DatasetId*.
nl: Een dataset-ID volgt het volgende formaat *ProviderName-DatasetId*.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Retrieve the dataset ID using the `explorer <https://db.nomics.world/views/explorer>`_. Select a provider, the dataset to retrieve and click on API Link > JSON. A link following this format will appear : https://api.db.nomics.world/api/v1/json/datasets/bea-fa2004-section1-101-a/values
de: Rufen Sie die Datensatz-ID mit dem `Explorer <https://db.nomics.world/views/explorer>`_ ab. Wählen Sie einen Anbieter, den abzurufenden Datensatz und klicken Sie auf den API Link > JSON. Es erscheint ein Link mit folgendem Format: https://api.db.nomics.world/api/v1/json/datasets/bea-fa2004-section1-101-a/values
es: Recupere el ID de conjunto de datos con el `Explorador <https://db.nomics.world/views/explorer>`_. Seleccione un proveedor y el conjunto de datos para recuperar, y haga clic en API Link > JSON. Aparecerá un vínculo con este formato: https://api.db.nomics.world/api/v1/json/datasets/bea-fa2004-section1-101-a/values
nl: Haal het dataset-ID op met behulp van de `explorer <https://db.nomics.world/views/explorer>`_. Selecteer een provider, de op te halen dataset en klik op API Link > JSON. Er verschijnt een link met in het volgende formaat: https://api.db.nomics.world/api/v1/json/datasets/bea-fa2004-section1-101-a/values

source: In this example, the dataset ID is : **bea-fa2004-section1-101-a**
de: In diesem Beispiel lautet die Datensatz-ID: **bea-fa2004-section1-101-a**
es: En este ejemplo, el ID de conjunto de datos es: **bea-fa2004-section1-101-a**
nl: In dit voorbeeld is het dataset-ID: **bea-fa2004-section1-101-a**

source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
nl: Voorbeeld

source: Dataset
de: Datensatz
es: Conjunto de datos
fr: Jeu de données

source: The comma separated list of dataset IDs to harvest.
de: Die kommagetrennte Liste der Datensatz-IDs, die Sie abrufen möchten.
es: La lista separada por comas de los ID para recolectar.
fr: La liste des jeux de données à moissonner séparés par des virgules.
nl: De door komma's gescheiden lijst met dataset-ID's die moeten worden geharvest.

source: Aggregate series in a single dataset
de: Serien in einem einzigen Datensatz aggregieren
es: Agregar una serie en un solo conjunto de datos
fr: Regrouper les séries en un seul jeu de données
nl: Reeksen bijeenvoegen in een enkele dataset

source: Aggregate SDMX series into a single SDMX dataset.
de: SDMX-Serien in einem einzigen SDMX-Datensatz aggregieren.
es: Agregue una serie SDMX en un solo conjunto de datos SDMX.
fr: Regrouper les séries SDMX en un seul jeu de données SDMX.
nl: SDMX-reeksen bijeenvoegen in een enkele SDMX-dataset.

source: Retrieve one or more datasets from `DBnomics <https://db.nomics.world/>`_.
fr: Récupérez un ou plusieurs jeux de données depuis `DB.nomics <https://db.nomics.world/>`_.

source: Retrieve the dataset ID from `DBnomics website <https://db.nomics.world/providers>`_. Select a provider, the dataset to retrieve and click on API Link > JSON. A link following this format will appear: `https://api.db.nomics.world/api/v1/json/datasets/bea-fa2004-section1-101-a/values`
fr: Récupérez l'identifiant du jeu de données à partir du site Web `DBnomics <https://db.nomics.world/providers>`_. Sélectionnez un fournisseur, le jeu de données à récupérer, et cliquez sur API Link > JSON. Un lien au format suivant apparaîtra : `https://api.db.nomics.world/api/v1/json/datasets/bea-fa2004-section1-101-a/values`.

source: In this example, the dataset ID is: **bea-fa2004-section1-101-a**
fr: Dans cet exemple, l'identifiant du jeu de données est : **bea-fa2004-section1-101-a**
