Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/enigma.po
Languages: it

source: Enigma harvester
it: Harvester Enigma

source: Retrieve datasets from `Enigma <https://public.enigma.com/>`_
it: Recupera i dataset da `Enigma <https://public.enigma.com/>`_

source: This harvester is not available by default. If you need to use it, please contact the OpenDataSoft support team.
it: Questo harvester non è disponibile in modo predefinito. Se desideri utilizzarlo ti preghiamo di contattare il team di assistenza OpenDataSoft.

source: Parameters
it: Parametri

source: Name
it: Nome

source: Description
it: Descrizione

source: Mandatory
it: Obbligatorio

source: Example
it: Esempio

source: Collection ID
it: ID della collezione

source: The ID of the `Enigma collection <https://enigmahelp.zendesk.com/hc/en-us/articles/115007163247-Browsing-Enigma-Public>`_ you wish to harvest.
it: L'ID della `collezione Enigma <https://enigmahelp.zendesk.com/hc/en-us/articles/115007163247-Browsing-Enigma-Public>`_ su cui desideri eseguire l'harvesting.

source: Yes
it: Sì

source: The URL for the 'United Nations' collection is https://public.enigma.com/browse/united-nations/f5a685ff-1e83-4654-ba8e-901a48f73ec2, so the collection ID is f5a685ff-1e83-4654-ba8e-901a48f73ec2
it: L'URL della collezione 'United Nations' è https://public.enigma.com/browse/united-nations/f5a685ff-1e83-4654-ba8e-901a48f73ec2, quindi l'ID della collezione è f5a685ff-1e83-4654-ba8e-901a48f73ec2

source: API key
it: Chiave API

source: Your API key available in `your account settings <https://public.enigma.com/settings>`_
it: La tua chiave API disponibile nelle `impostazioni dell'account <https://public.enigma.com/settings>`_

source: Number of datasets
it: Numero dei dataset

source: Only retrieve a certain amount of datasets.
it: Richiama solo un certo numero di dataset.
