Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/fred.po
Languages: de, es, fr, nl

source: FRED harvester
es: Recolector de FRED
fr: Moissonneur FRED

source: Retrieve datasets from the `Federal Reserve Bank of St. Louis <https://fred.stlouisfed.org/>`_.
de: Datensätze von der `Federal Reserve Bank of St. Louis <https://fred.stlouisfed.org/>`_ abrufen.
es: Recuperar conjuntos de datos de `Federal Reserve Bank of St. Louis <https://fred.stlouisfed.org/>`_.
fr: Récupérer les jeux de données depuis la `Banque de la Réserve Fédérale de St. Louis <https://fred.stlouisfed.org/>`_.
nl: Haal datasets op uit de `Federal Reserve Bank van St. Louis <https://fred.stlouisfed.org/>`_.

source: Disclaimer
de: Haftungsausschluss
es: Declinación de responsabilidades
fr: Avertissement

source: This product uses the FRED® API but is not endorsed or certified by the Federal Reserve Bank of St. Louis.
de: Dieses Produkt verwendet die FRED® API, wird jedoch nicht von der Federal Reserve Bank of St. Louis unterstützt oder zertifiziert.
es: Este producto utiliza la API FRED® pero no está aprobado ni certificado por Federal Reserve Bank of St. Louis.
fr: Ce produit repose sur l'API FRED® mais n'est ni officiellement reconnu ni certifié par la Banque de la Réserve Fédérale de St. Louis.
nl: Dit product gebruikt de FRED® API maar is niet bekrachtigd of gecertificeerd door de Federal Reserve Bank van St. Louis.

source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
nl: Voorbeeld

source: FRED API key
de: FRED API-Schlüssel
es: Clave de API FRED
fr: Clé d'API FRED
nl: FRED API-sleutel

source: Your own `FRED API key <https://research.stlouisfed.org/docs/api/api_key.html>`_
de: Ihr eigener `FRED API-Schlüssel <https://research.stlouisfed.org/docs/api/api_key.html>`_
es: Su propia `clave de API FRED <https://research.stlouisfed.org/docs/api/api_key.html>`_.
fr: Votre `clé d'API FRED <https://research.stlouisfed.org/docs/api/api_key.html>`_
nl: Uw eigen 'FRED API-sleutel <https://research.stlouisfed.org/docs/api/api_key.html>`_

source: Query
de: Anfrage
es: Consulta
fr: Requête
nl: Zoekopdracht

source: Can be either a dataset ID or a query to match series against
de: Kann eine Datensatz-ID oder eine Anfrage zum Abgleich von Serien sein
es: Un ID de conjunto de datos o una consulta con que contrastar la serie.
fr: Peut être un identifiant de jeu de données (dataset ID) ou une requête qui retourne des séries
nl: Kan ofwel een dataset-ID of een zoekopdracht zijn om de reeks af te stemmen op

source: Number of datasets
de: Anzahl der Datensätze
es: Número de conjuntos de datos
fr: Nombre de jeux de données
nl: Aantal datasets

source: The number of datasets that will be harvested. If no value is set, all datasets will be harvested (up to 1000).
de: Die Anzahl der Datensätze, die eingeholt werden. Ist kein Wert festgelegt, werden alle Datensätze eingeholt (bis zu 1000).
es: El número de conjuntos de datos que se recopilarán. Si no se establece ningún valor, se recopilarán todos los conjuntos de datos (hasta 1.000).
fr: Le nombre de jeux de données à moissonner. Si non rempli, tous les jeux de données (jusqu'à 1000) seront moissonnés.
nl: Het aantal datasets dat zal worden geharvest. Indien er geen waarde is ingesteld, zullen alle datasets worden geharvest (tot maximaal 1000).

source: PAYEMS, employment
de: PAYEMS, Beschäftigung
nl: PAYEMS, tewerkstelling
