Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/ftp_with_meta_csv.po
Languages: de, fr, nl

source: FTP with meta CSV harvester
de: FTP mit Meta-CSV-Harvester
fr: Moissonneur FTP avec CSV de métadonnées
nl: FTP met meta CSV harvester

source: This harvester allows users to create datasets from an FTP folder.
de: Dieser Harvester erlaubt es Nutzern, Datensätze aus einem FTP-Ordner zu erstellen.
fr: Ce moissonneur permet aux utilisateurs de créer des jeux de données à partir d'un répertoire FTP.
nl: Deze harvester laat gebruikers toe om datasets aan te maken vanuit een FTP-map.

source: It connects via FTPS (explicit mode on port 21) if available, or FTP if requested in the provided URL.
de: Er verbindet sich über FTPS (Explicit-Modus über Port 21), sofern verfügbar, oder über FTP, wenn es in der angegebenen URL gefordert wird.
fr: Il se connecte via FTPS (en mode explicite sur le port 21) si disponible, ou FTP si demandé dans l'URL fournie.
nl: Deze maakt verbinding via FTPS (expliciete modus op poort 21) wanneer dit beschikbaar is of FTP wanneer dit gevraagd wordt in de meegeleverde URL.

source: The FTP folder must contain:
de: Der FTP-Ordner muss Folgendes enthalten:
fr: Le répertoire FTP doit contenir :
nl: De FTP-map moet het volgende bevatten:

source: one **metadata CSV file** (separated with semicolons)
de: eine **Metadaten CSV-Datei** (durch Semikolon getrennt)
fr: un **fichier CSV de métadonnées** (séparé par des points-virgules)
nl: één **metadata CSV-bestand** (gescheiden door een punt komma)

source: several **resources**
de: verschiedene **Ressourcen**
fr: plusieurs **ressources**
nl: verschillende **bronnen**

source: (optional) several **CSV schema files**
de: (optional) verschiedene **CSV-Schema-Dateien**
fr: (facultatif) plusieurs **fichiers CSV de schéma**
nl: (optioneel) verschillende **CSV-schemabestanden**

source: Caution
de: Vorsicht
fr: Avertissement
nl: Opgelet

source: The FTP with meta CSV harvester only supports UTF-8 encoding.
de: Der FTP mit Meta-CSV-Harvester unterstützt nur UTF-8 Codierung.
fr: Le moissonneur FTP avec CSV de métadonnées ne prend en charge que l'encodage UTF-8.
nl: De FTP met meta CSV harvester ondersteunt enkel UTF-8 encoding

source: Metadata CSV file
de: Metadaten-CSV-Datei
fr: Fichier CSV de métadonnées
nl: Metadata CSV-bestand

source: The **metadata CSV file** (named ``index.csv`` by default) is a semicolon separated file which contains:
de: Die **Metadaten CSV-Datei** (Standardname: ``index.csv``) ist eine mit Semikolons getrennte Datei, die Folgendes enthält:
fr: Le **fichier CSV de métadonnées** (appelé ``index.csv`` par défaut) est un fichier séparé par des points-virgules contenant :
nl: Het **metadata CSV-bestand** (standaard ``index.csv`` genoemd) is een door punt komma's gescheden bestand dat het volgende bevat:

source: one header row
de: eine Kopfzeile
fr: une ligne d'en tête
nl: rij met één header

source: several other rows, each one dedicated to a dataset to harvest
de: Einige andere Zeilen, die jeweils zu einem zu sammelnden Datensatz gehören
fr: plusieurs autres lignes, chacune dédiée à un jeu de données à moissonner
nl: verschillende andere rijen, waarvan elk gewijd is aan een dataset die moet worden geharvest

source: **Example:**
de: **Beispiel:**
fr: **Exemple:**
nl: **Voorbeeld:**

source: Chocolate bars database
de: Schokoriegel-Datenbank
nl: Dataset met chocoladerepen

source: A database of chocolate bars
de: Eine Datenbank von Schokoriegeln
nl: Een dataset met chocoladerepen

source: Venture Capital Investments
de: Risikokapital-Investment

source: Venture capital industry statistics.
de: Statistiken der Risikokapital-Industrie.
nl: Statistieken van de durfkapitaalindustrie.

source: Economy, Business
de: Wirtschaft, Business
nl: Economie, zaken

source: Venture capital;Investments;IPO;Acquisitions
de: Risikokapital;Investments;Börsengang;Übernahmen

source: The ``name`` column contains an identifier for each row. These identifiers can be anything as long as they only contain letters and numbers, are unique across the file, and don't change over time.
de: Die Spalte ``name`` enthält einen Identifikator pro Zeile. Dieser kann beliebig gewählt werden muss aber ausschließlich aus Buchstaben und Zahlen bestehen, in der Datei einzigartig sein und im Zeitverlauf unverändert bleiben.
fr: La colonne ``name`` contient un identifiant pour chaque colonne. Ces identifiants sont arbitraires, mais doivent contenir uniquement des lettres et chiffres, être uniques dans le fichier et ne jamais changer.
nl: De kolom ``name`` bevat een identifier voor elke rij. Deze identifiers kunnen alles zijn zolang ze enkel letters en cijfers bevatten, uniek zijn in het hele bestand en na verloop van tijd niet wijzigen.

source: The **CSV resource column** (``source_dataset`` by default) contains the resource for each row.
de: Die **Spalte CSV-Ressource** (standardmäßig ``source_dataset``) enthält die Ressource für jede Zeile.
fr: La **colonne de ressource CSV** (``source_dataset`` par défaut) contient la ressource pour chaque ligne.
nl: De **CSV bronkolom** (standaard ``source_dataset``) bevat de bron voor elke rij.

source: The optional **CSV schema column** (here, ``schema_file``) contains the schema file for each row.
de: Die optionale **Spalte CSV-Schema** (hier: ``schema_file``) enthält die Schema-Datei für jede Zeile.
fr: La **colonne de schéma CSV** optionnelle (ici, ``schema_file``) contient le fichier de schéma pour chaque ligne.
nl: De optionele **CSV schemakolom** (hier, ``schema_file``) bevat het schemabestand voor elke rij.

source: Every other column is a metadata (see table below for the complete list of accepted column names). Note: use double quotes at the beginning and end of lists like ``keyword``, where you have to use semicolons to separate words (e.g ``"keyword1;keyword2"``).
de: Alle anderen Spalten sind für Metadaten (siehe untere Tabelle für eine komplette Liste akzeptierter Spaltennamen). Hinweis: verwenden Sie Anführungszeichen zu Beginn und am Ende der Listen wie etwa ``keyword`, die durch Semikolons getrennt werden müssen `(z. B. `"keyword1;keyword2"``).
fr: Toutes les autres colonnes sont des métadonnées (consultez le tableau ci-dessous pour obtenir une liste complète des noms de colonne acceptés). Remarque : utilisez des guillemets doubles au début et à la fin de chaque liste, par exemple ``keyword``, là où un point-virgule doit être utilisé pour séparer les mots (p. ex. ``"keyword1;keyword2"``).
nl: Elke andere kolom is een metadata (zie tabel hieronder voor een volledige lijst van aanvaarde kolomnamen). Opmerking: gebruik dubbele aanhalingstekens bij het begin en het einde van lijsten zoals "trefwoorden", waar u kommapunten moet gebruiken als scheidingsteken tussen woorden (bijv. ``"keyword1;keyword2"``).

source: Accepted metadata columns
de: Akzeptierte Metadatenspalten
fr: Colonnes de métadonnées acceptées
nl: Aanvaarde metadatakolommen

source: Template
de: Vorlage
fr: Modèle
nl: Sjabloon

source: Column name
de: Spaltenname
fr: Nom de colonne
nl: Kolomnaam

source: ``title``, ``description``, ``theme``, ``keyword``, ``license``, ``language``, ``timezone``, ``modified``, ``geographic_reference_auto``, ``geographic_reference``, ``publisher``, ``references``, ``attributions``, ``oauth_scope``
de: ``Titel``, ``Beschreibung``, ``Thema``, ``Schlüsselwort``, ``Lizenz``, ``Sprache``, ``Zeitzone``, ``geändert``, ``geographic_reference_auto``, ```geographic_reference``, ``Veröffentlicher``, ``Referenzen``, ``Attribute``, ``oauth_scope``

source: Custom
de: Benutzerdefiniert
fr: Personnalisé
nl: Gepersonaliseerd

source: ``<metadata-name>`` (the metadata name)
de: ``<metadata-name>`` (der Name der Metadaten)
fr: ``<metadata-name>`` (le nom des métadonnées)
nl: ``<metadata-name>`` (de metadatanaam)

source: For example, if the metadata name is "project name", use ``project-name`` .
de: Wenn der Name der Metadaten zum Beispiel "Projektname" lautet, verwenden Sie ``Projektname``.
fr: Par exemple, si le nom des métadonnées est "project name", utilisez ``project-name``.
nl: Als de metadatanaam bijvoorbeeld "projectnaam" is, gebruik dan ``project-naam`` .

source: DCAT (if activated)
de: DCAT (falls aktiviert)
fr: DCAT (si activées)
nl: DCAT (indien geactiveerd)

source: DCAT-AP for CH (if activated)
de: DCAT-AP für CH (falls aktiviert)
fr: DCAT-AP pour la Suisse (si activées)
nl: DCAT-AP for CH (indien geactiveerd)

source: Inspire (if activated)
de: Inspire (falls aktiviert)
fr: Inspire (si activées)
nl: Inspire (indien geactiveerd)

source: Semantic (if activated)
de: Semantic (falls aktiviert)
fr: Sémantique (si activées)
nl: Semantic (indien geactiveerd)

source: For more information about the standard metadata, see :doc:`Standard metadata </publishing_data/06_configuring_metadata/standard_metadata>`.
de: Weitere Informationen zu den Standard-Metadaten finden Sie unter :doc:`Standard-Metadaten </publishing_data/06_configuring_metadata/standard_metadata>`.
fr: Pour plus d'informations sur les métadonnées standard, consultez :doc:`Métadonnées standard </publishing_data/06_configuring_metadata/standard_metadata>`.
nl: Voor meer informatie over de standaard metadata, zie :doc:`Standaard metadata </publishing_data/06_configuring_metadata/standard_metadata>`.

source: The geographic_reference_auto metadata
de: Die Metadaten "geographic_reference_auto"
fr: Les métadonnées geographic_reference_auto
nl: De metadata geographic_reference_auto

source: The ``geographic_reference_auto`` column defines whether the dataset's geographic coverage is automatically computed and accepts a Boolean value:
de: Die Spalte ``geographic_reference_auto`` definiert, ob die geografische Abdeckung des Datensatzes automatisch berechnet wird und einen booleschen Wert akzeptiert:
fr: La colonne ``geographic_reference_auto`` définit si la couverture géographique du jeu de données est calculée automatiquement et accepte une valeur booléenne :
nl: De kolom ``geographic_reference_auto`` bepaalt of de geografische dekking van de dataset automatisch wordt berekend en aanvaardt een Boolean waarde:

source: This is my table
de: Das ist meine Tabelle
fr: C'est mon tableau
nl: Dit is mijn tafel

source: Value
de: Wert
fr: Valeur
nl: Waarde

source: Purpose
de: Zweck
fr: Objectif
nl: Doel

source: Sets the **Geographic coverage** metadata for the dataset to **Automatic**. The geographic coverage is automatically computed based on the dataset content or on the domain's dataset default geographic coverage.
de: Stellt die Metadaten **Geografische Abdeckung** für den Datensatz auf **Automatisch** ein. Die geografische Abdeckung wird automatisch basierend auf dem Inhalt des Datensatzes oder auf der standardmäßigen geografischen Abdeckung des Datensatzes der Domain berechnet.
fr: Définit les métadonnées **Couverture géographique** du jeu de données sur **Automatique**. La couverture géographique est ainsi automatiquement calculée en fonction du contenu du jeu de données ou de la couverture géographique par défaut du jeu de données du domaine.
nl: Stelt de metadata **Geografische dekking** voor de dataset in op **Automatisch**. De geografische dekking wordt automatisch berekend op basis van de content van de dataset of op de standaard geografische dekking van de dataset van het domein.

source: Sets the **Geographic coverage** metadata for the dataset to the value for ``geographic_reference``.
de: Stellt die Metadaten **Geografische Abdeckung** für den Datensatz auf "geographic_reference" ein.
fr: Définit les métadonnées **Couverture géographique** du jeu de données sur la valeur associée à ``geographic_reference``.
nl: Stelt de metadata **Geografische dekking** voor de dataset in op de waarde voor ``geographic_reference``.

source: The geographic_reference metadata
de: Die Metadaten "geographic_reference"
fr: Les métadonnées geographic_reference
nl: De metadata geographic_reference

source: The ``geographic_reference`` column defines the location used for the dataset geographic coverage, which means the **Geographic coverage** metadata for the dataset is set to **Specific**. This ``geographic_reference`` column contains an array of georeference unique identifiers representing locations.
de: Die Spalte ``geographic_reference`` definiert den Standort, der für die geografische Abdeckung des Datensatzes verwendet wird. Das bedeutet, dass die Metadaten **Geografische Abdeckung** für den Datensatz auf **Spezifisch** gestellt werden. Die Spalte ``geographic_reference`` enthält ein Array mit eindeutigen Bezeichnern für Georeferenzen, die für Orte stehen.
fr: La colonne ``geographic_reference`` définit l'emplacement utilisé pour la couverture géographique du jeu de données ; les métadonnées **Couverture géographique** du jeu de données sont ainsi définies sur **Spécifique**. La colonne ``geographic_reference`` contient un tableau d'identifiants uniques de références géographiques correspondant à des emplacements.
nl: De kolom ``geographic_reference`` bepaalt de locatie die gebruikt wordt voor de geografische dekking van de dataset. Dit betekent dat de metadata **Geografische dekking** voor de dataset wordt ingesteld op **Specifiek**. Deze kolom ``geographic_reference`` bevat een waaier aan georeferentie-unieke identifiers die locaties vertegenwoordigen.

source: Georeference unique identifiers use the following syntaxes based on the reference:
de: Je nach Referenz verwenden die eindeutigen Bezeichner der Georeferenz die folgenden Syntaxen:
fr: Les identifiants uniques de références géographiques utilisent les syntaxes suivantes, basées sur la référence :
nl: Georeferentie-unieke identifiers gebruiken de volgende syntaxen die gebaseerd zijn op de referentie:

source: Reference
de: Referenz
nl: Referentie

source: Description
de: Beschreibung
nl: Omschrijving

source: Example value
de: Beispielwert
fr: Exemple de valeur
nl: Voorbeeldwaarde

source: world
de: Welt
nl: wereld

source: The dataset contains content about different countries
de: Der Datensatz enthält Inhalte über verschiedene Länder
fr: Le jeu de données héberge du contenu sur différents pays
nl: De dataset bevat content over verschillende landen

source: country
de: Land
fr: pays
nl: land

source: The dataset contains country-level content
de: Der Datensatz enthält Inhalte auf Länderebene
fr: Le jeu de données héberge du contenu sur un pays spécifique
nl: De dataset bevat content op landniveau

source: ``world_fr`` if dataset coverage is France
de: ``world_fr`` wenn der Datensatz ganz Frankreich abdeckt
fr: ``world_fr`` si la couverture du jeu de données est définie sur France
nl: ``world_fr`` wanneer dekking van de dataset Frankrijk is

source: lower division
de: unterer Bereich
nl: lagere afdeling

source: The dataset contains content about a specific country division
de: Der Datensatz enthält Inhalte über einen bestimmten Länderbereich
fr: Le jeu de données héberge du contenu sur une division de pays spécifique
nl: De dataset bevat content over een specifieke landafdeling

source: ``fr_80_75056`` if dataset coverage is Paris city
de: ``fr_80_75056`` wenn der Datensatz die Stadt Paris abdeckt
fr: ``fr_80_75056`` si la couverture du jeu de données est définie sur la ville de Paris
nl: ``fr_80_75056`` wanneer de dekking van de dataset de stad Parijs is

source: ``{{country code}}`` is a two-letter country code defined in `ISO 3166-1 alpha-2 <https://www.iso.org/obp/ui/#search/code>`_. For example, ``fr`` for France.
de: ``{{country code}}`` ist ein zweibuchstabiges Länderkürzel, das unter `ISO 3166-1 alpha-2 <https://www.iso.org/obp/ui/#search/code>`_ definiert ist. zum Beispiel ``fr`` für Frankreich.
fr: ``{{country code}}`` est un code pays composé de deux lettres, défini par la norme `ISO 3166-1 alpha-2 <https://www.iso.org/obp/ui/#search/code>`_. Par exemple, ``fr`` correspond à France.
nl: ``{{country code}}`` is een tweeletterige landcode die gedefinieerd staat in `ISO 3166-1 alpha-2 <https://www.iso.org/obp/ui/#search/code>`_. Bijvoorbeeld, ``fr`` voor Frankrijk.

source: ``{{administrative-level}}`` is an administrative level for the country. For example, ``40`` is the administrative level for French regions. For more information about the administrative levels available for the desired country, see :ref:`referentials`.
de: ``{{administrative-level}}`` bezeichnet eine Verwaltungsebene für das Land. ``40`` steht zum Beispiel für die Verwaltungsebene französischer Regionen. Weitere Informationen zu den verfügbaren Verwaltungsebenen für das gewünschte Land finden Sie unter :ref:`referentials`.
fr: ``{{administrative-level}}`` est un niveau administratif pour le pays. Par exemple, ``40`` est le niveau administratif des régions françaises. Pour plus d'informations sur les niveaux administratifs disponibles pour le pays souhaité, consultez :ref:`referentials`.
nl: ``{{administrative-level}}`` is een administratief niveau voor het land. Bijvoorbeeld, ``40`` is het administratief niveau voor Franse regio's. Voor meer informatie over de administratieve niveaus die beschikbaar zijn voor het gewenste land, zie :ref:`referentials`.

source: ``{{administrative division}}`` is the relative administration division within the country's administrative level. For example, ``11`` is the code for the Île-de-France French region.
de: ``{{administrative division}}`` ist die jeweilige Verwaltungseinheit innerhalb der Verwaltungsebene des Landes. So steht ``11`` beispielsweise für die französische Region Île-de-France.
fr: ``{{administrative division}}`` est la division administrative relative dans le niveau administratif du pays. Par exemple, ``11`` correspond au code de la région française Île-de-France.
nl: ``{{administrative division}}`` is de relatieve administratieafdeling binnen het administratief niveau van het land. Bijvoorbeeld, ``11`` is de code voor de Franse regio Île-de-France.

source: You can retrieve the desired administrative division code as follows:
de: Die Kürzel der jeweiligen Verwaltungseinheiten können Sie wie folgt abrufen:
fr: Procédez comme suit pour récupérer le code de la division administrative souhaité :
nl: U kunt de gewenste administratieve afdelingscode als volgt ophalen:

source: Go to the :ref:`referentials` section of the documentation.
de: Öffnen Sie den Abschnitt :ref:`referentials` in der Dokumentation.
fr: Rendez-vous dans la section :ref:`referentials` de la documentation.
nl: Ga naar de rubriek :ref:`referentials` van de documentatie.

source: From the table at the end of the section, select a country and an administrative level.
de: Wählen Sie in der Tabelle am Ende des Abschnitts ein Land und eine Verwaltungsebene aus.
fr: Sélectionnez un pays et un niveau administratif dans le tableau se trouvant à la fin de la section.
nl: Selecteer uit de tabel op het einde van de rubriek een land en een administratief niveau.

source: From the related table row, click the link in the **Dataset URL** column to open the related geographical referential and get the desired administrative division code.
de: Klicken Sie in der betreffenden Tabellenzeile auf den Link in der Spalte **Datensatz-URL**, um den entsprechenden geografischen Referenzwert zu öffnen und das gewünschte Kürzel der Verwaltungseinheit zu erhalten.
fr: Dans la ligne du tableau associée, cliquez sur le lien de la colonne **URL du jeu de données** pour ouvrir le référentiel géographique et obtenir le code de division administrative souhaité.
nl: Klik in de betreffende rij van de tabel op de link in de kolom **Dataset URL** om de eraan verbonden geografische referential te openen en neem de gewenste administratieve afdelingscode.

source: Resources
de: Ressourcen
fr: Ressources
nl: Bronnen

source: Resources can either be:
de: Ressourcen können Folgendes sein:
fr: Les ressources peuvent être :
nl: Bronnen kunnen de volgende zijn:

source: files on the FTP server, in the same folder as the ``index.csv`` file, or under a subdirectory by specifying the relative path to the file in the column (e.g "resources/chocolate.csv")
de: Dateien auf dem FTP-Server, im selben Ordner wie die Datei ``index.csv`` oder in einem Unterordner, wobei der relative Dateipfad in der Spalte angegeben werden muss (z. B. "resources/chocolate.csv")
fr: des fichiers sur le serveur FTP, dans le même dossier que le fichier ``index.csv``, ou dans un sous-dossier en spécifiant le chemin d'accès relatif du fichier dans la colonne (par exemple "resources/chocolate.csv")
nl: bestanden op de FTP-server, in dezelfde map als het ``index.csv``-bestand of een subdirectory door het relatieve pad te specificeren naar het bestand in een kolom (bijv. "resources/chocolate.csv")

source: any URL pointing towards a supported format
de: eine beliebige URL, die auf ein unterstütztes Format verweist
fr: une URL pointant vers un format pris en charge
nl: elke URL die wijst naar een ondersteund formaat

source: If the column is empty, the dataset will only contain metadata.
de: Wenn die Zeile leer ist, enthält der Datensatz nur Metadaten.
fr: Si la colonne est vide, le jeu de données contiendra uniquement des métadonnées.
nl: Wanneer de kolom leeg is, zal de dataset enkel metadata bevatten.

source: Resources in any format supported by the platform can be harvested. However, as the harvester heavily relies on automatic parameters detection for the connector's configuration, files must be simple enough to be correctly extracted.
de: Ressourcen können in jedem von der Plattform unterstützten Format gesammelt werden. Da der Harvester jedoch vor allem auf der automatischen Parameter-Erkennung der Konfiguration des Konnektors basiert, müssen Dateien einfach genug sein, um korrekt extrahiert zu werden.
fr: Les ressources, si elles sont dans un format pris en charge par la plateforme, peuvent être moissonnées. Cependant, étant donné que le moissonneur s'appuie largement sur la détection automatique de paramètres pour la connexion du connecteur, les fichiers doivent être relativement simples pour être extraits.
nl: Bronnen in elk formaat dat ondersteund wordt door het platform kunnen worden geharvest. Aangezien de harvester sterk vertrouwt op het detecteren van automatische parameters voor de configuratie van de connector, moeten bestanden echter eenvoudig genoeg zijn om correct te worden geëxtraheerd.

source: Schema CSV file
de: CSV-Schema-Datei
fr: Fichier de schéma CSV
nl: Schema CSV-bestand

source: For each resource, the FTP folder can contain a **CSV schema file** that defines labels and descriptions for each field of the dataset.
de: Für jede Ressource kann der FTP-Ordner eine **CSV-Schema-Datei** enthalten, die Beschriftungen und Beschreibungen für jedes Feld des Datensatzes definiert.
fr: Pour chaque ressource, le dossier FTP peut convenir un **fichier de schéma CSV** qui définit les labels et les descriptions de chaque champ du jeu de données.
nl: Voor elke bron kan de FTP-map een **CSV schemabestand** bevatten dat de labels en omschrijvingen definieert voor elk veld van de dataset.

source: The filename of each schema file must be written in the **CSV schema column**. This file has the following specifications:
de: Der Dateiname jeder Schema-Datei muss in der **Spalte CSV-Schema** stehen. Für diese Datei gelten folgende Vorgaben:
fr: Le nom de fichier de chaque fichier de schéma doit être inscrit dans la **colonne de schéma CSV**. Ce fichier présente les spécifications suivantes :
nl: De bestandsnaam van elk schemabestand moet geschreven zijn in de **CSV schemakolom**. Dit bestand heeft de volgende specificaties:
