Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/ftp_csv.po
Languages: it

source: FTP CSV harvester (deprecated)
it: Harvester CSV FTP (obsoleto)

source: Synchronize files and metadata stored on an FTP server.
it: Sincronizza file e metadati memorizzati su un server FTP.

source: This harvester is not available by default. If you need to use it, please contact OpenDataSoft support team.
it: Questo harvester non Ã¨ disponibile in modo predefinito. Se desideri utilizzarlo ti preghiamo di contattare il team di assistenza OpenDataSoft.

source: Parameters
it: Parametri

source: Name
it: Nome

source: Description
it: Descrizione

source: Example
it: Esempio

source: URL of the FTP server
it: URL del server FTP

source: User (user)
it: Utente (user)

source: Your username
it: Il tuo nome utente

source: Your password
it: La tua password

source: The directory containing the data you want to harvest.
it: La directory contenente i dati su cui desideri effettuare l'harvesting.

source: Metadata CSV filename (metadata_file)
it: Nome file CSV metadati (metadata_file)

source: The file holding the metadata and filenames.
it: File contenente i metadati e i nomi dei file.

source: CSV file resource field (metadata_joinkey)
it: Campo risorsa del file CSV (metadata_joinkey)

source: This column holds a filename or an URL with the dataset resource.
it: Questa colonna contiene il nome di un file o un URL con la risorsa del dataset.
