Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/ftp_with_meta_csv.po
Languages: de, fr, nl

source: a ``name`` column holds each field name in lowercase (e.g. on a CSV resource, this would be the column names in lowercase)
de: eine Spalte ``Name`` enthält jeden Feldnamen in Kleinbuchstaben (in einer CSV-Ressource wäre dies z. B. der Spaltenname in Kleinbuchstaben)
fr: une colonne ``name`` contient chaque nom de champ en caractères minuscules (par ex. sur une ressource CSV, ce serait les noms de colonne en caractères minuscules)
nl: een kolom ``name`` bevat de naam van elk veld in kleine letters (bijv. voor een CSV-bron zouden dit de kolomnamen zijn in kleine letters)

source: a ``label`` column (optional) holds the label of the corresponding field
de: eine Spalte ``Beschriftung`` (optional) enthält die Beschriftung des entsprechenden Felds
fr: une colonne ``label`` (optionnelle) contient le label du champ correspondant
nl: een kolom ``label`` (optioneel) bevat het label van het overeenkomstige veld

source: a ``description`` column (optional) holds the description of the corresponding field
de: eine Spalte ``Beschreibung`` (optional) enthält die Beschreibung des entsprechenden Felds
fr: une colonne ``description`` (optionnelle) contient la description du champ correspondant
nl: een kolom ``description`` (optioneel) bevat de omschrijving van het overeenkomstige veld

source: label
de: Beschriftung

source: company
de: Unternehmen
nl: onderneming

source: Company
de: Unternehmen
nl: Onderneming

source: The company that makes the bar
de: Das Unternehmen, dass den Riegel herstellt
nl: De onderneming die de repen vervaardigt

source: The product id of the chocolate bar
de: Die Produkt-ID des Schokoriegels
nl: Het product-ID van de chocoladereep

source: The schema files do not need to contain a row for each field, and it is not required to provide a schema file for each dataset in the ``index.csv``. In the latter case, keep the corresponding cell empty.
de: Die Schemadateien enthalten nicht unbedingt eine Zeile für jedes Feld und es ist nicht nötig, eine Schema-Datei für jeden Datensatz in der ``index.csv`` zur Verfügung zu stellen. Gegebenenfalls lassen Sie die entsprechende Zelle leer.
fr: Les fichiers de schéma n'ont pas besoin de contenir une ligne pour chaque champ, et il n'est pas nécessaire de fournir un fichier de schéma pour chaque jeu de données dans ``index.csv``. Dans ce dernier cas, assurez-vous que la cellule correspondante reste vide.
nl: De schemabestanden moeten geen rij voor elk veld bevatten en het is niet verplicht om een schemabestand op te geven voor elke dataset in de ``index.csv``. In het laatste geval, laat de overeenkomstige cel leeg.

source: Parameters
de: Parameter
fr: Paramètres

source: Example
de: Beispiel
fr: Exemple
nl: Voorbeeld

source: URL of the FTP server
de: URL des FTP-Servers
fr: URL du serveur FTP
nl: URL van de FTP-server

source: **User** (user)
de: **Benutzer** (user)
fr: **Utilisateur** (user)
nl: **Gebruiker** (gebruiker)

source: Your username
de: Ihr Benutzername
fr: Votre nom d'utilisateur
nl: Uw gebruikersnaam

source: **Password** (password)
de: **Kennwort** (password)
fr: **Mot de passe** (password)
nl: **Wachtwoord** (wachtwoord)

source: Your password
de: Ihr Kennwort
fr: Votre mot de passe
nl: Uw wachtwoord

source: Subdirectory (subdir)
de: Unterverzeichnis (subdir)
fr: Sous-dossier (subdir)
nl: Submap (subdir)

source: The directory containing the data you want to harvest.
de: Das Verzeichnis mit den Daten, die Sie sammeln möchten.
fr: Le dossier contenant les données à moissonner.
nl: De map die de data bevat die u wil harvesten.

source: **Metadata CSV filename** (metadata_file)
de: **Metadaten-CSV-Dateiname** (metadata_file)
fr: **Nom du fichier CSV de métadonnées** (metadata_file)
nl: **Metadata CSV-bestandsnaam** (metadata_file)

source: The file holding the metadata and filenames (see above for more precise specifications).
de: Die Datei mit den Metadaten und Dateinamen (genauere Infos siehe weiter oben).
fr: Le fichier contenant les métadonnées et les noms de fichiers (voire ci-dessus pour une description plus précise).
nl: Het bestand dat de metadata en bestandsnamen bevat (zie hierboven voor meer precieze specificaties).

source: **Metadata CSV resource column** (resource_location_column)
de: **Metadaten-CSV-Ressourcenspalte** (resource_location_column)
fr: **Colonne des ressources CSV des métadonnées** (resource_location_column)
nl: **Metadata CSV bronkolom** (resource_location_column)

source: This column holds a filename or an URL with the dataset resource.
de: Diese Spalte enthält einen Dateinamen oder eine URL mit der Datensatzressource.
fr: Nom de la colonne contenant le nom du fichier ou l'URL contenant les données.
nl: Deze kolom bevat een bestandsnaam of een URL met de datasetbron.

source: Metadata CSV schema column (resource_schema_column)
de: Metadaten-CSV-Schemaspalte (resource_schema_column)
fr: Colonne du schéma CSV des métadonnées (resource_schema_column)
nl: Metadata CSV schemakolom (resource_schema_column)

source: This column holds a filename with the resource schema (column labels and descriptions).
de: Diese Spalte enthält einen Dateinamen mit dem Ressourcenschema (Spaltenbeschriftungen und -beschreibungen).
fr: Cette colonne contient un nom de fichier contenant le schéma des ressources (descriptions et labels des colonnes).
nl: In deze kolom staat een bestandsnaam met het bronschema (labels en omschrijvingen van de kolommen).

source: chocolate-bars
nl: chocoladerepen

source: Standard
nl: Standaard

source: Name
fr: Nom
nl: Naam

source: pub/documents
nl: pub/documenten

source: Syntax
fr: Syntaxe

source: **Host** (host)
fr: **Hôte** (host)
