Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/junar.po
Languages: it

source: Junar harvester
it: Harvester Junar

source: Retrieve datasets from a Junar portal.
it: Richiama i dataset da un portale Junar.

source: This harvester is not available by default. If you need to use it, please contact OpenDataSoft support team.
it: Questo harvester non è disponibile in modo predefinito. Se desideri utilizzarlo ti preghiamo di contattare il team di assistenza OpenDataSoft.

source: Parameters
it: Parametri

source: Name
it: Nome

source: Description
it: Descrizione

source: Example
it: Esempio

source: API url (portal_url)
it: URL API (portal_url)

source: The base URL of the portal
it: URL base del portale

source: API key (auth_key)
it: Chiave API (auth_key)

source: Your API Key.
it: La tua chiave API.

source: Will be passed as the *query* parameter to the request (see Junar documentation)
it: Questo valore sarà trasferito come parametro *query* alla richiesta. Per maggiori informazioni, consulta la documentazione Junar.

source: Categories (categories)
it: Categorie (categories)

source: Will be passed as the *categories* parameter to the request (see Junar documentation)
it: Questo valore sarà trasferito come parametro *categories* alla richiesta. Per maggiori informazioni, consulta la documentazione Junar.
