Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/ods.po
Languages: de, es, nl

source: Opendatasoft Federation harvester
de: Opendatasoft-Verbund-Harvester
es: Recolector de federación de Opendatasoft

source: Harvest another Opendatasoft domain to create federated datasets automatically.
de: Einen Harvester für eine andere Opendatasoft-Domain einrichten, um automatisch verbundene Datensätze zu erstellen.
es: Recolectar otro dominio Opendatasoft para crear conjuntos de datos federados automáticamente.
nl: Een ander Opendatasoft-domein harvesten om automatisch gekoppelde datasets aan te maken.

source: Parameters
de: Parameter
es: Parámetros

source: Name
es: Nombre
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Example
de: Beispiel
es: Ejemplo
nl: Voorbeeld

source: Domain ID (domain_id)
es: ID de dominio (domain_id)
nl: Domein-ID (domain_id)

source: The ID or base URL of the domain you want to harvest.
de: Die ID oder Basis-URL der Domain, die Sie harvesten wollen.
es: El ID o la dirección URL base del dominio que desea recolectar.
nl: Het ID of de basis-URL van het domein dat u wil harvesten.

source: Refines (refines)
de: Verfeinerungen (refines)
es: Refinamientos (refines)
nl: Verfijningen (verfijningen)

source: The refines you want to pass to filter the query (URL encoded)
de: Die Verfeinerungen, die Sie zur Filterung der Abfrage verwenden wollen (URL-codiert)
es: Los valores de refinamiento que desea pasar para filtrar la consulta (dirección URL codificada).
nl: De verfijningen die u wil doorgeven om de vraag te filteren (URL gecodeerd)

source: Api key (api_key)
de: API-Schlüssel (api_key)
es: Clave de API (api_key)
nl: API-sleutel (api_key)

source: The Api key used to access the other portal
de: Der API-Schlüssel für den Zugang zum anderen Portal
es: La clave de API utilizada para acceder al otro portal.
nl: De API-sleutel die gebruikt wordt om toegang te krijgen tot het ander portaal

source: Note
de: Hinweis
es: Nota
nl: Opmerking

source: If you want to harvest a single Opendatasoft dataset, you can use the :doc:`federation </publishing_data/01_creating_a_dataset/federating_data>`
es: Si quiere recolectar un solo conjunto de datos de Opendatasoft, puede utilizar la :doc:`federación </publishing_data/01_creating_a_dataset/federating_data>`.
nl: Indien u een enkele Opendatasoft-dataset wilt harvesten, kunt u de :doc:`samenvoeging </publishing_data/01_creating_a_dataset/federating_data>` gebruiken

source: discovery, https://discovery.opendatasoft.com, https://www.datastro.eu
nl: ontdekking, https://discovery.opendatasoft.com, https://www.datastro.eu

source: If you want to harvest a single Opendatasoft dataset, you can :doc:`retrieve an Opendatasoft dataset </publishing_data/01_creating_a_dataset/retrieving_dataset>`.
de: Wenn Sie einen Harvester für einen einzelnen Opendatasoft-Datensatz einrichten wollen, können Sie :doc:`einen Opendatasoft-Datensatz abrufen</publishing_data/01_creating_a_dataset/retrieving_dataset>`
