Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/02_harvesting_a_catalog/harvesters/quandl.po
Languages: fr

source: Quandl harvester
fr: Moissonneur Quandl

source: Retrieve datasets from `Quandl API <https://www.quandl.com/what-we-do>`_
fr: Récupère les jeux de données de `l'API Quandl <https://www.quandl.com/what-we-do>`_

source: This harvester is not available by default. If you need to use it, please contact OpenDataSoft support team.
fr: Ce moissonneur n'est pas disponible par défaut. Si vous souhaitez l'utiliser, veuillez contacter le support OpenDataSoft.

source: Parameters
fr: Paramètres

source: Name
fr: Nom

source: Example
fr: Exemple

source: Database code
fr: Code de la base de données

source: The code of the database you want to harvest
fr: Le code de la base de données à moissonner

source: Quandl API key
fr: Clé d'API Quandl

source: Your API key available in `your account settings <https://www.quandl.com/account/api>`_
fr: La clé d'API disponible dans `les paramètres du compte <https://www.quandl.com/account/api>`

source: Number of datasets
fr: Nombre de jeux de données

source: Only retrieve a certain amount of datasets.
fr: Ne récupérer qu'une certaine quantité de jeux de données
