Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/11_saving_and_publishing_a_dataset/dataset_actions_status.po
Languages: de, es, fr, nl

source: Dataset actions and statuses
de: Aktionen und Status von Datensätzen
es: Acciones y estados de los conjuntos de datos
fr: Actions et états des jeux de données
nl: Datasetacties en statussen

source: Actions
de: Aktionen
es: Acciones
nl: Acties

source: **Actions related to the life cycle of a dataset**
de: **Aktionen im Zusammenhang mit dem Lebenszyklus eines Datensatzes**
es: **Acciones relacionadas con el ciclo de vida de un conjunto de datos**
fr: **Actions liées au cycle de vie d'un jeu de données**
nl: **Acties met betrekking tot de levenscyclus van een dataset**

source: Action
de: Aktion
es: Acción
nl: Actie

source: Button
es: Botón
fr: Bouton
nl: Knop

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
nl: Opslaan

source: Saves all new configurations and modifications operated on the dataset.
de: Speichert alle neuen Konfigurationen und Änderungen, die am Datensatz vorgenommen wurden.
es: Guarda todas las nuevas configuraciones y modificaciones efectuadas en el conjunto de datos.
fr: Enregistre toutes les nouvelles configurations et modifications effectuées sur le jeu de données.
nl: Slaat alle nieuwe configuraties en wijzigingen aan de dataset op.

source: Publish
de: Veröffentlichen
es: Publicar
fr: Publier
nl: Publiceer

source: Makes the dataset's modifications go live on the portal. The duration of the publishing varies depending on the dataset, and the nature of the modifications.
de: Die Datensatzänderungen werden auf dem Portal veröffentlicht. Die Dauer der Veröffentlichung hängt vom Datensatz und der Art der Änderungen ab.
es: Activa las modificaciones del conjunto de datos en el portal. La duración de la acción de publicación varía según el conjunto de datos y la naturaleza de las modificaciones.
fr: Met en ligne les modifications du jeu de données sur le portail. La durée de cette action peut varier en fonction du jeu de données et de la nature des modifications.
nl: Zorgt ervoor dat de wijzigingen aan de dataset live gaan op het portaal. De duur van het publiceren verschilt afhankelijk van de dataset en de aard van de wijzigingen.

source: Abort
de: Abbrechen
es: Anular
fr: Interrompre
nl: Afbreken

source: Replaces the **Publish** button after clicking on it, and only lasts until the end of the publishing. Stops the publishing and leaves the dataset in a clean state, but incomplete since not all records have been processed.
de: Ersetzt den Button **Veröffentlichen** nach dem Anklicken und dauert nur bis zum Ende der Veröffentlichung. Die Veröffentlichung wird abgebrochen und der Datensatz wird in einen sauberen aber unvollständigen Zustand gesetzt (nicht alle Einträge wurden verarbeitet).
es: Sustituye el botón **Publicar** después de hacer clic en él, y solo se mantiene hasta el final de la acción de publicación. Detiene la publicación y deja el conjunto de datos en estado limpio pero incompleto, ya que no se han procesado todos los registros.
fr: Remplace le bouton **Publier** une fois que l'utilisateur a cliqué sur celui-ci et n'est disponible que jusqu'à la fin de la publication. Il interrompt la publication et laisse le jeu de données dans un état propre mais incomplet, étant donné que tous les enregistrements n'ont pas été traités.
nl: Vervangt de knop **Publiceer** nadat deze is aangeklikt en duurt enkel tot het einde van het publiceren. Stopt het publiceren en laat de dataset in een propere staat, maar onvolledig aangezien niet alle records verwerkt zijn geweest.

source: Unpublish
de: Veröffentlichung aufheben
es: Cancelar publicación
fr: Dépublier
nl: Verwijder

source: Removes the dataset from the front office catalog, deleting all the records during the process.
de: Der Datensatz wird aus dem Front-Office-Katalog entfernt und alle Einträge werden während des Prozesses gelöscht.
es: Elimina el conjunto de datos del catálogo del front office, y suprime todos los registros durante el proceso.
fr: Retire le jeu de données du catalogue de l'interface de navigation, supprimant également tous les enregistrements.
nl: Verwijdert de dataset uit de catalogus van de front office, waarbij alle records tijdens het proces worden gewist.

source: Warning
de: Warnung
es: Aviso
fr: Avertissement
nl: Waarschuwing

source: In some cases, the unpublishing of a dataset can erase data (i.e. realtime without recovery, specific connectors, dataset schema change etc.).
de: In einigen Fällen kann das Aufheben einer Datensatz-Veröffentlichung zum Löschen von Daten führen (z.B. Echtzeit ohne Wiederherstellung, spezifische Konnektoren, Änderung des Datensatzschemas usw.).
es: En algunos casos, al cancelarse la publicación de un conjunto de datos se pueden borrar datos (p. ej., en tiempo real sin recuperación, conectores específicos, cambio de esquemas de conjuntos de datos, etc.).
fr: Dans certains cas, la dépublication d'un jeu de données peut effacer des données (en temps réel sans récupération, connecteurs spécifiques, modification du modèle de données, etc.).
nl: In sommige gevallen kunnen bij het verwijderen van een dataset data worden gewist (d.i. real time zonder herstel, specifieke connectoren, wijziging datasetschema, enz.).

source: Delete dataset
de: Datensatz löschen
es: Suprimir conjunto de datos
fr: Supprimer le jeu de données
nl: Dataset verwijderen

source: Removes the dataset from both front office and back office catalogs. Entirely deletes the dataset, its records and everything else related to the dataset.
de: Der Datensatz wird aus den Front-Office- und Back-Office-Katalogen entfernt. Der komplette Datensatz, alle Einträge und alles, was mit ihm zusammenhängt, werden gelöscht.
es: Elimina el conjunto de datos de los catálogos del front office y el back office. Borra por completo el conjunto de datos, sus registros y todo lo demás en relación con el mismo.
fr: Retire le jeu de données des catalogues de l'interface de navigation et de l'interface d'administration. La suppression du jeu de données est totale : elle inclut ses enregistrements ainsi que tous les éléments en lien avec le jeu de données.
nl: Verwijdert de dataset uit zowel de front office als de back office catalogi. Verwijdert de dataset volledig, zijn records en al het andere dat verband houdt met de dataset.

source: Once a dataset has been deleted, it is not possible to get it back. This operation cannot be cancelled or reversed.
de: Nach dem Löschen eines Datensatzes kann dieser nicht wiederhergestellt werden. Dieser Vorgang kann nicht abgebrochen oder rückgängig gemacht werden.
es: Una vez suprimido un conjunto de datos, no se puede recuperar. Esta operación no se puede cancelar ni revertir.
fr: Une fois qu'un jeu de données a été supprimé, il n'est pas possible de le récupérer. Cette opération ne peut pas être changée ou annulée.
nl: Eenmaal een dataset is verwijderd, kan deze niet worden teruggehaald. Deze operatie kan niet worden geannuleerd of omgekeerd.

source: **Actions related to the configuring/processing of a dataset**
de: **Aktionen im Zusammenhang mit der Konfiguration/Verarbeitung eines Datensatzes**
es: **Acciones relacionadas con la configuración o el procesamiento de un conjunto de datos**
fr: **Actions liées à la configuration/au traitement d'un jeu de données**
nl: **Acties met betrekking tot het configureren/verwerken van een dataset**

source: Undo
de: Rückgängig machen
es: Deshacer
fr: Annuler
nl: Ongedaan maken

source: Reverses the last action operated on the dataset.
de: Kehrt die zuletzt am Datensatz durchgeführte Aktion um.
es: Revierte la última acción ejecutada en el conjunto de datos.
fr: Annule la dernière action effectuée sur le jeu de données.
nl: Keert de laatste actie om die uitgevoerd werd op de dataset.

source: Redo
de: Wiederholen
es: Rehacer
fr: Rétablir
nl: Opnieuw doen

source: Reoperates the last reversed action on the dataset.
de: Wiederholt die zuletzt rückgängig gemachte Aktion am Datensatz.
es: Efectúa de nuevo la última acción revertida en el conjunto de datos.
fr: Rétablit la dernière action annulée sur le jeu de données.
nl: Voert de laatste omgekeerde actie op de dataset opnieuw uit.

source: Duplicate dataset
de: Datensatz duplizieren
es: Duplicar conjunto de datos
fr: Dupliquer le jeu de données
nl: Dataset dupliceren

source: Creates an exact same copy of the dataset.
de: Erstellt eine genau gleiche Kopie des Datensatzes.
es: Crea una copia exacta del conjunto de datos.
fr: Crée une copie exacte du jeu de données.
nl: Maakt een volledig identieke kopie van de dataset.

source: Statuses
de: Status
es: Estados
fr: États
nl: Statussen

source: Status
es: Estado
fr: État

source: Queued
de: In Warteschlange
es: En cola
fr: Mise en file d'attente
nl: In wachtrij geplaatst

source: The processing is waiting to get started.
de: Die Verarbeitung wartet darauf, gestartet zu werden.
es: El procesamiento está esperando para comenzar.
fr: Le traitement est en attente d'être lancé.
nl: Er wordt gewacht om het verwerken te starten.

source: Processing
de: Verarbeitung
es: Procesadores
fr: Traitement
nl: Bezig met verwerken

source: The processing is ongoing. Records are extracted from the connector, processors are applied and the result is made available through the Opendatasoft API. The number of records increases during this step.
de: Die Verarbeitung läuft: Einträge werden vom Konnektor extrahiert, Prozessoren angewendet und die Opendatasoft-API stellt das Ergebnis zur Verfügung. Die Anzahl an Einträgen steigt in diesem Schritt.
es: El procesamiento está en curso. Se extraen los registros del conector, se aplican los procesadores y el resultado está disponible en la API de Opendatasoft. El número de registros aumenta en este paso.
fr: Le traitement est en cours. Les enregistrements sont extraits depuis le connecteur, les processeurs sont appliqués et le résultat est rendu visible via l'API Opendatasoft. Le nombre d'enregistrements augmente pendant cette étape.
nl: Het verwerken loopt. Records worden geÃ«xtraheerd uit de connector, processors worden toegepast en het resultaat wordt beschikbaar gesteld via de Opendatasoft API. Het aantal records neemt toe tijdens deze stap.

source: Unpublishing
de: Veröffentlichung wird aufgehoben
es: Cancelación de publicación en curso
fr: Dépublication
nl: Verwijderen

source: The dataset is being unpublished, thus removed from the API.
de: Die Veröffentlichung des Datensatzes wird aufgehoben und er wird aus der API entfernt.
es: Se cancela la publicación del conjunto de datos y, por consiguiente, se elimina de la API.
fr: Le jeu de données est dépublié, donc supprimé de l'API.
nl: De dataset wordt verwijderd uit de API.

source: Aborting processing
de: Abbruch der Verarbeitung
es: Proceso de anulación en curso
fr: Interruption du traitement
nl: Verwerking afbreken

source: The ongoing processing stops at where it was when the **Abort** button was pushed.
de: Die aktuelle Verarbeitung wird an der Stelle abgebrochen, an der der Button **Abbrechen** betätigt wurde.
es: El procesamiento en curso se detiene en el punto en que se encontraba al pulsar el botón **Anular**.
fr: Le traitement en cours s'arrête immédiatement dès que l'utilisateur clique sur le bouton **Interrompre**.
nl: Het verwerken stopt wanneer de knop **Afbreken** werd aangeklikt.
