Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/11_saving_and_publishing_a_dataset/publish.po
Languages: de, es, fr, it, nl

source: Publishing datasets
de: Veröffentlichen von Datensätzen
es: Publicar los juegos de datos
fr: Publier des jeux de données
it: Pubblicazione dei dataset
nl: Datasets publiceren

source: A dataset has a dedicated life cycle: It's start in the backoffice (not published), you configured the sources, the processors, the security and then you publish it. The dataset appears in the frontoffice (according to the security rules). When you make modifications on the dataset, they are pushed to the publish version when you click on the *publish* button. At any time you can remove a dataset from the by the *unpublish* action,
de: Ein Datensatz hat einen bestimmten Lebenszyklus: Er beginnt im Back-Office (unveröffentlicht), Sie konfigurieren die Quellen, die Prozessoren sowie die Sicherheit und veröffentlichen ihn dann. Der Datensatz erscheint im Front-Office (gemäß den Sicherheitsregeln). Nehmen Sie Änderungen an Datensätzen vor, werden sie in die Veröffentlichungsversion gepusht, wenn Sie auf die Schaltfläche *Veröffentlichen* klicken. Sie können einen Datensatz jederzeit über die Schaltfläche *Veröffentlichung aufheben* aus dem Front-Office entfernen.
es: Un juego de datos tiene un ciclo de vida específico: empieza en el back office (sin publicar), donde se configuran los orígenes, los procesadores y la seguridad, y después se publica. El juego de datos aparece en el front office (conforme a las reglas de seguridad). Cuando se realizan modificaciones en el juego de datos, estas se insertan en la versión publicada al hacer clic en el botón *Publicar¨. En cualquier momento se puede eliminar un juego de datos mediante la acción *Cancelar publicación*.
fr: Un jeu de données présente un cycle de vie spécifique : il est créé dans le back office (non publié), vous configurez les sources, les processeurs et la sécurité, puis vous le publiez. Le jeu de données apparaît sur la plateforme (en fonction des règles de sécurité). Quand vous apportez des modifications au jeu de données, elles sont chargées dans la version publiée lorsque vous cliquez sur le bouton *Publier*. Vous pouvez à tout moment supprimer un jeu de données à l'aide de l'action *dépublier*.
it: Il ciclo di vita di un dataset inizia nell'interfaccia di back-office, quando non è ancora pubblicato, e prosegue con la configurazione delle origini, dei processori e delle impostazioni di sicurezza, fino alla pubblicazione. A questo punto, il dataset compare anche nell'interfaccia front-office della piattaforma, nei limiti stabiliti dalle regole di sicurezza. Quando apporti modifiche ai dataset, cliccando sul pulsante *Pubblica* trasferirai queste anche nella versione pubblicata. Puoi annullare la pubblicazione di un dataset in qualsiasi momento, cliccando su *Annulla la pubblicazione*.
nl: Een dataset heeft een speciale levenscyclus. Deze begint in de back-office (niet-gepubliceerd). U configureert de bronnen, de processors, de veiligheid en vervolgens publiceert u deze. De dataset verschijnt in de front-office (overeenkomstig de veiligheidsregels). Wanneer u wijzigingen aanbrengt aan de dataset, worden deze gepusht naar de publicatieversie wanneer u klikt op de knop *publiceer*. U kan te allen tijd een dataset verwijderen via de actie *verwijderen*,

source: Actions
de: Aktionen
es: Acciones
it: Azioni
nl: Acties

source: Publish: Make the dataset's modifications live. This action duration can be various, it depends if only metadata have changed or if the dataset schema changed.
de: Veröffentlichen: Datensatzänderungen live schalten. Die Dauer dieser Aktion kann unterschiedlich sein und hängt davon ab, ob lediglich Metadaten oder das Datensatzschema geändert wurden.
es: Publicar: Activa las modificaciones del juego de datos. La duración de esta acción varía en función de si solo se han cambiado los metadatos o si se ha cambiado el esquema de juego de datos.
fr: Publier : met en ligne les modifications du jeu de données. La durée de cette action peut varier, par exemple si seules les métadonnées ont été modifiées ou si des modifications ont été apportées au schéma du jeu de données.
it: Pubblica: attiva le modifiche apportate al dataset. La durata di questa azione può variare, ad esempio se vengono modificati solo i metadati, oppure se cambia lo schema del dataset.
nl: Publiceer: Ervoor zorgen dat de wijzigingen van de dataset live worden. De duur van deze actie kan verschillen. Dit hangt af van het feit of alleen metadata werden gewijzigd of het datasetschema is gewijzigd.

source: Unpublish: It removes the dataset from the calalog and all records are deleted. In some case data can be lost (realtime without recovery, specific connectors).
de: Veröffentlichung aufheben: Entfernt einen Datensatz aus dem Katalog und alle Einträge werden gelöscht. In einigen Fällen kann es zu Datenverlusten kommen (Echtzeit ohne Wiederherstellung, spezifische Konnektoren).
es: Cancelar publicación: Elimina el juego de datos del catálogo y suprime todos los registros. En algunos casos pueden perderse datos (en tiempo real sin recuperación, conectores específicos...).
fr: Dépublier : supprime le jeu de données du catalogue et tous les enregistrements sont effacés. Dans certains cas, des données peuvent être perdues (temps réel sans récupération, connecteurs spécifiques).
it: Annulla la pubblicazione: rimuove il dataset dal catalogo ed elimina tutti i record. In alcuni casi possono verificarsi perdite di dati, ad esempio se l'operazione avviene in tempo reale senza recupero, se utilizzi connettori specifici e così via.
nl: Verwijderen: hierdoor wordt de dataset uit de catalogus verwijderd en worden alle records gewist. In sommige gevallen kunnen data verloren gaan (real time zonder herstel, specifieke connectoren).

source: Abort: It sends the *abort* order to the processing process. It will leave the dataset in a clean but incomplete state (not all records have been processed).
de: Abbrechen: Sendet den Befehl *Abbrechen* an den Verarbeitungsprozess. Lässt den Datensatz in einem sauberen aber unvollständigen Zustand (nicht alle Einträge wurden verarbeitet).
es: Anular: Envía la orden *Anular* al procesamiento en curso. Deja el juego de datos en estado limpio pero incompleto (no se han procesado todos los registros).
fr: Interrompre : envoie la commande *Interrompre* au processus de traitement. Il laissera le jeu de données dans un état propre mais incomplet (tous les enregistrements n'ont pas été traités).
it: Interrompi: invia l'ordine di *interruzione* al processo di elaborazione. Il dataset è lasciato in uno stato corretto ma incompleto, poiché non tutti i record sono stati elaborati.
nl: Afbreken: hiermee wordt een bevel *afbreken* gestuurd naar het verwerkingsproces. Hierdoor blijft de dataset in een zuivere maar onvolledige status (niet alle records werden verwerkt).

source: Statuses
de: Status
es: Estados
fr: États
it: Stati
nl: Statussen

source: Dataset processing is perform asynchronously to ensure the best performance and no interference with others processing tasks. Different status are reachable by a dataset during the processing task.
de: Die Datensatzverarbeitung erfolgt asynchron, um die beste Leistung und Störungsfreiheit mit anderen Verarbeitungsaufgaben zu gewährleisten. Während der Verarbeitung kann ein Datensatz mehrere Status erreichen.
es: El procesamiento del juego de datos se realiza asíncronamente para asegurar un rendimiento óptimo y no interferir en otras tareas de procesamiento. Un juego de datos pasa por diferentes estados a lo largo de la tarea de procesamiento.
fr: Le traitement des jeux de données est réalisé de manière asynchrone afin de garantir les meilleures performances possibles et d'éviter toute interférence avec d'autres tâches de traitement. Un jeu de données peut atteindre différents états pendant la tâche de traitement.
it: L'elaborazione del dataset avviene in modo asincrono, per ottimizzare le performance ed evitare interferenze con le altre attività elaborative. Durante questa fase, il dataset può assumere diversi stati.
nl: Het verwerken van datasets verloopt asynchroon om de beste prestaties te waarborgen en om ervoor te zorgen dat er geen interferentie is met andere verwerkingstaken. Tijdens de verwerkingstaak kan de dataset verschillende statussen bereiken.

source: Queued: The processing task is waiting to be pick up.
de: In Warteschlange: Die Verarbeitungsaufgabe wartet auf den Start.
es: En cola: La tarea de procesamiento está esperando a ser seleccionada.
fr: Mise en file d'attente : la tâche de traitement est en attente de la reprise.
it: In attesa: l'attività di elaborazione è in attesa di essere avviata.
nl: In wachtrij geplaatst: er wordt gewacht tot de verwerkingstaak hervat kan worden.

source: Processing: Records are extracted from the connector, processors are applied and the result is made available through the OpenDataSoft API. Records number increased during this step.
de: Verarbeitung: Einträge werden vom Konnektor extrahiert, Prozessoren angewendet und die OpenDataSoft-API stellt das Ergebnis zur Verfügung. Die Anzahl an Einträgen steigt in diesem Schritt.
es: Proceso en curso: Se han extraído los registros del conector, se han aplicado los procesadores y el resultado está disponible a través de la API de OpenDataSoft. El número de registros ha aumentado en este paso.
fr: Traitement : les enregistrements sont extraits depuis le connecteur, les processeurs sont appliqués, et le résultat est rendu disponible via l'API OpenDataSoft. Le nombre d'enregistrement augmente pendant cette étape.
it: Elaborazione: i record vengono estratti dal connettore, i processori vengono applicati e il risultato è reso disponibile mediante la API OpenDataSoft. In questa fase il numero dei record aumenta.
nl: Verwerken: records worden geëxtraheerd uit de connector, processors worden toegepast en het resultaat wordt beschikbaar gesteld via de OpenDataSoft API. Het aantal records neemt toe tijdens deze stap.

source: Unpublishing: Dataset is removed from the API.
de: Veröffentlichung aufheben: Datensatz wird von der API entfernt.
es: Cancelación de publicación en curso: El juego de datos se ha eliminado de la API.
fr: Dépublication : le jeu de données est supprimé de l'API.
it: Annullamento della pubblicazione: il dataset viene rimosso dall'API.
nl: Verwijderen: de dataset wordt verwijderd uit de API.

source: Aborting processing: The *abort* order has been sent to the platform. The dataset processing will stop within the next minute.
de: Abbruch der Verarbeitung: Der Befehl *Abbrechen* wurde an die Plattform gesendet. Die Datensatzverarbeitung wird innerhalb der nächsten Minute gestoppt.
es: Proceso de anulación en curso: Se ha enviado la orden *Anular* a la plataforma. El procesamiento del juego de datos se detendrá en el próximo minuto.
fr: Interruption du traitement : la commande *Interrompre* a été envoyée à la plateforme. Le traitement du jeu de données s'arrêtera sous une minute.
it: Interruzione dell'operazione in corso: la richiesta di *interruzione* è stata inviata alla piattaforma. L'elaborazione del dataset si interromperà entro pochi minuti.
nl: Verwerking afbreken: het bevel *afbreken* werd naar het platform gestuurd. Binnen de volgende minuut zal de verwerking van de dataset worden stopgezet.

source: Limit reached: The user who launched the processing job reached its allowed quota. He overtakes one of the limit (from the domain, the group of the user).
de: Limit erreicht: Der Benutzer, der den Verarbeitungsauftrag gestartet hat, hat die zulässige Quote erreicht. Er überschreitet eins der Limits (von der Domain oder der Benutzergruppe).
es: Límite alcanzado: El usuario que ha iniciado el trabajo de procesamiento ha alcanzado su cuota permitida. Supera en uno el límite (del dominio, grupo o usuario).
fr: Limite atteinte : l'utilisateur qui a lancé la tâche de traitement a atteint son quota autorisé. Il dépasse l'une des limites (du domaine, du groupe ou de l'utilisateur).
it: Limite raggiunto: l'utente che ha avviato l'attività di elaborazione ha raggiunto la quota consentita, superando uno dei limiti definiti a livello del dominio, del gruppo o del singolo utente.
nl: Limiet bereikt: de gebruiker die de verwerkingstaak heeft gelanceerd bereikte zijn toegelaten quotum. Hij neemt één van de limieten over (van het domein, de groep van de gebruiker).
