Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/available_apis.po
Languages: de, es, fr, nl

source: Available APIs
de: Verfügbare APIs
es: Interfaces API disponibles
fr: API disponibles
nl: Beschikbare API's

source: OpenDataSoft datasets can be accessed by developers through HTTP REST APIs.
de: Entwickler können über HTTP REST-APIs auf OpenDataSoft-Datensätze zugreifen.
es: Los desarrolladores pueden acceder a los conjuntos de datos de OpenDataSoft mediante interfaces API HTTP/REST.
fr: Les développeurs peuvent accéder aux jeux de données OpenDataSoft via des API REST HTTP.
nl: Ontwikkelaars kunnen zich toegang verschaffen tot de OpenDataSoft datasets via HTTP REST APIs.

source: The domain `<http://public.opendatasoft.com>`_ will be use to illustrate examples given in this forum.
de: Zur Veranschaulichung der in diesem Forum gegebenen Beispiele wird die Domain `<http://public.opendatasoft.com>`_ verwendet.
es: Se usará el dominio `<http://public.opendatasoft.com>`_ para ilustrar los ejemplos facilitados en este foro.
fr: Le domaine `<http://public.opendatasoft.com>`_ sera utilisé dans les exemples illustrant cette rubrique.
nl: Het domein `<http://public.opendatasoft.com>`_ zal gebruikt worden om voorbeelden te illustreren die gegeven worden in dit forum.

source: The available APIs are listed below.
de: Die verfügbaren APIs sind unten aufgelistet.
es: A continuación figura una lista de las interfaces API disponibles.
fr: Les API disponibles sont répertoriées ci-dessous.
nl: De beschikbare API's worden hieronder opgesomd.

source: API Short Description
de: API-Kurzbeschreibung
es: Descripción corta de la API
fr: Description rapide de l'API
nl: Beknopte omschrijving van de API

source: Dataset search API
de: Datensatzsuch-API
es: API de búsqueda de conjuntos de datos
fr: API de recherche de jeux de données
nl: API voor het zoeken van datasets

source: ``Dataset search API``
de: ``Datensatzsuch-API``

source: Search datasets
de: Datensätze durchsuchen
es: Búsqueda de conjuntos de datos
fr: Rechercher des jeux de données
nl: Zoek datasets

source: Dataset lookup API
de: Datensatznachschlag-API
es: API de consulta de conjunto de datos
fr: API de récupération de jeux de données
nl: API voor het opzoeken van datasets

source: ``Dataset lookup API``
de: ``Datensatznachschlag-API``

source: Find a dataset based on its identifier
de: Einen Datensatz auf der Grundlage seines Bezeichners suchen
es: Consulta de un conjunto de datos a partir de su identificador
fr: Trouver un jeu de données à l'aide de son identifiant
nl: Vind een dataset terug op basis van zijn identifier

source: Records search API
de: Eintragsuch-API
es: API de búsqueda de registros
fr: API de recherche d'enregistrements
nl: API voor het zoeken van records

source: ``Records search API``
de: ``Eintragsuch-API``

source: Search records within a specific dataset
de: Einträge in einem bestimmten Datensatz suchen
es: Búsqueda de registros en un conjunto de datos específico
fr: Rechercher des enregistrements dans un jeu de données spécifique
nl: Zoek records binnen een specifieke dataset

source: Analysis API
de: Analyse-API
es: API de análisis
fr: API d'analyse
nl: Analyse-API

source: ``Analysis API``
de: ``Analyse-API``

source: Build advanced aggregations using records of a specific dataset
de: Erweiterte Aggregationen mit Einträgen eines bestimmten Datensatzes erstellen
es: Compilación de agregaciones avanzadas con registros de un conjunto de datos específico
fr: Créer des agrégations complexes à l'aide des enregistrements d'un jeu de données spécifique
nl: Bouw geavanceerde aggregaties op door gebruik te maken van de records van een specifieke dataset

source: Efficiently download a large number of records from a specific dataset
de: Eine große Anzahl Einträge von einem bestimmten Datensatz herunterladen
es: Descarga eficaz de un gran número de registros de un conjunto de datos específico
fr: Télécharger efficacement un grand nombre d'enregistrements à partir d'un jeu de données spécifique
nl: Download op efficiënte wijze een groot aantal records uit een specifieke dataset

source: Geo clustering API
de: Geo-Cluster-API
es: API de clúster geográfico
fr: API de clusters géographiques

source: ``Geo clustering API``
de: ``Geo-Cluster-API``

source: Build geo clusters using records of a specific dataset
de: Geo-Cluster mit Einträgen eines bestimmten Datensatzes erstellen
es: Compilación de clústeres geográficos con registros de un conjunto de datos específico
fr: Créer des clusters géographiques à l'aide des enregistrements d'un jeu de données spécifique
nl: Bouw geoclusters op door gebruik te maken van records van een specifieke dataset

source: Real Time Push API
de: Echtzeit-Push-API
es: API de integración de datos en tiempo real
fr: API Push en temps réel

source: ``Real Time Push API``
de: ``Echtzeit-Push-API``

source: Real time data integration
de: Datenintegration in Echtzeit
es: Integración de datos en tiempo real
fr: Intégration des données en temps réel
nl: Real time data-integratie

source: Download multimedia content attached with datasets or records
de: An Datensätze oder Einträge angehängte Multimediainhalte herunterladen
es: Descarga de contenido multimedia asociado a conjuntos de datos o registros
fr: Télécharger les contenus multimédias joints aux jeux de données ou aux enregistrements
nl: Download multimedia content die verbonden is aan datasets of records

source: All these APIs (except the Multimedia download API) return JSON by default. Some of them can return alternate content.
de: All diese APIs (mit Ausnahme der Multimedia Download-API) geben standardmäßig JSON zurück. Einige von ihnen können alternative Inhalte zurückgeben.
es: Todas estas API (excepto la API de descarga multimedia) devuelven JSON de forma predeterminada. Algunas pueden devolver contenido alternativo.
fr: Toutes ces API (à l'exception de l'API de téléchargement multimédia) renvoient par défaut des contenus JSON. Certaines d'entre elles peuvent renvoyer d'autres contenus.
nl: Al deze API's (behalve de Multimedia Download API) leveren standaard JSON op. Sommige ervan kunnen andere content opleveren.

source: All these APIs (except the Real Time Push API) support cross-domain access from a browser, using CORS (`<http://en.wikipedia.org/wiki/Cross-origin_resource_sharing>`_). For older browsers or other specific purposes, JSONP (`<http://en.wikipedia.org/wiki/JSONP>`_) is supported when returning JSON content by adding a ``callback`` parameter.
de: All diese APIs (mit Ausnahme der Echtzeit-Push-API) unterstützen mithilfe von CORS (`<http://en.wikipedia.org/wiki/Cross-origin_resource_sharing>`_) einen domainübergreifenden Zugriff von einem Browser. Für ältere Browser oder andere spezifische Zwecke wird JSONP (`<http://en.wikipedia.org/wiki/JSONP>`_) unterstützt, wenn JSON-Inhalte durch Hinzufügen eines Parameters ``callback`` zurückgegeben werden.
es: Todas estas API (excepto la API de integración de datos en tiempo real) permiten el acceso entre dominios desde un explorador, utilizando CORS (`<http://en.wikipedia.org/wiki/Cross-origin_resource_sharing>`_). Para exploradores anteriores u otros fines específicos, se admite JSONP (`<http://en.wikipedia.org/wiki/JSONP>`_) cuando se devuelve contenido JSON añadiendo un parámetro ``callback``.
fr: Toutes ces API (à l'exception de l'API Push en temps réel) prennent en charge l'accès inter-domaines depuis un navigateur, à l'aide de CORS (`<http://en.wikipedia.org/wiki/Cross-origin_resource_sharing>`_). Pour les navigateurs anciens ou pour d'autres utilisations spécifiques, JSONP (`<http://en.wikipedia.org/wiki/JSONP>`_) est pris en charge lorsque vous renvoyez du contenu JSON, en ajoutant un paramètre ``callback``.
nl: Al deze API's (behalve de Real Time Push API) ondersteunen toegang tot verschillende domeinen vanuit een browser door gebruik te maken van CORS (`<http://en.wikipedia.org/wiki/Cross-origin_resource_sharing>`_). Voor oudere browsers en andere specifieke doeleinden, wordt JSONP (`<http://en.wikipedia.org/wiki/JSONP>`_) ondersteund wanneer JSON-content wordt gegeven door het toevoegen van een ``callback`` parameter.

source: Finding the dataset identifier
de: Suchen des Datensatzbezeichners
es: Buscar el identificador de conjunto de datos
fr: Trouver l'identifiant du jeu de données
nl: De identifier van de dataset terugvinden

source: You are looking for specific data to build your application but you don't know yet in which dataset you can find these data?
de: Sie suchen bestimmte Daten, um Ihre Anwendung zu erstellen, wissen aber noch nicht, in welchem Datensatz Sie diese Daten finden können?
es: ¿Busca unos datos específicos para compilar la aplicación pero aún no sabe en qué conjunto de datos puede encontrarlos?
fr: Vous recherchez des données spécifiques pour développer votre application, mais vous ne savez pas encore dans quel jeu de données les trouver ?
nl: U bent op zoek naar specifieke data om uw applicatie op te bouwen, maar u weet nog niet in welke dataset u deze data kan terugvinden?

source: You can simply use the exploration console by clicking on the "Explore" link in the top page menu. Once you have identified the dataset you need, just go to this dataset's "Information" tab where you'll find the dataset id.
de: Nutzen Sie einfach die Untersuchungskonsole, indem Sie oben im Seitenmenü auf den Link "Untersuchen" klicken. Haben Sie den benötigten Datensatz identifiziert, wechseln Sie einfach ins Register "Informationen" dieses Datensatzes, wo Sie die Datensatz-ID finden.
es: Basta con que use la consola de exploración haciendo clic en el vínculo "Explorar" en el menú de la parte superior de la página. Una vez identificado el conjunto de datos que necesite, simplemente vaya a la ficha "Información" de ese conjunto de datos y allí encontrará el identificador de conjunto de datos.
fr: Vous pouvez tout simplement utiliser la console d'exploration en cliquant sur le lien "Explorer" du menu en haut de page. Une fois que vous avez identifié le jeu de données dont vous avez besoin, il vous suffit d'accéder à son onglet "Informations" pour obtenir l'ID du jeu de données.
nl: U kan gewoon de exploratieconsole gebruiken door te klikken op de koppeling "Explore" in het menu bovenaan de pagina. Eenmaal u de dataset die u nodig heeft, heeft geïdentificeerd, ga gewoon naar het "informatie" tabblad van deze dataset waar u het dataset-ID zal terugvinden.

source: HTTP Methods
de: HTTP-Methoden
es: Métodos HTTP
fr: Méthodes HTTP
nl: HTTP-methodes

source: Except for the Real Time Push API which respects more strictly RESTful concepts, all the APIs endpoints accept GET and POST HTTP methods. GET methods shall be prefered of course. The POST can be used to workaround browsers / libraries / proxies limitations regarding the size of the HTTP URL.
de: Mit Ausnahme der Echtzeit-Push-API, die strengere RESTful-Konzepte beachtet, akzeptieren alle API-Endpunkte die HTTP-Methoden GET und POST. GET-Methoden sind natürlich zu bevorzugen. POST kann verwendet werden, um Einschränkungen von Browsern / Bibliotheken / Proxys hinsichtlich der Größe der HTTP-URL zu umgehen.
es: Con la excepción de la API de integración de datos en tiempo real que respeta más estrictamente los conceptos RESTful, todos los extremos de API aceptan los métodos HTTP GET y POST. Obviamente, son preferibles los métodos GET. Se pueden usar los métodos POST para buscar una solución alternativa a las limitaciones de exploradores/bibliotecas/proxies en cuanto al tamaño de la dirección URL HTTP.
fr: À l'exception de l'API Push en temps réel, qui adhère plus strictement aux concepts RESTful, tous les points d'entrée des API acceptent les méthodes HTTP GET et POST. La méthode GET est bien entendu préférable. La méthode POST peut être utilisée pour pallier les limitations des navigateurs/bibliothèques/proxys en ce qui concerne la taille des URL HTTP.
nl: Behalve voor de Real Time Push API die meer strikte RESTful concepten respecteert, aanvaarden alle eindpunten van API's GET- en POST HTTP-methodes. GET-methodes zullen vanzelfsprekend de voorkeur hebben. De POST kan gebruikt worden om browsers / bibliotheken / volmachtbeperkingen te omzeilen met betrekking tot de grootte van de HTTP URL.

source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
nl: Veiligheid

source: All the APIs are secured using the same authentication and authorization model.
de: Alle APIs sind mithilfe des gleichen Authentifizierungs- und Autorisierungsmodells gesichert.
es: Todas las API están protegidas por el mismo modelo de autenticación y autorización.
fr: Toutes les API sont sécurisées à l'aide du même modèle d'authentification et d'autorisation.
nl: Alle API's zijn beveiligd door gebruik te maken van hetzelfde authenticatie- en autorisatiemodel.

source: Users can only see what they are allowed to see:
de: Benutzer können nur das sehen, was ihnen erlaubt wurde:
es: Los usuarios solo pueden ver lo que tienen permiso para ver:
fr: Les utilisateurs peuvent uniquement consulter ce qu'ils sont autorisés à consulter :
nl: Gebruikers kunnen enkel zien wat ze mogen zien:

source: Datasets in a domain
de: Datensätze in einer Domain
es: Conjuntos de datos de un dominio
fr: Jeux de données dans un domaine
nl: Datasets in een domein

source: Records in a dataset
de: Einträge in einem Datensatz
es: Registros de un conjunto de datos
fr: Enregistrements dans un jeu de données
nl: Records in een dataset

source: APIs are available both in HTTP and HTTPS. We advise API users to always use the HTTPS endpoint.
de: APIs sind sowohl in HTTP als auch HTTPS verfügbar. Wir raten API-Benutzern, stets den HTTPS-Endpunkt zu nutzen.
es: Las interfaces API están disponibles en HTTP y HTTPS. Recomendamos a los usuarios de las API utilizar el extremo HTTPS.
fr: Les API sont disponibles en HTTP et en HTTPS. Nous recommandons aux utilisateurs des API de toujours utiliser le point d'entrée HTTPS.
nl: API's zijn beschikbaar in zowel HTTP als HTTPS. We adviseren API-gebruikers om altijd het HTTPS eindpunt te gebruiken.

source: The following authentication modes are available:
de: Folgende Authentifizierungsmodi stehen zur Verfügung:
es: Los modos de autenticación siguientes están disponibles:
fr: Les modes d'authentification suivants sont disponibles :
nl: De volgende authenticatiemodi zijn beschikbaar:

source: **Basic HTTP authentication:** Provide your account's login and password (`<http://en.wikipedia.org/wiki/Basic_access_authentication>`_)
de: **HTTP-Standardauthentifizierung:** Angabe Ihrer Kontoanmeldung und Ihres Kennworts (`<http://en.wikipedia.org/wiki/Basic_access_authentication>`_)
es: **Autenticación HTTP básica**: Proporcionar el inicio de sesión y la contraseña de su cuenta (`<http://en.wikipedia.org/wiki/Basic_access_authentication>`_).
fr: **Authentification HTTP basique :** fournit l'identifiant et le mot de passe de votre compte (`<http://en.wikipedia.org/wiki/Basic_access_authentication>`_)
nl: **Basis HTTP-authenticatie:** Geef het login en het wachtwoord van uw account op (`<http://en.wikipedia.org/wiki/Basic_access_authentication>`_)

source: **Simple key authentication:** Provide an API key you generated for your account (API keys work on any domain an OpenDataSoft user has access to)
de: **Einfache Schlüssel-Authentifizierung:** Angabe eines API-Schlüssels, den Sie für Ihr Konto generiert haben. (API-Schlüssel funktionieren bei allen Domains, auf die ein OpenDataSoft-Benutzer Zugriff hat.)
es: **Autenticación de clave simple**: Proporcionar una clave de API que ha generado para su cuenta (las claves de API funcionan en cualquier dominio al cual un usuario de OpenDataSoft tiene acceso).
fr: **Authentification par clé simple :** fournit une clé d'API que vous avez générée pour votre compte (les clés d'API fonctionnent sur tous les domaines OpenDataSoft auxquels un utilisateur a accès)
nl: **Gewone sleutelauthenticatie:** Geef een API-sleutel op die u gegenereerd hebt voor uw account (API-sleutels werken op elk domein waar een gebruiker van OpenDataSoft toegang toe heeft)

source: Note that when you are connected with a Browser session, API calls triggered from that browser will reuse your current credentials.
de: Hinweis: Sind Sie über eine Browser-Sitzung verbunden, werden von diesem Browser ausgelöste API-Aufrufe Ihre aktuellen Anmeldeinformationen weiterverwenden.
es: Tenga en cuenta que cuando se conecte con una sesión de explorador, las llamadas de API desencadenadas desde ese explorador reutilizarán sus credenciales actuales.
fr: Notez que lorsque vous êtes connecté via une session de navigateur, les appels d'API déclenchés depuis ce navigateur réutiliseront vos identifiants actuels.
nl: Gelieve te noteren dat, wanneer u verbonden bent met een Browser-sessie, API calls die getriggerd worden vanuit die browser uw huidige gegevens zullen hergebruiken.

source: Quotas
de: Quoten
es: Cuotas

source: APIs endpoints are subject to quota-based limitations. Contact the domain administrator or the dataset owner when you reach a limit.
de: API-Endpunkte unterliegen auf Quoten basierenden Einschränkungen. Wenden Sie sich beim Erreichen einer Begrenzung an den Domainadministrator oder den Datensatzbesitzer.
es: Los extremos de las API están sujetos a limitaciones basadas en cuotas. Póngase en contacto con el administrador del dominio o el propietario del conjunto de datos cuando alcance un límite.
fr: Les points d'entrée des API sont soumis à des limites basées sur des quotas. Contactez l'administrateur du domaine ou le propriétaire du jeu de données lorsque vous atteignez une limite.
nl: Eindpunten van API's zijn onderworpen aan op quota's gebaseerde beperkingen. Neem contact op met de domeinbeheerder of met de eigenaar van de dataset wanneer u een limiet heeft bereikt.

source: The API response contains three headers to indicate the current state of your quota:
de: Die API-Antwort enthält drei Kopfzeilen, die den aktuellen Status Ihrer Quote angeben:
es: La respuesta de la API contiene 3 encabezados para indicar el estado actual de la cuota:
fr: La réponse de l'API contient trois en-têtes indiquant l'état actuel de votre quota :
nl: De API-respons bevat drie headers om de huidige status van uw quota aan te geven:

source: **X-RateLimit-Limit** indicates the total number of API calls you can do in a single day (resets at midnight UTC)
de: **X-RateLimit-Begrenzung** gibt die Gesamtanzahl der API-Aufrufe an, die Sie an einem Tag machen dürfen (wird um Mitternacht in UTC zurückgesetzt).
es: **X-RateLimit-Limit** indica el número total de llamadas de API que puede hacer en un solo día (se restablece a medianoche UTC).
fr: **X-RateLimit-Limit** indique le nombre total d'appels d'API que vous pouvez effectuer en une journée (réinitialisation à minuit UTC)
nl: **X-RateLimit-Limit** geeft het totale aantal API calls aan dat u op één enkele dag kan doen (wordt om middernacht UTC opnieuw gereset)

source: **X-RateLimit-Remaining** indicates the number of API calls currently remaining
de: **X-RateLimit-Übrig** gibt die Anzahl der aktuell verbleibenden API-Aufrufe an.
es: **X-RateLimit-Remaining** indica el número de llamadas de API restantes actualmente.
fr: **X-RateLimit-Remaining** indique le nombre d'appels d'API actuellement restants
nl: **X-RateLimit-Remaining** geeft het momenteel resterende aantal API calls aan

source: **X-RateLimit-Reset** indicates the `epoch <http://en.wikipedia.org/wiki/Unix_time>`_ of the next reset time
de: **X-RateLimit-Zurücksetzung** gibt den `Zeitraum <http://en.wikipedia.org/wiki/Unix_time>`_ der nächsten Zurücksetzungszeit an.
es: **X-RateLimit-Reset** indica el `tiempo <http://en.wikipedia.org/wiki/Unix_time>`_ de la hora de restablecimiento siguiente.
fr: **X-RateLimit-Reset** indique l'`epoch <http://en.wikipedia.org/wiki/Unix_time>`_ de la prochaine heure de réinitialisation
nl: **X-RateLimit-Reset** verwijst naar de `epoch <http://en.wikipedia.org/wiki/Unix_time>`_ van het volgende resettijdstip

source: Errors handling
de: Fehlerbehandlung
es: Tratamiento de errores
fr: Gestion des erreurs
nl: Behandelen van fouten

source: When an error occurs, a JSON object describing the error is returned by the API.
de: Tritt ein Fehler auf, gibt die API ein den Fehler beschreibendes JSON-Objekt zurück.
es: Cuando se produce un error, la API devuelve un objeto JSON que describe el error.
fr: Lorsqu'une erreur se produit, un objet JSON décrivant l'erreur est renvoyé par l'API.
nl: Wanneer een fout optreedt, geeft de API een JSON-voorwerp dat de fout omschrijft.

source: Example of an error occuring when you reach a quota limit:
de: Beispiel eines beim Erreichen einer Quotenbegrenzung auftretenden Fehlers:
es: Ejemplo de un error producido al alcanzar un límite de cuota:
fr: Exemple d'erreur se produisant lorsque vous atteignez la limite d'un quota :
nl: Voorbeeld van een fout die optreedt wanneer u een quotalimiet bereikt:

source: API Name
es: Nombre de la API
fr: Nom de l'API
nl: Naam van de API

source: Download API
es: API de descarga
fr: API de téléchargement

source: Multimedia Download API
es: API de descarga multimedia
fr: API de téléchargement multimédia
