Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/catalog_api.po
Languages: de, es, fr, it

source: Dataset Catalog APIs
de: Datensatzkatalog-APIs
es: Interfaces API de catálogo de conjuntos de datos
fr: API du catalogue de jeux de données
it: API del catalogo dei dataset

source: Dataset Lookup API
de: Datensatznachschlag-API
es: API de consulta de conjunto de dastos
fr: API de récupération de jeux de données
it: API Dataset Lookup

source: This API makes it possible to fetch an individual dataset information.
de: Diese API ermöglicht das Abrufen einer individuellen Datensatzinformation.
es: Esta API permite capturar la información de un conjunto de datos individual.
fr: Cette API permet de récupérer les informations d'un jeu de données spécifique.
it: Questa API permette di ottenere le informazioni di singoli dataset.

source: **API endpoint**: ``/api/datasets/1.0/<DATASETID>``
de: **API-Endpunkt**: ``/api/datasets/1.0/<DATASETID>``
es: **Extremo de API**: ``/api/datasets/1.0/<ID_CONJUNTO_DATOS>``
fr: **Point d'entrée de l'API** : ``/api/datasets/1.0/<DATASETID>``
it: **Endpoint API**: ``/api/datasets/1.0/<DATASETID>``

source: **Query**
de: **Anfrage**
es: **Consulta**
fr: **Requête**

source: Parameter Name
es: Nombre de parámetro
fr: Nom du paramètre
it: Nome parametro

source: Description
de: Beschreibung
es: Descripción
it: Descrizione

source: Part of the URL path. Identifier of the dataset. Example: ``http://<DOMAIN_ID>/api/dataset/1.0/arbresremarquablesparis2011?...``
de: Teil des URL-Pfads. Bezeichner des Datensatzes. Beispiel: ``http://<DOMAIN_ID>/api/dataset/1.0/arbresremarquablesparis2011?...``
es: Parte de la ruta de dirección URL. Identificador del conjunto de datos. Ejemplo: ``http://<ID_DOMINIO>/api/dataset/1.0/arbresremarquablesparis2011?...``
fr: Partie du chemin de l'URL. Identifiant du jeu de données. Exemple : ``http://<DOMAIN_ID>/api/dataset/1.0/arbresremarquablesparis2011?...``
it: Parte del percorso dell'URL. Identificatore del dataset. Esempio: ``http://<DOMAIN_ID>/api/dataset/1.0/arbresremarquablesparis2011?...``

source: If set to true (default is false), pretty prints JSON and JSONP outputs.
de: Falls auf wahr gesetzt (Standard ist falsch), druckt Pretty JSON- und JSONP-Ausgaben.
es: Si se establece en true (el valor predeterminado es false), las salidas JSON y JSONP se imprimen en un formato bonito.
fr: Si défini sur true (false par défaut), impression automatique des sorties JSON et JSONP.
it: Se impostato su true (l'impostazione predefinita è false), esegue il pretty print degli output JSON e JSONP.

source: Format of the response output. One of JSON (default) and JSONP.
de: Format der Antwortausgabe. Entweder JSON (Standard) oder JSONP.
es: Formato de la salida de respuesta. Valores posibles: JSON (valor predeterminado) y JSONP.
fr: Format de la sortie de la réponse. JSON (par défaut) ou JSONP.
it: Formato dell'output di risposta. Può essere JSON (predefinito) e JSONP.

source: JSONP callback. Example: ``format=jsonp&callback=myFunction``
de: JSONP-Rückruf. Beispiel: ``format=jsonp&callback=myFunction``
es: Devolución de llamada JSONP. Ejemplo: ``format=jsonp&callback=myFunction``
fr: Rappel JSONP. Exemple : ``format=jsonp&callback=myFunction``
it: Callback JSONP. Esempio: ``format=jsonp&callback=miaFunzione``

source: Dataset Search API
de: Datensatzsuch-API
es: API de búsqueda de conjuntos de datos
fr: API de recherche de jeux de données
it: API Dataset Search

source: This API provides a search facility in the dataset catalog. Full text search as well as multi-criteria field queries are made possible and results facetting is provided as well.
de: Diese API stellt eine Suchmöglichkeit im Datensatzkatalog bereit. Ermöglicht werden Volltextsuchen sowie Feldanfragen mit mehreren Kriterien. Zudem werden Facets für die Ergebnisse bereitgestellt.
es: Esta API suministra un recurso de búsqueda en el catálogo de conjuntos de datos. Se pueden llevar a cabo consultas de campos de criterios múltiples y búsquedas de texto completo, y también se proporcionan facetas de resultados.
fr: Cette API fournit une fonction de recherche parmi le catalogue des jeux de données. La recherche en texte intégral ainsi que les requêtes sur des champs multicritères sont possibles, le facettage des résultats est également fourni.
it: Questa API offre una funzionalità di ricerca nel catalogo dei dataset. È possibile eseguire ricerche full-text e query dei campi basate su più criteri, nonché ottenere i facet dei risultati.

source: **API endpoint**: ``/api/datasets/1.0/search``
de: **API-Endpunkt**: ``/api/datasets/1.0/search``
es: **Extremo de API**: ``/api/datasets/1.0/search``
fr: **Point d'entrée de l'API** : ``/api/datasets/1.0/search``
it: **Endpoint API**: ``/api/datasets/1.0/search``

source: The full-text query. This parameter can be left empty, in which case no full-text filtering on the result set occurs.
de: Die Volltextanfrage. Dieser Parameter kann leer bleiben, wodurch keine Volltextfilterung des Ergebnissatzes erfolgt.
es: Consulta de texto completo. Este parámetro se puede dejar vacío, y en ese caso no se aplicará el filtro de texto completo en el conjunto de resultados.
fr: La requête en texte intégral. Ce paramètre peut être laissé vide, auquel cas aucun filtrage en texte intégral des résultats n'est effectué.
it: Query full-text. Questo parametro può essere lasciato vuoto. In tal caso al set dei risultati non verrà applicato alcun filtro full-text.

source: Activates faceting on the specified field (see Appendices for the available list of facets on Datasets). This parameter can be used multiple times to simultaneously activate several facets. By default, faceting is disabled. Example: ``facet=modified``
de: Aktiviert die Anwendung von Facets auf das angegebene Feld (siehe Anhänge für die Liste der für Datensätze verfügbaren Facets). Dieser Parameter kann mehrfach verwendet werden, um gleichzeitig mehrere Facets zu aktivieren. Die Anwendung von Facets ist standardmäßig deaktiviert. Beispiel ``facet=modified``
es: Activa las facetas en el campo especificado (consulte en los Apéndices la lista de facetas en los conjuntos de datos). Este parámetro se puede emplear varias veces para activar simultáneamente distintas facetas. De forma predeterminada, las facetas están inactivas. Ejemplo: ``facet=modified``
fr: Active le facettage sur le champ spécifié (reportez-vous aux Annexes pour obtenir la liste complète des facettes sur les jeux de données). Ce paramètre peut être utilisé plusieurs fois afin d'activer simultanément plusieurs facettes. Par défaut, le facettage est désactivé. Exemple : ``facet=modified``
it: Attiva i facet sul campo specificato (per un elenco dei facet disponibili nei dataset, vedere le Appendici). Questo parametro può essere utilizzato più volte per attivare contemporaneamente vari facet. Per impostazione predefinita, i facet sono disabilitati. Esempio: ``facet=modified``.

source: ``refine.<FACET>``
es: ``refine.<FACETA>``

source: Facet based filtering. This parameter limits the result set to the results matching a facet value. It can be used several times for the same facet or for different facets. Examples: ``refine.modified=2012/02``, ``refine.modified=2012/02&refine.publisher=Paris``
de: Facet-basiertes Filtern. Dieser Parameter beschränkt den Ergebnissatz auf die Ergebnisse, die einem Facet-Wert entsprechen. Er kann mehrfach für das gleiche Facet oder für verschiedene Facets verwendet werden. Beispiele: ``refine.modified=2012/02``, ``refine.modified=2012/02&refine.publisher=Paris``
es: Filtros basados en facetas. Este parámetro limita el conjunto de resultados a los resultados coincidentes con el valor de una faceta. Se puede emplear varias veces para la misma faceta o distintas facetas. Ejemplos: ``refine.modified=2012/02``, ``refine.modified=2012/02&refine.publisher=Paris``
fr: Filtrage basé sur les facettes. Ce paramètre limite les résultats à ceux correspondant à la valeur d'une facette. Il peut être utilisé plusieurs fois pour la même facette ou pour différentes facettes. Exemples : ``refine.modified=2012/02``, ``refine.modified=2012/02&refine.publisher=Paris``
it: Filtro basato sui facet. Questo parametro limita il set ai risultati corrispondenti a un valore facet. Può essere utilizzato più volte per lo stesso facet o per più facet. Esempi: ``refine.modified=2012/02``, ``refine.modified=2012/02&refine.publisher=Paris``.

source: ``exclude.<FACET>``
es: ``exclude.<FACETA>``

source: Facet based filtering. This parameter excludes the results matching a facet's value from the result set. It can be used several times for the same facet or for different facets. Examples: ``exclude.modified=2012/02``, ``exclude.modified=2012/02&exclude.publisher=Paris``
de: Facet-basiertes Filtern. Dieser Parameter schließt die Ergebnisse vom Ergebnissatz aus, die einem Facet-Wert entsprechen. Er kann mehrfach für das gleiche Facet oder für verschiedene Facets verwendet werden. Beispiele: ``exclude.modified=2012/02``, ``exclude.modified=2012/02&exclude.publisher=Paris``
es: Filtros basados en facetas. Este parámetro excluye los resultados coincidentes con el valor de una faceta del conjunto de resultados. Se puede emplear varias veces para la misma faceta o distintas facetas. Ejemplos: ``exclude.modified=2012/02``, ``exclude.modified=2012/02&exclude.publisher=Paris``
fr: Filtrage basé sur les facettes. Ce paramètre exclut les résultats correspondant à la valeur d'une facette. Il peut être utilisé plusieurs fois pour la même facette ou pour différentes facettes. Exemples : ``exclude.modified=2012/02``, ``exclude.modified=2012/02&exclude.publisher=Paris``
it: Filtro basato sui facet. Questo parametro esclude dal set i risultati corrispondenti a un valore facet. Può essere utilizzato più volte per lo stesso facet o per più facet. Esempi: ``exclude.modified=2012/02``, ``exclude.modified=2012/02&exclude.publisher=Paris``.

source: Sorts results according to the specified field (the sortable fields for the dataset search API are: ``modified``, ``issued``, ``created`` and ``records_count``). By default, the sort is descending (from the highest value to the smallest value). A minus sign ('-') may be used to perform an ascending sort. Examples: ``sort=issued``, ``sort=-issued``
de: Sortiert Ergebnisse nach dem angegebenen Feld (die sortierbaren Felder für die Datensatzsuche-API sind: ``modified``, ``issued``, ``created`` und ``records_count``). Die Sortierung ist standardmäßig absteigend (vom höchsten zum niedrigsten Wert). Ein Minuszeichen ('-') kann verwendet werden, um eine aufsteigende Sortierung durchzuführen. Beispiele: ``sort=issued``, ``sort=-issued``
es: Ordena los resultados en función del campo especificado (los campos ordenables de la API de búsqueda de conjuntos de datos son: ``modified``, ``issued``, ``created`` y ``records_count``). De forma predeterminada, el orden es descendente (del valor superior al inferior). Se puede emplear el signo menos ('-') para que el orden sea ascendente. Ejemplos: ``sort=issued``, ``sort=-issued``
fr: Trie les résultats en fonction du champ spécifié (les champs utilisables pour le tri dans l'API de recherche de jeux de données sont : ``modified``, ``issued``, ``created`` et ``records_count``). Par défaut, le tri est réalisé en ordre décroissant (de la valeur la plus élevée à la valeur la plus basse). Le caractère moins ('-') peut être utilisé pour réaliser un tri en ordre croissant. Exemples : ``sort=issued``, ``sort=-issued``
it: Ordina i risultati in base al campo specificato. I campi ordinabili per l'API di ricerca del dataset sono: ``modified``, ``issued``, ``created`` e ``records_count``. Per impostazione predefinita, l'ordine è decrescente, cioè dal valore più alto al valore più basso. Aggiungendo un segno meno ('-') è possibile ottenere un ordine crescente. Esempi: ``sort=issued``, ``sort=-issued``.

source: Number of results to return in a single call. The maximum number of rows returned is 1000. By default, 10 results are returned.
de: Anzahl der in einem einzigen Aufruf zurückzugebenden Ergebnisse. Die maximale Anzahl zurückgegebener Zeilen beträgt 1000. Standardmäßig werden 10 Ergebnisse zurückgegeben.
es: Número de resultados que se devolverán en una única llamada. El número máximo de filas devueltas es 1000. De forma predeterminada, se devuelven 10 resultados.
fr: Nombre de résultats à renvoyer pour chaque appel. Le nombre maximum de lignes renvoyées est de 1 000. Par défaut, 10 résultats sont renvoyés.
it: Numero di risultati da restituire in una singola chiamata. Il numero massimo di righe restituito è 1.000. Per impostazione predefinita, vengono restituiti 10 risultati.

source: Index of the first result to return (starting at 0). To be used in conjunction with "rows" to implement paging.
de: Index des ersten zurückzugebenden Ergebnisses (Start bei 0). In Verbindung mit "rows" zur Paginierungsimplementierung zu verwenden.
es: Índice del primer resultado que se devolverá (empezando por 0). Para usar junto con "rows" a fin de implementar la paginación.
fr: Index du premier résultat à renvoyer (en commençant à 0). À utiliser avec le paramètre "rows" pour mettre en œuvre la pagination.
it: Indice del primo risultato da restituire, a partire da 0. Da utilizzare in combinazione con "rows" per il paging.

source: Format of the response output. One of JSON (default), JSONP, CSV and RSS.
de: Format der Antwortausgabe. Entweder JSON (Standard), JSONP, CSV oder RSS.
es: Formato de la salida de respuesta. Valores posibles: JSON (valor predeterminado), JSONP, CSV y RSS.
fr: Format de la sortie de la réponse. JSON (par défaut), JSONP, CSV ou RSS.
it: Formato dell'output di risposta. Può essere JSON (predefinito), JSONP, CSV e RSS.
