Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/query_language_and_geo_filtering.po
Languages: es, fr, nl

source: Query Language and Geo Filtering
es: Lenguaje de consulta y filtros geográficos
fr: Langage de requêtes et filtrage géographique
nl: Query Language en Geo Filtering

source: Filtering features are built in the core of OpenDataSoft API engine. Many of the previously listed APIs can take as a parameter filters for constraining the list of returned datasets or records.
es: Las funciones de filtro se compilan en el núcleo del motor de la API de OpenDataSoft. Muchas de las API indicadas anteriormente pueden tomar filtros como parámetro a fin de limitar la lista de los conjuntos de resultados o registros devueltos.
fr: Des fonctionnalités de filtrage sont intégrées au cœur du moteur de l'API OpenDataSoft. Un grand nombre des API précédemment répertoriées peuvent utiliser des filtres de paramètres pour restreindre la liste de jeux de données ou d'enregistrements renvoyés.
nl: Filterkenmerken zijn ingebouwd in de kern van de OpenDataSoft API-motor. Vele van de vorig opgesomde API's kunnen gebruikt worden als parameterfilters voor het beperken van de lijst met opgeleverde datasets of records.

source: Note that a given filtering context can simply be copied from one API to another. For example, you can easily build a user interface which first allows the user to visually select the records their are interested in, using full text search, facets and geo filtering, and then allowing them to download these records with the same filtering context.
es: Observe que se puede simplemente copiar un contexto de filtro de una API en otra. Por ejemplo, puede compilar fácilmente una interfaz de usuario que primero permita al usuario seleccionar visualmente los registros que le interesen, mediante la búsqueda de texto completo, las facetas y los filtros geográficos, y después le permita descargar esos registros con el mismo contexto de filtro.
fr: Notez qu'un contexte de filtrage donné peut être tout simplement copié d'une API à une autre. Vous pouvez par exemple facilement développer une interface utilisateur qui permet aux utilisateurs de commencer par sélectionner visuellement les enregistrements qui les intéressent, à l'aide de la recherche en texte intégral, des facettes et du filtrage géographique, avant de télécharger ces enregistrements avec le même contexte de filtrage.
nl: Gelieve te noteren dat een welbepaalde filteringcontext gewoon kan worden gekopieerd van de ene API naar de andere. Bijvoorbeeld: u kan heel eenvoudig een gebruikersinterface bouwen die de gebruiker eerst toelaat om visueel de records waarin ze geïnteresseerd zijn te selecteren, door gebruik te maken van een volledige tekstopzoeking, facetten en geo filtering en hen vervolgens toelaat om deze records met dezelfde filteringcontext te downloaden.

source: Query language
es: Lenguaje de consulta
fr: Langage de requêtes
nl: Taal van de zoekopdracht

source: The OpenDataSoft query language makes it possible to express complex boolean conditions as a filtering context.
es: El lenguaje de consulta de OpenDataSoft permite expresar condiciones booleanas complejas a modo de contexto de filtro.
fr: Le langage de requêtes OpenDataSoft permet d'exprimer des conditions booléennes complexes en tant que contexte de filtrage.
nl: De taal van de zoekopdracht in OpenDataSoft maakt het mogelijk om complexe booleaanse voorwaarden uit te drukken als een filteringcontext.

source: The user query can most of the time be expressed through the ``q`` HTTP parameter.
es: La consulta del usuario se puede expresar casi siempre a través del parámetro HTTP ``q``.
fr: La requête de l'utilisateur peut, dans la plupart des cas, être exprimée à l'aide du paramètre HTTP ``q``.
nl: De zoekopdracht van de gebruiker kan in de meeste gevallen uitgedrukt worden door middel van de "q" HTTP-parameter.

source: Full-text search
es: Búsqueda de texto completo
fr: Recherche en texte intégral
nl: Volledige tekstzoekopdracht

source: The query language accepts full text queries.
es: El lenguaje de consulta acepta consultas de texto completo.
fr: Le langage de requêtes accepte les requêtes en texte intégral.
nl: De taal van de zoekopdracht aanvaardt volledige tekstzoekopdrachten.

source: If a given word or compounds is surrounded with double quotes, only exact matches are returned (modulo an accent and case insensitive match).
es: Si una palabra o estructura determinada está delimitada por comillas dobles, solo se devuelven las coincidencias exactas (sin distinción de mayúsculas/minúsculas ni acentos).
fr: Si un mot ou une expression est entouré de guillemets, seules les correspondances exactes seront renvoyées (les correspondances renvoyées peuvent présenter des différences au niveau des caractères accentués et de la casse).
nl: Wanneer een welbepaald woord of samenstelling van woorden tussen dubbele aanhalingstekens staat, worden enkele exacte matches weergegeven (modulo een accent en hoofdletterongevoelige matches).

source: ``q=film`` returns results that contain film, films, filmography...
es: ``q=film`` devuelve los resultados que contienen film, films, filmography...
fr: ``q=film`` renvoie des résultats contenant la chaîne de caractères film, par exemple films, filmographie...
nl: ``q=film`` geeft resultaten die film, films, filmografie, ... bevatten

source: ``q="film"`` only returns the ones containing exactly film.
es: ``q="film"`` solo devuelve los que contienen exactamente film.
fr: ``q="film"`` renvoie uniquement des résultats contenant exactement la chaîne de caractères film.
nl: ``q="film"`` geeft enkel die resultaten die precies film bevatten.

source: Boolean expressions
es: Expresiones booleanas
fr: Expressions booléennes
nl: Booleaanse uitdrukkingen

source: The query language supports the following boolean operators ``AND``, ``OR`` and ``NOT``.
es: El lenguaje de consulta admite los operadores booleanos ``AND``, ``OR`` y ``NOT``.
fr: Le langage de requêtes prend en charge les opérateurs booléens suivants : ``AND``, ``OR`` et ``NOT``.
nl: De taal van de zoekopdracht ondersteunt de volgende booleaanse operatoren ``AND``, ``OR`` en ``NOT``.

source: Parenthesis can be used to group together expressions and alter the default priority model:
es: Se pueden usar paréntesis para agrupar expresiones y alterar el modelo de prioridad predeterminado:
fr: Des parenthèses peuvent être utilisées pour regrouper des expressions et modifier le modèle de priorité par défaut :
nl: Parentheses kunnen gebruikt worden om uitdrukkingen te bundelen en het standaard prioriteitsmodel te wijzigen:

source: Samples
es: Ejemplos
fr: Exemples
nl: Voorbeelden

source: ``film OR trees``
nl: ``film OR bomen``

source: ``(film OR trees) AND paris``
nl: ``(film OR bomen) AND parijs``

source: Field queries
es: Consultas de campos
fr: Requêtes sur des champs
nl: Zoekopdrachten voor velden

source: One of the major feature of the query language is to allow per field filtering. You can use field names as a prefix to your queries to filter the results based on a specific field's value.
es: Una de las funciones primordiales del lenguaje de consulta es permitir los filtros por campos. Puede usar los nombres de campo como prefijo de las consultas para filtrar los resultados en función del valor de un campo específico.
fr: L'une des fonctionnalités clés du langage de requêtes est qu'il permet le filtrage par champ. Vous pouvez utiliser les noms de champ comme préfixe dans vos requêtes pour filtrer les résultats en fonction de la valeur d'un champ spécifique.
nl: Een van de belangrijkste kenmerken van de taal van de zoekopdracht is een filtering per veld toe te laten. U kan veldnamen gebruiken als een prefix voor uw zoekopdrachten om de resultaten te filteren op basis van de waarde van een specifiek veld.

source: **For the dataset search API**, the list of available fields corresponds exactly to available metadata. By default:
es: **En el caso de la API de búsqueda de conjuntos de datos**, la lista de campos disponibles se corresponde exactamente con los metadatos disponibles. De forma predeterminada:
fr: **Pour l'API de recherche de jeux de données**, la liste de champs disponibles correspond exactement aux métadonnées disponibles. Par défaut :
nl: **Voor de zoek-API van de dataset**, stemt de lijst met beschikbare velden precies overeen met de beschikbare metadata. Standaard:

source: Field Name
es: Nombre de campo
fr: Nom du champ
nl: Veldnaam

source: Description
es: Descripción
nl: Omschrijving

source: publisher
nl: uitgever

source: The dataset publisher
es: Publicador del conjunto de datos
fr: Producteur du jeu de données
nl: De uitgever van de dataset

source: title
nl: titel

source: The dataset title
es: Título del conjunto de datos
fr: Titre du jeu de données
nl: De titel van de dataset

source: description
nl: omschrijving

source: The dataset description
es: Descripción del conjunto de datos
fr: Description du jeu de données
nl: De omschrijving van de dataset

source: license
nl: licentie

source: The dataset license
es: Licencia del conjunto de datos
fr: Licence du jeu de données
nl: De licentie van de dataset

source: The number of records in the dataset
es: Número de registros del conjunto de datos
fr: Nombre d'enregistrements dans le jeu de données
nl: Het aantal records in de dataset

source: modified
nl: gewijzigd

source: The last modification date of the dataset
es: Fecha de la última modificación del conjunto de datos
fr: Date de la dernière modification du jeu de données
nl: De datum van laatste wijziging van de dataset

source: language
nl: taal

source: The language of the dataset (iso code)
es: Idioma del conjunto de datos (código ISO)
fr: Langue du jeu de données (code ISO)
nl: De taal van de dataset (ISO-code)

source: theme
nl: thema

source: The theme of the dataset
es: Tema del conjunto de datos
fr: Thème du jeu de données
nl: Het thema van de dataset

source: references
nl: referenties

source: The references for the dataset
es: Referencias del conjunto de datos
fr: Références pour le jeu de données
nl: De referenties voor de dataset

source: The domain administrator might define a richer metadata template, thus giving acces to a richer set of filtering fields.
es: El administrador del dominio puede definir una plantilla de metadatos más rica y así dar acceso a un conjunto de campos de filtro más rico.
fr: L'administrateur du domaine a la possibilité de définir un modèle de métadonnées plus complet, ce qui vous permet d'accéder à davantage de champs pour le filtrage.
nl: De domeinbeheerder zou een rijkere metadata template kunnen definiëren waardoor toegang wordt verleend aan een rijkere reeks filteringvelden.

source: For example, one can search on public.opendatasoft.com datasets which have ``Paris`` in their title or description and which contain at least 50 000 records:
es: Por ejemplo, se puede llevar a cabo una búsqueda en los conjuntos de datos de public.opendatasoft.com que tengan ``Paris`` en el título o la descripción y que contengan como mínimo 50.000 registros:
fr: Par exemple, il est possible de rechercher les jeux de données sur public.opendatasoft.com dont le titre ou la description contient ``Paris`` et contenant au moins 50 000 enregistrements :
nl: Bijvoorbeeld: iemand kan op public.opendatasoft.com datasets zoeken die "Parijs" hebben staan in hun titel of omschrijving en die minstens 50.000 records bevatten:

source: For example this query: ``(title:paris OR decription:paris) AND records_count >= 50 000`` `returns this on the platform <http://public.opendatasoft.com/api/datasets/1.0/search?q=(title:paris%20OR%20decription:paris)%20AND%20records_count%20%3E%3D%2050000>`_
es: Por ejemplo, esta consulta: ``(title:paris OR decription:paris) AND records_count >= 50 000`` `devuelve esto en la plataforma. <http://public.opendatasoft.com/api/datasets/1.0/search?q=(title:paris%20OR%20decription:paris)%20AND%20records_count%20%3E%3D%2050000>`_
fr: Par exemple cette requête: ``(title:paris OR decription:paris) AND records_count >= 50 000`` `renvoie cela sur la plateforme <http://public.opendatasoft.com/api/datasets/1.0/search?q=(title:paris%20OR%20decription:paris)%20AND%20records_count%20%3E%3D%2050000>`_
nl: Bijvoorbeeld deze zoekopdracht: ``(title:paris OR decription:paris) AND records_count >= 50 000`` `levert dit op het platform op <http://public.opendatasoft.com/api/datasets/1.0/search?q=(title:paris%20OR%20decription:paris)%20AND%20records_count%20%3E%3D%2050000>`_

source: **For the record search APIs**, the list of available fields depend on the schema of the dataset. To fetch the list of available fields for a given dataset, you may use the search dataset or lookup dataset APIs.
es: **En el caso de las API de búsqueda de registros**, la lista de campos disponibles depende del esquema del conjunto de datos. Para capturar la lista de campos disponibles para un conjunto de datos determinado, puede usar las API de consulta o búsqueda de conjunto de datos.
fr: **Pour les API de recherche d'enregistrements**, la liste des champs disponibles dépend du schéma du jeu de données. Pour récupérer la liste des champs disponibles d'un jeu de données, vous pouvez utiliser les API de recherche de jeux de données ou de récupération de jeux de données.
nl: **Voor de zoek-API's voor het record**, hangt de lijst met beschikbare velden af van het schema van de dataset. Om de lijst met beschikbare velden voor een welbepaalde dataset terug te vinden, kan u de zoek-API's voor de dataset of opzoek-API's voor de dataset gebruiken.

source: Multiple operator fields can be used between the field name and the query:
es: Se pueden emplear varios campos de operadores entre el nombre de campo y la consulta:
fr: Plusieurs champs d'opérateurs peuvent être utilisés entre le nom de champ et la requête :
nl: Er kunnen meervoudige operatorvelden gebruikt worden tussen de veldnaam en de zoekopdracht:

source: ``:``, ``-``, ``==``: Return results whose field exactly matches the given value (granted the fields are of text or numeric type)
es: ``:``, ``=``, ``==``: Devuelven los resultados cuyo campo coincide exactamente con el valor especificado (siempre que el campo sea de tipo texto o numérico).
fr: ``:``, ``=``, ``==`` : renvoie des résultats dont le champ correspond exactement à la valeur donnée (sous réserve que les champs soient de type textuel ou numérique)
nl: ``:``, ``=``, ``==``: levert resultaten op waarvan de velden exact overeenstemmen met de opgegeven waarde (de velden zijn van een tekst- of numeriek type)

source: ``>``, ``<``, ``>=``, ``<=``: Return results whose field values are larger, smaller, larger or equal, smaller or equal to the given value (granted the field is of date or numeric type).
es: ``>``, ``<``, ``>=``, ``<=``: Devuelven los resultados cuyos valores de campo son superiores, inferiores, superiores o iguales, o inferiores o iguales que el valor especificado (siempre que los campos sean de tipo fecha o numérico).
fr: ``>``, ``<``, ``>=``, ``<=`` : renvoie des résultats dont les valeurs de champ sont supérieures, inférieures, supérieures ou égales, inférieures ou égales à la valeur donnée (sous réserve que le champ soit de type numérique ou un champ de date).
nl: ``>``, ``<``, ``>=``, ``<=``: Levert resultaten op waarvan de veldwaarden groter, kleiner, groter of gelijk, kleiner of gelijk zijn aan de opgegeven waarde (het veld is van het datum- of numeriek type).

source: ``[start_date TO end_date]``: Queries Records whose date is between ``start_date`` and ``end_date``.
es: ``[start_date TO end_date]``: Consulta los registros cuya fecha se encuentra entre ``start_date`` y ``end_date``.
fr: ``[start_date TO end_date]`` : effectue une requête sur les enregistrements dont la date est située entre les arguments ``start_date`` et ``end_date``.
nl: ``[start_date TO end_date]``: Zoekt naar records waarvan de datum tussen de ``start_date`` en ``end_date`` ligt.

source: Date formats can be specified in different formats: simple (``YYYY[[/mm]/dd]``) or ISO 8601 (``YYYY-mm-DDTHH:MM:SS``)
es: Las fechas se pueden especificar en diversos formatos: simple (``YYYY[[/mm]/dd]``) o ISO 8601 (``YYYY-mm-DDTHH:MM:SS``).
fr: Il est possible de spécifier différents formats de date : simple (``AAAA[[/mm]/jj]``) ou ISO 8601 (``AAAA-mm-JJTHH:MM:SS``)
nl: Datumformaten kunnen gespecificeerd worden in verschillende formaten: gewoon (``JJJJ[[/mm]/dd]``) of ISO 8601 (``JJJJ-mm-DDTUU:MM:SS``)

source: Examples:
es: Ejemplos:
fr: Exemples :
nl: Voorbeelden:

source: Query language functions
es: Funciones del lenguaje de consulta
fr: Fonctions du langage de requêtes
nl: Taalfuncties van de zoekopdracht

source: Advanced functions can be used in the query language. Function names need to be prefixed with a sharp (``#``) sign.
es: Se pueden usar funciones avanzadas en el lenguaje de consulta. Debe anteponerse como prefijo a los nombres de función un signo ``#``.
fr: Il est possible d'intégrer des fonctions avancées au langage de requêtes. Les noms des fonctions doivent être précédés d'un croisillon (``#``).
nl: Geavanceerde functies kunnen gebruikt worden in de taal van de zoekopdracht. Functienamen moeten het prefix van een scherp (``#``) teken krijgen.

source: Function name
es: Nombre de función
fr: Nom de la fonction
nl: Naam van de functie

source: Returns the current date. This function may be called as a query value for a field. When called without an argument, it will evaluate to the current datetime: ``birthdate >= #now()`` returns all Records containing a birth date greater or equal to the current datetime. This function can also accept parameters, see below for the ``#now`` function available parameters.
es: Devuelve la fecha actual. Se puede invocar esta función como un valor de consulta para un campo. Si se invoca sin argumentos, se evaluará como la fecha y hora actual: ``birthdate >= #now()`` devuelve todos los registros que contienen una fecha de nacimiento superior o igual a la fecha y hora actual. Esta función también puede aceptar parámetros; consulte más adelante los parámetros de la función ``#now`` disponibles.
fr: Renvoie la date actuelle. Cette fonction peut être appelée en tant que valeur de requête pour un champ. Lorsqu'elle est appelée sans argument, elle effectue une évaluation jusqu'à la date actuelle : ``birthdate >= #now()`` renvoie tous les enregistrements contenant une date de naissance supérieure ou égale à la date et à l'heure actuelles. Cette fonction peut également accepter des paramètres, reportez-vous aux paramètres disponibles pour la fonction ``#now`` ci-dessous.
nl: Geeft de huidige datum. Deze functie kan een opgeroepen als een zoekwaarde voor een veld. Wanneer ze wordt opgeroepen zonder een argument, zal ze de huidige datumtijd evalueren: "birthdate>=#now()" levert alle records op die een geboortedatum bevatten die groter is dan of gelijk is aan de huidige datumtijd. Deze functie kan ook parameters aanvaarden, zie hieronder voor de parameters die beschikbaar zijn voor de "#now"-functie.

source: This function may be called specifying a field name as a parameter. It returns the hits for which no value is defined for the specified field. For example ``#null(birthdate)``
es: Se puede invocar esta función especificando un nombre de campo como parámetro. Devuelve las coincidencias para las cuales no se ha definido ningún valor para el campo especificado. Por ejemplo ``#null(birthdate)``.
fr: Cette fonction peut être appelée en spécifiant un nom de champ en tant que paramètre. Elle renvoie les correspondances pour lesquelles aucune valeur n'est définie dans le champ spécifié. Par exemple ``#null(birthdate)``.
nl: Deze functie kan opgeroepen worden om een veldnaam te specificeren als een parameter. Ze geeft de hits waarvoor geen waarde is gedefinieerd voor het gespecificeerde veld. Bijvoorbeeld "#null(birthdate)"

source: This function makes it possible to search for records with a field exactly matching a given value. For example, ``#exact(firstname, "Marie")`` will return records with a field ``firstname`` containing exactly "Marie" and nothing else.
es: Esta función permite buscar registros con un campo que coincida exactamente con un valor determinado. Por ejemplo, ``#exact(firstname, "Marie")`` devuelve los registros cuyo campo ``firstname`` contiene exactamente "Marie" y nada más.
fr: Cette fonction permet de rechercher des enregistrements dont un champ correspond exactement à la valeur spécifiée. Par exemple ``#exact(firstname, "Marie")`` renvoie les enregistrements dont le champ ``firstname`` contient exactement "Marie" et rien d'autre.
nl: Deze functie maakt het mogelijk om te zoeken naar records met een veld dat exact overeenstemt met een welbepaalde waarde. Bijvoorbeeld: ``#exact(firstname, "Marie")`` zal records opleveren met een veld "firstname" dat exact "Marie" bevat en niets anders.

source: years, months, weeks, days, hours, minutes, seconds, microseconds: These parameters add time to the current date.
es: years, months, weeks, days, hours, minutes, seconds, microseconds: Estos parámetros añaden tiempo a la fecha actual.
fr: years, months, weeks, days, hours, minutes, seconds, microseconds : ces paramètres ajoutent ou soustraient du temps à la date actuelle.
nl: jaren, maanden, weken, dagen, uren, minuten, seconden, microseconden: Deze parameters voegen tijd toe aan de huidige datum.

source: For example: ``#now(years=-1, hours=-1)`` returns the current date minus a year and an hour
es: Por ejemplo: ``#now(years=-1, hours=-1)`` devuelve la fecha actual menos un año y una hora.
fr: Par exemple : ``#now(years=-1, hours=-1)`` renvoie la date actuelle moins une année et une heure
nl: Bijvoorbeeld: ``#now(years=-1, hours=-1)`` levert de huidige datum op min een jaar en een uur

source: year, month, day, hour, minute, second, microsecond: can also be used to specify an absolute date.
es: year, month, day, hour, minute, second, microsecond: También se pueden utilizar para especificar una fecha absoluta.
fr: year, month, day, hour, minute, second, microsecond : ces paramètres peuvent également être utilisés pour spécifier une date absolue.
nl: jaar, maand, dag, uur, minuut, seconde, microseconde: kan ook gebruikt worden om een absolute datum te specificeren.

source: For example: ``#now(year=2001)`` returns the current time, day and month for year 2001
es: Por ejemplo: ``#now(year=2001)`` devuelve la hora, el día y el mes actuales para el año 2001.
fr: Par exemple : ``#now(year=2001)`` renvoie l'heure, le jour et le mois actuels pour l'année 2001
nl: Bijvoorbeeld: ``#now(year=2001)`` levert de huidige tijd, dag en maand op voor het jaar 2001

source: weekday: Specifies a day of the week. This parameter accepts either an integer between 0 and 6 (where 0 is Monday and 6 is Sunday) or the first two letters of the day (in English) followed by the cardinal of the first week on which to start the query.
es: weekday: Especifica un día de la semana. Este parámetro acepta o bien un entero entre 0 y 6 (donde 0 es lunes y 6 es domingo), o bien las 2 primeras letras del día (en inglés) seguidas del cardinal de la primera semana en que se debe iniciar la consulta.
fr: weekday : spécifie un jour de la semaine. Ce paramètre accepte soit un entier entre 0 et 6 (0 étant lundi et 6 dimanche), soit les deux premières lettres du jour (en anglais) suivies du cardinal de la première semaine sur laquelle porte la requête.
nl: weekdag: specificeert een dag van de week. Deze parameter aanvaardt ofwel een geheel getal tussen 0 en 6 (waarbij 0 maandag is en 6 zondag) of de eerste twee letters van de dag (in het Engels) gevolgd door het kardinaalteken van de eerste week waarop de zoekopdracht moet worden gestart.
