Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/query_language_and_geo_filtering.po
Languages: es, fr, nl

source: ``#now(weeks=-2, weekday=1)`` returns the Tuesday before last.
es: ``#now(weeks=-2, weekday=1)`` devuelve el martes anterior al último.
fr: ``#now(weeks=-2, weekday=1)`` renvoie le mardi précédant le dernier.
nl: ``#now(weeks=-2, weekday=1)`` levert de donderdag vóór de laatste donderdag op.

source: ``#now(weekday=MO(2))`` returns Monday after next.
es: ``#now(weekday=MO(2))`` devuelve el lunes posterior al siguiente.
fr: ``#now(weekday=MO(2))`` renvoie le lundi suivant le prochain.
nl: ``#now(weekday=MO(2))`` levert de maandag volgend op de volgende maandag op.

source: Records search APIs accept geofilter parameters to filter in records which are located in a specific geographical area.
es: Las API de búsqueda de registros aceptan parámetros de filtros geográficos para filtrar los registros que se encuentran en un área geográfica determinada.
fr: Les API de recherche d'enregistrements acceptent des paramètres de filtrage géographique afin de filtrer les enregistrements correspondant à une zone géographique spécifique.
nl: Zoek-API's voor records aanvaarden geofilterparameters om te filteren in records die gelegen zijn in een specifiek geografisch gebied.

source: The following parameters may be used.
es: Se pueden emplear los parámetros siguientes.
fr: Les paramètres suivants peuvent être utilisés.
nl: De volgende parameters kunnen gebruikt worden.

source: Parameter Name
es: Nombre de parámetro
fr: Nom du paramètre
nl: Naam van de parameter

source: Limits the result set to a geographical area defined by a circle (coordinates of the center of the circle expressed in WGS84 and distance expressed in meters): latitude,longitude,distance: ``geofilter.distance=48.8520930694,2.34738897685,1000``
es: Limita el conjunto de resultados a un área geográfica definida por un círculo (coordenadas del centro del círculo expresadas en WGS84 y distancia expresada en metros): latitud,longitud,distancia: ``geofilter.distance=48.8520930694,2.34738897685,1000``
fr: Limite les résultats à une zone géographique délimitée par un cercle (les coordonnées du centre du cercle sont exprimées au format WGS84 et la distance en mètres) : latitude,longitude,distance: ``geofilter.distance=48.8520930694,2.34738897685,1000``
nl: Beperkt het resultaat tot een geografisch gebied dat gedefinieerd wordt door een cirkel (coördinaten van het midden van de cirkel uitgedrukt in WGS84 en afstand uitgedrukt in meter): latitude,longitude,distance: ``geofilter.distance=48.8520930694,2.34738897685,1000``

source: Limits the result set to a geographical area defined by a polygon (coordinates of the points expressed in WGS84 as in ((lat1,lon1),(lat2,lon2),(lat3,lon3)): ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
es: Limita el conjunto de resultados a un área geográfica definida por un polígono (coordenadas de los puntos expresadas en WGS84 como en ((lat1,lon1),(lat2,lon2),(lat3,lon3)): ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
fr: Limite les résultats à une zone géographique délimitée par un polygone (les coordonnées du polygone sont exprimées au format WGS84 sous la forme ((lat1,lon1),(lat2,lon2),(lat3,lon3)) : ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
nl: Beperkt de resultatenreeks tot een geografisch gebied dat gedefinieerd wordt door een veelhoek (coördinaten van de punten uitgedrukt in WGS84 zoals in ((lat1,lon1),(lat2,lon2),(lat3,lon3)): ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``

source: **Available parameters for the ``#now`` function**:Ò
es: **Parámetros disponibles para la función ``#now``**:
fr: **Paramètres disponibles pour la fonction ``#now``** :

source: Geo Filtering
es: Filtros geográficos
fr: Filtrage géographique
