Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/records_api.po
Languages: de, es, fr, it, nl

source: Dataset Records APIs
de: Datensatzeintrag-APIs
es: Interfaces API de registros de conjuntos de datos
fr: API des enregistrements des jeux de données
it: API per i record dei dataset

source: Records Analysis API
de: Eintragsanalyse-API
es: API de análisis de registros
fr: API d'analyse d'enregistrements
it: API per l'analisi dei record

source: This API provides powerfull analytics features over a set of selected records. It returns analyzed results in light and easy to parse format which can used as an input of modern charting libraries such as **Highchart.js** or **D3.js**.
de: Diese API bietet leistungsstarke Analyse-Funktionen für einen Satz ausgewählter Einträge. Sie wandelt analysierte Ergebnisse in ein leichtes, einfach zu parsendes Format um, das als Eingabe moderner Diagrammbibliotheken wie **Highchart.js** oder **D3.js** verwendet werden kann.
es: Esta API suministra funciones analíticas avanzadas para un conjunto de registros seleccionados. Devuelve los resultados analizados en un formato ligero y fácil de examinar que se puede usar como entrada de modernas bibliotecas de gráficos tales como **Highchart.js** o **D3.js**.
fr: Cette API permet de réaliser des analyses complexes sur une sélection d'enregistrements. Elle renvoie les résultats dans un format léger et facile à analyser, ces derniers peuvent ainsi être utilisés comme sources par des bibliothèques graphiques modernes, telles que **Highchart.js** ou **D3.js**.
it: Questa API offre potenti funzionalità di analisi su un set di record selezionati, restituendo i risultati ottenuti in un formato leggero e facile da analizzare, che può essere utilizzato come input delle moderne librerie di grafici come **Highchart.js** o **D3.js**.
nl: Deze API beschikt over krachtige analysefuncties voor een reeks van geselecteerde records. Hij geeft geanalyseerde resultaten in een licht en eenvoudig parse-formaat dat gebruikt kan worden als een input van moderne chart-technische bibliotheken, zoals **Highchart.js** of **D3.js**

source: **API endpoint**: ``/api/records/1.0/analyze``
de: **API Endpunkt**: ``/api/records/1.0/analyze``
es: **Extremo de API**: ``/api/records/1.0/analyze``
fr: **Point d'entrée de l'API** : ``/api/records/1.0/analyze``
it: **Endpoint API**: ``/api/records/1.0/analyze``
nl: **API eindpunt**: ``/api/records/1.0/analyze``

source: **Query**
de: **Anfrage**
es: **Consulta**
fr: **Requête**
nl: **Zoekopdracht**

source: Parameter Name
es: Nombre de parámetro
fr: Nom du paramètre
it: Nome parametro
nl: Naam van de parameter

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Identifier of the dataset. This field is mandatory.
de: Bezeichner des Datensatzes. Dies ist ein Pflichtfeld.
es: Identificador del conjunto de datos. Este campo es obligatorio.
fr: Identifiant du jeu de données. Ce champ est obligatoire.
it: Identificatore del dataset. Questo campo è obbligatorio.
nl: Identifier van de dataset. Dit veld dient verplicht te worden ingevuld.

source: The full-text query. This parameter can be left empty, in which case no full-text filtering on the result set occurs.
de: Die Volltextanfrage. Dieser Parameter kann leer bleiben, wodurch keine Volltextfilterung des Ergebnissatzes erfolgt.
es: Consulta de texto completo. Este parámetro se puede dejar vacío, y en ese caso no se aplicará el filtro de texto completo en el conjunto de resultados.
fr: La requête en texte intégral. Ce paramètre peut être laissé vide, auquel cas aucun filtrage en texte intégral des résultats n'est effectué.
it: Query full-text. Questo parametro può essere lasciato vuoto, in tal caso al set dei risultati non verrà applicato alcun filtro full-text.
nl: De zoekopdracht op basis van een volledige tekst. Deze parameter kan leeg worden gelaten. In dit geval vindt er geen filtering op basis van volledige tekst op het resultaat plaats.

source: Limits the result set to a geographical area defined by a circle (coordinates of the center of the circle expressed in WGS84 and distance expressed in meters): ``latitude,longitude,distance`` . Example: ``geofilter.distance=48.8520930694,2.34738897685,1000``
de: Begrenzt das Ergebnis auf ein bestimmtes geografisches Gebiet, das durch einen Kreis definiert ist (Koordinaten der Kreismitte in WGS84 angegeben, Entfernung in Metern): ``Breitengrad, Längengrad, Entfernung`` . Beispiel: ``geofilter.distance=48.8520930694,2.34738897685,1000``
es: Limita el conjunto de resultados a un área geográfica definida por un círculo (coordenadas del centro del círculo expresadas en WGS84 y distancia expresada en metros): ``latitud,longitud,distancia``. Ejemplo: ``geofilter.distance=48.8520930694,2.34738897685,1000``
fr: Limite les résultats à une zone géographique délimitée par un cercle (les coordonnées du centre du cercle sont exprimées au format WGS84 et la distance en mètres) : ``latitude,longitude,distance``. Exemple : ``geofilter.distance=48.8520930694,2.34738897685,1000``
it: Limita il set dei risultati a un'area geografica definita da un cerchio (coordinate del cerchio espresse in formato WGS84 e distanza espressa in metri): ``latitude,longitude,distance`` . Esempio: ``geofilter.distance=48.8520930694,2.34738897685,1000``
nl: Beperkt de resultatenreeks tot een geografisch gebied dat gedefinieerd wordt door een cirkel (coördinaten van het midden van de cirkel uitgedrukt in WGS84 en afstand uitgedrukt in meter): latitude,longitude,distance: ``geofilter.distance=48.8520930694,2.34738897685,1000``

source: Limits the result set to a geographical area defined by a polygon (coordinates of the points expressed in WGS84): ``(lat1,lon1),(lat2,lon2),(lat3,lon3)`` . Example: ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
de: Begrenzt das Ergebnis auf ein bestimmtes geografisches Gebiet, das durch ein Vieleck definiert ist (Koordinaten der Ecken in WGS84 angegeben): ``(lat1,lon1),(lat2,lon2),(lat3,lon3)`` . Beispiel: ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
es: Limita el conjunto de resultados a un área geográfica definida por un polígono (coordenadas de los puntos expresadas en WGS84): ``(lat1,lon1),(lat2,lon2),(lat3,lon3)`` . Ejemplo: ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
fr: Limite les résultats à une zone géographique délimitée par un polygone (les coordonnées du polygone sont exprimées au format WGS84) : ``(lat1,lon1),(lat2,lon2),(lat3,lon3)``. Exemple : ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
it: Limita il set di risultati a un'area geografica definita da un poligono (coordinate dei punti espresse in formato WGS84): ``(lat1,lon1),(lat2,lon2),(lat3,lon3)`` . Esempio: ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
nl: Beperkt de resultatenreeks tot een geografisch gebied dat gedefinieerd wordt door een veelhoek (coördinaten van de punten uitgedrukt in WGS84): ``(lat1,lon1),(lat2,lon2),(lat3,lon3)`` . Voorbeeld: ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``

source: ``refine.<FACET>``
es: ``refine.<FACETA>``

source: Facet based filtering. This parameter limits the result set to the results matching a facet value. It can be used several times for the same facet or for different facets. Examples: ``refine.city=Paris`` , ``refine.city=Paris&refine.year=2013``
de: Facet-basiertes Filtern. Dieser Parameter beschränkt den Ergebnissatz auf die Ergebnisse, die einem Facet-Wert entsprechen. Er kann mehrfach für das gleiche Facet oder für verschiedene Facets verwendet werden. Beispiele: ``refine.city=Paris`` , ``refine.city=Paris&refine.year=2013``
es: Filtros basados en facetas. Este parámetro limita el conjunto de resultados a los resultados coincidentes con el valor de una faceta. Se puede emplear varias veces para la misma faceta o distintas facetas. Ejemplos: ``refine.city=Paris`` , ``refine.city=Paris&refine.year=2013``
fr: Filtrage basé sur les facettes. Ce paramètre limite les résultats à ceux correspondant à la valeur d'une facette. Il peut être utilisé plusieurs fois pour la même facette ou pour différentes facettes. Exemples : ``refine.city=Paris``, ``refine.city=Paris&refine.year=2013``
it: Filtro basato su facet. Questo parametro limita il set ai risultati che corrispondono a un valore facet. Può essere utilizzato più volte per lo stesso facet o per più facet. Esempi: ``refine.city=Paris`` , ``refine.city=Paris&refine.year=2013``
nl: Filtering op basis van facetten. Deze parameter beperkt de resultatenreeks die overeenstemt met een facetwaarde. Deze kan verschillende keren worden gebruikt voor hetzelfde facet of voor verschillende facetten. Voorbeelden: ``refine.city=Paris`` , ``refine.city=Paris&refine.year=2013``

source: ``exclude.<FACET>``
es: ``exclude.<FACETA>``

source: Facet based filtering. This parameter excludes the results matching a facet's value from the result set. It can be used several times for the same facet or for different facets. Examples: ``exclude.city=Paris`` , ``exclude.city=Paris&exclude.year=2013``
de: Facet-basiertes Filtern. Dieser Parameter schließt die Ergebnisse vom Ergebnissatz aus, die einem Facet-Wert entsprechen. Er kann mehrfach für das gleiche Facet oder für verschiedene Facets verwendet werden. Beispiele: ``exclude.city=Paris`` , ``exclude.city=Paris&exclude.year=2013``
es: Filtros basados en facetas. Este parámetro excluye los resultados coincidentes con el valor de una faceta del conjunto de resultados. Se puede emplear varias veces para la misma faceta o distintas facetas. Ejemplos: ``exclude.city=Paris`` , ``exclude.city=Paris&exclude.year=2013``
fr: Filtrage basé sur les facettes. Ce paramètre exclut les résultats correspondant à la valeur d'une facette. Il peut être utilisé plusieurs fois pour la même facette ou pour différentes facettes. Exemples : ``exclude.city=Paris``, ``exclude.city=Paris&exclude.year=2013``
it: Filtro basato su facet. Questo parametro esclude dal set i risultati corrispondenti a un valore facet. Può essere utilizzato più volte lo stesso facet o per più facet. Esempi: ``exclude.city=Paris`` , ``exclude.city=Paris&exclude.year=2013``
nl: Filtering op basis van facetten. Deze parameter sluit de resultaten uit die overeenstemmen met de waarde van een facet uit de resultatenreeks. Deze kan verschillende keren worden gebruikt voor hetzelfde facet of voor verschillende facetten. Voorbeelden: ``exclude.city=Paris`` , ``exclude.city=Paris&exclude.year=2013``

source: Format of the response output. One of JSON (default), CSV and GeoJSONP.
de: Format der Antwortausgabe. Eines von JSON (Standard), CSV und GeoJSONP.
es: Formato de la salida de respuesta. Valores posibles: JSON (valor predeterminado), CSV y GeoJSONP.
fr: Format de la sortie de la réponse. JSON (par défaut) CSV ou GeoJSONP.
it: Formato dell'output di risposta. Può essere JSON (predefinito), CSV o GeoJSONP.
nl: Formaat van de responsoutput. Eén van JSON (standaard), CSV en GeoJSONP.

source: JSONP callback. Example: ``format=jsonp&callback=myFunction``
de: JSONP-Rückrüf. Beispiel: ``format=jsonp&callback=myFunction``
es: Devolución de llamada JSONP. Ejemplo: ``format=jsonp&callback=myFunction``
fr: Rappel JSONP. Exemple : ``format=jsonp&callback=myFunction``
it: Callback JSONP. Esempio: ``format=jsonp&callback=myFunction``
nl: JSONP callback. Voorbeeld: ``format=jsonp&callback=myFunction``

source: The name of the field on which the data aggregation will be based. This is a mandatory parameter. It allows for analyzing a subset of data according to the different values of the fields. The behavior may vary according to the field type. For **Date** and **DateTime** fields, the slices are built from the dates using the level of aggregation defined through the ``precision`` and ``periodic`` parameters. For other field types, the actual field values are used as x values.
de: Der Name des Feldes, auf dem die Datenaggregation beruht. Dies ist ein Pflichtparameter. Er ermöglicht die Analyse eines Datenuntersatzes gemäß den einzelnen Werten der Felder. Das Verhalten kann je nach Feldtyp unterschiedlich sein. Für **Date**- und **DateTime**-Felder werden die Sektoren mit den Daten erstellt. Dabei wird die anhand der Parameter "Präzision" und "periodisch" definierte Aggregationsebene angewendet.
es: Nombre del campo en que se basará la agregación de datos. Es un parámetro obligatorio. Permite analizar un subconjunto de datos en función de los distintos valores de los campos. El comportamiento puede variar según el tipo de campo. En el caso de los campos **Fecha** y **Fecha y hora**, los segmentos se crean a partir de las fechas con el nivel de agregación definido mediante los parámetros ``precision`` y ``periodic``. En los demás tipos de campo, se utilizan los valores de campo reales como valores de x.
fr: Nom du champ sur lequel l'agrégation des données sera basée. Ce paramètre est obligatoire. Il permet d'analyser un sous-ensemble de données en fonction des différentes valeurs des champs. Le comportement peut varier en fonction du type de champ. Pour les champs **Date** et **DateTime**, les tranches sont générées à partir des dates en utilisant le niveau d'agrégation défini dans les paramètres ``precision`` et ``periodic``. Pour les autres types de champs, les valeurs réelles des champs sont utilisées en tant que valeurs de x.
it: Nome del campo su cui sarà basata l'aggregazione dei dati. Questo parametro è obbligatorio. Permette di analizzare un subset di dati in base ai diversi valori dei campi. Il comportamento può variare a seconda del tipo di campo. Per i campi **Data** and **Data/ora**, le slice sono create a partire dalle date in base al livello di aggregazione definito mediante i parametri ``precision`` e ``periodic``. Per gli altri campi, i valori effettivi dei campi sono utilizzati come valori x.
nl: De naam van het veld waarop de aggregatie van data is gebaseerd. Dit is een verplichte parameter. Deze maakt het mogelijk om een subreeks van data te analyseren op basis van de verschillende waarden van de velden. Het gedrag kan verschillen afhankelijk van het type veld. Voor **Datum** en **DatumTijd** velden, worden de sneden opgebouwd vanuit de datums waarbij het aggregatieniveau wordt gebruikt dat gedefinieerd is via de parameters "precision" en "periodic". Voor andere veldtypes worden de effectieve veldwaarden gebruikt als x-waarden.

source: The definition of the analysis aggregation function. Multiple series can be computed at once, simply name this parameter with an arbitrary serie name that you may reuse for specifying the associated aggregated expression. The list of available aggregation functions is: ``COUNT`` , ``AVG`` , ``SUM`` , ``MIN`` , ``MAX`` , ``STDDEV`` , ``SUMSQUARES`` . These functions return the result of their execution on the expression provided in y.<SERIE>.expr (or simply the number of records for the ``COUNT`` function) for each value of x.
de: Die Definition der Analyseaggregationsfunktion. Es können mehrere Verbindungslinien auf einmal berechnet werden. Dazu brauchen Sie diesen Parameter einfach nur mit einem beliebigen Verbindungsliniennamen zu benennen, den Sie zur Angabe des dazugehörigen aggregierten Ausdrucks wiederverwenden können. Die Liste der Ihnen zur Verfügung stehenden Aggregationsfunktionen lautet: ``COUNT`` , ``AVG`` , ``SUM`` , ``MIN`` , ``MAX`` , ``STDDEV`` , ``SUMSQUARES`` . Diese Funktionen geben das Ergebnis ihrer Ausführung an den Ausdruck zurück, der in y.<SERIE>.expr (oder einfach die Anzahl der Einträge für die "COUNT`` Funktion) für jeden Wert für x geliefert wird.
es: Definición de la función de agregación de análisis. Se pueden calcular varias series a la vez; basta con que indique en este parámetro un nombre de serie arbitrario que se pueda reutilizar para especificar la expresión agregada asociada. La lista de las funciones de agregación disponibles es: ``COUNT`` , ``AVG`` , ``SUM`` , ``MIN`` , ``MAX`` , ``STDDEV`` , ``SUMSQUARES`` . Estas funciones devuelven el resultado de su ejecución en la expresión proporcionada en y.<SERIE>.expr (o simplemente el número de registros de la función ``COUNT``) para cada uno de los valores de x.
fr: Définition de la fonction d'agrégation d'analyse. Plusieurs séries peuvent être calculées simultanément, il suffit pour cela de nommer ce paramètre avec un nom de série arbitraire que vous pouvez réutiliser pour spécifier l'expression agrégée associée. La liste des fonctions d'agrégation disponibles est la suivante : ``COUNT``, ``AVG``, ``SUM``, ``MIN``, ``MAX``, ``STDDEV``, ``SUMSQUARES``. Ces fonctions renvoient le résultat de leur exécution sur l'expression fournie dans le paramètre ``y.<SERIE>.expr`` (ou simplement le nombre d'enregistrements pour la fonction ``COUNT``) pour chaque valeur de x.
it: Definizione della funzione di aggregazione dell'analisi. È possibile calcolare più serie contemporaneamente. È sufficiente attribuire a questo parametro il nome di una serie arbitraria che potrà essere riutilizzato per specificare l'espressione aggregata associata. L'elenco delle funzioni di aggregazione disponibili è il seguente: ``COUNT`` , ``AVG`` , ``SUM`` , ``MIN`` , ``MAX`` , ``STDDEV`` , ``SUMSQUARES`` . Queste funzioni restituiscono il risultato della loro esecuzione sull'espressione fornita in y.<SERIE>.expr (o semplicemente il numero di record della funzione ``COUNT``) per ogni valore di x.
nl: De definitie van de analyseaggregatiefunctie. Er kunnen in één keer meerdere reeksen worden berekend. Geef deze parameter gewoon een willekeurige serienaam die u kan hergebruiken voor het specificeren van de eraan verbonden geaggregeerde uitdrukking. De lijst van beschikbare aggregatiefuncties is: ``COUNT`` , ``AVG`` , ``SUM`` , ``MIN`` , ``MAX`` , ``STDDEV`` , ``SUMSQUARES`` . Deze functies geven het resultaat van de uitvoering ervan op de uitdrukking die aangeleverd wordt in y.<SERIE>.expr (of gewoon het aantal records voor de ``COUNT``-functie) voor elke waarde van x.

source: Defines the value to be aggregated. This parameter is mandatory for every aggregation function but the ``COUNT`` function. The <SERIES> parameter must have the same name as the one used for the required corresponding aggregation function. The parameter may contain the name of a numeric field in the Dataset (**Int** or **Double**), or a mathematical expression (see below to get more details on the expression language).
de: Definiert den zu aggregierenden Wert. Dies ist ein Pflichtparameter für jede Aggragationsfunktion, außer der ``COUNT`` Funktion. Der Parameter <VERBINDUNGSLINIEN> muss denselben Namen tragen wie derjenige, der für die erforderliche entsprechende Aggregationsfunktion verwendet wird. Der Parameter kann den Namen eines numerischen Felds im Datensatz tragen (**Int** oder **Doppelt**) bzw. einen mathematischen Ausdruck (weitere Einzelheiten zur Ausdruckssprache siehe unten).
es: Define el valor que se debe agregar. Este parámetro es obligatorio para todas las funciones de agregación excepto la función ``COUNT``. El parámetro <SERIE> debe tener el nombre utilizado para la función de agregación requerida correspondiente. El parámetro puede contener el nombre de un campo numérico del conjunto de datos (**Entero** o **Doble**) o una expresión matemática (vea a continuación para obtener más detalles acerca del lenguaje de las expresiones).
fr: Définit la valeur à agréger. Ce paramètre est obligatoire pour chaque fonction d'agrégation à l'exception de la fonction ``COUNT``. Le paramètre <SERIES> doit avoir le même nom que celui utilisé pour la fonction d'agrégation correspondante requise. Ce paramètre peut contenir le nom d'un champ numérique du jeu de données (**Int** ou **Double**), ou une expression mathématique (vous trouverez davantage de détails sur le langage d'expression ci-dessous).
it: Definisce il valore da aggregare. Questo parametro è obbligatorio per ogni funzione di aggregazione, esclusa la funzione ``COUNT``. Il parametro <SERIES> deve avere lo stesso nome di quello utilizzato per la funzione di aggregazione corrispondente richiesta. Il parametro può contenere il nome di un campo numerico del Dataset (**Int** o **Double**) o un'espressione matematica. Per ulteriori informazioni sul linguaggio dell'espressione, vedere più avanti.
nl: Definieert de waarde die moet worden geaggregeerd. Deze parameter is verplicht voor elke aggregatiefunctie, behalve voor de ``COUNT``-functie. De parameter <SERIES> moet dezelfde naam hebben als de parameter die gebruikt wordt voor de vereiste overeenstemmende aggregatiefunctie. De parameter mag de naam bevatten van een numeriek veld in de dataset (**Int** of **Dubbel**), of een wiskundige uitdrukking (zie hieronder voor meer details over de taal van de uitdrukking).

source: This parameter accepts values ``true`` and ``false`` (default). If the parameter is set to true, the results of a series are recursively summed up (``serie(x) = serie(x) + serie(x-1)`` ).
de: Dieser Parameter akzeptiert "Wahr"- und "Falsch"-Werte. Falls der Parameter nicht auf wahr eingerichtet ist, werden die Ergebnisse einer Verbindungslinie rekursiv zusammengefasst (``serie(x) = serie(x) + serie(x-1)`` ).
es: Este parámetro acepta los valores ``true`` y ``false`` (valor predeterminado). Si el parámetro se establece en true, los resultados de una serie se acumularán recursivamente con los valores anteriores (``serie(x) = serie(x) + serie(x-1)`` ).
fr: Ce paramètre accepte les valeurs ``true`` et ``false`` (par défaut). Si le paramètre est défini sur true, les résultats d'une série sont additionnés de manière récursive (``serie(x) = serie(x) + serie(x-1)``).
it: Questo parametro accetta i valori ``true`` e ``false`` (predefinito). Se è impostato su true, i risultati di una serie vengono sommati in modo ricorsivo (``serie(x) = serie(x) + serie(x-1)`` ).
nl: Deze parameter aanvaardt de waarden "waar" en "onwaar" (standaard). Wanneer deze parameter ingesteld staat op "waar", worden de resultaten van de reeksen recursief opgesomd (``serie(x) = serie(x) + serie(x-1)`` ).

source: Limits the maximum number of results returned in the serie. By default there is no limit.
de: Begrenzt die maximale Anzahl an Ergebnissen, die in die Verbindungslinie zurückgegeben werden. Standardmäßig ist keine Grenze eingestellt.
es: Limita el número máximo de resultados que se devolverán en la serie. De forma predeterminada, no hay ningún límite.
fr: Limite le nombre maximum de résultats renvoyés dans la série. Par défaut, aucune limite n'est définie.
it: Limita il numero massimo di risultati restituiti dalla serie. Per impostazione predefinita non è previsto alcun limite.
nl: Beperkt het maximaal aantal resultaten dat wordt gegeven in een reeks. Standaard is er geen limiet.
