Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/records_api.po
Languages: de, es, fr, it, nl

source: Used only in cases in which x is of type **Date** or **DateTime**. It defines the level at which aggregation is done. Possible values are ``year`` (default), ``month`` , ``week`` , ``weekday`` , ``day`` , ``hour`` , ``minute`` . This parameter will allow you, for instance, to compute aggregations on months across all years. For instance, with a value set to ``weekday`` , the output will be: ``[{"x": {"weekday":0},"series1": 12}, {"x": {"weekday":1},"series1": 30}]`` . When ``weekday`` is used, the generated value range from 0 to 6 where 0 corresponds to Monday and 6 to Sunday.
de: Wird nur in Fällen verwendet, bei denen x vom Typ **Date** oder **DateTime** ist. Definiert die Ebene, bei der eine Aggregation durchgeführt wird. Mögliche Werte sind "Jahr" (Standard), "Monat", "Woche", "Wochentag", "Tag", "Stunde", "Minute". Dieser Parameter ermöglicht Ihnen beispielsweise, Aggregationen für Monate über alle Jahre hinweg zu berechnen. Beispielsweise ist die Ausgabe bei einem auf "Wochentag" eingerichteten Wert folgende: ``[{"x": {"weekday":0},"series1": 12}, {"x": {"weekday":1},"series1": 30}]``. Wenn "Wochentag" verwendet wird, umfasst der generierte Wertebereich 0 bis 6, wobei 0 Montag entspricht und 6 Sonntag.
es: Solo se utiliza en los casos en que x es de tipo **Fecha** o **Fecha y hora**. Define el nivel en que se realiza la agregación. Los valores posibles son: ``year`` (valor predeterminado), ``month`` , ``week`` , ``weekday`` , ``day`` , ``hour`` y ``minute`` . Este parámetro le permitirá, por ejemplo, calcular agregaciones en meses a lo largo de todos los años. Por ejemplo, si es valor establecido es ``weekday`` , la salida será: ``[{"x": {"weekday":0},"series1": 12}, {"x": {"weekday":1},"series1": 30}]`` . Cuando se utiliza ``weekday`` , se genera un valor dentro del rango de 0 a 6, donde 0 es lunes y 6 es domingo.
fr: Utilisé uniquement dans les cas où le paramètre x est de type **Date** or **DateTime**. Il définit le niveau auquel est réalisée l'agrégation. Les valeurs possibles sont ``year`` (par défaut), ``month``, ``week``, ``weekday``, ``day``, ``hour``, ``minute``. Ce paramètre vous permet, par exemple, de calculer des agrégations sur les mois de toutes les années. Par exemple, avec une valeur définie sur ``weekday``, la sortie sera : ``[{"x": {"weekday":0},"series1": 12}, {"x": {"weekday":1},"series1": 30}]``. Lorsque ``weekday`` est utilisé, la valeur générée est comprise entre 0 et 6, 0 étant le lundi et 6 le dimanche.
it: Utilizzato solo nei casi in cui x è del tipo **Data** o **Data/ora**. Definisce il livello a cui deve essere eseguita l'aggregazione. I possibili valori sono ``year`` (predefinito), ``month`` , ``week`` , ``weekday`` , ``day`` , ``hour`` , ``minute`` . Questo parametro permette, ad esempio, di calcolare le aggregazioni sui mesi di tutti gli anni. Impostando il valore su ``weekday`` , l'output sarà: ``[{"x": {"weekday":0},"series1": 12}, {"x": {"weekday":1},"series1": 30}]`` . Quando si utilizza ``weekday``, il valore generato è compreso tra 0 e 6, dove 0 corrisponde a lunedì e 6 a domenica.
nl: Wordt enkel gebruikt in gevallen waarbij x van het type **Datum** of **DatumTijd** is. Deze definieert het niveau waarop aggregatie wordt gedaan. Mogelijke waarden zijn``jaar`` (standaard), ``maand`` , ``week`` , ``weekdag`` , ``dag`` , ``uur`` , ``minuut`` . Deze parameter laat u toe om bijvoorbeeld de aggregaties te berekenen voor maanden over alle jaren heen. Bijvoorbeeld, wanneer de waarde staat ingesteld op ``weekdag`` , zal de output de volgende zijn: ``[{"x": {"weekday":0},"series1": 12}, {"x": {"weekday":1},"series1": 30}]`` . Waneer ``weekdag`` wordt gebruikt, ligt het gegenereerde waardebereik tussen 0 en 6, waarbij 0 overeenstemt met maandag en 6 met zondag.

source: Used only in cases in which X is of type **Date** or **DateTime**. It defines the precision of the aggregation. Possible values are ``year`` , ``month`` , ``week`` , ``day`` (default), ``hour`` , ``minute`` . If ``weekday`` is provided as a ``periodic`` parameter, the ``precision`` parameter is ignored. This parameter shall respect the ``precision`` annotation of the field. If the field is annotated with a precision set to ``day`` , the serie precision can at maximum be set to ``day`` . For Example: ``x=event_date&periodic=year&precision=month&y.series1.func=COUNT`` will output ``[{"x": {"year": 2002, "month":1},"series1": 3}, {"x": {"year": 2002, "month":1},"series1": 5}]``
de: Wird nur in Fällen verwendet, in denen X vom Typ **Date** oder **DateTime** ist. Definiert die Präzision der Aggregation. Mögliche Werte sind "Jahr", "Monat", "Woche", "Tag" (Standard), "Stunde", "Minute". Falls "Wochentag" als ein "periodischer" Parameter angeboten wird, wird der Parameter "Präzision" ignoriert. Dieser Parameter muss die Anmerkung "Präzision" des Feldes berücksichtigen. Falls das Feld mit einer Anmerkung versehen ist, die auf "Tag" eingestellt ist, kann die Präzision der Verbindungslinie maximal auf "Tag" gestellt werden. Beispiel: ``x=event_date&periodic=year&precision=month&y.series1.func=COUNT`` ergibt ``[{"x": {"year": 2002, "month":1},"series1": 3}, {"x": {"year": 2002, "month":1},"series1": 5}]``
es: Solo se utiliza en los casos en que x es de tipo **Fecha** o **Fecha y hora**. Define la precisión de la agregación. Los valores posibles son: ``year`` , ``month`` , ``week`` , ``day`` (valor predeterminado), ``hour`` y ``minute`` . Si se suministra ``weekday`` como parámetro ``periodic`` , el parámetro ``precision`` se omite. Este parámetro respetará la anotación ``precision`` del campo. Si la anotación del campo establece la precisión ``day`` , la precisión de la serie se puede establecer como máximo en ``day`` . Por ejemplo: ``x=event_date&periodic=year&precision=month&y.series1.func=COUNT`` devolverá esta salida: ``[{"x": {"year": 2002, "month":1},"series1": 3}, {"x": {"year": 2002, "month":1},"series1": 5}]``
fr: Utilisé uniquement dans les cas où le paramètre x est de type **Date** ou **DateTime**. Il définit la précision de l'agrégation. Les valeurs possibles sont ``year``, ``month``, ``week``, ``day`` (par défaut), ``hour``, ``minute``. Si le paramètre ``periodic`` est défini sur ``weekday``, le paramètre ``precision`` est alors ignoré. Ce paramètre doit respecter l'annotation ``precision`` du champ. Si l'annotation ``precision`` du champ est définie sur ``day``, la précision de la série peut au maximum être définie sur ``day``. Exemple : ``x=event_date&periodic=year&precision=month&y.series1.func=COUNT`` renverra la sortie ``[{"x": {"year": 2002, "month":1},"series1": 3}, {"x": {"year": 2002, "month":1},"series1": 5}]``
it: Utilizzato solo nei casi in cui X è del tipo **Data** o **Data/ora**. Definisce la precisione dell'aggregazione. I possibili valori sono ``year`` , ``month`` , ``week`` , ``day`` (predefinito), ``hour`` , ``minute`` . Se ``weekday`` viene fornito come parametro di ``periodic``, il parametro ``precision`` viene ignorato. Questo parametro deve rispettare l'annotazione ``precision`` del campo. Se il campo è annotato con una precisione impostata su ``day``, la precisione della serie può essere impostata al massimo su ``day`` . Ad esempio: ``x=event_date&periodic=year&precision=month&y.series1.func=COUNT`` fornirà come output ``[{"x": {"year": 2002, "month":1},"series1": 3}, {"x": {"year": 2002, "month":1},"series1": 5}]``
nl: Wordt enkel gebruikt in gevallen waarbij x van het type **Datum** of **DatumTijd** is. Deze definieert de nauwkeurigheid van de aggregatie. Mogelijke waarden zijn``jaar`` , ``maand`` , ``week`` , ``dag`` (standaard), ``uur`` , ``minuut`` . Wanneer ``weekdag`` wordt opgegeven als een ``periodic`` parameter, wordt de parameter ``precision`` genegeerd. Deze parameter zal de notering ``precision`` van het veld in acht nemen. Wanneer het veld wordt genoteerd met een nauwkeurigheid die ingesteld staat op ``dag`` , kan de nauwkeurigheid van de serie maximaal ingesteld worden op ``dag`` . Bijvoorbeeld: ``x=event_date&periodic=year&precision=month&y.series1.func=COUNT`` geeft als output ``[{"x": {"year": 2002, "month":1},"series1": 3}, {"x": {"year": 2002, "month":1},"series1": 5}]``

source: sorts the aggregation values according to the specified series, or to the x parameter. By default, the values are sorted in descending order, according to the x parameter. A minus sign ('-') can however be prepended to the argument to make an ascending sort. Examples: ``x=city&y.series1.func=SUM&y.series1.expr=population&sort=-x`` , `` x=city&y.series1.func=SUM&y.series1.expr=population&sort=-series1``
de: Sortiert die Aggregationswerte nach den spezifizierten Verbindungslinien oder dem x-Parameter. Standardmäßig werden die Werte in absteigender Reihenfolge gemäß dem x-Parameter sortiert. Um eine aufsteigende Sortierung zu erzielen, kann dem Argument jedoch ein Minuszeichen ('-') vorangestellt werden.
es: Ordena los valores de la agregación en función de la serie especificada, o del parámetro x. De manera predeterminada, los valores se ordenan de forma descendente, en función del parámetro x. Sin embargo, se puede anteponer un signo menos ('-') al argumento para establecer el orden ascendente. Ejemplos: ``x=city&y.series1.func=SUM&y.series1.expr=population&sort=-x`` , ``x=city&y.series1.func=SUM&y.series1.expr=population&sort=-series1``
fr: Trie les valeurs de l'agrégation en fonction de la série spécifiée, ou du paramètre x. Par défaut, les valeurs sont triées en ordre décroissant, en fonction du paramètre x. Le caractère moins ('-') peut cependant être préfixé à l'argument pour effectuer un tri en ordre croissant. Exemples : ``x=city&y.series1.func=SUM&y.series1.expr=population&sort=-x``, ``x=city&y.series1.func=SUM&y.series1.expr=population&sort=-series1``
it: Ordina i valori di aggregazione in base alle serie specificate o al parametro x. Per impostazione predefinita, i valori vengono ordinati in ordine decrescente secondo il parametro x. È comunque possibile anteporre il segno meno ('-') all'argomento per ottenere un ordinamento crescente. Esempi: ``x=city&y.series1.func=SUM&y.series1.expr=population&sort=-x`` , `` x=city&y.series1.func=SUM&y.series1.expr=population&sort=-series1``
nl: sorteert de aggregatiewaarden volgens de gespecificeerde reeksen of volgens de x-parameter. Standaard worden de waarden gesorteerd in dalende volgorde, afhankelijk van de x-parameter. Er kan echter een minteken ("-") voor het argument worden geplaatst om een sortering in oplopende volgorde uit te voeren. Voorbeelden: ``x=city&y.series1.func=SUM&y.series1.expr=population&sort=-x`` , `` x=city&y.series1.func=SUM&y.series1.expr=population&sort=-series1``

source: **Expression language**
de: **Ausdruckssprache**
es: **Lenguaje de expresiones**
fr: **Langage d'expression**
it: **Linguaggio dell'espressione**
nl: **Taal van de uitdrukking**

source: An arbitrary expression can be used as the value of the definition of an aggregated.
de: Ein beliebiger Ausdruck kann als Wert der Definition eines aggregierten verwendet werden.
es: Se puede usar una expresión arbitraria como el valor de la definición de un agregado.
fr: Une expression arbitraire peut être utilisée en tant que valeur de la définition d'une agrégation.
it: È possibile utilizzare un'espressione arbitraria come valore della definizione di un aggregato.
nl: Er kan een willekeurige uitdrukking gebruikt worden als de waarde van de definitie van een geaggregeerde.

source: Classical numerical operators are available: ``+``, ``-``, ``*``, ``/``
de: Folgende klassische numerische Operatoren stehen zur Verfügung: ``+``, ``-``, ``*``, ``/``
es: Los operadores numéricos clásicos están disponibles: ``+``, ``-``, ``*``, ``/``
fr: Les opérateurs numériques classiques sont disponibles : ``+``, ``-``, ``*``, ``/``
it: Sono disponibili i normali operatori numerici: ``+``, ``-``, ``*``, ``/``.
nl: Klassieke numerieke operatoren zijn beschikbaar: ``+``, ``-``, ``*``, ``/``

source: Parenthesis can be used to group sub expressions together
de: Um Unterausdrücke zusammenzufassen, können Klammern gesetzt werden
es: Se pueden usar paréntesis para agrupar subexpresiones.
fr: Des parenthèses peuvent être utilisées pour regrouper des sous-expressions.
it: Le parentesi permettono di raggruppare le sotto-espressioni.
nl: Ronde haakjes kunnen gebruikt worden om subuitdrukkingen samen te groeperen

source: The following functions are also available: time, sin, cos, tan, asin, acos, atan, toRadians, toDegrees, exp, log, log10, sqrt, cbrt, IEEEremainder, ceil, floor, rint, atan2, pow, round, random, abs, max, min, ulp, signum, sinh, cosh, tanh, hypot
de: Folgende Funktionen stehen ebenfalls zur Verfügung: time, sin, cos, tan, asin, acos, atan, toRadians, toDegrees, exp, log, log10, sqrt, cbrt, IEEEremainder, ceil, floor, rint, atan2, pow, round, random, abs, max, min, ulp, signum, sinh, cosh, tanh, hypot
es: También están disponibles las funciones siguientes: time, sin, cos, tan, asin, acos, atan, toRadians, toDegrees, exp, log, log10, sqrt, cbrt, IEEEremainder, ceil, floor, rint, atan2, pow, round, random, abs, max, min, ulp, signum, sinh, cosh, tanh, hypot
fr: Les fonctions suivantes sont également disponibles : time, sin, cos, tan, asin, acos, atan, toRadians, toDegrees, exp, log, log10, sqrt, cbrt, IEEEremainder, ceil, floor, rint, atan2, pow, round, random, abs, max, min, ulp, signum, sinh, cosh, tanh, hypot
it: Sono disponibili inoltre le seguenti funzioni: time, sin, cos, tan, asin, acos, atan, toRadians, toDegrees, exp, log, log10, sqrt, cbrt, IEEEremainder, ceil, floor, rint, atan2, pow, round, random, abs, max, min, ulp, signum, sinh, cosh, tanh, hypot.
nl: De volgende functies zijn eveneens beschikbaar: time, sin, cos, tan, asin, acos, atan, toRadians, toDegrees, exp, log, log10, sqrt, cbrt, IEEEremainder, ceil, floor, rint, atan2, pow, round, random, abs, max, min, ulp, signum, sinh, cosh, tanh, hypot

source: Example: ``x=espece_arbre&y.series1.func=Min&y.series1.expr=sin(height)*2``
de: Beispiel: ``x=espece_arbre&y.series1.func=Min&y.series1.expr=sin(height)*2``
es: Ejemplo: ``x=espece_arbre&y.series1.func=Min&y.series1.expr=sin(height)*2``
fr: Exemple : ``x=espece_arbre&y.series1.func=Min&y.series1.expr=sin(height)*2``
it: Esempio: ``x=espece_arbre&y.series1.func=Min&y.series1.expr=sin(height)*2``
nl: Voorbeeld: ``x=espece_arbre&y.series1.func=Min&y.series1.expr=sin(height)*2``

source: Records Download API
de: Eintragsdownload-API
es: API de descarga de registros
fr: API de téléchargement d'enregistrements
it: API peri l download dei record

source: This API provides a performant way to download a large set of records out of one or serveral datasets at once. The HTTP answer is streamed which makes it possible to optimize the memory consumption client side.
de: Diese API stellt eine effiziente Möglichkeit dar, einen großen Satz an Einträgen aus einem oder mehreren Datensätzen herunterzuladen. Die HTTP-Antwort wird gestreamt, so dass der Speicherverbrauch auf der Kundenseite optimiert werden kann.
es: Esta API suministra una manera eficaz de descargar un amplio conjunto de registros de uno o varios conjuntos de datos a la vez. La respuesta HTTP se transmite por secuencias, lo que permite optimizar el consumo de memoria del cliente.
fr: Cette API permet de télécharger efficacement un grand nombre d'enregistrements depuis un ou plusieurs jeux de données simultanément. La réponse HTTP est diffusée, ce qui permet d'optimiser la consommation de mémoire côté client.
it: Questa API permette di scaricare in modo molto performante set di record di grandi dimensioni da uno o più dataset contemporaneamente. La risposta HTTP avviene in streaming e permette quindi di ottimizzare il consumo di memoria lato client.
nl: Deze API biedt een performante manier om een grote reeks records uit één of verschillende datasets in één keer te downloaden. Het HTTP-antwoord wordt gestreamd waardoor het mogelijk wordt gemaakt om het geheugenverbruik bij de klant te optimaliseren.

source: **API endpoint**: ``/api/records/1.0/download``
de: **API Endpunkt**: ``/api/records/1.0/download``
es: **Extremo de API**: ``/api/records/1.0/download``
fr: **Point d'entrée de l'API** : ``/api/records/1.0/download``
it: **Endpoint API**: ``/api/records/1.0/download``
nl: **API eindpunt**: ``/api/records/1.0/download``

source: Identifier of the dataset. Datasets that are hosted in the same domain may be queried simultaneously. Simply repeat the dataset parameter for each dataset you need to query. This field is mandatory.
de: Bezeichner des Datensatzes. Datensätze, die in derselben Domain gehostet werden, können gleichzeitig abgefragt werden. Dazu brauchen Sie nur den Datensatzparameter für jeden Datensatz, den Sie abfragen möchten, zu wiederholen. Dies ist ein Pflichtfeld.
es: Identificador del conjunto de datos. Los conjuntos de datos alojados en el mismo dominio se pueden consultar simultáneamente. Simplemente repita el parámetro de conjunto de datos para cada uno de los conjuntos de datos que necesite consultar. Este campo es obligatorio.
fr: Identifiant du jeu de données. Il est possible d'effectuer simultanément des requêtes sur les jeux de données hébergés sur un même domaine. Répétez simplement le paramètre du jeu de données pour chaque jeu de données sur lequel vous souhaitez effectuer des requêtes. Ce champ est obligatoire.
it: Identificatore del dataset. È possibile eseguire query contemporeaneamente sui dataset ospitati nello stesso dominio, ripetendo il parametro del dataset per ogni dataset da interrogare. Questo campo è obbligatorio.
nl: Identifier van de dataset. Op datasets die gehost worden in hetzelfde domein kunnen gelijktijdig zoekopdrachten worden uitgevoerd. Herhaal gewoon de datasetparameter voor elke dataset waarop u een zoekopdracht dient uit te voeren. Dit veld dient verplicht te worden ingevuld.

source: Activates faceting on the specified field (see Appendices for the available list of facets on Datasets). This parameter can be used multiple times to simultaneously activate several facets. By default, faceting is disabled. Example: ``facet=city``
de: Aktiviert die Anwendung von Facets auf das angegebene Feld (siehe Anhänge für die Liste der für Datensätze verfügbaren Facets). Dieser Parameter kann mehrfach verwendet werden, um gleichzeitig mehrere Facets zu aktivieren. Die Anwendung von Facets ist standardmäßig deaktiviert. Beispiel ``facet=city``
es: Activa las facetas en el campo especificado (consulte en los Apéndices la lista de facetas en los conjuntos de datos). Este parámetro se puede emplear varias veces para activar simultáneamente distintas facetas. De forma predeterminada, las facetas están inactivas. Ejemplo: ``facet=city``
fr: Active le facettage sur le champ spécifié (reportez-vous aux Annexes pour obtenir la liste complète des facettes sur les jeux de données). Ce paramètre peut être utilisé plusieurs fois afin d'activer simultanément plusieurs facettes. Par défaut, le facettage est désactivé. Exemple : ``facet=city``
it: Attiva i facet sul campo specificato. Per un elenco dei facet di dataset disponibili, vedere le Appendici. Questo parametro può essere utilizzato più volte per attivare contemporaneamente vari facet. Per impostazione predefinita, i facet sono disabilitati. Esempio: ``facet=city``.
nl: Activeert de facettering op het gespecificeerde veld (zie Bijlagen voor de beschikbare lijst van facetten voor datasets). Deze parameter kan meerdere keren worden gebruikt om gelijktijdig verschillende facetten te activeren. Standaard is facettering gedeactiveerd. Voorbeeld: ``facet=city``

source: If set to true (default is false), pretty prints JSON and JSONP outputs.
de: Falls auf wahr gesetzt (Standard ist falsch), druckt Pretty-Print JSON- und JSONP-Ausgaben.
es: Si se establece en true (el valor predeterminado es false), las salidas JSON y JSONP se imprimen en un formato bonito.
fr: Si défini sur true (false par défaut), impression automatique des sorties JSON et JSONP.
it: Se impostato su true (l'impostazione predefinita è false), esegue il pretty print degli output JSON e JSONP.
nl: Indien ingesteld op waar (standaard is onwaar), pretty prints JSON en JSONP outputs.

source: Restricts fields to retrieve. This parameter accepts multiple field names separated by commas. Example: ``fields=field1,field2,field3``
de: Begrenzt die abzurufenden Felder. Dieser Parameter akzeptiert mehrere, durch Kommata getrennte Feldnamen. Beispiel: ``fields=field1,field2,field3``
es: Restringe los campos que se deben recuperar. Este parámetro acepta multiple nombres de campo separados por comas. Ejemplo: ``fields=field1,field2,field3``
fr: Limite les champs à récupérer. Ce paramètre peut accepter plusieurs noms de champs séparés par des virgules. Exemple : ``fields=field1,field2,field3``
it: Limita i campi da richiamare. Questo parametro accetta più nomi di campi separati da virgole. Esempio: ``fields=field1,field2,field3``
nl: Beperkt de velden die moeten worden opgehaald. Deze parameter aanvaardt meerdere veldnamen gescheiden door komma's. Voorbeeld: ``fields=field1,field2,field3``

source: Format of the response output. One of CSV, JSON (default), JSONP, GeoJSON and GeoJSONP.
de: Format der Antwortausgabe. Eines von CSV, JSON (Standard), JSONP, GeoJSON und GeoJSONP.
es: Formato de la salida de respuesta. Valores posibles: CSV, JSON (valor predeterminado), JSONP, GeoJSON y GeoJSONP.
fr: Format de la sortie de la réponse. CSV, JSON (par défaut), JSONP, GeoJSON ou GeoJSONP.
it: Formato dell'output di risposta. Può essere CSV, JSON (predefinito), JSONP, GeoJSON o GeoJSONP.
nl: Formaat van de responsoutput. Eén van CSV, JSON (standaard), JSONP, GeoJSON en GeoJSONP.

source: JSONP or GeoJSONP callback. Example: ``format=jsonp&callback=myFunction``
de: JSONP-Rückrüf. Beispiel: ``format=jsonp&callback=myFunction``
es: Devolución de llamada JSONP o GeoJSONP. Ejemplo: ``format=jsonp&callback=myFunction``
fr: Rappel JSONP ou GeoJSONP. Exemple : ``format=jsonp&callback=myFunction``
it: Callback JSONP o GeoJSONP. Esempio: ``format=jsonp&callback=myFunction``
nl: JSONP of GeoJSONP callback. Voorbeeld: ``format=jsonp&callback=myFunction``

source: Records Geo Clustering API
es: API de clúster geográfico de registros
fr: API de clusters géographiques des enregistrements
it: API di geo-clustering dei record
