Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/records_api.po
Languages: de, es, fr, it, nl

source: This API provides powerfull geo clustering features over a set of selected records. It returns results under a format which can easily be used to build comprehensive data visualizations on a map, using a very large number of records.
de: Diese API bietet leistungsstarke Geo-Clustering-Funktionen für einen Satz ausgewählter Einträge. Sie wandelt Ergebnisse in ein Format um, das einfach zum Erstellen verständlicher Datenvisualisierungen auf einer Karte verwendet werden kann und viele Einträge dafür nutzt.
es: Esta API suministra funciones de clúster geográfico avanzadas para un conjunto de registros seleccionados. Devuelve los resultados en un formato fácil de usar para crear completas visualizaciones de datos en un mapa, utilizando un número muy amplio de registros.
fr: Cette API offre de puissantes fonctionnalités de clusters géographiques utilisables sur une sélection d'enregistrements. Elle renvoie des résultats dans un format pouvant être facilement utilisé pour élaborer des visualisations de données complexes sur une carte, en utilisant un très grand nombre d'enregistrements.
it: Questa API offre potenti funzionalità di geoclustering su un set di record selezionati. Restituisce i risultati in un formato facilmente utilizzabile per creare ampie visualizzazioni di dati su una mappa, utilizzando un numero molto elevato di record.
nl: Deze API verschaft krachtige geo clustering-functies over een reeks van geselecteerde records. Hij geeft resultaten onder een formaat dat gemakkelijk kan gebruikt worden om volledige dataweergaves op een kaart op te bouwen door gebruik te maken van een zeer groot aantal records.

source: This API takes as an input the cluster precision and a polygon representing the current view (on a map) and returns a list of clusters with the number of points contained in each cluster and the polygon of the cluster envelope (along with computed analytical series when required).
de: Diese API verwendet die Cluster-Präzision und ein Vieleck als Eingabe, das die aktuelle Ansicht (auf einer Karte) darstellt. Sie gibt eine Clusterliste zurück mit der Anzahl der Punkte, die in jedem Cluster enthalten sind, und dem Vieleck der Cluster-Hüllkurve (mit Berechnungen der analytischen Verbindungslinien falls erforderlich).
es: Esta API toma como entrada la precisión del clúster y un polígono que representa la vista actual (en un mapa), y devuelve una lista de clústeres con el número de puntos contenidos en cada uno de los clústeres y el polígono del contenedor de clúster (junto con las series analíticas calculadas si se requiere).
fr: Cette API utilise comme entrée la précision des clusters et un polygone représentant la vue actuelle (sur une carte), et renvoie une liste de clusters, ainsi que le nombre de points contenus dans chaque cluster, et le polygone de l'enveloppe du cluster (ainsi que les séries analytiques calculées lorsque cela se révèle nécessaire).
it: Questa API utilizza come input la precisione del cluster e un poligono che rappresenta la visualizzazione corrente sulla mappa. Restituisce un elenco di cluster con il numero di punti contenuti in ognuno e il poligono dell'envelope del cluster, oltre, quando necessario, alle serie analitiche calcolate.
nl: Deze API neemt als input de clusternauwkeurigheid en een veelhoek die de huidige weergave vertegenwoordigt (op een kaart) en geeft een lijst met clusters met het aantal punten dat in elke cluster zit en de veelhoek van de clusteromslag (samen met berekende analytische reeksen indien vereist).

source: The clustering results are returned in JSON.
de: Die Clustering-Ergebnisse werden in JSON zurückgegeben.
es: Los resultados de clúster se devuelven en JSON.
fr: Les résultats du regroupement en cluster sont renvoyés au format JSON.
it: I risultati del clustering sono restituiti in JSON.
nl: De clusteringresultaten worden gegeven in JSON.

source: **API endpoint**: ``/api/records/1.0/geocluster``
de: **API Endpunkt**: ``/api/records/1.0/geocluster``
es: **Extremo de API**: ``/api/records/1.0/geocluster``
fr: **Point d'entrée de l'API** : ``/api/records/1.0/geocluster``
it: **Endpoint API**: ``/api/records/1.0/geocluster``
nl: **API eindpunt**: ``/api/records/1.0/geocluster``

source: The desired precision level, depending on the current map zoom level (if used through Leaflet, the Leaflet zoom level can be used). This parameter is mandatory.
de: Der gewünschte Genauigkeitsgrad, abhängig vom aktuellen Karten-Zoomfaktor (falls mit Leaflet verwendet, kann der Leaflet-Zoomfaktor verwendet werden). Dies ist ein Pflichtparameter.
es: El nivel de precisión deseado, en función del nivel de zoom de mapa actual (si se usa a través de Leaflet, se puede emplear el nivel de zoom de Leaflet). Este parámetro es obligatorio.
fr: Niveau de précision souhaité, en fonction de l'échelle actuelle de la carte (en cas d'utilisation avec Leaflet, l'échelle de Leaflet peut être utilisée). Ce paramètre est obligatoire.
it: Livello di precisione desiderato, a seconda del livello di zoom corrente della mappa. Se utilizzato tramite Leaflet, è possibile utilizzare il livello di zoom di Leaflet. Questo parametro è obbligatorio.
nl: Het gewenste nauwkeurigheidsniveau, afhankelijk van het huidige zoomniveau van de kaart (indien gebruikt via Leaflet, kan het Leaflet zoomniveau worden gebruikt). Deze parameter dient verplicht te worden ingevuld.

source: Defines the precision of the returned cluster envelope. The sum of clusterprecision and shapeprecision may not exceed 29.
de: Definiert die Genauigkeit der zurückgegebenen Cluster-Hüllkurve. Die Summe von clusterprecision und shapeprecision darf 29 nicht überschreiten.
es: Define la precisión del contenedor de clúster devuelto. La suma de clusterprecision y shapeprecision no puede ser superior a 29.
fr: Définit la précision de l'enveloppe du cluster renvoyé. La somme des paramètres ``clusterprecision`` et ``shapeprecision`` ne doit pas dépasser 29.
it: Definisce la precisione dell'envelope del cluster restituito. La somma di clusterprecision e shapeprecision non può superare 29.
nl: Definieert de nauwkeurigheid van de gegeven clusteromslag. De som van clusterprecision en shapeprecision mag niet meer bedragen dan 29.

source: Defines the desired clustering mode. Supported values are ``polygon`` (default) and ``heatmap``.
de: Definiert den gewünschten Clustering-Modus. Folgende Werte werden unterstützt: ``polygon`` (Standard) und ``heatmap``.
es: Define el modo de clúster deseado. Los valores permitidos son ``polygon`` (valor predeterminado) y ``heatmap``.
fr: Définit le mode de regroupement en cluster souhaité. Les valeurs prises en charge sont ``polygon`` (par défaut) et ``heatmap``.
it: Definisce la modalità di clustering desiderata. I valori supportati sono ``polygon`` (predefinito) e ``heatmap``.
nl: Definieert de gewenste clusteringmodus. Ondersteunde waarden zijn ``polygon`` (standaard) en ``heatmap``.

source: This API may also accept a serie definition as described in the records analysis API. If a serie is defined, the aggregation will be performed using the values of the serie. For example: ``clusterprecision=6&y.serie1.expr=height&y.series1.func=SUM``
de: Diese API kann auch eine Verbindungsliniendefinition akzeptieren, wie in der Eintragsanalyse-API beschrieben. Wenn eine Verbindungslinie definiert ist, wird die Aggregation unter Verwendung der Werte der Verbindungslinie durchgeführt. Beispiel: ``clusterprecision=6&y.serie1.expr=height&y.series1.func=SUM``
es: Esta API también puede aceptar una definición de serie según se describe en la API de análisis de registros. Si se define una serie, la agregación se realizará con los valores de la serie. Por ejemplo: ``clusterprecision=6&y.serie1.expr=height&y.series1.func=SUM``
fr: Cette API peut également accepter une définition de série, telle que décrite dans l'API d'analyse d'enregistrements. Si une série est définie, l'agrégation sera réalisée en utilisant les valeurs de la série. Par exemple : ``clusterprecision=6&y.serie1.expr=height&y.series1.func=SUM``
it: Questa API può inoltre accettare una definizione della serie come descritto per l'API di analisi dei record. Se si definisce una serie, l'aggregazione avverrà in base ai valori di quest'ultima. Ad esempio: ``clusterprecision=6&y.serie1.expr=height&y.series1.func=SUM``
nl: Deze API kan ook de definitie van een reeks aanvaarden zoals die beschreven staat in de Records Analysis API. Indien een reeks is gedefinieerd, zal de aggregatie worden uitgevoerd door gebruik te maken van de waarden van de reeks. Bijvoorbeeld: ``clusterprecision=6&y.serie1.expr=height&y.series1.func=SUM``

source: Record Lookup API
de: Eintragsaufruf-API
es: API de consulta de registro
fr: API de récupération d'enregistrements
it: API di ricerca di singoli record

source: This API makes it possible to fetch an individual record using its identifier (Record ID).
de: Diese API ermöglicht den Aufruf eines einzelnen Eintrags unter Verwendung seines Bezeichners (Eintrags-ID).
es: Esta API permite capturar un registro individual con su identificador (ID de registro).
fr: Cette API permet de récupérer un enregistrement spécifique à l'aide de son identifiant (ID d'enregistrement).
it: Questa API permette di recuperare un singolo record in base al relativo identificatore (Record ID).
nl: Deze API maakt het mogelijk om een individueel record op te halen met behulp van de identifier ervan (Record ID).

source: **API endpoint**: ``/api/datasets/1.0/<DATASETID>/records/<RECORDID>``
es: **Extremo de API**: ``/api/datasets/1.0/<ID_CONJUNTO_DATOS>/records/<ID_REGISTRO>``
fr: **Point d'entrée de l'API** : ``/api/datasets/1.0/<DATASETID>/records/<RECORDID>``
it: **Endpoint API**: ``/api/datasets/1.0/<DATASETID>/records/<RECORDID>``
nl: **API eindpunt**: ``/api/datasets/1.0/<DATASETID>/records/<RECORDID>``

source: Part of the URL path. Identifier of the dataset. Example: ``http://opendata.paris.fr/api/dataset/1.0/arbresremarquablesparis2011/``
de: Teil des URL-Pfads. Bezeichner des Datensatzes. Beispiel: ``http://opendata.paris.fr/api/dataset/1.0/arbresremarquablesparis2011/``
es: Parte de la ruta de dirección URL. Identificador del conjunto de datos. Ejemplo: ``http://opendata.paris.fr/api/dataset/1.0/arbresremarquablesparis2011/``
fr: Partie du chemin de l'URL. Identifiant du jeu de données. Exemple : ``http://opendata.paris.fr/api/dataset/1.0/arbresremarquablesparis2011/``
it: Parte del percorso dell'URL. Identificatore del dataset. Esempio: ``http://opendata.paris.fr/api/dataset/1.0/arbresremarquablesparis2011/``
nl: Deel van het URL-pad. Identifier van de dataset. Voorbeeld: ``http://opendata.paris.fr/api/dataset/1.0/arbresremarquablesparis2011/``

source: Part of the URL path. Identifier of the record. Example: ``http://opendata.paris.fr/api/dataset/1.0/<DATASETID>/records/758885b5183fd28f14ecf39e44484fdccf/``
de: Teil des URL-Pfads. Bezeichner des Eintrags. Beispiel: ``http://opendata.paris.fr/api/dataset/1.0/<DATASETID>/records/758885b5183fd28f14ecf39e44484fdccf/``
es: Parte de la ruta de dirección URL. Identificador del registro. Ejemplo: ``http://opendata.paris.fr/api/dataset/1.0/<ID_CONJUNTO_DATOS>/records/758885b5183fd28f14ecf39e44484fdccf/``
fr: Partie du chemin de l'URL. Identifiant de l'enregistrement. Exemple : ``http://opendata.paris.fr/api/dataset/1.0/<DATASETID>/records/758885b5183fd28f14ecf39e44484fdccf/``
it: Parte del percorso dell'URL. Identificatore del record. Esempio: ``http://opendata.paris.fr/api/dataset/1.0/<DATASETID>/records/758885b5183fd28f14ecf39e44484fdccf/``
nl: Deel van het URL-pad. Identifier van het record. Voorbeeld: ``http://opendata.paris.fr/api/dataset/1.0/<DATASETID>/records/758885b5183fd28f14ecf39e44484fdccf/``

source: Format of the response output. One of JSON (default) and JSONP.
de: Format der Antwortausgabe. Eins von JSON (Standard) und JSONP.
es: Formato de la salida de respuesta. Valores posibles: JSON (valor predeterminado) y JSONP.
fr: Format de la sortie de la réponse. JSON (par défaut) ou JSONP.
it: Formato dell'output di risposta. Può essere JSON (predefinito) e JSONP.
nl: Formaat van de responsoutput. Eén van JSON (standaard) en JSONP.

source: Record Search API
de: Eintragsuch-API
es: API de búsqueda de registros
fr: API de recherche d'enregistrements
it: API di ricerca dei record

source: This API makes it possible to perform complex queries on the records of a dataset, such as full-text search or geo search. It also provides faceted search features on dataset records.
de: Diese API ermöglicht die Durchführung komplexer Suchaufträge in den Einträgen eines Datensatzes, wie etwa eine Volltextsuche oder Geo-Suche. Sie bietet weiterhin Facet-Such-Funktionen für Datensatz-Einträge.
es: Esta API permite llevar a cabo consultas complejas en los registros de un conjunto de datos, como una búsqueda de texto completo o una búsqueda geográfica. También proporciona funciones de búsqueda de facetas en registros de conjuntos de datos.
fr: Cette API permet d'effectuer des requêtes complexes sur les enregistrements d'un jeu de données, telles qu'une recherche en texte intégral ou une recherche géographique. Elle permet également d'effectuer des recherches par facettes sur des enregistrements de jeux de données.
it: Questa API permette di eseguire query complesse sui record di un dataset, ad esempio ricerche full-text o ricerche geografiche. Offre inoltre funzionalità di ricerca facet sui record del dataset.
nl: Deze API maakt het mogelijk om complexe zoekopdrachten uit te voeren op de records van een dataset, zoals een volledige tekstzoekopdracht of een geografische opzoeking. Hij voorziet ook gefacetteerde zoekfuncties voor datasetrecords.

source: **API endpoint**: ``/api/records/1.0/search``
de: **API Endpunkt**: ``/api/records/1.0/search``
es: **Extremo de API**: ``/api/records/1.0/search``
fr: **Point d'entrée de l'API** : ``/api/records/1.0/search``
it: **Endpoint API**: ``/api/records/1.0/search``
nl: **API eindpunt**: ``/api/records/1.0/search``

source: Sorts results according to the specified field. By default, the sort is descending (from the highest value to the smallest value). A minus sign ('-') may be used to perform an ascending sort. Sorting is only available on numeric fields (int, double, date and datetime) and on text fields which have the ``sortable`` annotation. Examples: ``sort=price`` , ``sort=-width``
de: Sortiert Ergebnisse nach dem angegebenen Feld. Die Sortierung ist standardmäßig absteigend (vom höchsten zum niedrigsten Wert). Ein Minuszeichen ('-') kann verwendet werden, um eine aufsteigende Sortierung durchzuführen. Die Sortierung steht nur für numerische Felder (int, double, date und datetime) oder für Textfelder zur Verfügung, die die Anmerkung "sortierbar" haben. Beispiele: ``sort=price`` , ``sort=-width``
es: Ordena los resultados en función del campo especificado. De forma predeterminada, el orden es descendente (del valor superior al inferior). Se puede emplear el signo menos ('-') para que el orden sea ascendente. La ordenación solo está disponible en los campos numéricos (entero, doble, fecha, y fecha y hora) y los campos de texto que tienen la anotación ``sortable``. Ejemplos: ``sort=price`` , ``sort=-width``
fr: Trie les résultats en fonction du champ spécifié. Par défaut, le tri est réalisé en ordre décroissant (de la valeur la plus élevée à la valeur la plus basse). Le caractère moins ('-') peut être utilisé pour réaliser un tri en ordre croissant. Le tri est uniquement disponible sur les champs numériques (int, double, date et datetime) et sur les champs de texte présentant l'annotation``sortable``. Exemples : ``sort=price`` , ``sort=-width``
it: Ordina i risultati in base al campo specificato. Per impostazione predefinita, l'ordinamento è decrescente (dal valore più alto al valore più basso). Aggiungendo il segno meno ('-') è possibile eseguire l'ordinamento in senso crescente. L'ordinamento è disponibile solo sui campi numerici (int, doppio, data e data/ora) e sui campi di testo con annotazione ``sortable``. Esempi: ``sort=price``, ``sort=-width``
nl: Sorteert resultaten volgens het gespecificeerde veld. Standaard verloopt de sortering in dalende volgorde (van de hoogste waarde naar de kleinste waarde). Een minteken ("-") kan gebruikt worden om een sortering in dalende volgorde uit te voeren. Sortering is enkel beschikbaar voor numerieke velden (int, dubbel, datum en datumtijd) en op tekstvelden die de notering "sorteerbaar" hebben. Voorbeelden: ``sort=price`` , ``sort=-width``

source: Number of results to return in a single call. The maximum number of rows returned is 1000. By default, 10 results are returned.
de: Anzahl der in einem einzigen Aufruf zurückzugebenden Ergebnisse. Die maximale Anzahl zurückgegebener Zeilen beträgt 1000. Standardmäßig werden 10 Ergebnisse zurückgegeben.
es: Número de resultados que se devolverán en una única llamada. El número máximo de filas devueltas es 1000. De forma predeterminada, se devuelven 10 resultados.
fr: Nombre de résultats à renvoyer pour chaque appel. Le nombre maximum de lignes renvoyées est de 1 000. Par défaut, 10 résultats sont renvoyés.
it: Numero di risultati da restituire in una singola chiamata. Il numero massimo di righe restituito è 1000. Per impostazione predefinita, vengono restituiti 10 risultati.
nl: Aantal resultaten die moeten worden gegeven in één enkele call. Het maximaal aantal gegeven rijen is 1.000. Standaard worden er 10 resultaten gegeven.

source: Index of the first result to return (starting at 0). To be used in conjunction with "rows" to implement paging.
de: Index des ersten zurückzugebenden Ergebnisses (Start bei 0). In Verbindung mit "rows" zur Paginierungsimplementierung zu verwenden.
es: Índice del primer resultado que se devolverá (empezando por 0). Para usar junto con "rows" a fin de implementar la paginación.
fr: Index du premier résultat à renvoyer (en commençant à 0). À utiliser avec le paramètre "rows" pour mettre en œuvre la pagination.
it: Indice del primo risultato da restituire, a partire da 0. Da utilizzare insieme a "rows" per il paging.
nl: Index van het eerste resultaat dat moet worden gegeven (te beginnen met 0). Moet gebruikt worden in combinatie met "rijen" om de paginering te implementeren.

source: Format of the response output. One of JSON (default), JSONP, GeoJSON and GeoJSONP.
de: Format der Antwortausgabe. Eines von JSON (Standard), JSONP, GeoJSON und GeoJSONP.
es: Formato de la salida de respuesta. Valores posibles: JSON (valor predeterminado), JSONP, GeoJSON y GeoJSONP.
fr: Format de la sortie de la réponse. JSON (par défaut), JSONP, GeoJSON ou GeoJSONP.
it: Formato dell'output di risposta. Può essere JSON (predefinito), JSONP, GeoJSON e GeoJSONP.
nl: Formaat van de responsoutput. Eén van JSON (standaard), JSONP, GeoJSON en GeoJSONP.

source: ``periodic``
de: ``periodisch``

source: ``precision``
de: "Präzision"

source: ``y.<SERIE>.fun and y.<SERIE>.expr``
de: ``y.<SERIE>.fun und y.<SERIE>.expr``
nl: ``y.<SERIE>.fun en y.<SERIE>.expr``
