Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/using_facets.po
Languages: de, es, fr, it, nl

source: Using facets
de: Verwenden von Facets
es: Utilizar las facetas
fr: Utiliser les facettes
it: Utilizzo dei facet
nl: Facetten gebruiken

source: A facet can be considered as a valued tag associated with a record. For instance, let's say a dataset has a facet "City". A record in this dataset could have the value "Paris" for the "City" facet.
de: Ein Facet kann als ein bewerteter Tag betrachtet werden, der einem Eintrag zugeordnet ist. Als Beispiel nehmen wir an, ein Datensatz hat ein Facet "Stadt". Ein Eintrag in diesem Datensatz könnte für das Facet "Stadt" den Wert "Paris" haben.
es: Una faceta se puede considerar una etiqueta de valor asociada a un registro. Por ejemplo, supongamos que un conjunto de datos tiene una faceta "City". Un registro de este conjunto de datos podría tener el valor "Paris" para la faceta "City".
fr: Une facette peut être considérée comme un tag avec une valeur associé à un enregistrement. Par exemple, imaginons qu'un jeu de données soit doté d'une facette "City". Un enregistrement dans ce jeu de données pourrait alors avoir la valeur "Paris" pour la facette "City".
it: Un facet può essere considerato come un tag di valore associato a un record. Ipotizziamo, ad esempio, che un dataset includa il facet "Città". In tal caso, per uno dei record presenti nel dataset, potrebbe avere il valore "Parigi".
nl: Een facet kan beschouwd worden als een tag met een waarde die gekoppeld is aan een record. Bijvoorbeeld: veronderstel dat een dataset een facet "Stad" heeft. Een record in deze dataset zou de waarde "Parijs" kunnen hebben voor de facet "Stad".

source: Facets are for instance used for building the left navigation colonne, both for dataset catalog exploration page and dataset records exploration page.
de: Facets werden etwa zum Erstellen der linken Navigationsspalte verwendet, sowohl für die Untersuchungsseite des Datenkatalogs als auch für die Untersuchungsseite der Datensatzeinträge.
es: Las facetas se utilizan, por ejemplo, para compilar el panel de navegación izquierdo, tanto en la página de exploración del catálogo de conjuntos de datos como en la página de exploración de los registros de conjuntos de datos.
fr: Les facettes sont par exemple utilisées pour créer la colonne de navigation de gauche, aussi bien sur la page d'exploration du catalogue des jeux de données que sur la page d'exploration des enregistrements des jeux de données.
it: Tra le altre cose, i facet sono utilizzati per creare la colonna di navigazione a sinistra nelle due pagine di esplorazione, quella del catalogo e quella dei record dei dataset.
nl: Facetten worden bijvoorbeeld gebruikt voor het opbouwen van de linker navigatiekolom, zowel voor de exploratiepagina van de datasetcatalogus als voor de exploratiepagina van de datasetrecords.

source: Facets are especially useful to implement guided navigation in large result sets.
de: Facets sind besonders zur Implementierung der geführten Navigation in großen Ergebnissätzen nützlich.
es: Las facetas resultan de especial utilidad para implementar la navegación guiada en conjuntos de resultados grandes.
fr: Les facettes se révèlent particulièrement utiles pour mettre en œuvre la navigation guidée dans les grands ensembles de résultats.
it: In particolare, sono utili per implementare una navigazione guidata in caso di set di risultati di grandi dimensioni.
nl: Facetten zijn vooral nuttig om gericht te navigeren in grote resultatenreeksen.

source: Identifying facets
de: Identifizieren von Facets
es: Identificar las facetas
fr: Identifier les facettes
it: Identificazione dei facet
nl: Het identificeren van facetten

source: By default, in dataset and record APIs, faceting is disabled. Faceting can be enabled by using the "facet" API parameter, specifying the name of the facet to retrieve.
de: In Datensatz- und Eintrag-APIs ist die Anwendung von Facets standardmäßig deaktiviert. Die Anwendung von Facets kann mithilfe des API-Parameters "Facet" durch die Angabe des abzurufenden Facets aktiviert werden.
es: De forma predeterminada, en las API de registros y conjuntos de datos, las facetas están inactivas. Se pueden activar las facetas por medio del parámetro de API "facet", especificando el nombre de la faceta que se debe recuperar.
fr: Par défaut, dans les API des jeux de données et des enregistrements, le facettage est désactivé. Le facettage peut être activé à l'aide du paramètre d'API "facet", en spécifiant le nom de la facette à récupérer.
it: Per impostazione predefinita, nelle API dei dataset e dei record i facet sono disabilitati. Puoi attivarli utilizzando il parametro "facet" dell'API, specificando di volta in volta il nome del facet desiderato.
nl: Standaard is facettering in dataset- en record-API's gedeactiveerd. Facettering kan worden geactiveerd door middel van de API-parameter "facet", met vermelding van de naam van het op te zoeken facet.

source: In the dataset APIs, facets are the same for all datasets and are the following:
de: In Datensatz-APIs sind die Facets für alle Datensätze gleich, und zwar die folgenden:
es: En las API de conjuntos de datos, las facetas son las mismas para todos los conjuntos de datos y son las siguientes:
fr: Dans les API des jeux de données, les facettes sont identiques pour tous les jeux de données. Elles sont répertoriées dans le tableau suivant :
it: Nelle API dei dataset, i facet disponibili sono gli stessi per tutti. Ecco l'elenco:
nl: In de dataset API's zijn de facetten allemaal dezelfde voor alle datasets en zijn het de volgende:

source: Facet Name
es: Nombre de faceta
fr: Nom de la facette
it: Nome del facet
nl: Naam van het facet

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Last modification date
de: Datum der letzten Änderung
es: Fecha de la última modificación
fr: Date de dernière modification
it: Data dell'ultima modifica
nl: Datum laatste wijziging

source: Producer
de: Produzent
es: Productor
fr: Producteur
it: Produttore, entità di pubblicazione
nl: Producent

source: First publication date
de: Datum der Erstveröffentlichung
es: Fecha de la primera publicación
fr: Date de première publication
it: Data della prima pubblicazione
nl: Datum eerste publicatie

source: Publication frequency
de: Häufigkeit der Veröffentlichung
es: Frecuencia de publicación
fr: Fréquence de publication
it: Frequenza di pubblicazione
nl: Publicatiefrequentie

source: Language
de: Sprache
es: Idioma
fr: Langue
it: Lingua
nl: Taal

source: Licence
de: Lizenz
es: Licencia
it: Licenza
nl: Licentie

source: Data granularity
de: Datengranularität
es: Granularidad de los datos
fr: Granularité des données
it: Granularità dei dati
nl: Datagranulariteit

source: Data quality
de: Datenqualität
es: Calidad de datos
fr: Qualité des données
it: Qualità dei dati
nl: Kwaliteit van de data

source: Theme
de: Thema
es: Tema
fr: Thème
it: Tema
nl: Thema

source: Keywords
de: Schlüsselwörter
es: Palabras claves
fr: Mots-clés
it: Parole chiave
nl: Kernwoorden

source: Creation date
de: Erstellungsdatum
es: Fecha de creación
fr: Date de création
it: Data di creazione
nl: Aanmaakdatum

source: Creator
de: Ersteller
es: Creador
fr: Créateur
it: Creatore
nl: Aanmaker

source: Contributors
de: Mitwirkende
es: Colaboradores
fr: Contributeurs
it: Collaboratore
nl: Bijdragers

source: In the records API, facets are defined at field level. A field facet can be available depending on the data producer choices. Fields (retrieved for instance from the Dataset Lookup API) for which faceting is available can be easily identified:
de: In der Eintrag-API werden Facets auf Feldebene definiert. Ein Feldfacet kann je nach Wahl des Datenproduzenten verfügbar sein. Felder (zum Beispiel von der Datensatznachschlag-API abgerufene), für welche die Anwendung von Facets verfügbar ist, sind einfach identifizierbar:
es: En las API de registros, las facetas se definen a nivel de campo. Una faceta de campo puede estar disponible en función de las opciones seleccionadas por el productor de datos. Los campos (recuperados, por ejemplo, de la API de consulta de conjunto de datos) para los cuales están disponibles las facetas son fáciles de identificar:
fr: Dans l'API des enregistrements, les facettes sont définies au niveau des champs. La disponibilité de la facette d'un champ dépend des choix du producteur des données. Les champs (récupérés par exemple depuis l'API de récupération de jeux de données) pour lesquels le facettage est disponible sont aisément identifiables :
it: Nelle API dei record, i facet sono definiti a livello dei campi. La disponibilità del facet di un campo dipende dalle scelte del produttore dei dati. I campi (richiamati ad esempio dall'API Dataset Lookup) per i quali è possibile effettuare il faceting sono facilmente identificabili:
nl: In de records API worden facetten gedefinieerd op veldniveau. Een veldfacet kan beschikbaar zijn, afhankelijk van de keuzes van de dataproducent. Velden (die bijvoorbeeld terug te vinden zijn in de Dataset Lookup API) waarvoor facettering beschikbaar is, kunnen gemakkelijk worden geïdentificeerd.

source: When faceting is enabled, facets are returned in the response after the result set.
de: Ist die Anwendung von Facets aktiviert, werden Facets in der Antwort nach dem Ergebnissatz zurückgegeben.
es: Cuando las facetas están activadas, estas se devuelven en la respuesta después del conjunto de resultados.
fr: Lorsque le facettage est activé, les facettes sont renvoyées dans la réponse à la suite de l'ensemble de résultats.
it: Quando il faceting è abilitato, i facet vengono restituiti nella risposta, dopo il set dei risultati.
nl: Wanneer facettering geactiveerd is, worden facetten teruggegeven in het antwoord na de resultatenreeks.

source: Every facet has a display value ("name" attribute) and a refine property ("path" attribute) which can be used to alter the query context.
de: Jedes Facet hat einen Anzeigewert ("Name" des Attributs) und eine Verfeinerungseigenschaft (Attribut "Pfad"), die zum Ändern des Anfragekontexts verwendet werden kann.
es: Cada una de las facetas tiene un valor de visualización (atributo "name") y una propiedad de refinamiento (atributo "path") que se pueden utilizar para alterar el contexto de consulta.
fr: Chaque facette présente une valeur d'affichage (attribut "name") et une propriété d'affinage (attribut "path) pouvant être utilisées pour modifier le contexte de la requête.
it: Ogni facet ha un valore visualizzato (attributo "name") e una proprietà di affinamento (attributo "path"), utilizzabili per modificare il contesto della query.
nl: Elk facet heeft een weergavewaarde (attribuut "naam") en een verfijnkenmerk (attribuut "pad") dat gebruikt kan worden om de context van de zoekopdracht te wijzigen.

source: Facets are hierarchical, for instance, a year facet will contain months facets and a month facet will contain days facets.
de: Facets sind hierarchisch. Zum Beispiel wird ein Jahresfacet Monatsfacets enthalten und ein Monatsfacet Tagesfacets.
es: Las facetas son jerárquicas; por ejemplo, una faceta de año contendrá varias facetas de meses, y una faceta de mes contendrá varias facetas de días.
fr: Les facettes sont hiérarchisées. Par exemple, la facette d'année contient des facettes de mois, et les facettes de mois contiennent des facettes de jours.
it: I facet sono organizzati gerarchicamente. Un facet relativo all'anno, ad esempio, conterrà i facet relativi ai mesi e questi ultimi i facet relativi ai giorni.
nl: Facetten zijn hiërarchisch. Zo zal een jaarfacet bijvoorbeeld maandfacetten bevatten en zal een maandfacet dagfacetten bevatten.

source: Example of a facet tree:
de: Beispiel einer Facetstruktur:
es: Ejemplo de un árbol de facetas:
fr: Exemple d'arborescence de facette :
it: Esempio di struttura gerarchica dei facet:
nl: Voorbeeld van een facetboom:

source: Every facet contains two additional information:
de: Jedes Facet enthält zwei weitere Informationen:
es: Todas las facetas contienen 2 datos adicionales:
fr: Chaque facette contient deux informations supplémentaires :
it: Ogni facet include inoltre due informazioni aggiuntive.
nl: Elk facet bevat twee extra inlichtingen:

source: The "count" attribute contains the number of hits that have the same facet value. The "state" attribute defines whether the facet is currently used in a "refine" or in an "exclude". Possible values for the state attribute are:
de: Das Attribut "Zähler" enthält die Anzahl der Treffer, die den gleichen Facetwert haben. Das Attribut "Status" definiert, ob das Facet gegenwärtig in "Verfeinern" oder "Ausschließen" verwendet wird. Mögliche Werte für das Statusattribut sind:
es: El atributo "count" contiene el número de coincidencias que tienen el mismo valor de faceta. El atributo "state" define si la faceta se utiliza actualmente en un "refinamiento" o una "exclusión". Los valores posibles del atributo state son:
fr: L'attribut "count" contient le nombre de correspondances qui ont la même valeur de facette. L'attribut "state" définit si la facette est actuellement utilisée ou non dans un argument "refine" ou "exclude". Les valeurs possibles pour l'attribut "state" sont les suivantes :
it: L'attributo "count" riporta il numero di occorrenze con lo stesso valore di facet. L'attributo "state" definisce se il facet è utilizzato attualmente in modalità "refine" o "exclude". I possibili valori dell'attributo "state" sono:
nl: Het attribuut "tellen" bevat het aantal hits die dezelfde facetwaarde hebben. Het attribuut "staat" definieert of het facet momenteel gebruikt wordt in een "verfijnen" of in een "uitsluiten". Mogelijke waardes voor het attribuut "staat" zijn:

source: **displayed**: no refine nor exclude
de: **angezeigt**: weder Verfeinern noch Ausschließen
es: **displayed**: Ni refinamiento ni exclusión
fr: **displayed** : dans aucun argument "refine" ni "exclude"
it: **displayed**: né refine né exclude
nl: **weergegeven**: noch verfijnen noch uitsluiten

source: **refined**: refine
de: **verfeinert**: verfeinern
es: **refined**: Refinamiento
fr: **refined** : dans un argument "refine"
nl: **verfijnd**: verfijnen

source: **excluded**: exclude
de: **ausgeschlossen**: ausschließen
es: **excluded**: Exclusión
fr: **exclude** : dans un argument "exclude"
nl: **uitgesloten**: uitsluiten

source: Example of a facet with all its attributes:
de: Beispiel eines Facets mit all seinen Attributen:
es: Ejemplo de una faceta con todos sus atributos:
fr: Exemple d'une facette avec tous ses attributs :
it: Esempi di un facet con tutti gli attributi:
nl: Voorbeeld van een facet met al zijn attributen:

source: Refining
de: Verfeinern
es: Refinamiento
fr: Affiner
it: Affinamento
nl: Bezig met verfijnen

source: It is possible to limit the result set by refining on a given facet value. To do so, use the following API parameter: ``refine.FACETNAME=FACETVALUE``.
de: Sie können einen Ergebnissatz beschränken, indem Sie einen bestimmten Facetwert verfeinern. Verwenden Sie dazu den folgenden API-Parameter: ``refine.FACETNAME=FACETVALUE``.
es: Se puede limitar el conjunto de resultados efectuando un refinamiento a partir de un valor de faceta determinado. Para ello, use el parámetro de API siguiente: ``refine.NOMBRE_FACETA=VALOR_FACETA``.
fr: Il est possible de limiter l'ensemble de résultats en affinant la valeur d'une facette spécifique. Pour cela, utilisez le paramètre d'API suivant : ``refine.FACETNAME=FACETVALUE``.
it: Impostando l'affinamento su un determinato valore di un facet, è possibile limitare il set dei risultati. A questo scopo, utilizza il seguente parametro dell'API: ``refine.FACETNAME=FACETVALUE``.
nl: Het is mogelijk om de resultatenreeks te beperken door een welbepaalde facetwaarde te verfijnen. Gebruik hiervoor de volgende API-parameter: ``refine.FACETNAME=FACETVALUE``.

source: For example: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013>`_
de: Beispiel: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013>`_
es: Por ejemplo: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013>`_
fr: Par exemple : `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013>`_
it: Ad esempio: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013>`_.
nl: Bijvoorbeeld: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013>`_

source: In the returned result set, only the datasets modified in 2013 will be returned.
de: Im Ergebnissatz werden nur die 2013 geänderten Datensätze zurückgegeben.
es: En el conjunto de resultados devuelto, solo se mostrarán los conjuntos de datos modificados en 2013.
fr: L'ensemble de résultats renvoyés ne comprendra que les jeux de données modifiés en 2013.
it: Nel set di risultati restituito saranno inclusi solo i dataset modificati nel 2013.
nl: In de opgeleverde resultatenreeks zullen enkel de datasets die in 2013 gewijzigd zijn worden weergegeven.

source: As the refinement occurs on the "year" and as the "modified" facet is hierarchical, the sub-level is returned; results are dispatched in the "month" sub value:
de: Da die Verfeinerung für das "Jahr" erfolgt und das Facet "geändert" hierarchisch ist, wird die Unterebene zurückgegeben. Ergebnisse werden im Unterwert "Monat" versendet:
es: Como se produce el refinamiento a partir del valor de año y la faceta "modified" es jerárquica, se devuelve el subnivel; los resultados se distribuyen en el subvalor de mes:
fr: Étant donné que l'affinage est réalisé sur le paramètre "year" et que la facette "modified" est hiérarchique, le sous-niveau est renvoyé ; les résultats sont répartis en fonction de la sous-valeur "month" :
it: Poiché l'affinamento si applica a "year" e il facet "modified" è gerarchico, viene restituito il sotto-livello. I risultati sono inviati nel valore "month" sottostante:
nl: Aangezien de verfijning plaatsvindt op het "jaar" en aangezien het "gewijzigde" facet hiërarchisch is, wordt het subniveau weergegeven; resultaten worden weergegeven in de subwaarde "maand":

source: Excluding
de: Ausschließen
es: Exclusión
fr: Exclure
it: Esclusione
nl: Bezig met uitsluiten

source: Using the same principle as above, it is possible to exclude from the result set the hits matching a given value of a given facet. To do so, use the following API parameter: ``exclude.FACETNAME=FACETVALUE``.
de: Nach dem gleichen Prinzip wie oben können Sie solche Treffer aus einem Ergebnissatz ausschließen, die einem bestimmten Wert eines bestimmten Facets entsprechen. Verwenden Sie dazu den folgenden API-Parameter: ``exclude.FACETNAME=FACETVALUE``.
es: Según el mismo principio anterior, se puede excluir del conjunto de resultados las coincidencias con un valor determinado de una faceta determinada. Para ello, use el parámetro de API siguiente: ``exclude.NOMBRE_FACETA=VALOR_FACETA``.
fr: Sur la base du même principe, il est possible d'exclure de l'ensemble de résultats ceux qui correspondent à la valeur d'une facette spécifique. Pour cela, utilisez le paramètre d'API suivant : ``exclude.FACETNAME=FACETVALUE``.
it: Applicando lo stesso principio descritto in precedenza, è possibile anche escludere dal set dei risultati le occorrenze che corrispondono a un determinato valore di un particolare facet. A questo scopo, utilizza il seguente parametro dell'API: ``exclude.FACETNAME=FACETVALUE``.
nl: Door hetzelfde principe als hierboven te gebruiken, is het mogelijk om uit de resultatenreeks de hits uit te sluiten die overeenstemmen met een welbepaalde waarde van een welbepaald facet. Gebruik hiervoor de volgende API-parameter: ``exclude.FACETNAME=FACETVALUE``.

source: For example: `<http://public.opendatasoft.com/api/datasets/1.0/search?exclude.modified=2013>`_
de: Beispiel: `<http://public.opendatasoft.com/api/datasets/1.0/search?exclude.modified=2013>`_
es: Por ejemplo: `<http://public.opendatasoft.com/api/datasets/1.0/search?exclude.modified=2013>`_
fr: Par exemple : `<http://public.opendatasoft.com/api/datasets/1.0/search?exclude.modified=2013>`_
it: Ad esempio: `<http://public.opendatasoft.com/api/datasets/1.0/search?exclude.modified=2013>`_.
nl: Bijvoorbeeld: `<http://public.opendatasoft.com/api/datasets/1.0/search?exclude.modified=2013>`_

source: Only results that have not been modified in 2011 will be returned.
de: Zurückgegeben werden nur Ergebnisse, die 2011 nicht geändert wurden.
es: Solo se devolverán los resultados que no se hayan modificado en 2011.
fr: Seuls les résultats qui n'ont pas été modifiés en 2013 seront renvoyés.
it: Verranno restituiti solo i risultati che non sono stati modificati nel 2011.
nl: Enkel resultaten die in 2011 niet werden gewijzigd, zullen worden weergegeven.

source: Disjunctive faceting
de: Trennende Anwendung von Facets
es: Facetas disyuntivas
fr: Facettage disjonctif
it: Faceting disgiuntivo
nl: Disjunctieve facettering

source: By default, faceting is conjunctive. This means that the following context will lead down to no results: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014>`_.
de: Die Anwendung von Facets ist standardmäßig verbindend. Das heißt, dass der folgende Kontext zu keinen Ergebnissen führt: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014>`_.
es: De forma predeterminada, las facetas son conjuntivas. Esto significa que el contexto siguiente no proporcionará ningún resultado: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014>`_.
fr: Par défaut, le facettage est conjonctif. Cela signifie que le contexte suivant ne renverra aucun résultat : `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014>`_.
it: Per impostazione predefinita, il faceting è congiuntivo. Ciò significa che il seguente contesto non fornirà alcun risultato: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014>`_.
nl: Facettering is standaard conjunctief. Dit betekent dat de volgende context geen resultaten zal opleveren: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014>`_.

source: You can enable disjunctive faceting using the following API parameter: ``disjunctive.FACETNAME=true``.
de: Mithilfe des folgenden API-Paramters können Sie die trennende Anwendung von Facets aktivieren: ``disjunctive.FACETNAME=true``.
es: Puede activar las facetas disyuntivas con el parámetro de API siguiente: ``disjunctive.NOMBRE_FACETA=true``.
fr: Vous pouvez activer le facettage disjonctif à l'aide du paramètre d'API suivant : ``disjunctive.FACETNAME=true``.
it: Per abilitare il faceting disgiuntivo, utilizza il seguente parametro dell'API: ``disjunctive.FACETNAME=true``.
nl: U kan disjunctieve facettering activeren door gebruik te maken van de volgende API-parameter: ``disjunctive.FACETNAME=true``.

source: For example: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014&disjunctive.modified=true>`_
de: Beispiel: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014&disjunctive.modified=true>`_
es: Por ejemplo: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014&disjunctive.modified=true>`_
fr: Par exemple : `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014&disjunctive.modified=true>`_
it: Ad esempio: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014&disjunctive.modified=true>`_.
nl: Bijvoorbeeld: `<http://public.opendatasoft.com/api/datasets/1.0/search?refine.modified=2013&refine.modified=2014&disjunctive.modified=true>`_
