Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_account/02_generating_api_key/generating_api_key.po
Languages: de, es, fr, nl

source: Generating an API key
de: Einen API-Schlüssel generieren
es: Generar una clave de API
fr: Générer une clé d'API
nl: Een API-sleutel genereren

source: From the API keys tab of their account, authenticated users have the possibility to generate API keys, as well as to manage them.
de: Über die Registerkarte "API-Schlüssel" ihres Kontos können authentifizierte Benutzer API-Schlüssel generieren und verwalten.
es: En la ficha Claves de API de su cuenta, los usuarios autenticados tienen la posibilidad de generar claves de API, así como de administrarlas.
fr: Depuis l'onglet Clés d'API de leur compte, les utilisateurs authentifiés ont la possibilité de générer des clés d'API et de les gérer.
nl: Vanuit de tab API-sleutels van hun account kunnen geauthentificeerde gebruikers API-sleutels genereren en deze ook beheren.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: API keys are bound to a specific domain. They only work on the domain on which they were created.
de: API-Schlüssel sind an eine bestimmte Domain gebunden. Sie funktionieren nur auf der Domain, auf der sie erstellt wurden.
es: Las claves de API están vinculadas a un dominio específico. Solo funcionan en el dominio en el que se han creado.
fr: Les clés d'API sont reliées à un domaine spécifique, c'est-à-dire qu'elles ne fonctionnent que sur le domaine où elles ont été créées.
nl: API-sleutels zijn gekoppeld aan een specifiek domein. Ze werken enkel op het domein waarop ze werden aangemaakt.

source: These API keys allow to use the following APIs: ODS Search API v1 and v2, OData, WFS and CSW (more info in the :doc:`Using APIs </exploring_catalog_and_datasets/04_getting_involved/using_api>` documentation).
de: Diese API-Schlüssel ermöglichen die Verwendung der folgenden APIs: ODS Search API v1 und v2, OData, WFS und CSW (Weitere Informationen finden Sie in der Dokumentation :doc:`APIs verwenden </exploring_catalog_and_datasets/04_getting_involved/using_api>`).
nl: Met deze API-sleutels kunnen de volgende API's worden gebruikt: ODS Search API v1 en v2, OData, WFS en CSW (meer informatie in het document :doc:`API's gebruiken</exploring_catalog_and_datasets/04_getting_involved/using_api>`).

source: Click |icon-copypaste| to copy an API key.
de: Klicken Sie auf |icon-copypaste|, um einen API-Schlüssel zu kopieren.
es: Haga clic en |icon-copypaste| para copiar una clave de API.
fr: Cliquez sur |icon-copypaste| pour copier une clé d'API.
nl: Klik op |icon-copypaste| om een API-sleutel te kopiÃ«ren.

source: Click on the Generate new key button. An API key card appears on the tab.
de: Klicken Sie auf den Button "Neuen Schlüssel generieren". In der Registerkarte erscheint eine API-Schlüsselkarte.
es: Haga clic en el botón Generar clave nueva. Aparecerá una tarjeta de clave de API en la ficha.
fr: Cliquez sur le bouton Générer une nouvelle clé pour faire apparaître une carte de clé d'API dans l'onglet.
nl: Klik op de knop Nieuwe sleutel genereren. Er verschijnt een API-sleutelkaart op de tab.

source: Write a name for the API key in the Label textbox. It should indicate the purpose of the API key.
de: Schreiben Sie einen Namen für den API-Schlüssel in das Textfeld "Beschriftung". Dieser sollte den Zweck des API-Schlüssels angeben.
es: Escriba un nombre para la clave de API en el cuadro de texto Etiqueta. Debe indicar la finalidad de la clave de API.
fr: Donnez un nom à la clé d'API dans la zone de texte Label. Il devrait décrire la fonction de cette clé.
nl: Noteer een naam voor de API-sleutel in het tekstvak Label. Hiermee wordt het doel van een API-sleutel aangegeven.

source: Revoking an existing API key
de: Einen vorhandenen API-Schlüssel widerrufen
es: Revocar una clave de API existente
fr: Retirer une clé d'API existante
nl: Een bestaande API-sleutel herroepen

source: Click on the Revoke key button at the bottom of the chosen API key card. A pop-up window appears.
de: Klicken Sie auf den Button "Schlüssel widerrufen", der sich im unteren Bereich der API-Schlüsselkarte befindet. Ein Bestätigungsfenster wird angezeigt.
es: Haga clic en el botón Revocar clave en la parte inferior de la tarjeta de clave de API. Aparecerá una ventana emergente.
fr: Cliquez sur le bouton Retirer la clé en bas de la carte de clé d'API choisie. Une fenêtre s'ouvre alors.
nl: Klik op de knop Sleutel herroepen onderaan de gekozen API-sleutelkaart. Er verschijnt een pop-up venster.

source: Click on the Revoke key button to confirm the revokation of the API key.
de: Klicken Sie auf den Button "Schlüssel widerrufen", um den Vorgang zu bestätigen.
nl: Klik op de knop Sleutel herroepen om het herroepen van een API-sleutel te bevestigen.

source: These API keys allow you to use the following APIs: ODS Search API v1 and v2, OData, WFS, and CSW (more info in the :doc:`Using APIs </exploring_catalog_and_datasets/04_getting_involved/using_api>` documentation).
es: Estas claves de API permiten utilizar las API siguientes: ODS Search API v1 y v2, OData, WFS y CSW (más información en la documentación :doc:`Utilización de las API </exploring_catalog_and_datasets/04_getting_involved/using_api>`).
fr: Ces clés d'API vous permettent d'utiliser les API suivants : ODS Search API v1 et v2, OData, WFS et CSW (plus d'informations dans la documentation :doc:`Utiliser l'API</exploring_catalog_and_datasets/04_getting_involved/using_api>`).

source: Click on the Revoke key button to confirm the revocation of the API key.
es: Haga clic en el botón Revocar clave para confirmar la revocación de la clave de API.
fr: Cliquez sur le bouton Retirer la clé pour confirmer le retrait de la clé d'API.
