Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/03_analyzing_domain_usage/analyzing_users_usage.po
Languages: de, es, fr, it, nl

source: Analyzing users usage
de: Analysieren der Benutzerverwendung
es: Analizar el uso de los usuarios
fr: Analyser l'usage des utilisateurs
it: Analisi dell'utilizzo da parte degli utenti
nl: Het gebruik van gebruikers analyseren

source: Go to the *Analytics > Users* page.
de: Wechseln Sie zur Seite *Analysen > Benutzer*.
es: Vaya a la página *Análisis > Usuarios*.
fr: Allez sur la page *Statistiques > Utilisateurs*.
it: Fai clic su *Analytics > Utenti*.
nl: Ga naar de pagina *Analyse > Gebruikers*

source: There are seven indicators :
de: Es gibt sieben Indikatoren:
es: Hay 7 indicadores:
fr: Il y a sept indicateurs :
it: Sono disponibili sette indicatori:
nl: Er zijn zeven indicatoren:

source: **Activity**: API calls per day. It may allow you to understand better who are the people using your data (for example if you mostly have calls during week days). You can also link your activity to some events (a new dataset, a new communication campaign).
de: **Aktivität**: API-Aufrufe pro Tag. Ermöglicht ein besseres Verständnis, wer Ihre Daten nutzt (z. B. hauptsächlich Aufrufe an Wochentagen). Sie können Ihre Aktivität auch mit einigen Ereignissen verknüpfen (ein neuer Datensatz, eine neue Kommunikationskampagne).
es: **Actividad**: Llamadas de API por día. Puede ayudarle a comprender mejor quiénes emplean sus datos (por ejemplo, si tiene la mayoría de las llamadas entre semana). También puede vincular la actividad con determinados eventos (un conjunto de datos nuevo o una campaña de comunicación nueva).
it: **Attività**: numero di chiamate API al giorno. Può essere utile per capire meglio il tipo di utenti che utilizzano i tuoi dati (ad esempio, se le chiamate avvengono principalmente nei giorni feriali). Hai inoltre la possibilità di collegare la tua attività ad alcuni eventi, come la creazione di un nuovo dataset, una nuova campagna di comunicazione.
nl: **Activiteit**: API calls per dag. Hierdoor kan u beter begrijpen wie de mensen zijn die uw data gebruiken (bijvoorbeeld wanneer u de meeste calls hebt tijdens weekdagen). U kan uw activiteit ook koppelen aan enkele evenementen (een nieuwe dataset, een nieuwe communicatiecampagne).

source: **Total users**: Estimated number of unique users who interacted with the domain
de: **Benutzer insgesamt**: Geschätzte Anzahl der Einzelbenutzer, die mit der Domain interagiert haben.
es: **Total de usuarios**: Número estimado de usuarios exclusivos que han interactuado con el dominio.
fr: **Nombre total d'utilisateurs** : estimation du nombre d'utilisateurs uniques ayant interagi avec le domaine.
it: **Utenti totali**: stima del numero di utenti unici che hanno interagito con il dominio.
nl: **Totaal gebruikers**: geschatte aantal unieke gebruikers die interactie hebben met het domein

source: **API Calls per user**: on average API calls per users.
de: **API-Aufrufe pro Benutzer**: durchschnittliche API-Aufrufe je Benutzer.
es: **Llamadas de API por usuario**: Promedio de llamadas de API efectuadas por los usuarios.
it: **Chiamate API per utente**: media delle chiamate API per utente.
nl: **API calls per gebruiker**: gemiddeld aantal API calls per gebruiker.

source: **Anonymous users**: Percentage of users without an account. If your domain is open, you may have a lot of anonymous users, that's normal, that's the whole thing about Open Data. Not anonymous people are those who have an OpenDataSoft account and who are logged when they use your data.
de: **Anonyme Benutzer**: Prozentsatz an Benutzern ohne Konto. Viele Ihrer Benutzer können anonym sein, wenn Ihre Domain offen ist. Das ist völlig normal und der Kernpunkt von Open Data. Nicht anonyme Benutzer sind solche, die ein OpenDataSoft-Konto haben und bei der Nutzung Ihrer Daten eingeloggt sind.
es: **Usuarios anónimos**: Porcentaje de usuarios sin cuenta. Si el dominio es abierto, puede tener un gran número de usuarios anónimos y es normal, dado que en pura lógica este es el concepto de datos abiertos. Los usuarios no anónimos son los que tienen una cuenta OpenDataSoft y han iniciado la sesión cuando utilizan los datos.
it: **Utenti anonimi**: percentuale di utenti senza account. Se il tuo dominio è aperto, potrebbe avere un'elevata quantità di utenti anonimi: è del tutto normale, è questo il senso dell'Open Data. Gli utenti non anonimi sono quelli che possiedono un account OpenDataSoft e che effettuano l'accesso quando utilizzano i tuoi dati.
nl: **Anonieme gebruikers**: percentage gebruikers zonder een account. Indien uw domein open is, kan u een groot aantal anonieme gebruikers hebben. Dit is normaal. Daar gaat het bij Open Data nu eenmaal om. Niet-anonieme mensen die een OpenDataSoft-account hebben en die ingelogd zijn wanneer ze uw data gebruiken.

source: **Mobile users**: Percentage of activity generated by users using a mobile device.
de: **Mobile Benutzer**: Prozentsatz der durch Benutzer mobiler Geräte generierten Aktivität.
es: **Usuarios móviles**: Porcentaje de actividad generada por usuarios con un dispositivo móvil.
fr: **Utilisateurs mobiles** : pourcentage de l'activité générée par un utilisateur depuis un smartphone ou une tablette.
it: **Utenti mobili**: percentuale dell'attività generata da utenti con dispositivo mobile.
nl: **Mobiele gebruikers**: percentage van de activiteit die gegenereerd wordt door gebruikers die gebruik maken van een mobiel toestel.

source: **Top 5 users**: The people who use your API or your data the most. Keep in mind that if somebody downloads a dataset and develops something on his laptop, you won't be able to know it and it won't appear here.
de: **Top 5-Benutzer**: Jene Personen, die Ihre API oder Ihre Daten am häufigsten nutzen. Achtung, lädt jemand einen Datensatz herunter und entwickelt etwas auf seinem Laptop, erfahren Sie das nicht und es erscheint hier nicht.
es: **5 principales usuarios**: Las personas que más utilizan la API o los datos. Tenga presente que si alguien descarga un conjunto de datos y lleva a cabo un desarrollo posterior en su equipo, esto no podrá saberlo y no constará aquí.
it: **I primi 5 utenti**: utenti che utilizzano maggiormente la tua API o i tuoi dati. Considera che se un utente scarica un dataset e sviluppa un'applicazione sul proprio computer, non sarai in grado di saperlo e non potrai visualizzarlo in questo elenco.
nl: **Top 5 gebruikers**: de mensen die uw API of uw data het meest gebruiken. Denk eraan dat, wanneer iemand een dataset downloadt en iets op zijn laptop ontwikkelt, u dit niet kan weten en dit hier niet zal verschijnen.

source: **Map of API calls**: The map is based on the geolocation of IP addresses. It gives a good idea of the geographical distribution of usage. Yet it can be quite imprecise and may yield false geolocations.
de: **Karte der API-Aufrufe**: Die Karte basiert auf der Geolokalisierung von IP-Adressen. Vermittelt eine gute Übersicht über die geografische Verteilung der Nutzung. Kann dennoch ziemlich ungenau sein und falsche Geolokalisierungen ergeben.
es: **Mapa de llamadas de API**: El mapa se basa en la geolocalización de direcciones IP. Da una buena idea de la distribución geográfica del uso. Con todo, puede ser bastante impreciso y generar geolocalizaciones falsas.
it: **Mappa delle chiamate API**: la mappa si basa sulla geolocalizzazione degli indirizzi IP. Consente di farsi un'idea della distribuzione geografica degli utilizzi. Tuttavia, può contenere diverse imprecisioni e fornire geolocalizzazioni non corrette.
nl: **Kaart van API calls**: de kaart is gebaseerd op de geolocatie van IP-adressen. Ze geeft u een goed idee van de geografische verdeling van het gebruik. Wel kan ze vrij onnauwkeurig zijn en verkeerde geolocaties opleveren.

source: **Activity**: API calls per day. It may allow you to understand better who the people using your data are (for example, if you mostly have calls during week days). You can also link your activity to some events (a new dataset, a new communication campaign).
fr: **Activité** : nombre d'appels d'API quotidiens. Cela peut vous aider à mieux comprendre qui sont les personnes utilisant vos données (par exemple, si vous avez essentiellement des appels d'API en semaine). Vous pouvez aussi lier votre activité à certains évènements (un nouveau jeu de données, une nouvelle campagne de communication).

source: **API Calls per user**: on average, API calls per user.
fr: **Nombre d'appels d'API par utilisateur** : nombre moyen d'appels d'API par utilisateur.

source: **Anonymous users**: Percentage of users without an account. If your domain is open, you may have a lot of anonymous users. That's normal. That's the whole thing about Open Data. Not anonymous people are those who have an Opendatasoft account and who are logged when they use your data.
fr: **Utilisateurs anonymes** : pourcentage d'utilisateurs sans compte. Si votre domaine est ouvert, il peut y avoir de nombreux utilisateurs anonymes, c'est normal, c'est le principe de l'Open Data. Les utilisateurs non anonymes sont ceux qui ont un compte Opendatasoft et qui sont connectés quand ils utilisent vos données.

source: **Top 5 users**: The people who use your API or your data the most. Keep in mind that if somebody downloads a dataset and develops something on his laptop, you won't be able to know it, and it won't appear here.
fr: **Top 5 utilisateurs** : les utilisateurs qui utilisent le plus l'API ou les données. Gardez à l'esprit que si quelqu'un télécharge un jeu de données et développe une application sur son ordinateur, vous ne le saurez pas et cela n'apparaîtra pas ici.

source: **Map of API calls**: The map is based on the geolocation of IP addresses. It gives a good idea of the geographical distribution of usage. However, it can be quite imprecise and may yield false geolocations.
fr: **Carte des appels API** : la carte est basée sur la géolocalisation des adresses IP. Cela permet d'avoir un aperçu de la répartition de l'utilisation. Toutefois, cette technique peut manquer de précision et renvoyer de mauvaises géolocalisations.
