Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/03_analyzing_domain_usage/analyzing_data_usage.po
Languages: de, es, fr, nl

source: Analyzing data usage
de: Analysieren der Datennutzung
es: Analizar el uso de datos
fr: Analyser l'usage des données
nl: Gebruik van data analyseren

source: The Data dashboard displays statistics to analyze the data published on the portal. It is available in the Analytics > Data section of the back office.
de: Das Daten-Dashboard zeigt Statistiken an, um die im Portal veröffentlichten Daten zu analysieren. Es ist im Bereich Analyse > Daten des Backoffice verfügbar.
es: El panel de datos muestra estadísticas para analizar los datos publicados en el portal. Está disponible en la sección Análisis > Datos del back office.
fr: Le tableau de bord Données présente des statistiques pour analyser les données publiées sur le portail. Pour y accéder, rendez-vous dans la section Statistiques > Données du back-office.
nl: Het Data-dashboard geeft de statistieken weer om de data te analyseren die gebruikt worden op het portaal. Dit is terug te vinden in de rubriek Analytics > Data van de back office.

source: This dashboard is divided into 4 sections:
de: Dieses Dashboard ist in 4 Bereiche unterteilt:
es: Este panel se divide en 4 secciones:
fr: Ce tableau de bord se divise en 4 sections :
nl: Dit dashboard is onderverdeeld in 4 secties:

source: Totals: figures about the datasets published in the portal and their usage through that portal
de: Summen: Zahlen zu den im Portal veröffentlichten Datensätzen und deren Nutzung über das Portal
es: Totales: Cifras de los conjuntos de datos publicados en el portal y su uso en ese portal
fr: Totaux : chiffres concernant les jeux de données publiés dans le portail et leur utilisation dans celui-ci
nl: Totalen: cijfers over de datasets die in het portaal zijn gepubliceerd en hoe deze via dat portaal worden gebruikt

source: Popularity: statistics and charts to compute and analyze the popularity of the datasets published in the portal
de: Beliebtheit: Statistiken und Diagramme zur Berechnung und Analyse der Beliebtheit der im Portal veröffentlichten Datensätze
es: Popularidad: Estadísticas y gráficos para calcular y analizar la popularidad de los conjuntos de datos publicados en el portal
fr: Popularité : statistiques et graphes pour calculer et analyser la popularité des jeux de données publiés dans le portail
nl: Populariteit: statistieken en grafieken om de populariteit van de datasets die in het portaal zijn gepubliceerd te berekenen en te analyseren

source: Top 5: lists of most downloaded, used, and reused published datasets
de: Top 5: Listen der am häufigsten heruntergeladenen, verwendeten und weiterverwendeten veröffentlichten Datensätze
es: Los cinco principales: Listas de los conjuntos de datos publicados más descargados, utilizados y reutilizados
nl: Top 5: lijsten van de meest gedownloade, gebruikte en hergebruikte gepubliceerde datasets

source: Theme Distribution: tree chart to analyze most and least used themes
de: Themenverteilung: Baumdiagramm zur Analyse der am meisten und seltensten benutzten Themen
es: Distribución de temas: Gráfico de rectángulos para analizar los temas más y menos utilizados
fr: Répartition des thèmes : mosaïque permettant d'analyser les thèmes les plus utilisés et ceux qui le sont le moins
nl: Themaverdeling: drie grafieken om de meest en minst gebruikte thema's te analyseren

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: In this dashboard, only published datasets are taken into account. Unpublished datasets are ignored from all figures, charts and other computed analytics displayed.
de: In diesem Dashboard werden nur veröffentlichte Datensätze berücksichtigt. Nicht veröffentlichte Datensätze spielen in den angezeigten Zahlen, Diagrammen und anderen berechneten Analysen keine Rolle.
es: En este panel, solo se tienen en cuenta los conjuntos de datos publicados. Los conjuntos de datos con la publicación cancelada se omiten de todas las visualizaciones de cifras, gráficos y otros análisis.
fr: Seuls les jeux de données publiés figurent dans ce tableau de bord. Les jeux de données non publiés ne sont pas pris en compte dans les chiffres, graphes et autres statistiques affichés.
nl: In dit dashboard wordt enkel rekening gehouden met gepubliceerde datasets. Verwijderde datasets worden niet meegerekend in alle cijfers, grafieken en andere berekende analyses die worden weergegeven.

source: It is possible, by clicking the buttons at the top of the dashboard, to choose to build the dashboard:
de: Durch Anklicken der oberen Schaltflächen im Dashboard ist es möglich, das Dashboard mit folgenden Elementen zu erstellen:
es: Haciendo clic en los botones de la parte superior del panel, se puede elegir crear el panel:
nl: Door de knoppen aan te klikken bovenaan de dashboard is het evenwel mogelijk om ervoor te kiezen om het dashboard op te bouwen:

source: with all existing published datasets (checked by default),
de: mit allen vorhandenen veröffentlichten Datensätzen (Standard),
es: con todos los conjuntos de datos publicados existentes (selección predeterminada);
nl: met alle bestaande gepubliceerde datasets (standaard aangevinkt),

source: only with the private datasets, meaning those in restricted access, no matter the restriction, or
de: nur mit privaten Datensätzen, d.h. denjenigen mit eingeschränktem Zugriff (unabhängig von der Einschränkung), oder
es: solo con los conjuntos de datos privados, es decir, con acceso restringido (cualquiera que sea la restricción); o
nl: enkel met de private datasets, m.a.w. diegene in beperkte toegangen, ongeacht de beperking, of

source: only with the public datasets, meaning those accessible by everyone.
de: nur mit öffentlichen Datensätzen, d.h. solchen, die für alle zugänglich sind.
es: solo con los conjuntos de datos públicos, es decir, accesibles para todos.
nl: of enkel met de publieke datasets, m.a.w. diegene die voor iedereen toegankelijk zijn.

source: Depending on which datasets are used to build the Data dashboard, the displayed figures, charts, and analytics will vary.
de: Je nachdem, welche Datensätze zur Erstellung des Daten-Dashboards verwendet werden, variieren die angezeigten Zahlen, Diagramme und Analysen.
es: En función de los conjuntos de datos que se utilicen para crear el panel de datos, la visualización de cifras, gráficos y análisis variará.
nl: Afhankelijk van welke datasets die worden gebruikt om het Data-dashboard op te bouwen, zullen de weergegeven cijfers, grafieken en analyses verschillen.

source: Totals
de: Summen
es: Totales
fr: Totaux
nl: Totale

source: Label
de: Beschriftung
es: Etiqueta

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Datasets
de: Datensätze
es: Conjuntos de datos
fr: Jeux de données

source: Total number of published datasets in the portal
de: Gesamtanzahl der Datensätze im Portal.
es: Número total de conjuntos de datos publicados en el portal
fr: Nombre total de jeux de données publiés dans le portail
nl: Totaal aantal gepubliceerde datasets in het portaal

source: Records
de: Einträge
es: Registros
fr: Enregistrements

source: Total number of records in all published datasets combined
de: Gesamtanzahl der Einträge in allen veröffentlichten Datensätzen
es: Número total de registros de todos los conjuntos de datos publicados combinados
fr: Nombre total d'enregistrements dans tous les jeux de données publiés
nl: Totaal aantal records in alle gepubliceerde datasets gecombineerd

source: Downloads
es: Descargas
fr: Téléchargements

source: Total number of downloads in all published datasets combined
de: Gesamtanzahl der Downloads in allen veröffentlichten Datensätzen
es: Número total de descargas de todos los conjuntos de datos publicados combinados
fr: Nombre total de téléchargements dans tous les jeux de données publiés
nl: Totaal aantal downloads in alle gepubliceerde datasets gecombineerd

source: API calls
de: API-Aufrufe
es: Llamadas de API
fr: Appels d'API
nl: API-oproepen

source: Total number of API calls for all published datasets combined
de: Gesamtanzahl der API-Aufrufe in allen veröffentlichten Datensätzen
es: Número total de llamadas de API para todos los conjuntos de datos publicados combinados
fr: Nombre total d'appels d'API dans tous les jeux de données publiés
nl: Totaal aantal API-oproepen voor alle gepubliceerde datasets gecombineerd

source: Reuses
de: Weiterverwendungen
es: Reutilizaciones
fr: Réutilisations
nl: Hergebruiken

source: Total number of reuses for all published datasets combined
de: Gesamtanzahl der Weiterverwendungen für alle veröffentlichte Datensätze
es: Número total de reutilizaciones para todos los conjuntos de datos publicados combinados
fr: Nombre total de réutilisations dans tous les jeux de données publiés
nl: Totaal aantal hergebruiken voor alle gepubliceerde datasets gecombineerd

source: Popularity
de: Beliebtheit
es: Popularidad
fr: Popularité
nl: Populariteit

source: The Popularity section of the Data dashboard is based upon a computation aiming at quantifying dataset consumption in order to establish popularity scores for datasets. This computation is based on 3 metrics: number of downloads, number of API calls, and number of reuses. These 3 metrics indicate whether a dataset published into an Opendatasoft portal can be considered popular or not, compared to the other datasets of both that portal and the Opendatasoft data network.
de: Der Bereich "Beliebtheit" im Daten-Dashboard basiert auf einer Berechnung, mit der die Datensatznutzung gemessen und Popularitätswerte für einzelne Datensätze ermittelt werden. Diese Berechnung basiert auf 3 Metriken: Anzahl der Downloads, Anzahl der API-Aufrufe und Anzahl der Weiterverwendungen. Anhand dieser 3 Metriken kann bestimmt werden, ob ein Datensatz, der auf einem Opendatasoft-Portal veröffentlicht wurde, im Vergleich zu anderen Datensätzen dieses Portals und des gesamten Opendatasoft-Datennetzwerks beliebt ist.
es: La sección Popularidad del panel de datos se basa en un cálculo destinado a cuantificar el consumo de conjuntos de datos para establecer las puntuaciones de la popularidad de los conjuntos de datos. Este cálculo se basa en 3 métricas: número de descargas, número de llamadas de API y número de reutilizaciones. Estas 3 métricas indican si un conjunto de datos publicado en un portal Opendatasoft se puede considerar popular o no, en comparación con los demás conjuntos de datos tanto de ese portal como de la red de datos de Opendatasoft.
nl: De sectie Populariteit van het Data-dashboard is gebaseerd op een berekening die erop gericht is het datasetverbruik te kwantificeren om zo populariteitsscores voor datasets te bepalen. Deze berekening is gebaseerd op 3 cijfers: het aantal downloads, het aantal API-oproepen en het aantal hergebruiken. Deze 3 cijfers geven aan of een dataset die gepubliceerd is op een Opendatasoft-portaal, al dan niet als populair kan worden beschouwd in vergelijking met andere datasets van zowel dat portaal als het datanetwerk van Opendatasoft.

source: The scoring formula may change in the future. Opendatasoft will notify all users if the computation to establish the popularity changes.
de: Die Berechnungsformel kann sich in Zukunft ändern. Opendatasoft wird alle Benutzer darüber in Kenntnis setzen, wenn sich die Berechnungsmethode zur Ermittlung der Beliebtheit ändert.
es: La fórmula para calcular las puntuaciones puede variar en el futuro. Opendatasoft avisará a todos los usuarios si el cálculo para establecer la popularidad cambia.
fr: La formule permettant de calculer le score pourra être modifiée à l'avenir. Opendatasoft informera tous les utilisateurs si de telles modifications sont apportées.
nl: De scoringformule kan in de toekomst wijzigen. Opendatasoft zal alle gebruikers in kennis stellen wanneer de berekeningswijze om de populariteit te bepalen, wijzigt.

source: The Popularity section is divided into 2 parts:
de: Der Bereich Beliebtheit ist in 2 Bereiche unterteilt:
es: La sección Popularidad se divide en 2 partes:
fr: La section Popularité se divise en 2 parties :
nl: De sectie Populariteit is onderverdeeld in 2 delen:

source: on the left, 2 bar charts:
de: auf der linken Seite befinden sich 2 Balkendiagramme:
es: A la izquierda, 2 gráficos de barras:
fr: à gauche, 2 histogrammes :
nl: links, 2 staafdiagrammen:

source: the top 5 most popular datasets
de: die 5 beliebtesten Datensätze
es: Los 5 conjuntos de datos más populares
fr: le top 5 des jeux de données les plus populaires
nl: de 5 meest populaire datasets

source: below, the top 5 least popular datasets
de: unten befinden sich die 5 am wenigsten beliebten Datensätze
es: Abajo, los 5 conjuntos de datos menos populares
fr: en dessous, le top 5 des jeux de données les moins populaires
nl: daaronder, de 5 minst populaire datasets

source: on the right, information about the popularity score of the selected dataset:
de: auf der rechten Seite sehen Sie Informationen zum Beliebtheitsgrad des ausgewählten Datensatzes:
es: A la derecha, información acerca de la puntuación de la popularidad del conjunto de datos seleccionado:
fr: à droite, des informations sur le score de popularité du jeu de données sélectionné :
nl: rechts, informatie over de populariteitsscore van de geselecteerde dataset:

source: Label of the selected dataset
de: Beschriftung des ausgewählten Datensatzes
es: Etiqueta del conjunto de datos seleccionado
fr: Label du jeu de données sélectionné
nl: Label van de geselecteerde dataset

source: Dataset ID: technical identifier of the selected dataset
de: Datensatz-ID: technische Kennung des ausgewählten Datensatzes
es: ID de conjunto de datos: Identificador técnico del conjunto de datos seleccionado
fr: ID du jeu de données : identifiant technique du jeu de données sélectionné
nl: Dataset-ID: technische identifier van de geselecteerde dataset

source: Metrics: number of downloads, API calls, and reuses (if any) for the selected dataset
de: Metriken: Anzahl der Downloads, Anzahl der API-Aufrufe und Anzahl der Weiterverwendungen (falls vorhanden) des ausgewählten Datensatzes
es: Métricas: Número de descargas, llamadas de API y reutilizaciones (si existen) para el conjunto de datos seleccionado
nl: Cijfers: aantal downloads, API-oproepen en hergebruiken (indien er zijn) voor de geselecteerde dataset

source: Popularity Score: popularity score of the selected dataset, computed with the metrics displayed above
de: Beliebtheitsgrad: der Beliebtheitsgrad des ausgewählten Datensatzes, der mit den oben gezeigten Metriken berechnet wurde
es: Puntuación de la popularidad: Puntuación de la popularidad del conjunto de datos seleccionado, calculada con las métricas visualizadas arriba
fr: Score de popularité : score de popularité du jeu de données sélectionné, calculé à l'aide des métriques présentées ci-dessus
nl: Populariteitsscore: populariteitsscore van de geselecteerde dataset, berekend op basis van de hierboven weergegeven cijfers

source: To display the popularity score information of a dataset:
de: Zur Anzeige des Beliebtheitsgrads eines Datensatzes:
es: Para visualizar la información de la puntuación de la popularidad de un conjunto de datos:
fr: Pour afficher les informations relatives au score de popularité d'un jeu de données :
nl: Om de informatie over de populariteitsscore van een dataset weer te geven:

source: In any of the charts, click a bar (representing a dataset).
de: Klicken Sie in einem der Diagramme auf einen Balken (der einen Datensatz darstellt).
es: En cualquiera de los gráficos, haga clic en una barra (que representa un conjunto de datos).
fr: Dans l'un des graphes, cliquez sur une barre (qui représente un jeu de données).
nl: Klik in een van de grafieken op een staaf (die een dataset vertegenwoordigt).

source: Check the right part of the Popularity section: the information of the selected dataset is automatically displayed.
de: Prüfen Sie die rechte Seite des Bereichs "Beliebtheit": Die Informationen zum ausgewählten Datensatz werden automatisch angezeigt.
es: Examine la parte derecha de la sección Popularidad: la información del conjunto de datos seleccionado se visualiza automáticamente.
nl: Controleer het rechterdeel van de populariteitssectie: de informatie over de geselecteerde dataset wordt automatisch weergegeven.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Click the "See more" button at the bottom of the Popularity section to see a column chart that displays the popularity score distribution over all published datasets on the domain.
de: Klicken Sie unten im Bereich Beliebtheit auf den Button "Mehr anzeigen": Sie sehen ein Säulendiagramm, das den Beliebtheitsgrad und die Verbreitung in allen veröffentlichten Datensätzen auf der Domain anzeigt.
es: Haga clic en el botón "Ver más" en la parte inferior de la sección Popularidad para ver un gráfico de columnas que visualiza la distribución de las puntuaciones de la popularidad en todos los conjuntos de datos publicados en el dominio.
fr: En bas de la section Popularité, cliquez sur le bouton "Voir plus" pour afficher un diagramme en colonne représentant la répartition du score de popularité pour tous les jeux de données publiés sur le domaine.
nl: Klik op de knop "Zie meer" onderaan de populariteitssectie om een kolomgrafiek te zien waarin de verdeling van de populariteitsscore over alle gepubliceerde datasets op het domein wordt weergegeven.

source: Top 5
es: Los cinco principales

source: Top 5 most downloaded published datasets, along with the current amount of downloads for each dataset
de: Die 5 am häufigsten heruntergeladenen veröffentlichten Datensätze sowie die aktuelle Anzahl der Downloads pro Datensatz
es: Los cinco conjuntos de datos publicados más descargados, junto con la cantidad actual de descargas para cada uno de los conjuntos de datos
fr: Le top 5 des jeux de données les plus téléchargés, ainsi que le nombre actuel de téléchargements de chaque jeu de données
nl: De 5 meest gedownloade gepubliceerde dataset, samen met het huidige aantal downloads voor elke dataset

source: API Calls
de: API-Aufrufe
es: Llamadas de API
fr: Appels d'API
nl: API-oproepen

source: Top 5 datasets with the most API calls, along with the current amount of API calls for each dataset
de: Die 5 Datensätze mit den meisten API-Aufrufen sowie die aktuelle Anzahl der API-Aufrufe für jeden Datensatz
es: Los cinco conjuntos de datos con más llamadas de API, junto con la cantidad actual de llamadas de API para cada uno de los conjuntos de datos
fr: Le top 5 des jeux de données avec le plus d'appels d'API , ainsi que le nombre actuel d'appels d'API de chaque jeu de données
nl: De 5 datasets met het grootste aantal API-oproepen, samen met het huidige aantal API-oproepen voor elke dataset

source: Top 5 datasets with the most reuses, along with the current amount of reuses for each dataset
de: Die 5 Datensätze mit den meisten Weiterverwendungen sowie die aktuelle Anzahl der Weiterverwendungen für jeden Datensatz
es: Los cinco conjuntos de datos con más reutilizaciones, junto con la cantidad actual de reutilizaciones para cada uno de los conjuntos de datos
fr: Le top 5 des jeux de données avec le plus de réutilisations, ainsi que le nombre actuel de réutilisations de chaque jeu de données
nl: De 5 datasets met het grootste aantal hergebruiken, samen met het huidige aantal hergebruiken voor elke dataset

source: Theme Distribution
de: Themenverteilung
es: Distribución de temas
fr: Répartition des thèmes
nl: Themaverdeling

source: The Theme Distribution section of the Data dashboard displays a tree chart representing all currently used dataset themes. This chart helps analyzing which themes are the most or the least used.
de: Der Bereich Themenverteilung des Daten-Dashboards zeigt ein Baumdiagramm mit allen derzeit verwendeten Datensatz-Themen. Anhand dieses Diagramms können Sie analysieren, welche Themen häufig oder selten genutzt werden.
es: La sección Distribución de temas del panel de datos muestra un gráfico de rectángulos que representa todos los temas de conjunto de datos usados actualmente. Este gráfico ayuda a analizar qué temas son los más o los menos utilizados.
fr: La section Répartition des thèmes du tableau de bord Données affiche une mosaïque représentant tous les thèmes de jeux de données actuellement utilisés. Cette mosaïque permet d'analyser les thèmes qui sont le plus utilisés ou ceux qui le sont le moins.
nl: De sectie Themaverdeling van het Data-dashboard geeft een boomdiagram weer dat alle datasetthema's die momenteel gebruikt worden, weergeeft. Deze diagram helpt te analyseren welke thema's het meest of het minst gebruikt worden.

source: Hover over a theme in the tree chart to display the average popularity score of the datasets which belong to that theme.
de: Bewegen Sie den Mauszeiger über ein Thema im Baumdiagramm, um den durchschnittlichen Beliebtheitsgrad der zu diesem Thema gehörenden Datensätze anzuzeigen.
es: Pase por encima de un tema en el gráfico de rectángulos para ver el promedio de puntuación de la popularidad de los conjuntos de datos que pertenecen a ese tema.
fr: Passez votre souris sur un thème de la mosaïque pour afficher le score de popularité moyen des jeux de données appartenant à ce thème.
nl: Glij over een thema in het boomdiagram om de gemiddelde populariteitsscore van de datasets die tot dat thema behoren, weer te geven.

source: Top 5: lists of most downloaded, used and reused published datasets
fr: Top 5 : listes des jeux de données publiés les plus téléchargés, les plus utilisés et les plus réutilisés

source: It is however possible, by clicking the buttons at the top of the dashboard, to choose to build the dashboard:
fr: Néanmoins, en cliquant sur les boutons en haut du tableau de bord, vous avez la possibilité de choisir des jeux de données spécifiques pour créer le tableau de bord :

source: with all existing published datasets (checked by default)
fr: Vous pouvez choisir tous les jeux de données publiés existants (cette option est sélectionnée par défaut).

source: only with the private datasets, meaning those in restricted access, no matter the restriction
fr: Vous pouvez choisir les jeux de données privés uniquement, c'est-à-dire des jeux de données avec un accès limité, quelle que soit la limitation.

source: or, only with the public datasets, meaning those accessible by everyone.
fr: Ou encore, vous pouvez choisir les jeux de données publics, c'est-à-dire ceux accessibles à tous.

source: Depending on which datasets are used to build the Data dashboard, the displayed figures, charts and analytics will vary.
fr: En fonction des jeux de données utilisés pour créer le tableau de bord Données, les chiffres, graphiques et statistiques affichés varient.

source: The Popularity section of the Data dashboard is based upon a computation aiming at quantifying dataset consumption in order to establish popularity scores for datasets. This computation is based on 3 metrics: number of downloads, number of API calls and number of reuses. These 3 metrics indicate whether a dataset published into an Opendatasoft portal can be considered popular or not, compared to the other datasets of both that portal and the Opendatasoft data network.
fr: La section Popularité du tableau de bord Données repose sur un calcul visant à quantifier l'utilisation des jeux de données, afin de déterminer des scores de popularité pour ces derniers. Ce calcul se base sur 3 métriques : le nombre de téléchargements, le nombre d'appels d'API et le nombre de réutilisations. Ces 3 métriques indiquent si un jeu de données publié dans un portail Opendatasoft peut être considéré comme populaire ou non par rapport aux autres jeux de données du portail concerné et au réseau de données Opendatasoft.
