Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/03_analyzing_domain_usage/analyzing_domain_activity.po
Languages: es, fr, it, nl

source: Analyzing domain activity
es: Analizar la actividad del dominio
fr: Analyser l'activité d'un domaine
it: Analisi dell'attività di un dominio
nl: De domeinactiviteit analyseren

source: Go to the *Analytics > Backoffice* page.
es: Vaya a la página *Análisis > Back office*.
fr: Accédez à la page *Statistiques > Back office*.
it: Fai clic su *Analytics > Back-office*.
nl: Ga naar de pagina *Analyse > Back-office*

source: Backoffice Analytics
es: Análisis del back office
fr: Statistiques du back office
it: Statistiche del back-office
nl: Analyse van de back-office

source: The Backoffice analytics allows the domain administrator to monitor domain configuration activity.
es: El análisis del back office permite al administrador del dominio supervisar la actividad de configuración del dominio.
fr: Les statistiques du back office permettent à l'administrateur du domaine de surveiller l'activité sur son domaine.
it: Le statistiche del back-office permettono agli amministratori di un dominio di monitorarne l'attività di configurazione.
nl: De analyse van de back-office laat de domeinbeheerder toe de configuratieactiviteit op het domein op te volgen.

source: There are seven indicators :
es: Hay 7 indicadores:
fr: Il y a sept indicateurs :
it: Sono disponibili sette indicatori:
nl: Er zijn zeven indicatoren:

source: **Actions**: Frequency and distribution of administrative actions (edit and publish datasets or pages, add users to the domain etc). Gives you precious information about what your users do and how they spend their time on the platform. Also remember that like with every charts on OpenDataSoft you can filter the variables displayed by clicking on the legend labels.
es: **Acciones**: Frecuencia y distribución de acciones administrativas (editar y publicar conjuntos de datos o páginas, añadir usuarios al dominio, etc.). Brinda información muy valiosa acerca de qué hacen los usuarios y a qué dedican su tiempo en la plataforma. Recuerde también que, al igual que con todos los gráficos de OpenDataSoft, puede filtrar las variables mostradas haciendo clic en las etiquetas de la leyenda.
it: **Azioni**: frequenza e distribuzione delle azioni di amministrazione (modifica o pubblicazione di pagine o dataset, aggiunta di utenti al dominio, ecc.). Fornisce preziose informazioni sui comportamenti degli utenti e sul modo in cui questi utilizzano la piattaforma. Ricorda anche che in ogni grafico OpenDataSoft puoi filtrare le variabili da visualizzare cliccando sulle etichette della legenda.
nl: **Acties**: frequentie en verdeling van administratieve acties (bewerken en publiceren van datasets of pagina's, toevoegen van gebruikers aan het domein, enz.). Verschaft u kostbare informatie over wat uw gebruikers doen en hoe ze hun tijd doorbrengen op het platform. Denk er ook aan dat, net zoals bij alle grafieken op OpenDataSoft u de weergegeven variabelen kan filteren door te klikken op de labels van de legende.

source: **Number of users**: Number of users that had an activity on the platform during the period.
es: **Número de usuarios**: Número de usuarios que han tenido una actividad en la plataforma durante el período.
fr: **Nombre d'utilisateurs** : nombre d'utilisateurs ayant réalisé des activités sur la plateforme au cours de la période.
it: **Numero di utenti**: numero degli utenti che hanno effettuato azioni sulla piattaforma durante il periodo.
nl: **Aantal gebruikers**: aantal gebruikers dat gedurende de periode een activiteit heeft gehad op het platform.

source: **Actions by users**: Number of actions by users during the period.
es: **Acciones realizadas por usuarios**: Número de acciones realizadas por los usuarios durante el período.
fr: **Actions par les utilisateurs** : nombre d'actions réalisées par les utilisateurs au cours de la période.
it: **Azioni degli utenti**: numero delle azioni effettuate dagli utenti durante il periodo.
nl: **Acties door gebruikers**: aantal acties door gebruikers gedurende de periode.

source: **Top 5 users**: Most active users during the period. Note that every user activity is broke down by action type.
es: **5 principales usuarios**: Los usuarios más activos durante el período. Tenga en cuenta que la actividad de los usuarios está desglosada por tipo de acción.
fr: **Top 5 utilisateurs** : utilisateurs les plus actifs au cours de la période. Notez que chaque activité d'un utilisateur est classée en fonction du type d'action.
it: **I primi 5 utenti**: utenti più attivi durante il periodo. L'attività di ogni utente è suddivisa in base al tipo di azione.
nl: **Top 5 gebruikers**: meest actieve gebruikers gedurende de periode. Gelieve te noteren dat elke gebruikersactiviteit onderverdeeld wordt per actietype.

source: **Top 5 modified datasets**: Most modified datasets. Those are the datasets that requested the more work.
es: **5 principales conjuntos de datos modificados**: Los conjuntos de datos más modificados. Son los conjuntos de datos que han solicitado más trabajo.
it: **I 5 dataset più modificati**: dataset che contano il maggior numero di modifiche. Sono quelli che hanno richiesto più lavoro.
nl: **Top 5 gewijzigde datasets**: meest gewijzigde datasets. Dit zijn de datasets die het meeste werk vergden.

source: **Top 5 pages**: Most modified pages. Those are the pages that requested the more work.
es: **5 principales páginas**: Las páginas más modificadas. Son las páginas que han solicitado más trabajo.
it: **Le prime 5 pagine**: pagine più modificate. Sono quelle che hanno richiesto più lavoro.
nl: **Top 5 pagina's**: meest gewijzigde pagina's. Dit zijn de pagina's die het meeste werk vergden.

source: **Distribution of actions**: Distribution of the activity based on the number of actions.
es: **Distribución de acciones**: Distribución de la actividad según el número de acciones.
fr: **Répartition des actions** : répartition de l'activité en fonction du nombre d'actions.
it: **Distribuzione delle azioni**: distribuzione dell'attività in base al numero di azioni.
nl: **Verdeling van acties**: verdeling van de activiteit op basis van het aantal acties.

source: Activity log dataset
es: Conjunto de datos de registro de actividad
fr: Journal d'activité
it: Registro attività del dataset
nl: Activiteitslog dataset

source: As in the other analytics pages, you can access the full activity log dataset at the bottom of the dashboard by clicking "See source data".
es: Como en las demás páginas de análisis, puede acceder al conjunto de datos de registro de actividad completo en la parte inferior del panel haciendo clic en "Ver datos de origen".
fr: Comme sur les autres pages de statistiques, vous pouvez accéder à l'intégralité du journal d'activité en cliquant sur le lien "Voir les données source" situé en bas du tableau de bord.
it: Come nelle altre pagine di statistiche, puoi accedere al registro attività del dataset cliccando su "Guarda dati di origine", nella parte inferiore del dashboard.
nl: Net zoals in de andere analysepagina's, kan u toegang krijgen tot de volledige activiteitslog dataset onderaan het dashboard door te klikken op "Zie brondata".

source: The activity log dataset contains the following fields.
es: El conjunto de datos de registro de actividad incluye los campos siguientes.
fr: Le journal d'activité contient les champs suivants.
it: Il registro attività del dataset contiene i seguenti campi:
nl: De activiteitslog dataset bevat de volgende velden:

source: Field name
es: Nombre de campo
fr: Nom du champ
it: Nome del campo
nl: Veldnaam

source: Description
es: Descripción
it: Descrizione
nl: Omschrijving

source: Action timestamp
es: Marca de tiempo de la acción
fr: Date et heure de l'action
it: Marca temporale dell'azione
nl: Tijdstempel van de actie

source: Domain ID
es: ID de dominio
fr: ID du domaine
it: ID del dominio
nl: Domein-ID

source: Identifier of the event owner
es: Identificador del propietario del evento
fr: Identifiant de l'utilisateur ayant fait l'action
it: Identificatore dell'utente che ha effettuato l'azione
nl: Identifier van de eigenaar van het evenement

source: Id of the dataset if the action is relative to a specific dataset
es: ID del conjunto de datos si es una acción relativa a un conjunto de datos específico
fr: Identifiant du jeu de données si l'action est relative à un jeu de données spécifique
it: ID del dataset se l'azione riguarda un dataset specifico
nl: ID van de dataset wanneer de actie betrekking heeft op een specifieke dataset

source: Name of the user the action has an effect on
es: Nombre del usuario sobre el cual tiene efecto la acción
fr: Nom de l'utilisateur affecté par l'action
it: Nome dell'utente su cui ricadono gli effetti dell'azione
nl: Naam van de gebruiker waarvoor de actie een gevolg heeft

source: Action name (one of **publish_dataset**, **add_dataset**, **edit_dataset**, **delete_dataset**)
es: Nombre de acción (valores posibles: **publish_dataset**, **add_dataset**, **edit_dataset** y **delete_dataset**)
fr: Nom de l'action (valeurs possibles: **publish_dataset**, **add_dataset**, **edit_dataset**, **delete_dataset**)
it: Nome dell'azione (uno tra **publish_dataset**, **add_dataset**, **edit_dataset**, **delete_dataset**)
nl: Naam van de actie (één van **publish_dataset**, **add_dataset**, **edit_dataset**, **delete_dataset**)

source: Identifier of the group concerned by the action
es: Identificador del grupo al cual afecta la acción
fr: Identifiant du groupe concerné par l'action
it: Identificatore del gruppo interessato dall'azione
nl: Identifier van de groep waarop de actie een invloed heeft

source: Identifier of the page concerned by the action
es: Identificador de la página a la cual afecta la acción
fr: Identifiant de la page concernée par l'action
it: Identificatore della pagina interessata dall'azione
nl: Identifier van de pagina waarop de actie een invloed heeft

source: Difference introduced by the action (for example a new permission added to a user)
es: Diferencia introducida por la acción (por ejemplo, un permiso nuevo añadido a un usuario)
it: Differenza introdotta dall'azione (ad esempio, un nuovo permesso aggiunto all'utente)
nl: Verschil geïntroduceerd door de actie (bijvoorbeeld een nieuwe toelating toegevoegd aan een gebruiker)

source: Identifier of the map
es: Identificador del mapa
fr: Identifiant de la carte
it: Identificatore della mappa
nl: Identifier van de kaart

source: Title of the reuse
es: Título de la reutilización
fr: Titre de la réutilisation
it: Titolo del riutilizzo
nl: Titel van het hergebruik

source: Identifier of the subdomain where the action was made
es: Identificador del subdominio en que se ha efectuado la acción
fr: Identifiant du sous-domaine sur lequel a été réalisée l'action
it: Identificatore del sottodominio in cui l'azione è stata effettuata
nl: Identifier van het subdomein waarin de actie werd uitgevoerd

source: **Actions**: Frequency and distribution of actions (analyze, geo, search) taken by users based on API calls. It gives you precious information about what your users do and how to serve them better. Remember that, like with every chart on Opendatasoft, you can filter the variables displayed (Analyze, Geo, or Search) by clicking on the legend labels.
fr: **Actions** : fréquence et répartition des actions (parmi la recherche, la géo et l'analyse) effectuées par les utilisateurs en fonction des appels d'API. Vous obtenez de précieuses informations sur ce que font vos utilisateurs et sur comment mieux répondre à leurs besoins. N'oubliez pas que, comme sur tous les graphes Opendatasoft, vous pouvez filtrer les variables présentées (Analyse, Géo ou Recherche) en cliquant sur la légende.

source: **Top 5 modified datasets**: Most modified datasets. Those are the datasets that requested more work.
fr: **Top 5 jeux de données modifiés** : jeux de données les plus modifiés. Il s'agit des jeux de données ayant demandé le plus de travail.

source: **Top 5 pages**: Most modified pages. Those are the pages that requested more work.
fr: **Top 5 pages** : pages les plus modifiées. Il s'agit des pages ayant demandé le plus de travail.

source: Difference introduced by the action (for example, a new permission added to a user)
fr: Différence découlant de l'action (par exemple, l'ajout d'une nouvelle permission pour un utilisateur)
