Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/03_analyzing_domain_usage/analyzing_actions_usage.po
Languages: de, es, fr, it, nl

source: Analyzing actions usage
de: Analysieren der Aktionsverwendung
es: Analizar el uso de las acciones
fr: Analyser l'usage par action
it: Analisi dell'utilizzo in base alle azioni
nl: Het gebruik van acties analyseren

source: Go to the *Analytics > Actions* page.
de: Wechseln Sie zur Seite *Analysen > Aktionen*.
es: Vaya a la página *Análisis > Acciones*.
fr: Allez sur la page *Statistiques > Actions*.
it: Fai clic su *Analytics > Azioni*.
nl: Ga naar de pagina *Analyse > Acties*

source: There are eight indicators :
de: Es gibt acht Indikatoren:
es: Hay 8 indicadores:
fr: Il y a huit indicateurs :
it: Sono disponibili otto indicatori:
nl: Er zijn acht indicatoren:

source: **Actions**: Frequency and distribution of actions (analyze, geo, search) taken by users based on API calls. It gives you precious information about what your users do and how to serve them better. Remember that, like with every chart on Opendatasoft, you can filter the variables displayed (Analyze, Geo, or Search) by clicking on the legend labels.
fr: **Actions** : fréquence et répartition des actions (parmi la recherche, la géo et l'analyse) effectuées par les utilisateurs en fonction des appels d'API. Vous obtenez de précieuses informations sur ce que font vos utilisateurs et sur comment mieux répondre à leurs besoins. N'oubliez pas que, comme sur tous les graphes Opendatasoft, vous pouvez filtrer les variables présentées (Analyse, Géo ou Recherche) en cliquant sur la légende.

source: **Total searches**: Number of times somebody searched for a dataset from the catalog or searched in a dataset.
fr: **Nombre de recherches** : nombre de fois où un utilisateur recherche un jeu de données dans le catalogue ou des données dans un jeu de données.

source: **Searches with no results**: Number of searches that return no results.
de: **Ergebnislose Suchen**: Anzahl der Suchen, für die keine Ergebnisse gefunden wurden.
es: **Búsquedas sin resultado**: Número de búsquedas que no han devuelto ningún resultado.
fr: **Recherches sans résultat** : nombre de recherches ne retournant aucun résultat.
it: **Ricerche senza risultato**: numero di ricerche che non hanno prodotto risultati.
nl: **Opzoekingen zonder resultaat**: aantal opzoekingen die geen resultaat hebben opgeleverd.

source: Note
fr: Remarque

source: A search can return no results for different reasons:
fr: Une recherche peut ne pas renvoyer de résultats pour différentes raisons :

source: There are not any resources that match the user's query.
fr: Aucune ressource ne correspond à la requête de l'utilisateur.

source: The user refines their search with facets and filters that lead to no results.
fr: L'utilisateur affine sa recherche avec des facettes et des filtres qui ne mènent à aucun résultat.

source: The user does not have the required permissions to see the content.
fr: L'utilisateur n'a pas les permissions obligatoires pour consulter le contenu.

source: **API call sources**: Distribution of the API call per page based on the number of API calls.
fr: **Provenance des appels API** : répartition des appels d'API par page, basée sur le nombre d'appels d'API.

source: **Text searches with no result**: Basically, those may be the data users expect to find on your portal.
fr: **Recherches textuelles sans résultat** : il s'agit essentiellement des données que vos utilisateurs s'attendent à trouver sur votre portail.

source: **Federated activity**: Percentage of API calls made on datasets added on other portals.
de: **Verbundaktivitäten**: Prozentsatz der API-Aufrufe von auf anderen Portalen hinzugefügten Datensätzen.
es: **Actividad federada**: Porcentaje de llamadas de API realizadas en conjuntos de datos añadidos a otros portales.
fr: **Activité fédérée** : pourcentage d'appels à l'API faits depuis un de vos jeux de données ajouté à un autre portail.
it: **Attività federata**: percentuale di chiamate API eseguite nei dataset aggiunti su altri portali.
nl: **Bijeengevoegde activiteit**: percentage API calls verricht op datasets die aan andere portalen zijn toegevoegd.

source: **Bot activity**: Percentage of API calls made by bot. Keep in mind that bots are often useful and can help make your data known to the world.
de: **Bot-Aktivität**: Prozentsatz der API-Aufrufe von Bots. Bedenken Sie, dass Bots oft nützlich sind und helfen können, Ihre Daten in der Welt bekannt zu machen.
es: **Actividad de Bot**: Porcentaje de llamadas de API realizadas por un bot. No olvide que los bots acostumbran a resultar útiles y pueden contribuir a dar a conocer sus datos al mundo.
fr: **Activité des robots** : pourcentage d'appels à l'API fait par des robots. Gardez à l'esprits que les robots sont le plus souvent utiles et contribuent à la popularité de vos données dans le monde.
it: **Attività del bot**: percentuale di chiamate API eseguite da bot. I bot si rivelano spesso utili e possono aiutare a diffondere i tuoi dati.
nl: **Bot-activiteit**: percentage API calls verricht door bots. Denk eraan dat bots vaak nuttig zijn en kunnen helpen om uw data kenbaar te maken aan de wereld.

source: **Distribution of errors**: Number and type of errors generated by failed API calls.
de: **Fehlerverteilung**: Anzahl und Typ der von fehlgeschlagenen API-Aufrufen generierten Fehler.
es: **Distribución de errores**: Número y tipo de errores generados por llamadas de API erróneas.
fr: **Distribution des erreurs** : nombre et type d'erreurs générées par des appels API ayant échoué.
it: **Distribuzione degli errori**: numero e tipologia degli errori generati da chiamate API non riuscite.
nl: **Verdeling van fouten**: aantal en type fouten die gegenereerd worden door mislukte API calls.

source: API calls Errors
de: API-Aufruffehler
es: Errores de llamadas de API
fr: Erreurs des appels à l'API
it: Errori nelle chiamate API
nl: API calls Fouten

source: In most cases, you won't be able to do anything. Anyway, we want to be transparent on your users' usage.
fr: Dans la plupart des cas, vous ne serez pas en mesure d'effectuer quoi que ce soit. Mais nous voulons être transparents sur l'utilisation de vos utilisateurs.

source: Error name
de: Fehlername
es: Nombre de error
fr: Nom de l'erreur
it: Nome dell'errore
nl: Naam van de fout

source: Error Description
de: Fehlerbeschreibung
es: Descripción del error
fr: Description de l'erreur
it: Descrizione dell'errore
nl: Omschrijving van de fout

source: This is a server error, we monitor it real time on our side to avoid it.
de: Das ist ein Serverfehler, den wir zur Vermeidung in Echtzeit überwachen.
es: Es un error del servidor que es supervisado por nuestra parte en tiempo real con objeto de evitarlo.
fr: C'est une erreur côté serveur. Nous surveillons ces erreurs en temps réel de notre côté pour les éviter.
it: Questo è un errore del server: per evitare questi inconvenienti, lo monitoriamo in tempo reale.
nl: Dit is een serverfout. We volgen deze aan onze kant in real time op om deze te vermijden.

source: The defined polygon filter on a geo-query is malformed. For example, it can be a self-crossing polygon like an hourglass.
fr: Le filtre polygonal d'une requête géographique est invalide. Par exemple cela peut être un polygone qui s'entrecoupe lui-même, comme un sablier.

source: It comes from a federated dataset. It may happen when you change the schema of a dataset when it is already federated on another portal. Always be careful when you update a dataset's schema.
de: Stammt von einem Verbunddatensatz und kann auftreten, wenn Sie das Schema eines bereits auf einem anderen Portal verbundenen Datensatzes ändern. Seien Sie beim Aktualisieren eines Datensatzschemas stets vorsichtig.
es: Procede de un conjunto de datos federado. Puede producirse al cambiar el esquema de un conjunto de datos que está federado en otro portal. Tenga cuidado siempre que actualice el esquema de un conjunto de datos.
fr: Cela provient d'un jeu de données fédéré. Cela peut arriver si vous changez le schéma d'un jeu de données alors qu'il a déjà été re-publié sur un autre portail. Soyez toujours vigilants en mettant à jour le schéma d'un jeu de données.
it: È un errore proveniente da un dataset federato. Può verificarsi nei casi in cui venga modificato lo schema di un dataset già federato su un altro portale. Fai sempre attenzione, quando aggiorni lo schema di un dataset.
nl: Deze is afkomstig van een bijeengevoegde dataset. Deze kan zich voordoen wanneer u het schema van een dataset wijzigt wanneer deze reeds is bijeengevoegd op een ander portaal. Wees altijd voorzichtig wanneer u het schema van een dataset updatet.

source: It may happen when you forget the dataset_id in the API console.
de: Kann auftreten, wenn Sie die dataset_id in der API-Konsole vergessen.
es: Puede producirse al olvidar especificar el ID de conjunto de datos en la consola de API.
fr: Cela peut arriver lorsque l'on oublie le dataset_id dans la console API.
it: Può verificarsi quando dimentichi di inserire il dataset_id nella console API.
nl: Deze kan zich voordoen wanneer u het dataset_id in de API console vergeet.

source: The dataset_id on the URL doesn't exist, or someone has tried to access a dataset without having the right.
fr: Le dataset_id dans l'URL n'existe pas ou alors quelqu'un a essayé d'accéder à un jeu de données alors qu'il n'en avait pas l'autorisation.

source: The search API is paginated with an offset and a response size. You can't access more than ~10k results. If you want more than 10k results, you'll probably want to use the download API.
fr: L'API de recherche est paginée grâce à un offset et à une taille de réponse. Vous ne pouvez pas accéder à plus de ~10k résultats. Si vous voulez accéder à plus de 10k résultats, il est préférable d'utiliser l'API de téléchargement.

source: **Actions**: Frequency and distribution of actions (analyze, geo, search) taken by users based on API calls. Gives you precious information about what your users do and how to better serve them. Also remember that like with every chart on OpenDataSoft you can filter the variables displayed (Analyze, Geo or Search) by clicking on the legend labels.
de: **Aktionen**: Häufigkeit und Verteilung der von Benutzern auf der Grundlage der API-Aufrufe gewählten Aktionen (Analyse, Geo, Suche). Liefert wertvolle Informationen über das Verhalten Ihrer Benutzer und darüber, wie Sie ihnen besser zu Diensten sein können. Vergessen Sie nicht, dass Sie die angezeigten Variablen (Analyse, Geo oder Suche) auch wie bei allen anderen Diagrammen auf OpenDataSoft durch Klick auf die Legendenbeschriftungen filtern können.
es: **Acciones**: Frecuencia y distribución de acciones (análisis, geografía, búsqueda) tomadas por usuarios a partir de llamadas de API. Brinda información muy valiosa acerca de qué hacen los usuarios y cómo puede atenderlos mejor. Recuerde también que, al igual que con todos los gráficos de OpenDataSoft, puede filtrar las variables mostradas (análisis, geografía o búsqueda) haciendo clic en las etiquetas de la leyenda.
it: **Azioni**: frequenza e distribuzione delle azioni degli utenti (analizza, geo, ricerca) in base alle chiamate API. Fornisce preziose informazioni sui comportamenti degli utenti e su come soddisfare al meglio le loro esigenze. Ricorda anche che, come per ogni grafico OpenDataSoft, puoi filtrare le variabili da visualizzare (Analizza, Geo o Ricerca) cliccando sulle etichette della legenda.
nl: **Acties**: Frequentie en spreiding van acties (analyseren, geo, zoeken) ondernomen door gebruikers op basis van API calls. Geeft u kostbare informatie over wat uw gebruikers doen en hoe u hen beter van dienst kan zijn. Denk er ook aan dat met elke grafiek op OpenDataSoft u de weergegeven variabelen (Analyseren, Geo of Zoeken) kan filteren door te klikken op de labels van de legende.

source: **Total searches**: Number of times somebody searched for a dataset from the catalog, or searched in a dataset.
de: **Suchen insgesamt**: Anzahl, wie oft jemand nach einem Datensatz aus dem Katalog bzw. in einem Datensatz gesucht hat.
es: **Total de búsquedas**: Número de veces que algún usuario ha buscado un conjunto de datos en el catálogo o ha buscado en un conjunto de datos.
it: **Ricerche totali**: numero di volte in cui qualcuno ha cercato un dataset nel catalogo o effettuato una ricerca all'interno di un dataset.
nl: **Totale zoekopdrachten**. Aantal keren dat iemand gezocht heeft naar een dataset vanuit de catalogus of gezocht heeft in een dataset.

source: **API call sources**: Distribution of the API call per page based on number of API calls.
de: **API-Aufrufquellen**: Verteilung der API-Aufrufe pro Seite basierend auf der Anzahl der API-Aufrufe.
es: **Orígenes de llamadas de API**: Distribución de llamadas de API por página según el número de llamadas de API.
it: **Origine delle chiamate API**: distribuzione delle chiamate API per pagina in base al numero di chiamate.
nl: **API call-bronnen**: verdeling van de API call per pagina gebaseerd op het aantal API calls.

source: **Text searches with no result**: Basically those may be the data users expect to find on your portal.
de: **Ergebnislose Textsuchen**: Im Prinzip können das die Daten sein, die Benutzer auf Ihrem Portal erwarten.
es: **Búsquedas de texto sin resultado**: En definitiva, estos pueden ser los datos que los usuarios esperan encontrar en su portal.
it: **Ricerche testuali senza risultato**: in sostanza, sono i dati che i tuoi utenti si attendono di trovare sul tuo portale.
nl: **Tekstzoekopdrachten zonder resultaat**: In essentie kunnen dit de data zijn die gebruikers verwachten terug te vinden op uw portaal.

source: In most cases you won't be able to do anything. Anyway we want to be transparent on your users' usage.
de: In den meisten Fällen können Sie nichts unternehmen, aber wir möchten die Verwendung Ihrer Benutzer trotzdem transparent machen.
es: Aunque en la mayoría de las ocasiones no podrá hacer nada, queremos ser transparentes en cuanto al uso de sus usuarios.
it: Nella maggior parte dei casi, non potrai farci nulla, ma vogliamo essere trasparenti sull'utilizzo da parte degli utenti.
nl: In de meeste gevallen kan u niets doen. In elk geval willen we transparant zijn betreffende het gebruik door gebruikers.

source: The defined polygon filter on a geo-query is malformed. For example it can be a self-crossing polygon like an hourglass.
de: Der in einer Geoanfrage definierte Polygonfilter ist fehlerhaft. Beispielsweise kann dies ein sich selbst kreuzendes Polygon wie eine Sanduhr sein.
es: El filtro de polígono definido en una consulta geográfica tiene un formato erróneo. Por ejemplo, puede ser un polígono entrecruzado como un reloj de arena.
it: Il filtro poligono definito nella query geografica non è valido. Ad esempio, potrebbe essere un poligono che si interseca al suo interno, come una clessidra.
nl: De gedefinieerde veelhoekfilter op een geo-zoekopdracht is slecht gevormd. Zo kan dit een zelfkruisende veelhoek zijn, zoals een zandloper.

source: The dataset_id on the URL doesn't exist or someone has tried to access a dataset without having the right.
de: Die dataset_id der URL existiert nicht oder jemand ohne entsprechende Berechtigungen hat versucht, auf einen Datensatz zuzugreifen.
es: El ID de conjunto de datos de la dirección URL no existe, o alguien ha intentado acceder a un conjunto de datos sin tener el derecho adecuado.
it: Il dataset_id presente nell'URL non esiste oppure qualcuno ha tentato di accedere al dataset senza i necessari permessi.
nl: Het dataset_id op de URL bestaat niet of iemand heeft geprobeerd om zich toegang te verschaffen tot een dataset zonder dat hij hier het recht toe had.

source: The search API is paginated with an offset and a response size. You can't access more than ~10k results. If you want more than 10k results you'll probably want to use the download API.
de: Die Such-API ist mit einem Versatz und einer Antwortgröße paginiert. Sie können nur auf ~10 Tsd. Ergebnisse zugreifen. Möchten Sie mehr als 10 Tsd. Ergebnisse, sollten Sie die Download-API verwenden.
es: La API de búsqueda está paginada con un desplazamiento y un tamaño de respuesta. No puede acceder a más de 10.000 resultados aproximadamente. Si necesita más de 10.000 resultados, probablemente le convenga utilizar la API de descarga.
it: La pagina dell'API di ricerca è impostata con un offset e una dimensione di risposta. Non puoi avere accesso a più di ~10.000 risultati: se desideri superare questo limite, è preferibile utilizzare l'API di download.
nl: De zoek-API wordt gepagineerd met een offset en een responsgrootte. U kan zich geen toegang verschaffen tot meer dan ~10k resultaten. Indien u meer dan 10k resultaten wil, zal u waarschijnlijk de download-API willen gebruiken.
