Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/03_analyzing_domain_usage/analyzing_data_usage.po
Languages: de, es, fr, nl

source: Metrics: number of downloads, API calls and reuses (if any) for the selected dataset
fr: Métriques : nombre de téléchargements, d'appels d'API et de réutilisations (le cas échéant) du jeu de données sélectionné

source: Check the right part of the Popularity section: the information of the selected dataset are automatically displayed.
fr: Consultez la partie droite de la section Popularité : les informations du jeu de données sélectionné s'affichent automatiquement.
