Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/03_analyzing_domain_usage/analyzing_dataset_usage.po
Languages: de, es, fr, it, nl

source: Analyzing dataset usage
de: Analysieren der Datensatznutzung
es: Analizar el uso de los conjuntos de datos
fr: Analyser l'utilisation des jeux de données
it: Analisi dell'utilizzo dei dataset
nl: Gebruik van datasets analyseren

source: Go to the *Catalog > Datasets* page. There is a *Monitoring* link for each dataset.
de: Wechseln Sie zur Seite *Katalog > Datensätze*. Hier gibt es für jeden Datensatz einen *Monitoring*-Link.
fr: Accédez à la page *Catalogue > Jeux de données*. Elle comprend un lien *Monitoring* pour chaque jeu de données.

source: There are seven indicators:
de: Es gibt sieben Indikatoren:
fr: Sept indicateurs existent :

source: **Actions**: Frequency and distribution of actions (analyze, geo, search) taken by users based on API calls. It gives you precious information about what your users do and how to serve them better. Remember that, like with every chart on Opendatasoft, you can filter the variables displayed (Analyze, Geo, or Search) by clicking on the legend labels.
de: **Aktionen**: Häufigkeit und Verteilung der von Benutzern auf der Grundlage der API-Aufrufe gewählten Aktionen (Analyse, Geo, Suche). Hier erhalten Sie wertvolle Informationen über das Verhalten Ihrer Benutzer und darüber, wie Sie ihnen besser zu Diensten sein können. Vergessen Sie nicht, dass Sie die angezeigten Variablen (Analyse, Geo oder Suche) auch wie bei allen anderen Diagrammen auf Opendatasoft durch einen Klick auf die Legendenbeschriftungen filtern können.
fr: **Actions** : fréquence et répartition des actions (parmi la recherche, la géo et l'analyse) effectuées par les utilisateurs en fonction des appels d'API. Vous obtenez de précieuses informations sur ce que font vos utilisateurs et sur comment mieux répondre à leurs besoins. N'oubliez pas que, comme sur tous les graphes Opendatasoft, vous pouvez filtrer les variables présentées (Analyse, Géo ou Recherche) en cliquant sur la légende.

source: **Total users**: Estimated number of unique users who interacted with the domain
de: **Benutzer insgesamt**: Geschätzte Anzahl der Einzelbenutzer, die mit der Domain interagiert haben.
es: **Total de usuarios**: Número estimado de usuarios exclusivos que han interactuado con el dominio.
fr: **Nombre total d'utilisateurs** : estimation du nombre d'utilisateurs uniques ayant interagi avec le domaine.
it: **Utenti totali**: stima del numero di utenti unici che hanno interagito con il dominio.
nl: **Totaal gebruikers**: geschatte aantal unieke gebruikers die interactie hebben met het domein

source: **API calls per user**: on average, API calls per user.
de: **API-Aufrufe pro Benutzer**: durchschnittliche API-Aufrufe je Benutzer.
fr: **Nombre d'appels d'API par utilisateur** : nombre moyen d'appels d'API par utilisateur.

source: **Total record searches**: Number of searches in the dataset
de: **Eintragssuchen insgesamt**: Anzahl der Suchen im Datensatz.
es: **Total de búsquedas de registros**: Número de búsquedas en el conjunto de datos.
fr: **Nombre total de recherches d'enregistrement** : nombre de recherches dans le jeu de données.
it: **Numero totale di ricerche dei record**: numero delle ricerche effettuate nel dataset.
nl: **Totaal aantal recordopzoekingen**: aantal zoekopdrachten in de dataset

source: **Text searches**
de: **Textsuchen**
es: **Búsquedas de texto**
fr: **Recherches textuelles**
it: **Ricerche testuali**.
nl: **Tekstopzoekingen**

source: **API call sources**: Distribution of the API call per page based on the number of API calls.
de: **API-Aufrufquellen**: Verteilung der API-Aufrufe pro Seite basierend auf der Anzahl der API-Aufrufe.
fr: **Provenance des appels API** : répartition des appels d'API par page, basée sur le nombre d'appels d'API.

source: **Map of API calls**: The map is based on the geolocation of IP addresses. It gives a good idea of the geographical distribution of usage. However, it can be quite imprecise and may yield false geolocations.
de: **Karte der API-Aufrufe**: Die Karte basiert auf der Geolokalisierung von IP-Adressen. Sie vermittelt eine gute Übersicht über die geografische Verteilung der Nutzung. Sie kann jedoch ziemlich ungenau sein und falsche Geolokalisierungen ergeben.
fr: **Carte des appels API** : la carte est basée sur la géolocalisation des adresses IP. Cela permet d'avoir un aperçu de la répartition de l'utilisation. Toutefois, cette technique peut manquer de précision et renvoyer de mauvaises géolocalisations.

source: Go to the *Catalog > Datasets* page. Then for each dataset there is a *Monitoring* link.
es: Vaya a la página *Catálogo > Conjuntos de datos*. A continuación aparece un vínculo *Supervisión* para cada uno de los conjuntos de datos.
it: Fai clic su *Catalogo > Dataset*. Ogni dataset presenta un link di *Monitoraggio*.
nl: Ga naar de pagina *Catalogus > Datasets*. Vervolgens is er voor elke dataset een *Monitoring*-koppeling.

source: There are seven indicators :
es: Hay 7 indicadores:
it: Sono disponibili sette indicatori:
nl: Er zijn zeven indicatoren:

source: **Actions**: Frequency and distribution of actions (analyze, geo, search) taken by users based on API calls. Gives you precious information about what your users do and how to better serve them. Also remember that like with every charts on OpenDataSoft you can filter the variables displayed (Analyze, Geo or Search) by clicking on the legend labels.
es: **Acciones**: Frecuencia y distribución de acciones (análisis, geografía, búsqueda) tomadas por usuarios a partir de llamadas de API. Brinda información muy valiosa acerca de qué hacen los usuarios y cómo puede atenderlos mejor. Recuerde también que, al igual que con todos los gráficos de OpenDataSoft, puede filtrar las variables mostradas (análisis, geografía o búsqueda) haciendo clic en las etiquetas de la leyenda.
it: **Azioni**: frequenza e distribuzione delle azioni degli utenti (analizza, geo, ricerca) in base alle chiamate API. Fornisce preziose informazioni sui comportamenti degli utenti e su come soddisfare al meglio le loro esigenze. Ricorda anche che in ogni grafico OpenDataSoft puoi filtrare le variabili da visualizzare (Analizza, Geo o Ricerca) cliccando sulle etichette della legenda.
nl: **Acties**: frequentie en verdeling van acties (analyseren, geo, zoeken) die ondernomen worden door gebruikers op basis van API calls. Verschaft u kostbare informatie over wat uw gebruikers doen en over hoe u hen nog beter van dienst kan zijn. Denk er ook aan dat, net zoals bij alle grafieken op OpenDataSoft u de weergegeven variabelen (Analyseren, Geo of Zoeken) kan filteren door te klikken op de labels van de legende.

source: **API calls per user**: on average API calls per users.
es: **Llamadas de API por usuario**: Promedio de llamadas de API efectuadas por los usuarios.
it: **Chiamate API per utente**: media delle chiamate API per utente.
nl: **API calls per gebruiker**: gemiddeld aantal API calls per gebruiker.

source: **API call sources**: Distribution of the API call per page based on number of API calls.
es: **Orígenes de llamadas de API**: Distribución de llamadas de API por página según el número de llamadas de API.
it: **Origine delle chiamate API**: distribuzione delle chiamate API per pagina in base al numero di chiamate.
nl: **API call-bronnen**: verdeling van de API call per pagina gebaseerd op het aantal API calls.

source: **Map of API calls**: The map is based on the geolocation of IP addresses. It gives a good idea of the geographical distribution of usage. Yet it can be quite imprecise and may yield false geolocations.
es: **Mapa de llamadas de API**: El mapa se basa en la geolocalización de direcciones IP. Da una buena idea de la distribución geográfica del uso. Con todo, puede ser bastante impreciso y generar geolocalizaciones falsas.
it: **Mappa delle chiamate API**: la mappa si basa sulla geolocalizzazione degli indirizzi IP. Consente di farsi un'idea della distribuzione geografica degli utilizzi. Tuttavia, pu√≤ contenere diverse imprecisioni e fornire geolocalizzazioni non corrette.
nl: **Kaart van API calls**: de kaart is gebaseerd op de geolocatie van IP-adressen. Ze geeft u een goed idee van de geografische verdeling van het gebruik. Wel kan ze vrij onnauwkeurig zijn en verkeerde geolocaties opleveren.
