Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_domain/03_analyzing_domain_usage/index.po
Languages: de, es, fr, nl

source: Monitoring a domain
de: Überwachen einer Domain
es: Supervisar un dominio
fr: Surveiller un domaine
nl: Een domein opvolgen

source: There are three main views to analyze your domain, trying to answer three different questions:
de: Es gibt drei Hauptansichten zur Analyse Ihrer Domain, die drei verschiedene Fragen beantworten sollen:
es: Hay 3 vistas principales para analizar el dominio, a fin de intentar responder estas 3 preguntas:
fr: Il y a trois vues principales pour analyser l'audience d'un domaine, répondant à trois questions :
nl: Er zijn drie belangrijke weergaves om uw domein te analyseren, waarbij geprobeerd wordt een antwoord te geven op drie verschillende vragen:

source: Users: who are the people using your data and with which intensity?
de: Benutzer: Wer nutzt Ihre Daten und mit welcher Intensität?
es: Usuarios: ¿Quiénes utilizan sus datos y con qué intensidad?
fr: Utilisateurs : qui sont les personnes qui utilisent vos données et avec quelle intensité ?

source: Data: what is the distribution of the popularity among your datasets?
de: Daten: Wie sieht die Beliebtheitsverteilung zwischen Ihren Datensätzen aus?
es: Datos: ¿Cuál es la distribución de la popularidad entre los conjuntos de datos?
fr: Données : quelle est la répartition de la popularité parmi vos jeux de données ?
nl: Data: wat is de verdeling van de populariteit onder uw datasets?

source: Actions: what are people looking to do with your data?
de: Aktionen: Was machen Benutzer mit Ihren Daten?
es: Acciones: ¿Qué operaciones realizan los usuarios con sus datos?
fr: Actions : que font vos utilisateurs avec vos données ?
nl: Acties: wat zijn de mensen van plan te doen met uw data?

source: **API Call.** The key measure of the monitoring is the API call. An API call is one request to the data. It can be made directly via the API or when using one of our services like displaying a map or an analysis. For example when you search for a keyword on a dataset, it generates one request, hence it counts as one API call.
de: **API-Aufruf.** Die Schlüsselmaßnahme der Überwachung ist der API-Aufruf. Ein API-Aufruf ist eine Anforderung an die Daten. Dies kann direkt über die API erfolgen oder durch die Nutzung eines unserer Dienste wie Anzeigen einer Karte oder Analyse. Wenn Sie z. B. nach einem Schlüsselwort in einem Datensatz suchen, generiert dies eine Anforderung und zählt daher als ein API-Aufruf.
es: **Llamada de API**. La medida clave para la supervisión es la llamada de API. Una llamada de API es una solicitud de datos. Se puede efectuar directamente a través de la API o mientras se utiliza alguno de nuestros servicios, como visualizar un mapa o un análisis. Por ejemplo, al buscar una palabra clave en un conjunto de datos, se genera una solicitud, que se contabiliza como una llamada de API.
fr: **Appel API.** La mesure clé de l'analyse de l'usage est l'appel d'API. Un appel d'API correspond à une requête sur les données. Il peut être fait directement via l'API ou en utilisant un de nos services comme afficher une carte ou une analyse. Par exemple, si vous cherchez un mot clé dans un jeu de données, cela génèrera une requête, et donc cela comptera comme un appel d'API.

source: In the Users and Actions view, you can select a period (default is the last week).
de: In den Ansichten Benutzer und Aktionen können Sie einen Zeitraum wählen (standardmäßig die letzte Woche).
es: En las vistas Usuarios y Acciones, puede seleccionar un período (el valor predeterminado es la última semana).
fr: Pour les pages Utilisateurs et Actions, vous pouvez sélectionner une période d'analyse (par défaut c'est la dernière semaine).
nl: In de weergave Gebruikers en Acties, kan u een periode selecteren (standaard is de afgelopen week).

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: If the domain has subdomains, a feature allowing the monitoring of these subdomains through the main domain's Analytics can be activated on demand. When this feature is activated, a "Select domain" filter is displayed at the top of the dashboard. In this filter, tick "Subdomains" to take them into account in the monitoring dashboards. Note that the monitoring of subdomains can only be available for the Users, Actions and Backoffice monitoring dashboards.
de: Verfügt die Domain über Subdomains, kann eine Funktion aktiviert werden, um diese Subdomains über die Analyse der Haupt-Domain zu überwachen. Ist diese Funktion aktiviert, wird oben im Dashboard der Filter "Domain auswählen" angezeigt. Markieren Sie in diesem Filter "Subdomains", um sie in den Überwachungs-Dashboards zu berücksichtigen. Beachten Sie, dass die Überwachung von Subdomains nur für die Überwachungs-Dashboards Benutzer, Aktionen und Backoffice verfügbar ist.
es: Si el dominio tiene subdominios, se puede activar una función que permita la supervisión de estos subdominios por medio del análisis del dominio principal bajo demanda. Cuando esta función está activada, aparece un filtro "Seleccionar dominios" en la parte superior del panel. En este filtro, marque "Subdominios" para tenerlos en cuenta en los paneles de supervisión. Tenga presente que la supervisión de los subdominios solo puede estar disponible para los paneles de supervisión Usuarios, Acciones y Back office.
fr: Si le domaine est composé de sous-domaines, vous pouvez activer à la demande une fonctionnalité de surveillance pour ces sous-domaines via la section Statistiques du domaine principal. Une fois cette fonctionnalité activée, un filtre "Sélection des domaines" s'affiche en haut du tableau de bord. Dans ce filtre, cochez "Sous-domaines" pour les prendre en compte dans les tableaux de bord de surveillance. Notez que la surveillance des sous-domaines est uniquement disponible pour les tableaux de surveillance Utilisateurs, Actions et Interface d'administration.

source: If the default KPIs and analysis are not enough for your needs, you can click on the "See source data" link at the bottom of the page. It allows you to get the whole dataset and do your own analyzis. There is a :doc:`documentation page </managing_domain/03_analyzing_domain_usage/analyzing_source_data>` describing the data.
de: Sollten die standardmäßigen Leistungskennzahlen (KPI, Key Performance Indicator) und Analysen Ihren Anforderungen nicht genügen, können Sie unten auf der Seite auf den Link "Quelldaten anzeigen" klicken. So können Sie den gesamten Datensatz erhalten und Ihre eigene Analyse durchführen. Die Daten werden auf einer :doc:`Dokumentationsseite </managing_domain/03_analyzing_domain_usage/analyzing_source_data>` beschrieben.
es: Si los análisis e indicadores KPI predeterminados no son suficientes para sus necesidades, puede hacer clic en el vínculo "Ver datos de origen" en la parte inferior de la página. Con ello podrá obtener todo el conjunto de datos y realizar su propio análisis. En una :doc:`página de la documentación </managing_domain/03_analyzing_domain_usage/analyzing_source_data>` se describen los datos.
fr: Si les KPI et analyses par défaut ne correspondent pas à vos besoins, vous pouvez cliquer sur le lien "Voir les données" en bas de la page. Vous serez alors redirigé vers le jeu de données complet et pourrez effectuer vos propres analyses. Il y a une :doc:`page de documentation </managing_domain/03_analyzing_domain_usage/analyzing_source_data>` qui décrit les données.

source: Please note that the dataset includes usage data for **at least** the **3 last months**. Older data are archived within the limits indicated by the law and our terms of use.
de: Bitte beachten Sie, dass der Datensatz Nutzungsdaten für **mindestens** die **letzten 3 Monate** enthält. Ältere Daten werden innerhalb der gesetzlich und in unseren Nutzungsbedingungen festgelegten Fristen archiviert.
es: Tenga en cuenta que el conjunto de datos incluye los datos de uso de **como mínimo** los **3 últimos meses**. Los datos anteriores se archivan dentro de los límites estipulados por la legislación y nuestros términos de uso.
fr: Notez que ce dataset comprend les données sur **au moins** les **3 derniers mois**. Les données plus anciennes sont archivées dans les limites imposées par la loi et nos conditions d'utilisation.

source: Users: who are the people using your data, and with which intensity?
nl: Gebruikers: wie zijn de mensen die uw data gebruiken en met welke intensiteit?

source: **API Call.** The key measure of the monitoring is the API call. An API call is one request to the data. It can be made directly via the API or when using one of our services, like displaying a map or an analysis. For example, when you search for a keyword on a dataset, it generates one request; hence it counts as one API call.
nl: **API call** De belangrijkste maatstaf om uw domein op te volgen is de API call. Een API call is één aanvraag voor de data. Deze kan rechtstreeks gedaan worden via de API of door één van onze diensten te gebruiken, zoals het weergeven van een kaart of een analyse. Bijvoorbeeld: wanneer u een trefwoord zoekt op een dataset, genereert dit één aanvraag, en wordt dit meegeteld als één API call.

source: If the domain has subdomains, a feature allowing the monitoring of these subdomains through the main domain's Analytics can be activated on demand. When this feature is activated, a "Select domain" filter is displayed at the top of the dashboard. In this filter, tick "Subdomains" to take them into account in the monitoring dashboards. Note that the monitoring of subdomains can only be available for the Users, Actions, and Backoffice monitoring dashboards.
nl: Wanneer het domein subdomeinen heeft, kan een functie op aanvraag worden geactiveerd om deze subdomeinen te monitoren via Analytics van het hoofddomein. Wanneer deze functie is geactiveerd, wordt een filter "Selecteer domein" weergegeven bovenaan het dashboard. Vink in deze filter "Subdomeinen" aan zodat er rekening mee kan worden gehouden bij het monitoren van dashboards. Merk op dat het monitoren van subdomeinen enkel beschikbaar kan zijn voor de Users, Actions and Backoffice monitoring dashboards.

source: If the default KPIs and analysis are not enough for your needs, you can click on the "See source data" link at the bottom of the page. It allows you to get the whole dataset and do your own analysis. There is a :doc:`documentation page </managing_domain/03_analyzing_domain_usage/analyzing_source_data>` describing the data.
nl: Wanneer de standaard KPI's en analyses niet voldoende zijn voor uw noden, kunt u klikken op de link "Zie brongegevens" onderaan de pagina. Hiermee krijgt u de volledige dataset en kunt u uw eigen analyse doen. Er is :doc:`documentatiepagina </managing_domain/03_analyzing_domain_usage/analyzing_source_data>` waarin de gegevens staan beschreven.

source: The dataset includes usage data for **at least** the **3 last months**. Older data are archived within limits indicated by the law and our terms of use.
nl: Gelieve te noteren dat de dataset gebruiksdata omvat voor **minstens** de **laatste 3 maanden**. Oudere data worden gearchiveerd binnen de limieten die bij wet en door onze gebruiksvoorwaarden zijn opgelegd.
