Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/07_designing_responsive_portal/responsive.po
Languages: de, es, fr, it, nl

source: Like many websites, OpenDataSoft's portal uses a grid layout to position elements. A grid is the intersection of rows and columns of pre-defined width, which will be used to position elements within a layout. This very common design tool as been adapted to webdesign first using tables and soon thereafter using standard ``div`` elements.
de: Wie viele Websites nutzt auch das Portal OpenDataSoft eine Rasteranordnung, um Elemente zu positionieren. Unter einem Raster versteht man die Verknüpfung von Zeilen und Spalten mit vordefinierter Breite, die zum Positionieren von Elementen innerhalb eines Layouts verwendet wird. Dieses sehr gängige Entwicklungstool wurde für das Webdesign angepasst, indem es zunächst Tabellen nutzte und bald darauf Standard-"div"-Elemente.
es: Como muchos sitios web, el portal de OpenDataSoft utiliza un diseño de cuadrícula para colocar los elementos. Una cuadrícula es una intersección de filas y columnas con un ancho predefinido, que se utilizará para disponer los elementos en un diseño. Esta herramienta de diseño de uso frecuente se ha adaptado al diseño web, primero mediante tablas y poco después con elementos ``div`` estándar.
fr: Le portail OpenDataSoft utilise une disposition en grille pour positionner les éléments. Une grille est une intersection de lignes et colonnes aux dimensions prédéfinies qui seront utilisées pour positionner les éléments dans la grille. Cet outil de design a été adapté au design Web en utilisant en premier lieu des tableaux et ensuite en utilisant des éléments "div".
it: Come molti altri siti web, il portale OpenDataSoft si serve di un layout a griglia per posizionare i propri elementi. Una griglia è uno spazio di intersezione tra righe e colonne di larghezza predefinita, all'interno del quale vengono collocati gli elementi di un determinato layout. Utilizzato abitualmente nel campo della progettazione, questo strumento è stato adattato al web design prima con l'uso delle tabelle e in seguito ricorrendo agli elementi ``div`` standard.
nl: Zoals dit het geval is bij vele websites, gebruikt het portaal van OpenDataSoft een rooster lay-out voor positie-elementen. Een rooster is een intersectie van rijen en kolommen met een vooraf gedefinieerde breedte die gebruikt zal worden voor positie-elementen binnen een lay-out. Deze vaak gebruikte ontwerptool werd aangepast voor webdesign door eerst tabellen te gebruiken en door snel daarna standaard "div"-elementen te gebruiken.

source: If you are already familiar with the whole concept of grid layouts, suffice-it to say that OpenDataSoft's grid system is largely based on `Bootstrap CSS framework <http://getbootstrap.com/css/#grid>`_. You can see the list of `Available classes`_ below.
de: Falls Sie bereits mit dem gesamten Konzept der Rasteranordnungen vertraut sind, genügt an dieser Stelle der Hinweis, dass das Rastersystem von OpenDataSoft hauptsächlich auf dem `Bootstrap CSS Framework <http://getbootstrap.com/css/#grid>`_ basiert. Im Anschluss finden Sie die Liste der `Verfügbare Klassen`_.
es: Si ya está familiarizado con el concepto global de los diseños de cuadrícula, basta decir que el sistema de cuadrículas de OpenDataSoft se basa ampliamente en el `marco CSS de Bootstrap <http://getbootstrap.com/css/#grid>`_. Puede consultar la lista de `clases disponibles`_ a continuación.
fr: Si vous êtes familier avec le concept des dispositions en grille, il suffit de savoir que le systeme de grille OpenDataSoft est basé sur le `framework Bootstrap CSS <http://getbootstrap.com/css/#grid>`_. Vous pouvez voir la liste des `Classes disponibles`_ ci-dessous.
it: Se il concetto di layout a griglia ti è già familiare, ti basterà sapere che il sistema adottato da OpenDataSoft si basa sul `framework CSS Bootstrap <http://getbootstrap.com/css/#grid>`_. In fondo alla pagina trovi l'elenco delle `classi disponibili`_.
nl: Indien u reeds vertrouwd bent met het volledige concept van rooster lay-outs, volstaat het om te zeggen dat het roostersysteem van OpenDataSoft grotendeels gebaseerd is op het `Bootstrap CSS-kader <http://getbootstrap.com/css/#grid>`_. U kan de lijst met `Beschikbare klassen`_ hieronder terugvinden.

source: Concepts and terminology
de: Konzepte und Terminologie
es: Conceptos y terminología
fr: Concepts et terminologie
it: Concetti e terminologia
nl: Concepten en terminologie

source: OpenDataSoft grid layout is a 12-column layout, which means that grid cells can span 1 to 12 columns at once.
de: Die OpenDataSoft-Rasteranordnung besteht aus einem 12-Spalten-Layout, d. h. die Rasterzellen können 1 bis 12 Spalten auf einmal umfassen.
es: El diseño de cuadrícula de OpenDataSoft es un diseño de 12 columnas, lo que significa que las celdas de la cuadrícula pueden abarcar de 1 a 12 columnas a la vez.
fr: La disposition en grille OpenDataSoft est une grille de 12 colonnes, ce qui signifie que les cellules de la grille peuvent s'étendre de 1 à 12 colonnes à la fois.
it: Il layout a griglia di OpenDataSoft è composto da 12 colonne, perciò le celle possono comprendere da 1 a 12 colonne alla volta.
nl: De roosterlay-out van OpenDataSoft is een lay-out die uit 12 kolommen bestaat. Dit betekent dat roostercellen zich in één keer kunnen uitstrekken over 1 tot 12 kolommen.

source: A grid layout relies on 3 types of elements: containers, rows and columns. Containers define the overall width of the layout, rows group together cells and columns are one-twelfth of the container's width. As a result, cells are defined by the number of columns they span and are nested within rows, which themselves are nested within containers.
de: Eine Rasteranordnung besteht aus 3 Element-Typen: Zellenkästen, Zeilen und Spalten. Die Zellenkästen bestimmen die Gesamtbreite des Layouts, die Zeilen ordnen die Zellen und die Spalten stellen ein Zwölftel der Zellenkastenbreite dar. Somit werden die Zellen über die Spaltenanzahl definiert, die sie umfassen, und sind in Zeilen verschachtelt, die wiederum in Zellenkästen verschachtelt sind.
es: Un diseño de cuadrícula se fundamenta en 3 tipos de elementos: contenedores, filas y columnas. Los contenedores definen el ancho global del diseño, las filas agrupan las celdas, y las columnas ocupan una doceava parte del ancho del contenedor. En consecuencia, las celdas se definen por el número de columnas que abarcan y se anidan en filas, que a su vez se anidan en contenedores.
fr: Une disposition en grille contient 3 types d'éléments : des conteneurs, des lignes et des colonnes. Les conteneurs définissent la largeur totale de la grille, les lignes regroupent les cellules et les colonnes font 1/12e de la largeur d'un conteneur. Ainsi, les cellules sont définies par le nombre de colonnes sur lesquelles elles s'étendent, sont contenues dans des lignes, qui sont elles-mêmes contenues dans des conteneurs.
it: Un layout a griglia è composto da 3 tipi di elementi: i contenitori, le righe e le colonne. I contenitori definiscono la larghezza totale del layout, le righe raggruppano le celle e le colonne occupano 1/12 della larghezza del contenitore. Di conseguenza, le celle sono definite dal numero di colonne su cui si dispongono e sono contenute all'interno di righe, a loro volta comprese in contenitori.
nl: Een roosterlay-out berust op 3 types elementen: containers, rijen en kolommen. Containers definiëren de globale breedte van de lay-out, rijen groeperen cellen samen en kolommen zijn één twaalfde van de breedte van de container. Als gevolg hiervan worden cellen gedefinieerd door het aantal kolommen dat ze overspannen en die genest zijn in rijen, die op hun beurt weer genest zijn in containers.

source: Translated into html code:
de: In HTML-Code übersetzt:
es: Convertido en código html:
fr: Soit en code html :
it: Tradotto in codice HTML:
nl: Vertaald in HTML-code:

source: Will render as (colors and labels added via CSS specifically for these examples):
de: Folgendes Rendering (Farben und Beschriftungen speziell für diese Beispiele mit CSS hinzugefügt):
es: La presentación será la siguiente (con colores y etiquetas añadidas por medio de CSS específicamente para estos ejemplos):
fr: Sera affiché comme (les couleurs et les labels sont ajoutés spécifiquement par CSS pour ces exemples) :
it: Il risultato sarà il seguente (in questi esempi, i colori e le etichette sono aggiunti tramite CSS):
nl: Zal weergegeven worden als (kleuren en labels toegevoegd via CSS specifiek voor die voorbeelden):

source: You can of course specify cells covering less than 12 columns, in which case there will be remaining white space at the end. In the case they cover more than 12 columns, the cells would wrap and create a new line within the row.
de: Selbstverständlich können Sie auch Zellen definieren, die weniger als 12 Spalten abdecken. In diesem Fall bleibt Leerraum am Ende übrig. Wenn die Zellen mehr als 12 Spalten abdecken, werden sie umgebrochen und es wird eine neue Zeile in der Spalte erstellt.
es: Por supuesto, puede especificar celdas que abarquen menos de 12 columnas; en ese caso quedará espacio en blanco al final. Si abarcan más de 12 columnas, las celdas se ajustan y se crea una línea nueva en la fila.
fr: Vous pouvez bien sur spécifier des cellules qui couvrent moins de 12 colonnes. Dans ce cas, il y aura un espace blanc à la fin. Si les cellules couvrent plus de 12 colonnes, elle seront alors renvoyées à la ligne et crééront une nouvelle ligne.
it: Naturalmente è possibile distribuire le celle in meno di 12 colonne, lasciando così uno spazio bianco alla fine. Nel caso in cui le celle occupino invece più di 12 colonne, verrà creata una nuova linea all'interno della riga.
nl: U kan vanzelfsprekend cellen specificeren die zich uitstrekken over minder dan 12 kolommen. In dit geval zal er op het einde een witte ruimte overblijven. Ingeval ze zich uitstrekken over meer dan 12 kolommen, zouden de cellen inpakken en een nieuwe lijn binnen de rij aanmaken.

source: Hence, this:
de: Somit entsteht
es: En consecuencia, esto:
fr: Ainsi, ceci :
it: Questo è il codice HTML:
nl: Vandaar, dit:

source: Will render as this:
de: folgendes Rendering:
es: Se presentará del modo siguiente:
fr: Sera affiché comme cela :
it: E questo il risultato:
nl: Zal worden weergegeven als dit:

source: Responsive grid layouts
de: Responsive Rasteranordnungen
es: Diseños de cuadrícula con capacidad de respuesta
fr: Les dispositions en grille responsive.
it: Layout a griglia responsivi
nl: Responsieve rooster lay-outs

source: In webdesign, *responsive layout* means that the layout will adapt to the width of the screen it is displayed on. To be even more precise, it responds to the width of the viewport of the device, that is the space available for rendering, that is the width of the browser's window.
de: Im Webdesign bedeutet ein "responsives Layout", dass sich bei der Anzeige das Layout der Größe des jeweiligen Bildschirmes proportional anpassen kann. Genauer genommen passt es sich der Breite des Anzeigebereichs des Geräts an. Der Anzeigebereich ist der für das Rendering zur Verfügung stehende Bereich, d. h. die Breite des Browserfensters.
es: En diseño web, el *diseño con capacidad de respuesta* significa que el diseño se adapta al ancho de la pantalla en que se visualiza. Más concretamente, responde al ancho de la ventanilla del dispositivo, es decir, el espacio disponible para la presentación o el ancho de la ventana del explorador.
fr: En design Web, une disposition responsive signifie que la disposition de la page s'adaptera à la largeur de l'écran. Plus précisément, elle s'adaptera à la largeur du `viewport`, c'est à dire, l'espace disponible pour l'affichage qui est la largeur de la fenêtre du navigateur.
it: Nel web design, quando si parla di *layout responsivo* si indica un layout in grado di adattarsi alla larghezza dello schermo su cui viene visualizzato. Per essere più precisi, il layout responsivo si adegua alla larghezza del viewport del dispositivo, cioè allo spazio disponibile per la visualizzazione o, in altri termini, la larghezza della finestra del browser.
nl: In webdesign betekent "responsieve lay-out" dat de lay-out aangepast zal worden aan de breedte van het scherm waarop deze wordt weergegeven. Om nog nauwkeuriger te zijn, reageert deze op de breedte vanuit het oogpunt van het toestel, zijnde de ruimte die beschikbaar is om weer te geven, zijnde de breedte van het venster van de browser.

source: Responsive layouts work by defining *breakpoints*, widths in pixels marking levels at which the layout will change. Within the OpenDataSoft's platform, 3 breakpoints (defining 4 modes) are defined and can be :ref:`customized through the theme <theme__layout-options>`. These modes are *extra-small*, *small*, *medium* and *large* (also refered to as *mobile*, *tablet*, *desktop* and *large desktop*).
de: Für responsive Layouts werden *Breakpoints* definiert, d. h. Breiten in Pixel, die Grenzen festlegen, ab denen das Layout sich ändert. Auf der OpenDataSoft-Plattform sind 3 Breakpoints (mit 4 definierten Modi) definiert: :ref:`customized through the theme <theme__layout-options>`. Diese Modi lauten *extra-klein*, *klein*, *mittel* und *groß* (entsprechend *Mobiles Endegerät*, Tablet*, *Desktop* und *großer Desktop*).
es: Los diseños con capacidad de respuesta funcionan definiendo *puntos de interrupción*, anchos en píxeles que señalan los niveles en que cambiará el diseño. En la plataforma OpenDataSoft, se definen 3 puntos de interrupción (que definen 4 modos) que se pueden :ref:`personalizar a través del tema <theme__layout-options>`. Estos modos son: *muy pequeño*, *pequeño*, *mediano* y *grande* (denominados también *móvil*, *tableta*, *escritorio* y *escritorio grande*).
fr: Les dispositions en grilles fonctionnent grâce à la définition de points de rupture, ce sont des largeurs en pixels qui définissent à quel moment la disposition va changer. Sur la plateforme OpenDataSoft, 3 points de rupture (soit 4 modes) sont utilisés et peuvent être :ref:`modifiés sur la page Theme <theme__layout-options>`. Ces mides sont *extra-small*, *small*, *medium* et *large* (on utilise parfois *mobile*, *tablet*, *desktop* et *large desktop*).
it: I layout responsivi si basano sulla definizione dei *breakpoint*, cioè soglie di larghezza (in pixel) al di là delle quali il layout dovrà cambiare. La piattaforma OpenDataSoft consente di impostare 3 breakpoint (e quindi 4 modalità di visualizzazione), che possono essere :ref:`personalizzati nella pagina dedicata ai temi<theme__layout-options>`. Le modalità disponibili sono: *molto piccolo*, *piccolo*, *medio* e *grande* (denominate anche: *smartphone*, *tablet*, *desktop* e *desktop grande*).
nl: Responsieve lay-outs werken door het definiëren van *breekpunten*, breedtes in pixels die niveaus aangeven waarbij de lay-out zal wijzigen. Binnen het platform van OpenDataSoft worden 3 breekpunten (waarbij 4 modi worden gedefinieerd) gedefinieerd en deze kunnen de volgende zijn :ref:`gepersonaliseerd via het thema <theme__layout-options>`. Deze modi zijn *extra klein*, *klein*, *middelgroot* en *groot* (waarnaar ook verwezen wordt als *mobiel*, *tablet*, *desktop* en *grote desktop*).

source: A grid layout is designed for a given window width but can quite quickly become unsuited for other screen formats. For example, a very detailed 12 columns layout will render terribly on a tiny screen, all content being crammed into tiny cells each taking one-twelfth of the little space available. We'd like instead to have the layout reorganize itself when it changes mode.
de: Eine Rasteranordnung ist für eine bestimmte Bildschirmbreite ausgelegt, sie kann für andere Bildschirmformate jedoch schnell unpassend werden. So kann etwa ein genau detailliertes 12-Spalten-Layout auf einem kleinen Bildschirm sehr unübersichtlich wirken, da der gesamte Content in sehr kleine Zellen hineingezwängt wird, die jeweils ein Zwölftel des geringen zur Verfügung stehenden Raumes einnehmen.
es: Un diseño de cuadrícula está pensado para un ancho de ventana determinado, pero rápidamente puede resultar inapropiado para otros formatos de pantalla. Por ejemplo, un diseño muy detallado de 12 columnas tendrá una presentación pésima en una pantalla minúscula, con todo el contenido apiñado en minúsculas celdas de una doceava parte del poco espacio disponible. Por contra, queremos que el diseño se reorganice cuando el modo cambie.
fr: Une disposition en grille est conçue pour une largeur de fenêtre déterminée mais peut être inadaptée pour d'autres formats d'écran. Par exemple, une disposition 12-colonnes va s'afficher très mal sur un petit écran. Tout le contenu sera inséré dans des petites cellules faisant 1/12e du petit espace disponible. On préfère ainsi avoir une disposition qui se réorganise au changement de mode.
it: Il layout a griglia è studiato per finestre dotate di una determinata larghezza e può facilmente risultare inadeguato su schermi dal formato diverso. Ad esempio, la visualizzazione molto dettagliata di un layout a 12 colonne darà effetti disastrosi su un piccolo schermo, perché lo spazio limitato a disposizione verrà diviso in 12 parti, schiacciando tutto il contenuto all'interno di celle minuscole. L'ideale è invece che il layout venga riorganizzato a ogni cambio di modalità.
nl: Een rooster lay-out wordt ontworpen voor een welbepaalde vensterbreedte, maar kan vrij snel ongeschikt worden voor andere schermformaten. Bijvoorbeeld, een zeer gedetailleerde lay-out in 12 kolommen zal zeer slecht weergegeven worden op een klein scherm, waarbij alle inhoud in kleine cellen wordt gepropt en elk één twaalfde van de kleine beschikbare ruimte in beslag nemen. In plaats daarvan zouden we willen dat de lay-out zichzelf reorganiseert wanneer deze van modus wijzigt.

source: You may have noticed in the code snippets above that the class names for the cells ``<div class="col-xs-6">col-6</div>`` include a little ``xs`` right before the number of columns the cell should span. This tells the browser that in *extra-small* mode, the cell should span 6 of the 12 super-tiny columns. We can however add classes specifying how we'd like the layout to behave in other modes. For example:
de: Ihnen ist eventuell bei den oben genannten Codeschnipseln aufgefallen, dass in den Klassennamen für die Zellen ``<div class="col-xs-6">col-6</div>`` ein kleines "xs" vor der Anzahl der Spalten steht, die die Zelle umfassen kann. In diesem Beispiel handelt es sich um eine Information an den Browser, dass die Zelle im *extra-kleinen* Modus 6 der 12 ganz kleinen Spalten umfassen kann. Wir können jedoch Klassen hinzufügen, die spezifizieren, wie sich das Layout in anderen Modi verhält. Ein Beispiel:
es: Puede que haya observado en los fragmentos de código anteriores que los nombres de clase de las celdas ``<div class="col-xs-6">col-6</div>`` contienen ``xs`` justo antes del número de columnas que debe abarcar la celda. Esto indica al explorador que, en modo *muy pequeño*, la celda debe abarcar 6 de las 12 superminúsculas columnas. Sin embargo, podemos añadir clases especificando cómo deseamos que se comporte el diseño en otros modos. Por ejemplo:
fr: Vous avez peut-être remarqué que les extraits de code au dessus des noms de classes pour les cellules ``<div class="col-xs-6">col-6</div>`` contiennent un petit ``xs`` juste avant le nombre de colonnes sur lequel la cellule doit s'étendre. Cela indique aux navigateurs que dans le mode *extra-small*, cette cellule doit s'étendre sur 6 des 12 minuscules colonnes. Pour autant, on peut ajouter des classes spécifiques pour les autres modes. Par exemple :
it: Nei ritagli di codice mostrati precedentemente avrai notato che i nomi delle classi di ogni cella ``<div class="col-xs-6">col-6</div>`` includono un piccolo ``xs`` subito prima del numero di colonne impostato. Tale informazione indica al browser che nella modalità *molto piccolo* la cella deve distribuirsi solo su 6 colonne, anziché 12. È comunque possibile inserire classi aggiuntive che specifichino il comportamento da adottare in altre modalità. Ad esempio:
nl: In de bovenstaande code snippets heeft u misschien opgemerkt dat de namen van de klasse voor de cellen ``<div class="col-xs-6">col-6</div>`` een kleine ``xs`` omvatten net voor het aantal kolommen dat de cel zou moeten overspannen. Hiermee wordt aan de browser gezegd dat in de modus *extra klein*, de cel 6 van de 12 superkleine kolommen zou moeten overspannen. We kunnen evenwel klassen toevoegen die specificeren hoe we zouden willen dat de lay-out zich gedraagt in andere modi. Bijvoorbeeld:

source: This way the cell will span 6 columns in extra-small mode, 4 in small mode, 2 in medium mode and only 1 in large mode.
de: Hier umfasst die Zelle 6 Spalten im extra-kleinen Modus, 4 im kleinen Modus, 2 im mittleren Modus und nur 1 im großen Modus.
es: De este modo, la celda abarcará 6 columnas en modo muy pequeño, 4 en modo pequeño, 2 en modo mediano y 1 sola en modo grande.
fr: Ainsi, une cellule s'étendra sur 6 colonnes dans mode *extra-small*, sur 4 en mode *small*, sur 2 en mode *medium* et seulement sur 1 en mode *large*.
it: In questo modo, la cella verrà distribuita su 6 colonne nella modalità "molto piccolo", su 4 nella modalità "piccolo", su 2 nella modalità "medio" e solo su 1 nella modalità "grande".
nl: Op deze manier zal de cel 6 kolommen in extra kleine modus overspannen, 4 in kleine modus, 2 in middelgrote modus en slechts 1 in grote modus.
