Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/07_designing_responsive_portal/responsive.po
Languages: de, es, fr, it, nl

source: Designing a responsive portal
de: Design eines responsiven Portals
es: Diseñar un portal con capacidad de respuesta
fr: Concevoir un portail responsive
it: Progettazione di un portale responsivo
nl: Een responsief portaal ontwerpen

source: A responsive portal header
de: Eine responsive Portal-Kopfzeile
es: Encabezado de un portal con capacidad de respuesta
fr: Un en-tête responsive
it: Header di portale responsivo
nl: De header van een responsief portaal

source: The theme customization is not available on freemium domains (created through the `Try it for free <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ page on `OpenDataSoft's website <https://www.opendatasoft.com>`_). If your domain is a freemium domain and would like to get this theme feature, `email us! <sales@opendatasoft.com>`_
de: Die Theme-Anpassung ist nicht für Freemium-Domains verfügbar (erstellt mit Hilfe der Seite 'Kostenlos ausprobieren <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ auf der OpenDataSoft-Website <https://www.opendatasoft.com>`_). Falls Ihre Domain eine Freemium-Domain ist und Sie diese Themenfunktion haben möchten, mailen Sie uns einfach! <sales@opendatasoft.com>`_
es: La personalización de temas no está disponible en dominios freemium (creados a través de la página `Try it for free <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ del `sitio web de OpenDataSoft <https://www.opendatasoft.com>`_). Si su dominio es freemium y desea obtener esta función de temas, `¡escríbanos un correo electrónico! <sales@opendatasoft.com>`_
fr: La personnalisation du thème du portail n'est pas disponible sur les domaines freemium (domaines créés via la page `Essayez ODS <https://www.opendatasoft.com/fr/decouvrez-opendatasoft-demo/>`_ du `site d'OpenDataSoft <https://www.opendatasoft.com/fr/>`_). Si votre domaine est un domaine freemium mais que vous voudriez tout de même avoir la fonctionnalité de personnalisation de thème activée, `écrivez nous ! <sales@opendatasoft.com>`_
it: La personalizzazione dei temi non è disponibile nei domini "freemium" (cioè attivati gratuitamente nella pagina `Scopri OpenDataSoft <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ del nostro `sito <https://www.opendatasoft.com>`_). Se il tuo è un dominio "freemium" e desideri ottenere questa funzionalità, `ti preghiamo di inviarci un'e-mail <sales@opendatasoft.com>`_.
nl: Het personaliseren van thema's is niet beschikbaar voor freemium domeinen (aangemaakt via de pagina "Probeer gratis <https://www.opendatasoft.com/discover-opendatasoft-demo/> op de website van OpenDataSoft <https://www.opendatasoft.com>). Wanneer uw domein een freemium domein is en u zou deze themafunctie toch graag willen, stuur ons dan een e-mail! <sales@opendatasoft.com>

source: This page explores in length the customization of the platform responsive menu directive. This entails a fair amount of HTML and CSS code to be written and explained. You'll need working knowledge of both these technologies to understand the content of this page.
de: Diese Seite untersucht die Anpassung der Plattform responsiven Menürichtlinie. Hierfür muss recht viel HTML- und CSS-Code geschrieben und erklärt werden. Sie werden für diese beiden Technologien Fachwissen benötigen, um den Inhalt dieser Seite verstehen zu können.
es: Esta página describe de manera detallada la personalización de la directiva de menú con capacidad de respuesta de la plataforma. Esto supone crear y explicar bastante código HTML y CSS. Necesitará conocimientos prácticos de ambas tecnologías para entender el contenido de esta página.
fr: Cette page explore en détail la customisation des menus de la plateforme. Ceci implique d'écrire et d'expliquer une certaine quantité de code HTML et CSS. Vous aurez besoin de connaissances des ces deux langages pour comprendre le contenu de cette page.
it: Questa pagina illustra nel dettaglio come personalizzare in maniera responsiva i menu della piattaforma. A tale scopo, sarà necessario ricorrere in una certa misura ai codici HTML e CSS. Per una comprensione ottimale del contenuto di questa pagina, è dunque richiesta la conoscenza di entrambi i linguaggi.
nl: Op deze pagina wordt meer diepgaand ingegaan op de richtlijn betreffende het personaliseren van het responsieve menu van het platform. Dit houdt in dat er een vrij grote hoeveelheid HTML- en CSS-code moet worden geschreven en uitgelegd. U zal werkkennis nodig hebben van deze beide technologieën om de inhoud van deze pagina te kunnen begrijpen.

source: For basic customization needs, check out :doc:`customizing your portal's theme </customizing_look_and_feel/06_customizing_theme/theme>`.
de: Für eine Basisanpassung lesen Sie bitte das Dokument :doc:`Anpassen Ihres Portalthemas </customizing_look_and_feel/06_customizing_theme/theme>`.
es: Para las necesidades básicas de personalización, consulte cómo :doc:`personalizar la temática del portal </customizing_look_and_feel/06_customizing_theme/theme>`.
fr: Pour les besoins de personnalisation basique, vous pouvez consulter :doc:`Personnaliser le thème de votre portail </customizing_look_and_feel/06_customizing_theme/theme>`.
nl: Voor basisnoden op het vlak van personalisering, ga naar :doc:`het thema van uw portaal personaliseren </customizing_look_and_feel/06_customizing_theme/theme>`.

source: One very common pattern in graphic design is to have the header menu hidden on small screens and replaced by a single toggle button, which usually features the famous *hamburger icon* |hamburger|.
de: Ein sehr gängiges Muster im Grafikdesign ist das Verbergen des Kopfzeilenmenüs auf kleinen Bildschirmen und das Ersetzen durch eine einfache Schaltfläche, auf dem gewöhnlich das berühmte *Hamburger-Icon* |hamburger| zu sehen ist.
es: Un patrón muy común en diseño gráfico consiste en disponer el menú de encabezado oculto en pantallas pequeñas y sustituirlo por un botón de alternancia, normalmente con el famoso *icono de hamburguesa* |hamburger|.
fr: Un motif très utilisé en design graphique est d'avoir le menu d'entête caché sur les petits écrans et remplacé par un seul bouton qui contient généralement la fameuse icône *hamburger* |hamburger|.
it: Una pratica molto comune nella progettazione grafica dei siti è quella di nascondere il menu dell'header negli schermi piccoli, sostituendolo con un semplice pulsante, in genere contrassegnato dall'*icona a forma di hamburger* |hamburger|.
nl: Een zeer vaak gebruikt patroon bij het ontwerpen van grafieken is om het headermenu te verbergen op kleine schermen te vervangen door één enkele toggle-knop, die meestal voorzien is van het gekende *hamburgerpictogram* |hamburger|.

source: Clicking this button opens or closes a drawer containing all menu items. This behaviour can be seen on `OpenDataSoft's central data repository <https://data.opendatasoft.com/page/home/>`_ and on all new portals.
de: Durch Klicken auf diese Schaltfläche wird eine Schublade geöffnet bzw. geschlossen, die sämtliche Menüpunkte enthält. Dieses Verhalten kann beim zentralen Datenspeicher von OpenDataSoft <https://data.opendatasoft.com/page/home/>`_ sowie bei allen neuen Portalen beobachtet werden.
es: Al hacer clic en este botón se abre o cierra un cajón con todos los elementos de menú. Este comportamiento se puede ver en el `repositorio de datos central de OpenDataSoft <https://data.opendatasoft.com/page/home/>`_ y en todos los portales nuevos.
fr: Un clic sur cette icône ouvre et ferme un tiroir contenant tous les éléments du menu. Ce comportement est visible sur `le portail central de données OpenDataSoft <https://data.opendatasoft.com/page/home/>`_ et sur tous les nouveaux portails.
it: Cliccando su questo pulsante si apre o si chiude una tendina contenente tutti gli elementi del menu. È possibile osservare questo effetto sul `repository centrale dei dati OpenDataSoft <https://data.opendatasoft.com/page/home/>`_ e su tutti i nuovi portali.
nl: Wanneer op deze knop wordt geklikt, gaat er een lade open of dicht die alle menu-items bevat. Dit gedrag is waar te nemen op de centrale datarepository van `OpenDataSoft <https://data.opendatasoft.com/page/home/>`_ en op alle nieuwe portalen.

source: Closed drawer
de: Geschlossene Schublade
es: Cajón cerrado
fr: Tiroir fermé
it: Menu a tendina chiuso
nl: Gesloten lade

source: Open drawer
de: Geöffnete Schublade
es: Cajón abierto
fr: Tiroir ouvert
it: Menu a tendina aperto
nl: Open lade

source: Implementation
de: Implementierung
es: Implementación
fr: Implémentation
it: Implementazione
nl: Implementatie

source: Implementing this behaviour usually means resorting heavily to *media queries*, that is CSS rules applied only for a given screen width. To facilitate this work, OpenDataSoft's provides a handy directive called ``ods-responsive-menu`` that you should use within the header as follow.
de: Das Implementieren dieses Verhaltens bedeutet gewöhnlich ein intensives Zurückgreifen auf "Media Queries", d. h. CSS-Regeln werden nur für eine bestimmte Bildschirmbreite angewandt. Um diese Arbeit zu erleichtern, bietet OpenDataSoft eine praktische Richtlinie namens ``ods-responsive-menu``, die Sie in der Kopfzeile wie folgt anwenden sollten.
es: Implementar este comportamiento normalmente significa recurrir intensamente a *consultas de medios*, lo que equivale a unas reglas CSS que se aplican tan solo para un ancho de pantalla determinado. Con objeto de facilitar esta tarea, OpenDataSoft facilita una práctica directiva llamada ``ods-responsive-menu`` para usar en el encabezado tal como se indica a continuación.
fr: Implémenter ce comportement implique d'implémenter les *media queries*, ce sont des règles CSS appliquées uniquement pour une largeur d'écran donnée. Pour faciliter ce travail, OpenDataSoft fournit une directive nommée ``ods-responsive-menu`` qu'il faut utiliser dans l'entête comme ceci.
it: Per ottenere questo risultato è necessario fare abbondante ricorso alle *media query*, cioè a regole CSS valide unicamente per schermi di una determinata larghezza. Per facilitare questa operazione, OpenDataSoft mette a disposizione una comoda direttiva denominata ``ods-responsive-menu`` che andrà utilizzata nell'header come indicato di seguito.
nl: Het implementeren van dit gedrag betekent meestal dat zwaar een beroep moet worden gedaan op *media zoekopdrachten*. Dit zijn CSS-regels die enkel gelden voor een welbepaalde schermbreedte. Om dit werk te vereenvoudigen, voorziet OpenDataSoft een handige richtlijn die de naam "ods-responsive-menu" draagt en die u als volgt binnen de header zou moeten gebruiken.

source: This directive is actually an ensemble of 3 directives:
de: Diese Richtlinie besteht aus insgesamt 3 Richtlinien:
es: En realidad, esta directiva es un conjunto de 3 directivas:
fr: Cette directive est en fait un ensemble de 3 directives :
it: Si tratta in realtà di un insieme di 3 direttive:
nl: Deze richtlijn is eigenlijk een geheel van 3 richtlijnen:

source: ``ods-responsive-menu`` (attribute directive, used as an attribute of another html tag)
de: ``ods-responsive-menu`` (Attribut-Richtlinie, als Attribut eines anderen HTML-Tags verwendet)
es: ``ods-responsive-menu`` (directiva de atributo utilizada como atributo de otra etiqueta html)
fr: ``ods-responsive-menu`` (attribute de directive, utilisé comme attribut d'un autre tag html)
it: ``ods-responsive-menu`` (direttiva di attributo, utilizzata come attributo di un altro tag HTML).
nl: ``ods-responsive-menu`` (attribuutrichtlijn, gebruikt als een attribuut van een andere HTML-tag)

source: Used to specify (through the ``breakpoint`` attribute) the screen width (in px) under which the drawer should appear and over which things should be displayed normally.
de: Zur Spezifizierung (mittels des "Breakpoint"-Attributs) der Bildschirmbreite (in px), unter der die Schublade erscheinen soll und über der die Dinge normal angezeigt werden.
es: Se emplea para especificar (mediante el atributo ``breakpoint``) el ancho de pantalla (en píxeles) por debajo del cual debería aparecer el cajón y por encima del cual el contenido debería visualizarse normalmente.
fr: Utilisé pour spécifier (à l'aide de l'attribut ``breakpoint``) la largeur d'écran (en px) sous laquelle le tiroir doit apparaître et au dessus de laquelle les éléments doivent être affichés normalement.
it: Utilizzata per specificare, tramite l'attributo ``breakpoint``, la larghezza dello schermo (in px) al di sotto della quale utilizzare il menu a tendina e al di sopra della quale visualizzare il menu in formato originale.
nl: Wordt gebruikt om (via het attribuut "breekpunt") de schermbreedte (in px) te specificeren onder welke de lade zou moeten verschijnen en boven welke dingen normaal zouden moeten worden weergegeven.

source: ``ods-responsive-menu-placeholder`` (element directive used as an html tag)
de: ``ods-responsive-menu-placeholder`` (Element-Richtlinie, als HTML-Tag verwendet)
es: ``ods-responsive-menu-placeholder`` (directiva de elemento utilizada como etiqueta html)
fr: ``ods-responsive-menu-placeholder`` (directive d'élément utilisée comme un tag html)
it: ``ods-responsive-menu-placeholder`` (direttiva di elemento utilizzata come tag HTML).
nl: ``ods-responsive-menu-placeholder`` (elementrichtlijn gebruikt als een HTML-tag)

source: Wraps the content that will be invisible unless we are below the breakpoint.
de: Bricht den Content um. Dieser bleibt unsichtbar, solange wir unterhalb des Breakpoints sind.
es: Envuelve el contenido que será invisible salvo que se esté por debajo del punto de interrupción.
fr: Renvoie à la ligne le contenu qui sera invisible sauf si on est en dessous du ``breakpoint``.
it: Riorganizza nello spazio disponibile i contenuti da visualizzare solo quando la soglia di "breakpoint" non viene raggiunta.
nl: Omvat de inhoud die onzichtbaar zal zijn, tenzij we onder het breekpunt zitten.

source: ``ods-responsive-menu-collapsible`` (element directive)
de: ``ods-responsive-menu-collapsible`` (Element-Richtlinie)
es: ``ods-responsive-menu-collapsible`` (directiva de elemento)
fr: ``ods-responsive-menu-collapsible`` (directive d'élément)
it: ``ods-responsive-menu-collapsible`` (direttiva di elemento).
nl: ``ods-responsive-menu-collapsible`` (elementrichtlijn)

source: Wraps the content that will be displayed normally over the breakpoint but collapsed within the drawer below.
de: Bricht den Content um, der oberhalb des Breakpoints normal angezeigt wird, in der Schublade unten jedoch nur minimiert.
es: Envuelve el contenido que se visualizará normalmente por encima del punto de interrupción y se contraerá dentro del cajón en caso de estar por debajo del mismo.
fr: Entoure le contenu qui sera affiché normalement au delà du ``breakpoint`` mais caché à l'intérieur du tiroir en deçà.
it: Riorganizza nello spazio disponibile i contenuti che sopra la soglia di "breakpoint" appaiono nel formato originale e che al di sotto di essa sono racchiusi in un menu a tendina.
nl: Omvat de inhoud die normaal zal worden weergegeven boven het breekpunt maar ingeklapt in de lade eronder.

source: Writing styles for the collapsed header content
de: Schriftarten für den minimiert angezeigten Kopfzeilen-Content
es: Estilos de escritura para el contenido del encabezado contraído
fr: Styles d'écriture du contenu replié de l'entête
it: Stili per i contenuti dell'header nascosto
nl: Schrijfstijlen voor de ingeklapte inhoud van de header

source: Going from an horizontal layout to a vertical layouts entails quite a few graphical changes, as demonstrated by the platform's default header.
de: Der Wechsel von einem waagerechten zu einem senkrechten Layout führt zu recht vielen grafischen Veränderungen, wie am Beispiel der Plattform-Standardkopfzeile gezeigt.
es: Pasar de un diseño horizontal a otro vertical acarrea bastantes cambios gráficos, como demuestra el encabezado predeterminado de la plataforma.
fr: Passer d'une disposition horizontale à une disposition verticale nécessite quelques changements graphiques, comme démontré par l'entête par défaut de la plateforme.
it: Passare da un layout orizzontale a uno verticale implica diversi cambiamenti di tipo grafico, come dimostra l'header predefinito della piattaforma.
nl: Evolueren van een horizontale lay-out naar een verticale lay-out houdt vrij veel grafische wijzigingen in, zoals geïllustreerd wordt door de standaard header van het platform.

source: Desktop header.
de: Desktop-Kopfzeile
es: Encabezado de escritorio.
fr: Entête bureautique
it: Header su desktop

source: Mobile header.
de: Mobile Kopfzeile.
es: Encabezado de dispositivo móvil.
fr: Entête mobile
it: Header su smartphone
nl: Mobiele header.

source: In order for you to change the style accordingly, the ``ods-responsive-menu-collapsible`` element will wrap its content with the ``.ods-responsive-menu-collapsible--collapsed`` when (and only when) the screen is smaller than the breakpoint. This enables you to clearly separate the style for the two layout-styles (horizontal and vertical).
de: Um die Schriftart entsprechend anzupassen, bricht das Element ``ods-responsive-menu-collapsible`` den Content mit ``.ods-responsive-menu-collapsible--collapsed`` um, wenn (und nur wenn) der Bildschirm kleiner als der Breakpoint ist. Damit können Sie die Schriftart für die zwei Layout-Styles (Quer- und Hochformat) klar trennen.
es: Para que pueda cambiar el estilo en consecuencia, el elemento ``ods-responsive-menu-collapsible`` envolverá el contenido con ``.ods-responsive-menu-collapsible--collapsed`` únicamente cuando la pantalla sea más pequeña que el punto de interrupción. Esto permite separar claramente el estilo para los 2 estilos de diseño (horizontal y vertical).
fr: Afin de pouvoir changer le style en conséquence, l'élément ``ods-responsive-menu-collapsible`` renvoie à la ligne son contenu avec ``.ods-responsive-menu-collapsible--collapsed`` quand (et seulement quand) l'écran est plut petit que le ``breakpint``. Ceci vous permet de séparer précisement le style pour les deux styles de disposition (horizontal et vertical).
it: Perché lo stile cambi in modo appropriato, l'elemento ``ods-responsive-menu-collapsible`` riorganizzerà i contenuti tramite ``.ods-responsive-menu-collapsible--collapsed`` quando e solo quando le dimensioni dello schermo risulteranno inferiori alla soglia di "breakpoint". In questo modo è possibile distinguere chiaramente lo stile dei due layout, orizzontale e verticale.
nl: Opdat u de stijl dienovereenkomstig kan wijzigen, zal het element ``ods-responsive-menu-collapsible`` de inhoud ervan omwikkelen met de ``.ods-responsive-menu-collapsible--collapsed`` wanneer (en enkel wanneer) het scherm kleiner is dan het breekpunt. Hierdoor kan u duidelijk de stijl voor de twee lay-outstijlen (horizontaal en verticaal) scheiden.

source: Writing styles for the drawer
de: Schriftarten für die Schublade
es: Estilos de escritura para el cajón
fr: Styles d'écriture pour le tiroir
it: Stili per il menu a tendina
nl: Schrijfstijlen voor de lade

source: If you'd like to customize the overall look of the drawer, you will need to know the name of the classes applied to elements created by the 3 directives. The code sample we saw earlier will render as:
de: Wenn Sie das Gesamtbild der Schublade anpassen möchten, müssen Sie den Namen der Klassen kennen, die auf die Elemente angewendet werden, welche von den 3 Richtlinien erstellt wurden. Das an früherer Stelle besprochene Code-Muster ergibt folgendes Rendering:
es: Si desea personalizar la apariencia general del cajón, tendrá que saber el nombre de las clases que se aplican a los elementos creados por las 3 directivas. El ejemplo de código anterior se presentará del modo siguiente:
fr: Si vous voulez personnaliser le style du tiroir, vous allez avoir besoin de connaître le nom des classes appliquées sur les éléments créé par les 3 directives. L'échantillon de code vu précédemment sera affiché comme ceci :
it: Se desideri personalizzare interamente l'aspetto del menu a tendina, devi conoscere il nome delle classi applicate agli elementi creati dalle 3 direttive. Il codice dell'esempio precedente sarà questo:
nl: Indien u het globale uitzicht van de lade wil personaliseren, zal u de naam van de klassen moeten kennen die toegepast werden op de elementen die aangemaakt zijn door de 3 richtlijnen. Het codevoorbeeld dat we eerder al zagen, zal weergegeven worden als:

source: On top of that, the ``.ods-responsive-menu-collapsible`` element will get the class ``.ods-responsive-menu-collapsible--collapsed`` as soon as the screen width falls below the breakpoint and the class ``.ods-responsive-menu-collapsible--expanded`` to mark whenever the user wants the menu to be displayed.
de: An seinem Anfang bekommt das Element ``.ods-responsive-menu-collapsible`` die Klasse ``.ods-responsive-menu-collapsible--collapsed``, sobald die Bildschirmbreite unterhalb des Breakpoints fällt, und die Klasse ``.ods-responsive-menu-collapsible--expanded``, um zu kennzeichnen, wenn der Nutzer die Anzeige des Menüs wünscht.
es: Además, el elemento ``.ods-responsive-menu-collapsible`` obtendrá la clase ``.ods-responsive-menu-collapsible--collapsed`` cuando el ancho de pantalla esté por debajo del punto de interrupción y la clase ``.ods-responsive-menu-collapsible--expanded`` para señalar cuando el usuario desee que se visualice el menú.
fr: De plus, l'élément ``.ods-responsive-menu-collapsible`` obtiendra la classe ``.ods-responsive-menu-collapsible--collapsed`` dès que la largeur de l'écran passe en dessous du ``breakpoint`` et la classe ``.ods-responsive-menu-collapsible--expanded`` pour indiquer lorsque l'utilisateur veut afficher le menu.
it: L'elemento ``.ods-responsive-menu-collapsible``, inoltre, conterrà la classe ``.ods-responsive-menu-collapsible--collapsed`` quando la larghezza dello schermo sarà inferiore alla soglia di breakpoint e la classe ``.ods-responsive-menu-collapsible--expanded`` per indicare quando l'utente desidera visualizzare il menu.
nl: Daarbovenop zal het element ``.ods-responsive-menu-collapsible`` de klasse ``.ods-responsive-menu-collapsible--collapsed`` krijgen zodra de schermbreedte onder het breekpunt daalt en de klasse ``.ods-responsive-menu-collapsible--expanded`` om aan te geven wanneer de gebruiker wil dat het menu wordt weergegeven.

source: Responsive page layouts
de: Responsive Seiten-Layouts
es: Diseños de página con capacidad de respuesta
fr: Disposition responsive de la page
it: Layout di pagina responsivi
nl: Responsieve pagina lay-outs
