Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/07_designing_responsive_portal/responsive.po
Languages: de, es, fr, it, nl

source: You don't have to specify all 4 levels though. The classes default to a standard 12-columns span below there own display mode and keep their specified column-span for larger display modes. ``<div class="col-md-4"></div>`` is therefore equivalent to ``<div class="col-xs-12 col-sm-12 col-md-4 col-lg-4"></div>`` and ``<div class="col-sm-6 col-lg-3"></div>`` is equivalent to ``<div class="col-xs-12 col-sm-6 col-md-6 col-lg-3"></div>``.
de: Dabei müssen Sie jedoch nicht alle 4 Stufen angeben. Die Klassen stellen sich automatisch auf die Standardbreite 12 Spalten unterhalb ihres eigenen Anzeigemodus ein und behalten ihre spezifisch eingestellte Spaltenbreite breiteren Anzeigemodi vor. ``<div class="col-md-4"></div>`` entspricht also ``<div class="col-xs-12 col-sm-12 col-md-4 col-lg-4"></div>`` und ``<div class="col-sm-6 col-lg-3"></div>`` entspricht ``<div class="col-xs-12 col-sm-6 col-md-6 col-lg-3"></div>``.
es: No obstante, no tiene que especificar los 4 niveles. De manera predeterminada, las clases establecen una extensión de columna estándar de 12 columnas por debajo de su propio modo de visualización y mantienen su extensión de columna especificada para los modos de visualización más grandes. Por lo tanto, ``<div class="col-md-4"></div>`` equivale a ``<div class="col-xs-12 col-sm-12 col-md-4 col-lg-4"></div>``, y ``<div class="col-sm-6 col-lg-3"></div>`` equivale a ``<div class="col-xs-12 col-sm-6 col-md-6 col-lg-3"></div>``.
fr: Vous n'avez pas besoin de spécifier les 4 modes. Les classes utilisent une largeur de 12 colonnes par défaut en dessous de leur mode d'affichage et gardent leur largeur spécifiée pour des modes d'affichage plus grand. ``<div class="col-md-4"></div>`` est équivalent à ``<div class="col-xs-12 col-sm-12 col-md-4 col-lg-4"></div>`` et ``<div class="col-sm-6 col-lg-3"></div>`` est équivalent à ``<div class="col-xs-12 col-sm-6 col-md-6 col-lg-3"></div>``.
it: A ogni modo, non è necessario specificare ogni volta tutti e 4 i livelli. Per impostazione predefinita, ogni classe utilizza una larghezza di 12 colonne nelle modalità di visualizzazione inferiori e conserva la propria larghezza specifica in quelle più grandi. Di conseguenza, ``<div class="col-md-4"></div>`` è equivalente a ``<div class="col-xs-12 col-sm-12 col-md-4 col-lg-4"></div>`` e ``<div class="col-sm-6 col-lg-3"></div>`` è equivalente a ``<div class="col-xs-12 col-sm-6 col-md-6 col-lg-3"></div>``.
nl: U moet echter niet alle 4 niveaus specificeren. De klassen die standaard zijn voor een standaard overspanning over 12 kolommen onder hun eigen weergavemodus en behouden hun specifieke kolomoverspanning voor grotere weergavemodi. ``<div class="col-md-4"></div>`` is daarom het equivalent van ``<div class="col-xs-12 col-sm-12 col-md-4 col-lg-4"></div>`` en is ``<div class="col-sm-6 col-lg-3"></div>`` het equivalent van ``<div class="col-xs-12 col-sm-6 col-md-6 col-lg-3"></div>``.

source: Available classes
de: Verfügbare Klassen
es: Clases disponibles
fr: Classes disponibles
it: Classi disponibili
nl: Beschikbare klassen
