Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/monitoring_audience/analyzing_users_usage.po
Languages: fr

source: Analyzing users usage
fr: Analyser l'usage des utilisateurs

source: Go to the *Analytics > Users* page.
fr: Allez sur la page *Statistiques > Utilisateurs*.

source: There are seven indicators :
fr: Il y a sept indicateurs :

source: **Activity**: API calls per day. It may allow you to understand better who are the people using your data (for example if you mostly have calls during week days). You can also link your activity to some events (a new dataset, a new communication campaign).
fr: **Activité** : nombre d'appel d'API quotidiens. Cela peut vous aider à mieux comprendre qui sont les personnes utilisant vos données (par exemple, si vous avez essentiellement des appels d'API en semaine). Vous pouvez aussi lier votre activité à certains évènements (un nouveau jeu de données, une nouvelle campagne de communication).

source: **Total users**: Estimated number of unique users who interacted with the domain
fr: **Nombre total d'utilisateurs** : estimation du nombre d'utilisateurs uniques ayant interagi avec le domaine.

source: **API Calls per user**: on average API calls per users.
fr: **Appels API par utilisateurs** : Nombre d'appels API moyen par utilisateur.

source: **Anonymous users**: Percentage of users without an account. If your domain is open, you may have a lot of anonymous users, that's normal, that's the whole thing about Open Data. Not anonymous people are those who have an OpenDataSoft account and who are logged when they use your data.
fr: **Utilisateurs anonymes** : Pourcentage d'utilisateurs sans comptes. Si votre domaine est ouvert, il peut y avoir des utilisateurs anonymes, c'est normal, c'est le principe de l'Open Data. Les utilisateurs non anonymes sont ceux qui on un compte OpenDataSoft et qui sont connectés quand ils utilisent vos données.

source: **Mobile users**: Percentage of activity generated by users using a mobile device.
fr: **Utilisateurs mobiles** : Pourcentage de l'activité générée par un utilisateur depuis un smartphone ou une tablette.

source: **Top 5 users**: The people who use your API or your data the most. Keep in mind that if somebody downloads a dataset and develops something on his laptop, you won't be able to know it and it won't appear here.
fr: **Top 5 utilisateurs** : les utilisateurs qui utilisent le plus l'API. Gardez à l'esprit que si quelqu'un télécharge un jeu de données et développe une application sur son ordinateur, vous ne le saurez pas et cela n'apparaîtra pas ici.

source: **Map of API calls**: The map is based on the geolocation of IP addresses. It gives a good idea of the geographical distribution of usage. Yet it can be quite imprecise and may yield false geolocations.
fr: **Carte des appels API** : La carte est basée sur la géo-localisation d'adresses IP. Cela donne une bonne idée de la répartition de l'usage. Mais c'est une technique qui peut être imprécise et qui peut retourner de mauvaises géo-localisations.
