Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/monitoring_audience/analyzing_domain_activity.po
Languages: de

source: Analyzing domain activity
de: Analysieren der Domainaktivität

source: Go to the *Analytics > Backoffice* page.
de: Wechseln Sie zur Seite *Analyse > Back-Office*.

source: Backoffice Analytics
de: Back-Office-Analyse

source: The Backoffice analytics allows the domain administrator to monitor domain configuration activity.
de: Mit der Back-Office-Analyse kann der Domainadministrator die Domainkonfigurationsaktivität überwachen.

source: There are seven indicators :
de: Es gibt sieben Indikatoren:

source: **Actions**: Frequency and distribution of administrative actions (edit and publish datasets or pages, add users to the domain etc). Gives you precious information about what your users do and how they spend their time on the platform. Also remember that like with every charts on OpenDataSoft you can filter the variables displayed by clicking on the legend labels.
de: **Aktionen**: Häufigkeit und Verteilung administrativer Aktionen (Bearbeiten und Veröffentlichen von Datensätzen oder Seiten, Hinzufügen von Benutzern zur Domain usw.). Gibt wertvolle Informationen darüber, was Ihre Benutzer tun und wie sie ihre Zeit auf der Plattform verbringen. Vergessen Sie nicht, dass Sie die angezeigten Variablen auch wie bei allen anderen Diagrammen auf OpenDataSoft durch Klick auf die Legendenbeschriftungen filtern können.

source: **Number of users**: Number of users that had an activity on the platform during the period.
de: **Benutzeranzahl**: Anzahl der Benutzer mit einer Aktivität auf der Plattform in einem Zeitraum.

source: **Actions by users**: Number of actions by users during the period.
de: **Benutzeraktionen**: Anzahl der Aktionen von Benutzern in einem Zeitraum.

source: **Top 5 users**: Most active users during the period. Note that every user activity is broke down by action type.
de: **Top 5-Benutzer**: Die aktivsten Benutzer in einem Zeitraum. Beachten Sie, dass jede Benutzeraktivität nach Aktionstyp unterteilt ist.

source: **Top 5 modified datasets**: Most modified datasets. Those are the datasets that requested the more work.
de: **Top 5 geänderte Datensätze**: Die am häufigsten geänderten Datensätze. Das sind die Datensätze mit dem größten Arbeitsaufwand.

source: **Top 5 pages**: Most modified pages. Those are the pages that requested the more work.
de: **Top 5-Seiten**: Die am häufigsten geänderten Seiten. Das sind die Seiten mit dem größten Arbeitsaufwand.

source: **Distribution of actions**: Distribution of the activity based on the number of actions.
de: **Aktionsverteilung**: Verteilung der Aktivitäten basierend auf der Anzahl von Aktionen.

source: Activity log dataset
de: Datensatz Aktivitätsprotokoll

source: As in the other analytics pages, you can access the full activity log dataset at the bottom of the dashboard by clicking "See source data".
de: Wie bei den anderen Analyseseiten können Sie auf den kompletten Datensatz des Aktivitätsprotokolls zugreifen, indem Sie unten im Dashboard auf "Quelldaten anzeigen" klicken.

source: The activity log dataset contains the following fields.
de: Der Datensatz Aktivitätsprotokoll beinhaltet folgende Felder.

source: Field name
de: Feldname

source: Description
de: Beschreibung

source: Action timestamp
de: Zeitstempel der Aktion

source: Domain ID
de: ID der Domain

source: Identifier of the event owner
de: Bezeichner des Ereignisbesitzers

source: Id of the dataset if the action is relative to a specific dataset
de: ID des Datensatzes, wenn die Aktion relativ zu einem bestimmten Datensatz ist.

source: Name of the user the action has an effect on
de: Name des Benutzers, auf den sich die Aktion auswirkt.

source: Action name (one of **publish_dataset**, **add_dataset**, **edit_dataset**, **delete_dataset**)
de: Name der Aktion (entweder **publish_dataset**, **add_dataset**, **edit_dataset** oder **delete_dataset**)

source: Identifier of the group concerned by the action
de: Bezeichner der von der Aktion betroffenen Gruppe

source: Identifier of the page concerned by the action
de: Bezeichner der von der Aktion betroffenen Seite

source: Difference introduced by the action (for example a new permission added to a user)
de: Durch die Aktion bewirkte Differenz (z. B. eine neue Berechtigung für einen Benutzer)

source: Identifier of the map
de: Bezeichner der Karte

source: Title of the reuse
de: Titel der Weiterverwendung

source: Identifier of the subdomain where the action was made
de: Bezeichner der Subdomain, wo die Aktion erfolgte.
