Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/monitoring_audience/analyzing_data_usage.po
Languages: de, es, fr, nl

source: Analyzing data usage
de: Analysieren der Datennutzung
es: Analizar el uso de datos
fr: Analyser l'usage des données
nl: Gebruik van data analyseren

source: Go to the *Analytics > Data* page.
de: Wechseln Sie zur Seite *Analysen > Daten*.
es: Vaya a la página *Análisis > Datos*.
fr: Allez sur la page *Statistiques > Données*.
nl: Ga naar de pagina *Analyse > Data*

source: There are seven indicators :
de: Es gibt sieben Indikatoren:
es: Hay 7 indicadores:
fr: Il y a sept indicateurs :
nl: Er zijn zeven indicatoren:

source: **Dataset activity**: Download and API calls of most used datasets. Please note that there are two different scales for the downloads count and the number of API calls on each side of the chart.
de: **Datensatzaktivität**: Download und API-Aufrufe der meist genutzten Datensätze. Bitte beachten Sie, dass es zwei unterschiedliche Größenordnungen für die Download-Zählung und die Anzahl der API-Aufrufe auf jeder Seite des Diagramms gibt.
es: **Actividad de conjunto de datos**: Descargas y llamadas de API de los conjuntos de datos más utilizados. Tenga en cuenta que a ambos lado del gráfico aparecen 2 escalas distintas, correspondientes al recuento de descargas y el número de llamadas de API.
fr: **Activité des jeux de données** : Nombre de téléchargements et d'appels API des jeux de données les plus utilisés. Notez qu'il y a deux échelles différentes pour les deux variables sur chaque côté du graphique.
nl: **Datasetactiviteit**: download en API calls voor de meest gebruikte datasets. Gelieve er nota van te nemen dat er twee verschillende schalen zijn voor het telen van de downloads en het aantal API calls op elke zijde van de grafiek.

source: **Total datasets**: Total number of datasets in the catalog.
de: **Datensätze insgesamt**: Gesamtanzahl der Datensätze im Katalog.
es: **Total de conjuntos de datos**: Número total de conjuntos de datos en el catálogo.
fr: **Nombre de jeux de données** : Nombre de jeux de données dans le catalogue.
nl: **Totaal datasets**: totaal aantal datasets in de catalogus.

source: **Total records**: Total number of records in the catalog.
de: **Datensätze insgesamt**: Gesamtanzahl der Datensätze im Katalog.
es: **Total de registros**: Número total de registros en el catálogo.
fr: **Nombre d'enregistrements** : Nombre d'enregistrements dans le catalogue.
nl: **Totaal records**: totaal aantal records in de catalogus.

source: **Top datasets**: The 3 datasets with most API calls. Those are the datasets that drive the usage on your portal.
de: **Top-Datensätze**: Die 3 Datensätze mit den meisten API-Aufrufen. Das sind die Datensätze, welche die Nutzung auf Ihrem Portal antreiben.
es: **Principales conjuntos de datos**: Los 3 conjuntos de datos con más llamadas de API. Son los conjuntos de datos que impulsan el uso de su portal.
fr: **Jeux de données les plus populaires** : Les 3 jeux de données ayant reçu le plus d'appels API. Ce sont les jeux de données moteurs de votre audience.
nl: **Top datasets**: de 3 datasets met de meeste API calls. Dit zijn de datasets die het gebruik op uw portaal aandrijven.

source: **Least used datasets**: The 3 datasets with least API calls. Those datasets may have not met their audience yet.
de: **Am wenigsten genutzte Datensätze**: Die 3 Datensätze mit den wenigsten API-Aufrufen. Diese Datensätze haben unter Umständen noch keine Zielgruppe gefunden.
es: **Conjuntos de datos menos usados**: Los 3 conjuntos de datos con menos llamadas de API. Puede que estos conjuntos de datos todavía no hayan encontrado su público.
fr: **Jeux de données les moins consultés** : Les 3 jeux de données ayant reçu le moins d'appels API. Ces jeux de données n'ont peut-être pas encore rencontré leurs public.
nl: **Minst gebruikte datasets**: de 3 datasets met het kleinste aantal API calls. Deze datasets hebben hun publiek nog niet ontmoet.

source: **Theme popularity**: Distribution of popularity among themes. Allows you to understand what data your users look for.
de: **Themenbeliebtheit**: Verteilung der Beliebtheit zwischen Themen. Erlaubt zu verstehen, nach welchen Daten Benutzer Ausschau halten.
es: **Popularidad de tema**: Distribución de la popularidad entre temas. Permite comprender qué datos buscan los usuarios.
fr: **Popularité des thèmes** : Répartition de la popularité parmi les thèmes. Cela donne une idée des données recherchées par vos utilisateurs.
nl: **Populariteit van het thema**: verdeling van de populariteit onder thema's. Laat u toe te begrijpen naar welke data uw gebruikers op zoek zijn.

source: **Tag cloud**: Distribution of popularity among tags. Allows you to understand what data your users look for.
de: **Tag-Cloud**: Verteilung der Beliebtheit zwischen Tags. Erlaubt zu verstehen, nach welchen Daten Benutzer Ausschau halten.
es: **Nube de etiquetas**: Distribución de la popularidad entre etiquetas. Permite comprender qué datos buscan los usuarios.
fr: **Nuage de mots clés** : Répartition de la popularité parmi les tags. Cela donne une idée de ce que vos utilisateurs recherchent.
nl: **Tag cloud**: verdeling van de populariteit onder tags. Laat u toe te begrijpen naar welke data uw gebruikers op zoek zijn.
