Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_security/portal.po
Languages: de, fr

source: Configuring your portal's general security policy
de: Konfigurieren der allgemeinen Sicherheitsrichtlinie Ihres Portals
fr: Configurer la politique de sécurité générale de votre portail

source: Public or private?
de: Öffentlich oder privat?
fr: Public ou privé ?

source: The most important choice is whether your portal should be public or private. That is whether you want anonymous users to be able to access the portal or if you'll require people to signup before they can access anything.
de: Zu den wichtigsten Entscheidungen gehört die Frage, ob Ihr Portal öffentlich oder privat sein soll. Sie entscheiden, ob anonyme Benutzer Zugang zu dem Portal haben sollen oder ob Sie von den Besuchern zunächst eine Anmeldung verlangen, bevor Sie überhaupt Zugang bekommen.
fr: Le choix le plus important consiste à déterminer si votre portail doit être public ou privé. Il s'agit de savoir si des utilisateurs non authentifiés seront en mesure d'accéder au portail ou s'il sera demandé aux visiteurs de s'inscrire pour y accéder.

source: Making your portal public doesn't mean that anybody will have access to all of the datasets! You'll always be able to limit what the general public can see through the use of sensible default security parameters for your datasets and explicit parameters on each single dataset.
de: Wenn Sie sich für ein öffentliches Portal entscheiden, bedeutet das nicht, dass damit jedermann Zugang zu Ihren Datensätzen hat! Sie können jederzeit einschränken, was die Öffentlichkeit zu sehen bekommt, indem Sie sensible Standard-Sicherheitsparameter für Ihre Datensätze sowie explizite Parameter für jeden einzelnen Datensatz verwenden.
fr: Le fait de rendre votre portail public ne signifie pas que tout le monde aura accès à l'ensemble des jeux de données ! À l'aide des paramètres de sécurité précis pour les jeux de données et de paramètres explicites pour chacun d'entre eux, il vous sera toujours possible de restreindre ce à quoi les utilisateurs ont accès.

source: See the :doc:`dedicated section </sourcing_and_processing_data/security>` for more information about dataset security.
de: Weitere Informationen zur Datensatzsicherheit siehe :doc:`spezifischer Abschnitt</sourcing_and_processing_data/security>`
fr: Reportez-vous à la :doc:`section dédiée </sourcing_and_processing_data/security>` pour plus d'informations sur la sécurité des jeux de données.

source: This setting can be found in the **security** subsection of the **configuration** section of your portal's backoffice.
de: Diese Einstellung finden Sie im Unterabschnitt **Sicherheit** des Abschnitts **Konfiguration** in Ihrem Portal-Back-Office.
fr: Ce paramètre se trouve dans la sous-section **sécurité** de la section **configuration** du back office de votre portail.

source: Note that if you decide not to allow anonymous users to access your portal, they will be redirected to the login page unless you'd rather they land on a specific page you've written.
de: Beachten Sie bitte, dass, wenn Sie sich dafür entscheiden, anonymen Benutzern den Zugang zu Ihrem Portal nicht zu erlauben, diese zu der Anmeldungsseite weitergeleitet werden, es sei denn, Sie bestimmen, dass sie zu einer spezifischen Seite weitergeleitet werden sollen, die Sie selbst geschrieben haben.
fr: Notez que si vous décidez de ne pas autoriser les utilisateurs non authentifiés à accéder à votre portail, ils seront redirigés vers la page de connexion, sauf si vous préférez qu'ils soient redirigés vers une page spécifique que vous avez créée.

source: Signup policy
de: Anmeldungsrichtlinie
fr: Politique d'inscription

source: No matter your choice of public or private, you can then decide on who will be able to become a registered member of your portal. In order to do this, go to the **Configuration/Signup** subsection of your portal's backoffice.
de: Unabhängig davon, ob Sie sich für ein öffentliches oder privates Portal entscheiden, können Sie danach immer noch bestimmen, wer ein registriertes Mitglied Ihres Portals werden kann. Gehen Sie hierfür zum Unterabschnitt **Konfiguration/Anmeldung** im Back-Office Ihres Portals.
fr: Quel que soit votre choix, public ou privé, vous pouvez par la suite décider de qui sera en mesure de devenir un membre enregistré de votre portail. Pour ce faire, accédez à la sous-section **Configuration/Inscription** du back office de votre portail.

source: Closed signup policy
de: Richtlinie Geschlossene Anmeldung
fr: Politique d'inscription fermée

source: If you decide not to allow people to signup freely, the only way of adding members to your portal will be through :doc:`direct email invitation <users>`.
de: Wenn Sie sich dafür entscheiden, den Besuchern keine freie Anmeldung zu ermöglichen, können Sie Ihrem Portal nur durch :doc:`direkte E-Mail-Einladung <users>` neue Mitglieder hinzufügen.
fr: Si vous décidez de ne pas autoriser les inscriptions publiques, la seule manière d'ajouter des membres à votre portail sera par l'intermédiaire d'une :doc:`invitation directe par e-mail <users>`.

source: Open signup policy
de: Richtlinie Offene Anmeldung
fr: Politique d'inscription ouverte

source: If on the other hand you allow people to register, you'll then have to decide whether you want to manually approve each access request to your portal or not. Note that whatever your decision, each member of the portal able to manage users will receive a notification for each new access request.
de: Falls Sie jedoch Besuchern erlauben möchten, sich zu registrieren, müssen Sie entscheiden, ob Sie jede Zugangsanfrage zu Ihrem Portal manuell genehmigen möchten oder nicht. Beachten Sie bitte, dass unabhängig von Ihrer Entscheidung jedes Portalmitglied, das Benutzer verwalten darf, bei jeder neuen Zugangsanfrage eine Benachrichtigung erhält.
fr: À l'inverse, si vous autorisez les inscriptions publiques, il vous faudra alors déterminer si vous souhaitez approuver manuellement ou non chaque demande d'accès à votre portail. Notez que, quelle que soit votre décision, chaque membre du portail autorisé à gérer les utilisateurs recevra une notification pour chaque nouvelle demande d'accès.

source: Do not forget to add the signup button to your header's menu or people won't see a signup form until they try to access a restricted area of your portal.
de: Denken Sie daran, die Schaltfläche Anmelden Ihrem Kopfzeilen-Menü hinzuzufügen. Ansonsten sehen die Benutzer so lange kein Anmeldefomular, bis sie versuchen, Zugang zu einem zugriffsbeschränkten Bereich zu bekommen.
fr: N'oubliez pas d'ajouter le bouton d'inscription à votre menu d'en-tête, sinon les utilisateurs ne verront pas le formulaire d'inscription avant d'essayer d'accéder à une zone de votre portail dont l'accès est restreint.

source: The signup process is usually very straightforward: an email, a password and that's it. You can however decide to customize the experience by setting up a custom text as disclaimer, request users to accept your terms and conditions and even require that they leave a message for the portal's administrator (useful when you want to manually approve access requests).
de: Der Anmeldeprozess ist normalerweise sehr einfach: eine E-Mail-Adresse, ein Passwort und das war es schon. Sie können die Anmeldung jedoch individuell anpassen, indem Sie einen benutzerspezifischen Text als Disclaimer einrichten, der die Benutzer dazu auffordert, Ihre Allgemeinen Geschäftsbedingungen zu akzeptieren bzw. sogar verlangt, dass sie eine Nachricht für den Portal-Administrator hinterlassen (sinnvoll, wenn Sie die Zugangsanfrage von Hand genehmigen möchten).
fr: La procédure d'inscription est généralement très simple : une adresse e-mail, un mot de passe, et le tour est joué. Vous pouvez néanmoins décider de personnaliser l'expérience en utilisant un texte personnalisé comme avis de non-responsabilité, en exigeant des utilisateurs qu'ils acceptent vos conditions d'utilisation et même qu'ils laissent un message aux administrateurs du portail (utile lorsque vous souhaitez approuver manuellement les demandes d'accès).

source: Granting access for all of your organisation's members
de: Zugangsberechtigung für alle Ihre Organisationsmitglieder
fr: Donner un accès à tous les membres de votre organisation

source: If your organisation already has its own credentials management system, you can set up a bridge between your identity provider and your OpenDataSoft portal. This will give general access to your portal (no specific rights) to each of your organisation's members.
de: Falls Ihre Organsiation bereits ihr eigenes Verwaltungssystem für die Anmeldeinformationen besitzt, können Sie eine Brücke zwischen Ihrem Identity-Provider und Ihrem OpenDataSoft-Portal einrichten. Dies ermöglicht jedem Ihrer Organisationsmitglieder allgemeinen Zugang zu Ihrem Portal (keine spezifischen Rechte).
fr: Si votre organisation possède déjà son propre système de gestion des identifiants, vous pouvez configurer un relais entre votre fournisseur d'identité et votre portail OpenDataSoft. Cela aura pour conséquence d'octroyer un accès général à votre portail (sans droits spécifiques) à chacun des membres de votre organisation.

source: You'll find more information about setting up such a bridge on the :doc:`SAML configuration documentation page <saml>`.
de: Weitere Informationen zum Einrichten einer solchen Brücke finden Sie in :doc:`SAML configuration documentation page <saml>`.
fr: Vous trouverez davantage d'informations sur la configuration d'un relais sur la :doc:`page de documentation de la configuration SAML <saml>`.
