Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_security/quotas.po
Languages: de, es, fr, nl

source: Managing quotas
de: Verwalten von Quoten
es: Administrar las cuotas
fr: Gérer les quotas
nl: Quota's beheren

source: Your portal license
de: Ihre Portallizenz
es: Licencia del portal
fr: Licence de votre portail
nl: De licentie van uw portaal

source: Before diving into what quotas exist on OpenDataSoft portals, it is important to know that for each portal there is a license that applies. A license is a contract between OpenDataSoft and the portal owners defining how much data can be injected into the portal and the consumption of this data.
de: Bevor wir uns damit beschäftigen, welche Quoten auf OpenDataSoft-Portalen existieren, ist wichtig zu wissen, dass für jedes Portal eine Lizenz gilt. Eine Lizenz ist ein Vertrag zwischen OpenDataSoft und den Portalbesitzern, in dem die Menge an Daten, die in das Portal eingespeist werden kann, sowie die Nutzung dieser Daten definiert wird.
es: Antes de analizar las cuotas existentes en los portales OpenDataSoft, es importante saber que se aplica una licencia para cada portal. Una licencia es un contrato entre OpenDataSoft y los propietarios del portal que define la cantidad de datos que es posible insertar en el portal y el consumo de esos datos.
fr: Avant d'étudier les quotas disponibles dans les portails OpenDataSoft, il est important de savoir que pour chaque portail, il existe une licence correspondante. Une licence est un contrat signé entre OpenDataSoft et les propriétaires du portail. Elle définit la quantité de données pouvant être injectée dans le portail, ainsi que la consommation de ces données.
nl: Alvorens dieper in te gaan op welke quota's er bestaan op OpenDataSoft-portalen, is het belangrijk om te weten dat er voor elk portaal een licentie van toepassing is. Een licentie is een contract tussen OpenDataSoft en de portaaleigenaars waarin gedefinieerd staat hoeveel data kan worden ge√Ønjecteerd in het portaal en hoeveel van deze data kan worden geconsumeerd.

source: For example, freemium portals can have up to 5 datasets, each having at most 20000 records.
de: Beispielsweise können Freemium-Portale bis zu 5 Datensätze mit jeweils maximal 20000 Einträgen haben.
es: Por ejemplo, los portales freemium pueden tener hasta 5 conjuntos de datos de hasta 20.000 registros cada uno.
fr: Par exemple, les portails freemium peuvent comporter jusqu'à 5 jeux de données, qui peuvent chacun contenir jusqu'à 20 000 enregistrements.
nl: Bijvoorbeeld: freemium portalen kunnen tot 5 datasets hebben en elke dataset maximaal 20000 records.

source: Your license defines 3 global limits on your portal, the two first ones regulate the amount of data you can inject into the portal while the last one puts an upper limit on the consumption of this data.
de: Ihre Lizenz definiert 3 globale Portalbegrenzungen. Die ersten beiden regeln die Datenmenge, die Sie ins Portal einspeisen können, während die letzte eine Obergrenze für die Nutzung dieser Daten festlegt.
es: Su licencia define 3 límites globales en el portal: los 2 primeros regulan la cantidad de datos que puede insertar en el portal, y el tercero establece un límite superior en el consumo de esos datos.
fr: Votre licence définit 3 limites globales sur votre portail. Les deux premières régulent la quantité de données que vous pouvez injecter dans le portail, tandis que la troisième place une limite maximale de consommation de ces données.
nl: Uw licentie definieert 3 globale limieten voor uw portaal. De eerste twee reguleren de hoeveelheid data die u kan injecteren in het portaal, terwijl de laatste een maximale limiet oplegt betreffende de consumptie van deze data.

source: The **number of datasets** quota constraints the total number of datasets currently within the portal (published or not),
de: Die Quote **Datensatzanzahl** schränkt die Gesamtanzahl der aktuell im Portal vorhandenen Datensätze (veröffentlicht oder nicht) ein.
es: La cuota de **número de conjuntos de datos** restringe el número total de conjuntos de datos que existen actualmente en el portal (publicados o no).
fr: Le quota **nombre de jeux de données** limite le nombre total de jeux de données actuellement enregistrés dans le portail (qu'ils soient publiés ou non).
nl: Het quotum **aantal datasets** beperkt het totale aantal datasets momenteel binnen het portaal (al dan niet gepubliceerd).

source: the **number of records** quota limits to total number of records within published datasets, regardless of the actual content of these records.
de: Die Quote **Eintragsanzahl** begrenzt die Gesamtanzahl von Einträgen in veröffentlichten Datensätzen unabhängig vom tatsächlichen Inhalt dieser Einträge.
es: La cuota de **número de registros** restringe el número total de registros dentro de los conjuntos de datos publicados, con independencia del contenido real de esos registros.
fr: Le quota **nombre d'enregistrements** limite le nombre total d'enregistrements au sein des jeux de données publiés, quel que soit le contenu réel de ces enregistrements.
nl: het quotum **aantal records** beperkt het totale aantal records in gepubliceerde datasets, ongeacht de effectieve content van deze records.

source: lastly, the **number of API calls** quota limits the number of requests made to the data within a given timeframe (usually within a month).
de: Schließlich begrenzt die Quote **Anzahl der API-Aufrufe** die Anzahl der Datenanforderungen in einem bestimmten Zeitrahmen (normalerweise innerhalb eines Monats).
es: Por último, la cuota de **número de llamadas de API** restringe el número de solicitudes de datos efectuadas dentro de un período de tiempo determinado (normalmente, un mes).
fr: Enfin, le quota **nombre d'appels d'API** limite le nombre de requêtes exécutées sur les données pendant une période précise (généralement pendant un mois).
nl: tot slot beperkt het quotum **aantal API calls** het aantal aanvragen dat kan worden gedaan voor de data binnen een welbepaald tijdkader (meestal binnen een maand).

source: The number of API calls measure can be a bit difficult to wrap his/her head around since this is a very technical measure of the activity. But it can be summarised as such: everytime somebody accesses your portal, for example the datasets catalog page, the interface will make requests to the portal for the filters values, for the 10 first datasets then the 10 next ones etc. Each of these requests is an API call and counted within the quota.
de: Die Messung der Anzahl der API-Aufrufe ist nicht unbedingt leicht nachzuvollziehen, da es sich um ein äußerst technisches Maß der Aktivität handelt. Sie lässt sich jedoch wie folgt zusammenfassen: Jedes Mal, wenn jemand auf Ihr Portal zugreift, z. B. auf die Datensatzkatalogseite, sendet die Schnittstelle Anforderungen für die Filterwerte, die ersten 10 Datensätze, die nächsten 10 usw. an das Portal. Jede dieser Anforderungen ist ein API-Aufruf, der für die Quote zählt.
es: El número de llamadas de API puede ser un poco difícil de entender ya que es una medida de la actividad muy técnica. Para resumir: cada vez que alguien accede al portal (por ejemplo, a la página de catálogo de conjuntos de datos), la interfaz efectúa solicitudes en el portal de los valores de filtros, de los 10 primeros conjuntos de datos, a continuación de los 10 siguientes, etc. Cada una de estas solicitudes es una llamada de API y se contabiliza en la cuota.
fr: La mesure du nombre d'appels d'API peut être complexe à comprendre, car il s'agit d'une mesure extrêmement technique de l'activité. Elle peut cependant être résumée ainsi : à chaque fois qu'un utilisateur accède à votre portail, par exemple à la page du catalogue des jeux de données, l'interface envoie des requêtes au portail pour obtenir les valeurs des filtres, pour les 10 premiers jeux de données, puis pour les 10 suivants, etc. Chacune de ces requêtes est un appel d'API et est comptabilisée dans le quota.
nl: Het meten van het aantal API calls kan iets moeilijker zijn aangezien dit een zeer technische meting van de activiteit is. Maar ze kan als volgt worden samengevat: telkens iemand zich toegang verschaft tot uw portaal, bijvoorbeeld de cataloguspagina met datasets, doet de interface aanvragen aan het portaal voor de filterwaarden, voor de eerste 10 datasets, vervolgens de 10 volgende enz. Elk van deze aanvragen is een API call en wordt geteld binnen het quotum.

source: API calls are therefore made by visitors on your portal, but also by developers using the API to retrieve the data you published and dashboards hosted outside of your portal.
de: API-Aufrufe werden also von Besuchern Ihres Portals gemacht, aber auch von Entwicklern, die die API zum Abrufen der von Ihnen veröffentlichten Daten nutzen, sowie außerhalb Ihres Portals gehosteter Dashboards.
es: Por consiguiente, las llamadas de API son realizadas por los visitantes del portal, pero también por los desarrolladores que usan la API para recuperar los datos publicados y los paneles que se alojan fuera del portal.
fr: Des appels d'API sont par conséquent réalisés par les visiteurs de votre portail, mais également par les développeurs qui utilisent l'API pour récupérer les données publiées et les tableaux de bord hébergés à l'extérieur de votre portail.
nl: API calls worden daarom gedaan door bezoekers op uw portaal, maar ook door ontwikkelaars die de API gebruiken om de data die u gepubliceerd hebt, terug te vinden en dashboards die gehost worden buiten uw portaal.

source: You can see your license quotas and their current usage in your backoffice, under the **Analytics/Quotas** section.
de: Ihre Lizenzquoten und deren aktuelle Nutzung können Sie in Ihrem Back-Office im Bereich **Analyse/Quoten** sehen.
es: Puede consultar las cuotas de licencia y su uso actual en el back office, bajo la sección **Análisis/Cuotas**.
fr: Vous pouvez consulter les quotas de votre licence ainsi que leur utilisation actuelle dans votre back office, dans la section **Statistiques/Quotas**.
nl: U kan de quota's van uw licentie en het huidige gebruiker ervan in uw back-office terugvinden onder de sectie **Analytische gegevens/Quota's**.

source: Setting defaults limitations on users
de: Einrichten von Standardbeschränkungen für Benutzer
es: Configurar límites predeterminados para los usuarios
fr: Définir des limites par défaut pour les utilisateurs
nl: Standaard beperkingen instellen voor gebruikers

source: Since your portal has global upper limits set, you want to avoid having anybody use all of the license quota just by him/herself. You can therefore set general limits on users and if your portal is open to anonymous users, set a different limit for them. You can also set a global limit for all anonymous users to be sure that they won't eat up all of your usage quota.
de: Da globale Obergrenzen für Ihr Portal existieren, möchten Sie wahrscheinlich vermeiden, dass jemand ganz allein die komplette Lizenzquote in Anspruch nimmt. Daher können Sie allgemeine Grenzen für Benutzer festlegen. Steht Ihr Portal auch anonymen Benutzern offen, können Sie andere Grenzen für sie festlegen. Sie können auch eine globale Grenze für alle anonymen Benutzer einrichten, um sicherzustellen, dass sie nicht die gesamte Nutzungsquote verbrauchen.
es: Como el portal tiene establecidos límites superiores globales, es necesario evitar que alguien acapare toda la cuota de licencia. En este sentido, puede establecer límites generales para los usuarios y, si el portal está abierto a los usuarios anónimos, definir un límite distinto para estos. También puede configurar un límite global para todos los usuarios anónimos a fin de asegurarse de que no consuman toda la cuota de uso.
fr: Étant donné que votre portail présente des limites supérieures globales, il est recommandé de faire en sorte qu'un utilisateur ne puisse pas à lui tout seul consommer la totalité du quota de la licence. Vous pouvez ainsi définir des limites générales pour les utilisateurs, et si votre portail est ouvert aux utilisateurs non authentifiés, définir des limites différentes pour ces derniers. Vous pouvez également définir une limite globale pour tous les utilisateurs non authentifiés, afin de vous assurer qu'ils ne consommeront pas l'intégralité de votre quota d'utilisation.
nl: Aangezien er voor uw portaal globale maximale limieten zijn ingesteld, wil u vermijden dat wie dan ook alle quota's van uw licentie helemaal zelf opgebruikt. U kan daarom algemene limieten instellen voor gebruikers en wanneer uw portaal open staat voor anonieme gebruikers, kan u voor hen een andere limiet instellen. U kan ook een globale limiet instellen voor alle anonieme gebruikers om er zeker van te zijn dat ze al uw gebruiksquota's niet zullen opsouperen.

source: You'll be able to set these limits in the **Security** subsection of the **Configuration** section of your portal's backoffice.
de: Einrichten können Sie diese Beschränkungen im Back-Office Ihres Portals, und zwar im Unterbereich **Sicherheit** des Bereichs **Konfiguration**.
es: Podrá establecer estos límites en la subsección **Seguridad** de la sección **Configuración** del back office del portal.
fr: Vous pourrez définir ces limites dans la sous-section **Sécurité** de la section **Configuration** du back office de votre portail.
nl: U zal deze limieten kunnen instellen in de subsectie **Veiligheid** van de sectie **Configuratie** van de back-office van uw portaal.

source: When a user makes a request (be it an API call, a dataset creation of the publication of a dataset), we make sure he/she isn't running into the default limit set for him/her and isn't going over the global portal limit. Were it the case, a message would pop-up telling him/her so.
de: Startet ein Benutzer eine Anforderung (z. B. API-Aufruf oder Datensatzerstellung von einer Datensatzveröffentlichung) stellen wir sicher, dass er weder die für ihn festgelegte Standardbegrenzung noch die gobale Portalbegrenzung erreicht. Wäre das der Fall, würde ihm das anhand einer Popupnachricht signalisiert.
es: Cuando un usuario efectúa una solicitud (que puede ser una llamada de API, la creación de un conjunto de datos o la publicación de un conjunto de datos), nos aseguramos de que no alcanza el límite predeterminado establecido para él ni el límite global del portal. Si es el caso, le aparecerá un mensaje informativo.
fr: Lorsqu'un utilisateur effectue une requête (que ce soit un appel d'API, la création d'un jeu de données ou encore la publication d'un jeu de données), nous nous assurons qu'il n'atteindra pas la limite par défaut définie pour lui et qu'il n'atteindra pas non plus la limite globale du portail. Le cas échéant, un message s'affiche pour avertir l'utilisateur.
nl: Wanneer een gebruiker een aanvraag doet (zijnde een API call, de aanmaak van een dataset of de publicatie van een dataset), zorgen we ervoor dat hij/zij de standaard limiet niet bereikt die voor hem/haar is ingesteld en dat hij/zij de globale limiet van het portaal niet overschrijdt. Wanneer dit het geval is, zou een bericht te voorschijn kunnen komen om hem/haar dit te melden.

source: Setting specific limitations for individual users and group of users
de: Einrichten spezifischer Einschränkungen für individuelle Benutzer und Benutzergruppen
es: Establecer límites específicos para usuarios individuales y grupos de usuarios
fr: Définir des limites spécifiques pour des utilisateurs individuels et des groupes d'utilisateurs
nl: Specifieke limieten instellen voor individuele gebruikers en groepen van gebruikers.

source: Some of your users have specific roles within your organisation that justify their need for quotas larger than the default ones. For example, you may allow registered users to create only a couple of datasets each, but your Chief Data Office will need to be able to publish as many datasets as the license allows.
de: Einige Ihrer Benutzer übernehmen bestimmte Rollen in Ihrer Organisation, die einen Bedarf an höheren als den standardmäßigen Quoten rechtfertigen. Beispielsweise muss Ihr Chief Data Officer so viele Datensätze veröffentlichen können, wie die Lizenz zulässt, während Sie registrierten Benutzern nur jeweils die Erstellung einiger weniger Datensätze gewähren.
es: Algunos usuarios tienen unos roles específicos en la organización que justifican su necesidad de cuotas superiores a las predeterminadas. Por ejemplo, puede permitir que cada uno de los usuarios registrados cree solo un par de conjuntos de datos, pero el director de datos deberá poder publicar todos los conjuntos de datos permitidos por la licencia.
fr: Certains de vos utilisateurs peuvent avoir des rôles spécifiques au sein de votre organisation qui justifient de bénéficier de quotas supérieurs aux quotas par défaut. Par exemple, vous pouvez autoriser les utilisateurs enregistrés à créer uniquement quelques jeux de données chacun. Votre directeur des données devra en revanche pouvoir publier autant de jeux de données que le permet la licence.
nl: Sommige van uw gebruikers hebben specifieke rollen binnen uw organisatie die rechtvaardigen dat ze quota's nodig hebben die groter zijn dan de standaard quota's. Bijvoorbeeld: u kan geregistreerde gebruikers toelaten om elk slechts een aantal datasets aan te maken, maar uw Chief Data Officer zal zoveel datasets moeten kunnen publiceren als de licentie toelaat.

source: In order to do so, you'll have to go to the :doc:`user's management page <users>` or his/her :doc:`group management page <groups>` to set a more appropriate limit for his/her use case.
de: Dazu müssen Sie zur :doc:`Benutzerverwaltungseite <users>` bzw. der entsprechenden :doc:`Gruppenverwaltungsseite <groups>` wechseln, wo Sie eine für den jeweiligen Fall passendere Begrenzung einrichten können.
es: Para ello, tendrá que ir a la :doc:`página de administración de usuarios <users>` o la :doc:`página de administración de grupos <groups>` con objeto de establecer un límite más adecuado para ese caso de uso.
fr: Pour ce faire, vous devrez accéder à la :doc:`page de gestion de l'utilisateur <users>` ou à la :doc:`page de gestion du groupe <groups>` auquel il appartient pour définir une limite plus adaptée à sa situation.
nl: Om dit te doen, dient u naar de :doc:`beheerpagina van gebruikers <users>` of zijn/haar :doc:`groepsbeheerpagina <groups>` moeten gaan om een meer passende limiet voor zijn/haar geval in te stellen.
