Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_security/saml.po
Languages: es, fr

source: Federate identity with SAML
es: Federar identidades con SAML
fr: Fédérer les identités avec SAML

source: Some organizations already have a user directory service that manages their users authentication and permission, and see little value in using the built in OpenDataSoft user management features. In order to address this use case, the OpenDataSoft platform supports external Identity Providers (IdP) through the SAMLv2 standard. This allows for setting up an identity federation between your domain, which will act as a service provider, and this IdP. This federation allows users of your domain to connect to the platform using the identity provider, and if they have one, reuse their active security context to create a SSO mechanism. Such a federation permits user access through 2 different modes: the transient mode, where users are created on the fly when validated by the IdP, and the linked mode, where an OpenDataSoft user account is linked to a SAML identity through a set of properties known by the IdP. Those two modes can coexist on a domain, but a single user can only connect through one mode.
es: Algunas organizaciones ya tienen un servicio de directorio de usuarios que administra la autenticación y el permiso de los usuarios, y les resulta poco útil emplear las funciones de administración de usuarios integradas en OpenDataSoft. Para abordar este caso de uso, la plataforma OpenDataSoft admite proveedores de identidad (IdP) externos por medio del estándar SAMLv2. Este permite configurar una federación de identidades entre el dominio, que actuará como proveedor de servicio, y este IdP. Esta federación permite a los usuarios de su dominio conectar con la plataforma utilizando el proveedor de identidad y, si tienen uno, reutilizar su contexto de seguridad activo para crear un mecanismo SSO. Esta federación permite el acceso de usuario en 2 modos distintos: el modo transitorio (en que los usuarios se crean sobre la marcha una vez validados por el IdP) y el modo vinculado (en que una cuenta de usuario OpenDataSoft está vinculada a una identidad SAML por medio de una serie de propiedades conocidas por el IdP). Ambos modos pueden coexistir en un dominio, pero un mismo usuario solo puede conectarse empleando un modo.
fr: Certaines organisations disposent déjà d'un service de répertoire d'utilisateurs qui gère l'authentification et les permissions de leurs utilisateurs. Elles ne voient pas les avantages que peuvent apporter les fonctionnalités de gestion des utilisateurs intégrées à OpenDataSoft. Afin de répondre à ce cas d'utilisation, la plateforme OpenDataSoft prend en charge les fournisseurs d'identité (IdP) externes à l'aide de la norme SAMLv2. Il est ainsi possible de mettre en œuvre une fédération des identités entre votre domaine, qui fera office de fournisseur de services, et cet IdP. Cette fédération permettra aux utilisateurs de votre domaine de se connecter à la plateforme via le fournisseur d'identité, et, le cas échéant de réutiliser leur connexion active auprès de celui-ci afin de créer une authentification unique (SSO). Ce type de fédération permettra un accès des utilisateurs selon 2 modes différents : le mode transient, avec lequel les utilisateurs sont créés à la volée une fois qu'ils sont validés par l'IdP, et le mode lié, avec lequel un compte utilisateur OpenDataSoft est lié à une identité SAML via un ensemble de propriétés connues par l'IdP. Ces deux modes peuvent coexister au sein d'un domaine, cependant un utilisateur peut se connecter par l'un ou l'autre de ces deux modes uniquement.

source: Transient mode
es: Modo transitorio
fr: Mode transient

source: In the transient mode, every user that has a user account on the IdP trusted by a domain, and doesn't have a OpenDataSoft user account can connect through SAML. A transient user will be created for the user, based on SAML settings for the domain. These settings are the account mapper (the set of IdP-sent parameters that uniquely identify a user) and the the attribute mapper (the parameters that correspond to the user first name, last name and email address). These transient users have the permission to explore the public datasets of the domain. Extra permissions can be given to these users by using the generic ``SAML users`` group. Transient users may not be assigned any special permissions on individual datasets or added to groups (other than the ``SAML users`` group, of which they are automatic members).
es: En el modo transitorio, todo usuario que tenga una cuenta de usuario en el IdP considerado de confianza por un dominio y no tenga una cuenta de usuario OpenDataSoft podrá conectarse a través de SAML. Se creará un usuario transitorio para el usuario a partir de los valores de configuración SAML del dominio. Estos valores de configuración son el mapeador de cuentas (el conjunto de parámetros enviados por el IdP que identifican un usuario de forma exclusiva) y el mapeador de atributos (los parámetros correspondientes al nombre, apellido y dirección de correo electrónico del usuario). Estos usuarios transitorios tienen permiso para explorar los conjuntos de datos públicos del dominio. Se pueden conceder permisos adicionales a estos usuarios utilizando el grupo de ``usuarios de SAML`` genérico. Los usuarios transitorios no pueden tener asignados permisos especiales en conjuntos de datos individuales ni añadirse a grupos (salvo el grupo de ``usuarios de SAML``, del cual son automáticamente miembros).
fr: En mode transient, chaque utilisateur disposant d'un compte utilisateur auprès de l'IdP approuvé par un domaine, mais ne disposant pas d'un compte utilisateur OpenDataSoft, peut se connecter via le protocole SAML. Un utilisateur transient sera créé pour l'utilisateur, en se basant sur les paramètres SAML du domaine. Ces paramètres sont le mappeur de comptes (l'ensemble des paramètres envoyés par l'IdP permettant d'identifier un utilisateur unique) et le mappeur d'attributs (les paramètres correspondant au prénom, au nom de famille et à l'adresse e-mail de l'utilisateur). Ces utilisateurs transients disposent des permissions pour explorer les jeux de données publics du domaine. Des permissions supplémentaires peuvent être octroyées à ces utilisateurs en utilisant le groupe générique ``Utilisateurs SAML``. Les utilisateurs transients ne peuvent pas disposer de permissions relatives à des jeux de données individuels ni être ajoutés à des groupes (autres que le groupe ``Utilisateurs SAML``, auquel ils sont automatiquement ajoutés).

source: Linked mode
es: Modo vinculado
fr: Mode lié

source: In the linked mode, users that have an OpenDataSoft user account can link this account to particular values of the set of parameters defined in the account mapper setting. After the link has been established, users who log in through SAML will be logged to their OpenDataSoft user account. Linked users may be assigned the same permissions and added to groups just like normal users (as they are normal users). They are also automatic members of the ``SAML users`` group. This mode allows a more fine-grained permission control, while retaining most of the advantages of the transient mode. The only drawback is the necessity for users to create an account on the domain before linking it to their SAML identity. There are two method for linking an OpenDataSoft user account. The first one is to click on ``Link your account to a SAML account on this domain`` in the identity tab of the user account settings.
es: En el modo vinculado, los usuarios que tengan una cuenta de usuario OpenDataSoft podrán vincular esta cuenta a valores específicos del conjunto de parámetros definidos en la configuración del mapeador de cuentas. Una vez establecido el vínculo, los usuarios que inicien la sesión a través de SAML iniciarán la sesión en su cuenta de usuario OpenDataSoft. Los usuarios vinculados pueden tener asignados los mismos permisos y añadirse a grupos igual que los usuarios normales (dado que son usuarios normales). También son automáticamente miembros del grupo de ``usuarios de SAML``. Este modo permite efectuar un control de permisos más preciso, y a la vez conservar la mayoría de las ventajas del modo transitorio. El único inconveniente es la necesidad de que los usuarios creen una cuenta en el dominio antes de vincularla a su identidad SAML. Hay 2 métodos para vincular una cuenta de usuario OpenDataSoft. El primero es hacer clic en ``Vincular la cuenta a una cuenta SAML en este dominio`` en la ficha de identidad de la configuración de la cuenta de usuario.
fr: En mode lié, les utilisateurs disposant d'un compte utilisateur OpenDataSoft peuvent lier ce dernier à des valeurs spécifiques de l'ensemble de paramètres définis dans la configuration du mappeur de comptes. Une fois la liaison établie, les utilisateurs qui s'identifient via le protocole SAML seront identifiés avec leur compte utilisateur OpenDataSoft. Les utilisateurs liés peuvent se voir octroyer les mêmes permissions et être ajoutés aux mêmes groupes que les utilisateurs normaux (car ils sont des utilisateurs normaux). En outre, ils sont automatiquement ajoutés au groupe ``Utilisateurs SAML``. Ce mode permet un contrôle plus précis des permissions, tout en conservant la plupart des avantages que propose le mode transient. Le seul inconvénient est qu'il est nécessaire pour les utilisateurs de créer un compte sur le domaine avant de le lier à leur identité SAML. Il existe deux méthodes pour lier un compte utilisateur OpenDataSoft. La première consiste à cliquer sur ``Lier votre compte à un compte SAML sur ce domaine`` dans l'onglet Identité des paramètres de compte utilisateur.

source: The other method is to create the link during the user account creation process, by clicking the link to complete the registration through SAML. This actually speeds up the user account creation process and allows for a quick account linking.
es: El otro método consiste en crear el vínculo durante el proceso de creación de la cuenta de usuario, haciendo clic en el vínculo para completar el registro a través de SAML. En realidad, esta operación acelera el proceso de creación de la cuenta de usuario y permite vincular la cuenta rápidamente.
fr: L'autre méthode consiste à établir la liaison lors du processus de création du compte utilisateur, en cliquant sur le lien permettant de terminer la création du compte via le protocole SAML. Cette méthode permet d'accélérer le processus de création du compte utilisateur et de lier rapidement ce dernier.

source: Register and configure an identity provider
es: Registrar y configurar un proveedor de identidad
fr: Configurer son domaine avec un fournisseur d'identité

source: Navigate to the signup page in the domain configuration interface.
es: Navegue a la página de registro de la interfaz de configuración del dominio.
fr: Rendez vous sur la page de configuration des intégrations du domaine.

source: Check "Allow access for SAML users"
es: Seleccione "Permitir acceso para usuarios de SAML".
fr: Activez l'option "Autoriser l'accès aux utilisateurs SAML".

source: Paste your identity provider metadata document in the "IDP metadata document" field.
es: Pegue el documento de metadatos de proveedor de identidad en el campo "Documento de metadatos de proveedor de identidad (IdP)".
fr: Collez le document de metadata de votre fournisseur d'identité dans le champ "Document de metadata de l'IDP".

source: If you are using Microsoft Azure Active Directory as an IDP, check the related checkbox.
es: Si utiliza Microsoft Azure Active Directory como IdP, seleccione la casilla en cuestión.
fr: Si vous utilisez Microsoft Azure Active Directory comme Identity Provider, cochez la case.

source: Input the set of attributes sent by the IDP that uniquely define a user.
es: Introduzca el conjunto de atributos enviados por el IdP que definen un usuario de forma exclusiva.
fr: Renseignez l'ensemble des attributs renvoyés par l'IDP qui définissent de façon unique un utilisateur.

source: If the users are defined by their NameID and the NameID format used by your IdP is not transient, there is no need to fill anything.
es: Si los usuarios se definen por su ID de nombre y el formato del ID de nombre utilizado por el IdP no es transitorio, no es necesario especificar nada.
fr: Si les utilisateurs sont définis de façon unique par leur NameID saml, et que le format du NameID n'est pas transient, il n'est pas nécessaire de remplir cette option.

source: For instance, if your users are defined by the attribute "FirstName" and "LastName" transmitted by your IdP, first input "FirstName" in the box and press enter, then "LastName" and press enter again.
es: Por ejemplo, si los usuarios se definen por los atributos "FirstName" y "LastName" transmitidos por el IdP, primero especifique "FirstName" en la casilla y pulse Entrar, y después "LastName" y vuelva a pulsar Entrar.
fr: Par exemple, si vos utilisateurs sont définis par l'attribut "FirstName" et "LastName", entrez "FirstName" dans la zone de texte, puis validez avec enter. Entrez ensuite "LastName" et validez avec enter.

source: Input the attributes mappings for the username, last name, first name and email address.
es: Introduzca las asignaciones de atributos correspondientes al nombre de usuario, el apellido, el nombre y la dirección de correo electrónico.
fr: Renseignez les mappings d'attributs pour le nom d'utilisateur, le nom de famille, le prénom et l'adresse email.

source: Here, you need to declare the fields names as they are sent by the identity provider.
es: Aquí tiene que declarar los nombres de campo tal como los ha enviado el proveedor de identidad.
fr: Il s'agit ici de remplir les champs correspondant avec le nom de l'attribut tel qu'envoyé par le fournisseur d'identité.

source: For instance, if your identity provider transmits the connected user's first name in an attribute called "GivenName", this is what you will need to type in the "First name" field.
es: Por ejemplo, si el proveedor de identidad transmite el nombre del usuario conectado en un atributo denominado "GivenName", esto es lo que usted deberá escribir en el campo "First name".
fr: Par exemple, si votre fournisseur d'identité renseigne le prénom de l'utilisateur qui se connecte en appellant cet attribut "FirstName", c'est ce qu'il faudra écrire dans le champ "prénom".

source: If for any reason your identity provider doesn't send all of these elements, let the corresponding fields blank. The platform will automatically generate them based on other available attributes.
es: Si por algún motivo el proveedor de identidad no enviara todos estos elementos, deje los campos correspondientes en blanco. La plataforma los generará automáticamente a partir de los demás atributos disponibles.
fr: Si certaines de ces informations ne sont pas fournies par votre fournisseur d'identité, laissez les champs vides. La plateforme les générera automatiquement sur base des autres attributs définis.

source: Optionally input an access condition.
es: Si lo desea, especifique una condición de acceso.
fr: Définissez des conditions d'accès éventuelles.

source: The first box is the name of the attribute to check for, and the second one the value of that attribute. If you just want to check for the presence of an attribute, without value restriction, just leave the second box blank.
es: La primera casilla es el nombre del atributo que se examinará y el segundo es el valor de ese atributo. Si solo desea comprobar la presencia de un atributo, sin restricción de valor alguna, deje la segunda casilla en blanco.
fr: La première zone de texte est le nom de l'attribut à vérifier, et la seconde est la valeur que cet attribut doit prendre. Si vous désirez uniquement vérifier la présence de l'attribut, vous pouvez ne pas renseigner la seconde zone de texte.

source: For instance, if your identity provider sends a list of "Roles" for the users and you want to make sure that only users that have a role can get access, input "Roles" in the first box under "Conditionnal access". If you only want users with the role "DataAccess" to be able to connect to the domain, input "DataAccess" in the second box.
es: Por ejemplo, si el proveedor de identidad envía una lista de "Roles" para los usuarios y desea comprobar que solo puedan acceder los usuarios que tengan un rol, introduzca "Roles" en la primera casilla bajo "Acceso condicional". Si desea que solo puedan conectarse al dominio los usuarios con el rol "DataAccess", introduzca "DataAccess" en la segunda casilla.
fr: Par exemple, si votre IdP renvoie une liste de "Roles" pour les utilisateurs, et que vous voulez que seuls les utilisateurs qui ont un rôle puissent se connecter, renseignez "Roles" dans la première zone de texte. Si vous voulez vous assurer que seuls les utilisateurs qui ont le rôle "DataAccess" aient accès au domaine, entrez "DataAccess" dans la seconde zone de texte.

source: Configure your identity provider
es: Configurar el proveedor de identidad
fr: Configurer le fournisseur d'identité

source: The configuration of the identity provider is implementation-dependant, but it always consist of importing the service provider metadata document to enable a identity federation.
es: La configuración del proveedor de identidad varía en función de la implementación, pero siempre es necesario importar el documento de metadatos de proveedor de identidad para hacer posible la federación de identidades.
fr: La configuration du fournisseur d'identité dépend de l'implémentation de celui-ci, mais elle consiste toujours en l'import du document de metadata du fournisseur de service.

source: You can download the metadata document for your OpenDataSoft domain on ``https://<YOUR DOMAIN>.opendatasoft.com/saml2/metadata.xml``
es: Puede descargar el documento de metadatos del dominio OpenDataSoft en ``https://<SU_DOMINIO>.opendatasoft.com/saml2/metadata.xml``.
fr: Vous pouvez télécharger le document de metadata du fournisseur de services OpenDataSoft en vous rendant sur ``https://<VOTRE DOMAINE>.opendatasoft.com/saml2/metadata.xml``

source: Using user attributes to filter data
fr: Utilisation des attributs utilisateur pour filtrer des données

source: Through the #attr function, it is possible to filter a dataset records in such a way that the only records returned are the ones that match a value set in the user attributes sent by the IdP. For the following examples, we assume that we have the 3 users, with respective usernames and SAML attributes ``user-country`` and ``user-language`` given by the following table.
fr: La fonction #attr vous permet de filtrer les enregistrements d'un jeu de données de façon que seuls les enregistrements renvoyés soient ceux qui correspondent à une valeur définie dans les attributs utilisateur envoyés par l'IDP. Dans les exemples suivants, nous partons du principe que nous avons 3 utilisateurs avec des noms d'utilisateur et attributs SAML respectifs "user-country" et "user-language" indiqués dans le tableau suivant.

source: User
fr: Utilisateur

source: User1
fr: Utilisateur1

source: French
fr: Français

source: User2
fr: Utilisateur2

source: User3
fr: Utilisateur3

source: United States
fr: États-Unis

source: English
fr: Anglais

source: And a dataset with records given by the following table.
fr: Et un jeu de données avec des enregistrements indiqués par le tableau suivant.

source: country
fr: pays

source: Worldwide
fr: Monde

source: We can restrict these users so that they see only messages that apply to their respective countries, with the query ``#attr(country, user-country)``.
fr: Nous pouvons limiter ces utilisateurs de façon qu'ils voient uniquement les messages concernant leur pays respectif en utilisant la requête "#attr(country, user-country)".

source: User1 sees
fr: Utilisateur1 voit

source: User2 sees
fr: Utilisateur2 voit

source: User3 sees
fr: Utilisateur3 voit

source: We can also restrict these users so that they only see messages that are in their respective language, with the query ``#attr(language, user-language)``.
fr: Nous pouvons également limiter ces utilisateurs de façon qu'ils voient uniquement les messages dans leur langue respective en utilisant la requête "#attr(language, user-language)".

source: Since it is a function of the query language, it can also be grouped with the usual operators, for instance, we can restrict users to only seeing messages that fit their country and languages with the query ``#attr(language, user-language) AND #attr(country, user-country)``.
fr: Cette fonction étant propre au langage de requête, elle peut également être combinée aux opérateurs habituels. Nous pouvons, par exemple, limiter les utilisateurs de façon qu'ils voient uniquement les messages adaptés à leur pays et à leur langue en utilisant la requête "#attr(language, user-language) AND #attr(country, user-country)".
