Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_security/users.po
Languages: de, es, it

source: Managing users
de: Verwalten von Benutzern
es: Administrar los usuarios
it: Gestione degli utenti

source: Now that you've set up your :doc:`portal's security policy <portal>`, people are registering and becoming full-fledged users. Unless your portal is closed to anonymous users, this new status is not changing anything for them. They can still see the same data and a subject to the same quotas as before.
de: Nachdem Sie die :doc:`Sicherheitsrichtlinie für das Portal <portal>` eingerichtet haben, registrieren sich Personen und werden vollwertige Benutzer. Sofern Ihr Portal anonymen Benutzern nicht verwehrt bleibt, ändert dieser neue Status nichts für sie. Sie sehen nach wie vor die gleichen Daten und unterliegen den gleichen Quoten wie zuvor.
es: Una vez configurada la :doc:`directiva de seguridad del portal <portal>`, los visitantes se registran y pasan a ser realmente usuarios. Salvo que el portal se cierre a los usuarios anónimos, este nuevo estatus no les supone ningún cambio. Pueden seguir viendo los mismos datos y están sujetos a las mismas cuotas que antes.
it: Dopo che avrai definito la :doc:`politica di sicurezza del tuo portale <portal>`, le persone cominceranno a registrarsi diventando utenti a tutti gli effetti. A meno che tu non abbia deciso di impedire l'accesso anonimo, la registrazione non cambierà nulla per gli utenti, che continueranno a usufruire degli stessi dati e delle stesse quote di prima.

source: Permissions
de: Berechtigungen
es: Permisos
it: Permessi

source: What is changing is that you can now give them permissions extending what they can do. You can do so either on the users' index page or directly on the single user management page, both accessible through the **Users & groups / Users** section in your backoffice.
de: Neu ist, dass Sie ihnen nun Berechtigungen erteilen können, was sie tun dürfen. Dies können Sie entweder auf der Benutzerindexseite oder direkt auf der Verwaltungsseite des einzelnen Benutzers vornehmen. Auf beide greifen Sie in Ihrem Back-Office über den Bereich **Benutzer + Gruppen / Benutzer** zu.
es: Lo que cambia es que usted ahora puede darles permisos que amplíen las tareas que pueden llevar a cabo. Puede hacerlo en la página de índice de usuarios o directamente en la página de administración de usuarios, a las cuales se accede a través de la sección **Usuarios y grupos/Usuarios** del back office.
it: A cambiare è la possibilità di assegnare loro permessi che consentano un maggior numero di azioni. Puoi fare ciò dalla pagina di indice degli utenti o direttamente sulla pagina di gestione del singolo utente, entrambe raggiungibili cliccando su **Utenti e gruppi / Utenti** nell'interfaccia di back-office.

source: Permissions each affect an independent part of your portal so that by looking at a user's permissions list you know exactly what he/she can do. Each permission has its own category, symbolized by an icon and a tag color.
de: Berechtigungen wirken sich jeweils auf einen unabhängigen Teil Ihres Portals aus. So können Sie durch die Einsicht in die Liste der Benutzerberechtigungen genau ermitteln, was ein Benutzer genau tun kann. Jede Berechtigung hat eine eigene Kategorie, die durch ein Symbol und eine Tagfarbe angezeigt wird.
es: Los permisos afectan a partes independientes del portal, de modo que al ver la lista de permisos de un usuario sabrá exactamente qué tareas puede realizar. Cada uno de los permisos tiene su propia categoría, simbolizada mediante un icono y una etiqueta de color.
it: Ogni permesso ha un impatto su una parte indipendente del tuo portale, tanto che guardando i permessi di un utente puoi determinare con precisione cosa gli è consentito fare. Ogni permesso è caratterizzato da una determinata categoria di appartenenza, un'icona specifica e un colore per il tag.

source: Dataset permissions
de: Datensatzberechtigungen
es: Permisos de conjunto de datos
it: Permessi del dataset

source: Permission
de: Berechtigung
es: Permiso
it: Permesso

source: Description
de: Beschreibung
es: Descripción
it: Descrizione

source: Browse all datasets
de: Alle Datensätze durchsuchen
es: Explorar todos los conjuntos de datos
it: Esplora tutti i dataset

source: The user may access all data on all published datasets, regardless of any security parameters even specific rules set just for this user.
de: Der Benutzer kann ungeachtet etwaiger Sicherheitsparameter oder gar spezifischer Regeln, die nur für diesen Benutzer eingerichtet wurden, auf sämtliche Daten in allen veröffentlichten Datensätzen zugreifen.
es: El usuario puede acceder a todos los datos de todos los conjuntos de datos publicados, con independencia de los parámetros de seguridad o hasta las reglas específicas establecidas únicamente para este usuario.
it: L'utente può avere accesso a tutti i dati presenti nei dataset pubblicati, a prescindere dai parametri di sicurezza impostati o da eventuali regole assegnategli in maniera esclusiva.

source: Create new datasets
de: Neue Datensätze erstellen
es: Crear conjuntos de datos nuevos
it: Crea nuovi dataset

source: The user may create new datasets (but not publish them), within the limits defined by the quotas.
de: Der Benutzer kann innerhalb der durch die Quoten festgelegten Grenzen neue Datensätze erstellen (aber nicht veröffentlichen).
es: El usuario puede crear conjuntos de datos nuevos (pero no publicarlos), dentro de los límites definidos por las cuotas.
it: L'utente può creare nuovi dataset (ma non pubblicarli), nei limiti definiti dalle quote.

source: **Grants access to the catalog section of the backoffice**
de: **Gewährt Zugriff auf den Katalogbereich des Back-Office**
es: **Concede acceso a la sección del catálogo del back office.**
it: **Permette l'accesso alla sezione Catalogo dell'interfaccia di back-office**.

source: Edit all datasets
de: Alle Datensätze bearbeiten
es: Editar todos los conjuntos de datos
it: Modifica tutti i dataset

source: The user may edit all existing datasets.
de: Der Benutzer kann alle vorhandenen Datensätze bearbeiten.
es: El usuario puede editar todos los conjuntos de datos existentes.
it: L'utente può modificare tutti i dataset esistenti.

source: Manage own datasets' security
de: Sicherheit eigener Datensätze verwalten
es: Administrar la seguridad del conjunto de datos propio
it: Gestisci la sicurezza dei tuoi dataset

source: The user gets access to the security section of the dataset edition page and is able to set rules defining who can access which records within the datasets he/she can edit.
de: Der Benutzer erhält Zugriff auf den Sicherheitsbereich der Datensatzbearbeitungsseite und kann Regeln einrichten, die festlegen, wer innerhalb der Datensätze, die er bearbeiten darf, auf welche Einträge zugreifen kann.
es: El usuario obtiene acceso a la sección de seguridad de la página de edición del conjunto de datos y puede establecer reglas que definan quién puede acceder a qué registros de los conjuntos de datos que puede editar.
it: L'utente ha accesso alla sezione Sicurezza nella pagina di modifica dei dataset e può definire regole per stabilire chi può accedere e a quali record.

source: Publish own datasets
de: Eigene Datensätze veröffentlichen
es: Publicar conjuntos de datos propios
it: Pubblica i tuoi dataset

source: The user can publish or republish the datasets he/she can edit.
de: Der Benutzer kann Datensätze, die er bearbeiten darf, veröffentlichen oder erneut veröffentlichen.
es: El usuario puede publicar o volver a publicar los conjuntos de datos que puede editar.
it: L'utente può pubblicare o ripubblicare i dataset che è autorizzato a modificare.

source: These are general permissions that apply to a user with regard to the portal, but user can also get :doc:`permissions for individual datasets </sourcing_and_processing_data/security>`.
de: Dies sind allgemeine Berechtigungen, die für einen Benutzer im Hinblick auf das Portal gelten. Einem Benutzer können jedoch auch :doc:`Berechtigungen für einzelne Datensätze </sourcing_and_processing_data/security>` erteilt werden.
es: Son permisos generales que se aplican a un usuario en relación con el portal, pero el usuario también puede obtener :doc:`permisos para conjuntos de datos individuales </sourcing_and_processing_data/security>`.
it: Questi sono permessi generali relativi all'intero portale, ma l'utente può anche ottenere :doc:`permessi per singoli dataset </sourcing_and_processing_data/security>`.

source: Other permissions
de: Sonstige Berechtigungen
es: Otros permisos
it: Altri permessi

source: Edit domain properties
de: Domaineigenschaften bearbeiten
es: Editar propiedades de dominio
it: Modifica le proprietà del dominio

source: The user may edit all properties in the **Look & feel**, **Users & groups** and **Configuration** sections of the backoffice. He/she also gets access to the **Analytics** and **Assets** sections.
de: Der Benutzer kann alle Eigenschaften in den Back-Office-Bereichen **Aussehen + Eindruck**, **Benutzer + Gruppen** sowie **Konfiguration** bearbeiten. Er erhält auch Zugriff auf die Bereiche **Analyse** und **Objekte**.
es: El usuario puede editar todas las propiedades de las secciones **Apariencia**, **Usuarios y grupos** y **Configuración** del back office. También obtiene acceso a las secciones **Análisis** y **Activos**.
it: L'utente può modificare tutte le proprietà sull'interfaccia di back-office, nelle sezioni **Look & feel**, **Utenti e gruppi** e **Configurazione**. Ha inoltre accesso alle sezioni **Analytics** e **Risorse**.

source: Edit all pages
de: Alle Seiten bearbeiten
es: Editar todas las páginas
it: Modifica tutte le pagine

source: The user may create, edit and delete all pages. He/she can also manage assets.
de: Der Benutzer kann Seiten erstellen sowie alle Seiten bearbeiten und löschen. Zudem kann er Objekte verwalten.
es: El usuario puede crear, editar y suprimir todas las páginas. También puede administrar activos.
it: L'utente può creare, modificare ed eliminare qualsiasi tipo di pagina, oltre a poter gestire le risorse.

source: Manage all reuses
de: Alle Weiterverwendungen verwalten
es: Administrar todas las reutilizaciones
it: Gestisci tutti i riutilizzi

source: The user may see, approve, reject and delete all reuse submissions on the portal.
de: Der Benutzer kann alle Weiterverwendungseinsendungen anzeigen, genehmigen, ablehnen oder löschen.
es: El usuario puede consultar, aprobar, rechazar y suprimir todos los envíos de reutilización del portal.
it: L'utente può consultare, approvare, rifiutare ed eliminare tutte le richieste di riutilizzo del portale.

source: Manage all subdomains
de: Alle Subdomains verwalten
es: Administrar todos los subdominios
it: Gestisci tutti i sottodomini

source: :doc:`If subdomains are enabled on the portal </managing_subdomains/index>`, then the user may edit, create and delete all subdomains.
de: :doc:`Sind Subdomains für das Portal aktiviert </managing_subdomains/index>`, kann der Benutzer Subdomains erstellen sowie alle Subdomains bearbeiten und löschen.
es: :doc:`Si la creación de subdominios está activada en el portal </managing_subdomains/index>`, el usuario puede editar, crear y suprimir todos los subdominios.
it: :doc:`Se sul portale sono attivi i sottodomini </managing_subdomains/index>`, l'utente può modificarli, crearli ed eliminarli.

source: Browse analytics
de: Analysen durchsuchen
es: Explorar análisis
it: Consulta le statistiche

source: The user may access all analytics dashboards, both at the `domain level </monitoring_audience>`_ and at the dataset level.
de: Der Benutzer kann auf alle Analyse-Dashboards zugreifen, sowohl auf `Domainebene </monitoring_audience>`_ als auch auf Datensatzebene.
es: El usuario puede acceder a todos los paneles de análisis, tanto a `nivel de dominio </monitoring_audience>`_ como a nivel de conjunto de datos.
it: L'utente può accedere alle statistiche dei dashboard, a livello sia del `dominio </monitoring_audience>`_ sia del dataset.

source: **Grants access to the analytics section of the backoffice**
de: **Gewährt Zugriff auf den Analysebereich des Back-Office**
es: **Concede acceso a la sección de análisis del back office.**
it: **Permette l'accesso alla sezione di statistiche dell'interfaccia di back-office**.

source: Quotas
de: Quoten
es: Cuotas
it: Quote

source: In order to avoid having a user use up all of your license usage quotas, you can :doc:`set up default quotas for users <quotas>`. However you can override the general quotas given to everybody with specific values tailored to a single profile for each of the 3 quota types.
de: Um zu vermeiden, dass ein Benutzer all Ihre Lizenznutzungsquoten beansprucht, können Sie :doc:`Standardquoten für Benutzer einrichten <quotas>`. Diese allen zugeordneten allgemeinen Quoten können Sie jedoch auch mit bestimmten, auf das jeweilige Profil zugeschnittenen Werten für jeden der 3 Quotentypen überschreiben.
es: Para evitar que un usuario utilice todas las cuotas de uso de su licencia, puede :doc:`configurar cuotas predeterminadas para los usuarios <quotas>`. No obstante, puede sobrescribir las cuotas generales concedidas a todos con valores específicos ajustados a un perfil determinado para cada uno de los 3 tipos de cuotas.
it: Per evitare che un utente esaurisca le quote di utilizzo previste dalla tua licenza, puoi :doc:`stabilire quote predefinite per gli utenti <quotas>`. Al contempo, puoi assegnare valori specifici a singoli utenti per ciascuna delle 3 quote disponibili, ignorando i valori impostati per tutti.

source: Since quotas can also be defined at the group level, users are inheriting from 3 settings.
de: Da Quoten auch auf der Gruppenebene definiert werden können, erben Benutzer von 3 Einstellungen.
es: Puesto que las cuotas también se pueden definir a nivel de grupo, los usuarios las heredan de una triple configuración.
it: Poiché le quote possono essere definite anche a livello dei gruppi, gli utenti ereditano 3 parametri:

source: license quotas (for the whole portal)
de: Lizenzquoten (für das gesamte Portal)
es: Cuotas de licencia (para todo el portal)
it: le quote della licenza, valide per l'intero portale;

source: default quotas (for each user indifferently)
de: Standardquoten (für alle Benutzer gleich)
es: Cuotas predeterminadas (para cada uno de los usuarios indiferentemente)
it: le quote predefinite, valide per tutti gli utenti;

source: group quotas (for each member)
de: Gruppenquoten (für jedes Mitglied)
es: Cuotas de grupo (para cada uno de los miembros)
it: le quote dei gruppi, validi per i loro membri.

source: The value that applies to the given is calculated as such:
de: Der Wert, der für das Gegebene gilt, wird als solcher berechnet:
es: El valor que se aplica a un usuario determinado se calcula así:
it: Il valore della quota risultante è calcolato in base ai seguenti criteri:

source: If there is a specific value for the user, this value applies.
de: Gibt es einen spezifischen Wert für den Benutzer, gilt dieser.
es: Si hay un valor específico para el usuario, se aplica este valor.
it: In presenza di un valore specifico per l'utente, è questo ad essere applicato.

source: If there is no specific value for the user, but the user is member of at least one group with a specific value, then the maximum of all group values apply.
de: Gibt es keinen spezifischen Wert für den Benutzer, der jedoch Mitglied mindestens einer Gruppe mit einem spezifischen Wert ist, gilt der höchste aller Gruppenwerte.
es: Si no hay un valor específico para el usuario pero el usuario es miembro de como mínimo un grupo con un valor específico, se aplica el máximo de todos los valores de grupo.
it: In assenza di un valore specifico individuale, se l'utente fa parte di almeno un gruppo con una quota specifica, allora viene applicato il valore più alto tra le quote di tutti i gruppi.

source: If there no specific value and no group value, then the default security value for non-anonymous users applies.
de: Gibt es weder einen spezifischen Wert noch einen Gruppenwert, gilt der Standardsicherheitswert für nicht anonyme Benutzer.
es: Si no hay un valor específico ni un valor de grupo, se aplica el valor de seguridad predeterminado para los usuarios no anónimos.
it: In assenza di valori specifici a livello dell'utente e dei gruppi, ad essere applicato è il valore predefinito di sicurezza per gli utenti non anonimi.

source: The applied values is then of course capped at the license value.
de: Die geltenden Werte erhalten dann natürlich den Lizenzwert als Obergrenze.
es: A continuación, los valores aplicados se limitan como máximo al valor de la licencia.
it: Naturalmente, i valori applicati non possono poi superare quelli previsti dalla licenza.

source: Since this is a bit difficult to remember, the interface includes a calculator showing you the license, default and group values and dynamically computes the effective quota depending on the specific value you're setting up.
de: Da dies etwas schwierig zu behalten ist, bietet die Schnittstelle einen Rechner, der die Lizenz-, Standard- und Gruppenwerte anzeigt und die effektive Quote je nach dem spezifischen Wert, den Sie einrichten, dynamisch berechnet.
es: Como es un poco difícil de recordar, la interfaz incluye una calculadora que muestra los valores de licencia, predeterminado y grupo, y calcula dinámicamente la cuota real según el valor específico configurado.
it: Poiché tali norme potrebbero risultare non facili da ricordare, l'interfaccia offre un riepilogo dei valori previsti dalla licenza, nonché di quelli predefiniti e relativi ai gruppi. In base anche all'eventuale valore specifico da te definito, viene quindi calcolata in maniera dinamica la quota effettiva risultante.
