Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_portal/tabs.po
Languages: de, es, fr, it, nl

source: Configure catalog & dataset pages
de: Katalog- und Datensatzseiten konfigurieren
es: Configurar páginas de catálogo y conjunto de datos
fr: Configuration des pages de jeux de données et du catalogue
it: Configurazione delle pagine del catalogo e dei dataset
nl: Catalogus- en datasetpagina's configureren

source: This section explains which features can be configured on the catalog and dataset pages.
de: Dieser Abschnitt erklärt, welche Funktionen auf den Katalog- und Datensatzseiten konfiguriert werden können.
es: En esta sección se describen las funciones que se pueden configurar en las páginas de catálogo y conjunto de datos.
fr: Cette section présente les fonctionnalités qui peuvent être configurées sur les pages de jeux de données et du catalogue.
it: Questa sezione illustra le opzioni che è possibile configurare nelle pagine del catalogo e dei dataset.
nl: In dit deel wordt uitgelegd welke eigenschappen geconfigureerd kunnen worden op de catalogus- en datasetpagina's.

source: Catalog page
de: Katalogseite
es: Página de catálogo
fr: Page du catalogue
it: Pagina del catalogo
nl: Cataloguspagina

source: **Geographic filter**
de: **Geografischer Filter**
es: **Filtro geográfico**
fr: **Filtre géographique**
it: **Filtro geografico**
nl: **Geografische filter**

source: If you have datasets with geographic metadatas, you can give users the possibility to filter the catalog for datasets in a specific area using a mini-map in the filters bar. See :doc:`Looking up the catalog </exploring_catalog_and_datasets/catalog>` for more details.
de: Haben Sie Datensätze mit geografischen Metadaten, können Sie Benutzern mittels einer Minikarte in der Filterleiste das Filtern des Katalogs nach Datensätzen in einem bestimmten Gebiet ermöglichen. Weitere Detials siehe :doc:`Katalog durchsuchen </exploring_catalog_and_datasets/catalog>`.
es: Si tiene conjuntos de datos con metadatos geográficos, puede dar a los usuarios la posibilidad de filtrar el catálogo para los conjuntos de datos de una área específica utilizando un minimapa en la barra de filtros. Vea :doc:`Consultar el catálogo </exploring_catalog_and_datasets/catalog>` para obtener más detalles.
fr: Si vous avez des jeux de données incluant des métadonnées géographiques, vous pouvez permettre aux utilisateurs de filtrer le catalogue en fonction d'une certaine zone géographique en utilisant une mini-carte dans la barre des filtres. Voir :doc:`Effectuer une recherche dans le catalogue </exploring_catalog_and_datasets/catalog>` pour plus de détails.
it: Se i tuoi dataset includono metadati geografici, puoi mettere a disposizione degli utenti una mini-mappa nella barra dei filtri del catalogo, grazie alla quale sarà possibile visualizzare solo i dataset compresi all'interno dell'area geografica selezionata. Per maggiori informazioni consulta la sezione :doc:`Ricerca all'interno del catalogo </exploring_catalog_and_datasets/catalog>`.
nl: Wanneer u datasets met geografische metadata hebt, kan u gebruikers de mogelijkheid bieden om de catalogus te filteren voor datasets in een welbepaald gebied door gebruik te maken van een minikaart in de filterbalk. Voor meer details kan u terecht op :doc:`De catalogus opzoeken </exploring_catalog_and_datasets/catalog>` .

source: This feature can be enabled or disabled in the ``Configuration`` section in the menu bar, then on the ``Catalog page & dataset pages`` link
de: Diese Funktion können Sie über den Menüleistenbereich ``Konfiguration`` und dann den Link ``Katalogseite + Datensatzseiten`` aktivieren bzw. deaktivieren.
es: Esta función se puede activar o desactivar en la sección ``Configuración`` de la barra de menús, y después en el vínculo ``Páginas de catálogo y conjunto de datos``.
fr: Cette fonctionnalité peut être activée ou désactivée dans la section ``Configuration`` de la barre de menus, sous le lien ``Page du catalogue et pages de jeux de données``.
it: Per attivare o disattivare questa opzione, clicca sul link ``Pagine di dataset e catalogo`` della sezione ``Configurazione`` nella barra dei menu.
nl: Deze eigenschap kan geactiveerd of gedeactiveerd worden in de rubriek ``Configuratie`` in de menubalk en vervolgens op de koppeling ``Cataloguspagina & datasetpagina's``.

source: Dataset page
de: Datensatzseite
es: Página de conjunto de datos
fr: Page du jeu de données
it: Pagina del dataset
nl: Datasetpagina

source: Users can explore and analyze datasets using different visualizations and tools, each one available in a tab in the dataset page. See :doc:`Visualizing data </exploring_catalog_and_datasets/dataset>` for more details.
de: Benutzer können Datensätze mithilfe verschiedener Darstellungen sowie Tools untersuchen und analysieren, die jeweils in einem Register auf der Datensatzseite bereitgestellt werden. Weitere Details siehe :doc:`Daten darstellen </exploring_catalog_and_datasets/dataset>`.
es: Los usuarios pueden explorar y analizar los conjuntos de datos con diferentes visualizaciones y herramientas, cada una de ellas disponible en una ficha de la página de conjunto de datos. Consulte :doc:`Visualizar datos </exploring_catalog_and_datasets/dataset>` para obtener más detalles.
fr: Les utilisateurs peuvent explorer et analyser les jeux de données grâce à plusieurs outils et visualisations disponibles dans un onglet de la page du jeu de données. Voir :doc:`Visualiser des données </exploring_catalog_and_datasets/dataset>` pour plus d'informations.
it: Gli utenti possono esplorare e analizzare i dataset utilizzando diversi strumenti e visualizzazioni, tutti accessibili singolarmente nella pagina del dataset, con le schede dedicate. Per maggiori informazioni, consulta la sezione :doc:`Visualizzazione dei dati </exploring_catalog_and_datasets/dataset>`.
nl: Gebruikers kunnen datasets zoeken en analyseren door gebruik te maken van verschillende weergaves en tools, die elk beschikbaar zijn in een tabblad in de datasetpagina. Voor meer details, raadpleeg :doc:`Data weergeven </exploring_catalog_and_datasets/dataset>`.

source: **Default tab**
de: **Standardregister**
es: **Ficha predeterminada**
fr: **Onglet par défaut**
it: **Scheda predefinita**
nl: **Standaard tabblad**

source: By default the dataset is opened on the **table view**, but you can choose to display the **information tab** instead. The table view by default is useful to give users with a direct access to the data, whereas the information tab by default is interesting to provide users with context and description first.
de: Ein Datensatz wird standardmäßig in der **Tabellenansicht** geöffnet, aber Sie können stattdessen auch die **Registerkarte Informationen** anzeigen lassen. Die standardmäßige Tabellenansicht ist hilfreich, um Benutzern Direktzugriff auf Daten zu gewähren, während die standardmäßige Anzeige des Informationsregisters interessant ist, um Benutzer zunächst mit einem Kontext und einer Beschreibung zu versorgen.
es: El conjunto de datos se abre de forma predeterminada con la **vista de tabla**, pero puede elegir visualizar la **ficha de información**. La visualización predeterminada de la vista de tabla resulta útil para permitir a los usuarios acceder directamente a los datos, mientras que la visualización predeterminada de la ficha de información es interesante para brindarles en primer lugar la información de contexto y descripción.
fr: Par défaut, le jeu de données s'ouvre sur la **vue tableau**, mais vous pouvez afficher **l'onglet informations** à la place. Choisir la vue tableau permet aux utilisateurs d'accéder directement aux données tandis que l'onglet Informations leur donnera d'abord le contexte et la description.
it: Il dataset si apre per impostazione predefinita in modalità di **visualizzazione Tabella**, ma in alternativa è possibile impostare l'apertura sulla **scheda Informazioni**. Nel primo caso gli utenti hanno il vantaggio di accedere direttamente ai dati, mentre nel secondo quello di ricevere prima una descrizione introduttiva e varie informazioni di contesto.
nl: Standaard wordt de dataset geopend met de **tabelweergave**, maar u kan er in de plaats voor kiezen om het **informatietabblad** weer te geven. De standaard tabelweergave is nuttig om gebruikers rechtstreeks toegang te geven tot de data, terwijl het standaard informatietabblad interessant is om gebruikers eerst de context en de omschrijving te geven.
