Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_subdomains/index.po
Languages: fr

source: Managing subdomains
fr: Gérer les sous-domaines

source: Subdomains management lets OpenDataSoft customers manage autonomously their own set of domains. A subdomain shares the exact same characteristics as a domain, except that its quotas can be managed from the parent domain (root domain).
fr: La gestion des sous-domaines permet aux clients OpenDataSoft de gérer de manière autonome l'ensemble de leurs domaines. Un sous-domaine présente exactement les mêmes caractéristiques qu'un domaine, à la différence que ses quotas peuvent être gérés à partir du domaine parent (domaine racine).

source: Subdomains are made available to OpenDataSoft's customers through a specific, paying, license option.
fr: Les clients OpenDataSoft peuvent avoir accès aux sous-domaines via une option de licence payante spécifique.

source: Subdomains can be used for different purposes:
fr: Les sous-domaines peuvent être utilisés à différentes fins dont voici quelques exemples :

source: A private company with different business units wanting to manage their own OpenDataSoft instance (domain).
fr: Une entreprise privée composée de différentes unités commerciales souhaitant chacune gérer sa propre instance (domaine) OpenDataSoft.

source: A local government sustaining an Open Data policy at a regional scale, providing its local cities with an on-the-shelf Open Data platform.
fr: Un gouvernement local appliquant une politique Open Data au niveau régional, offrant à ses municipalités une plateforme Open Data prête à l'emploi.

source: The subdomain creation is managed from the parent domain. Once created, the subdomain owner can:
fr: La création des sous-domaines est gérée à partir du domaine parent. Une fois le sous-domaine créé, son propriétaire peut :

source: Manage its own security policy (users, groups)
fr: Gérer sa propre politique de sécurité (utilisateurs, groupes)

source: Create and manage datasets and content pages
fr: Créer et gérer des jeux de données et des pages de contenu

source: Manage the look and feel of its portal
fr: Gérer l'apparence de son portail

source: Thanks to the :doc:`Federation </sourcing_and_processing_data/federation>` feature, domains and subdomains can easily share datasets between each other.
fr: Grâce à la fonctionnalité de :doc:`fédération </sourcing_and_processing_data/federation>`, les domaines et les sous-domaines peuvent se partager des jeux de données facilement.
