Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_account/07_managing_identities/managing_identities.po
Languages: de, es, fr, nl

source: Managing identities
de: Identitäten verwalten
es: Administrar las identidades
fr: Gérer les identités
nl: Identiteiten beheren

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: The Identities tab is only available if SAML or OpenID Connect (OIDC) is enabled on the portal.
de: Die Registerkarte "Identitäten" ist nur verfügbar, wenn SAML oder OpenID Connect (OIDC) im Portal aktiviert sind.
es: La ficha Identidades solo está disponible si SAML u OpenID Connect (OIDC) está activado en el portal.
fr: L'onglet Identités n'est disponible que si SAML ou OpenID Connect (OIDC) est activé sur le portail.
nl: Het tabblad Identiteiten is enkel beschikbaar wanneer SAML of OpenID Connect (OIDC) is geactiveerd op het portaal.

source: From the Identities tab, authenticated users can manage their SAML identities or link their Opendatasoft account to a SAML or an OIDC identity.
de: Über die Registerkarte "Identitäten" können authentifizierte Benutzer ihre SAML-Identitäten verwalten oder ihr Opendatasoft-Konto mit einer SAML- oder einer OIDC-Identität verknüpfen.
es: En la ficha Identidades, los usuarios autenticados pueden administrar sus identidades SAML o vincular su cuenta Opendatasoft a una identidad SAML u OIDC.
fr: Depuis l'onglet Identités, les utilisateurs authentifiés peuvent gérer leurs identités SAML ou lier leur compte Opendatasoft à une identité SAML ou OIDC.
nl: Vanuit het tabblad Identiteiten hebben geauthentificeerde gebruikers de mogelijkheid om hun SAML-identiteiten te beheren of om hun Opendatasoft-account te koppelen aan een SAML- of een OIDC-identiteit.

source: The content of the Identities tab depends on the type of the user. There are 3 types of users in Opendatasoft: Opendatasoft users, local users, and linked users.
de: Der Inhalt der Registerkarte "Identitäten" hängt vom Typ des Benutzers ab. Bei Opendatasoft gibt es 3 Benutzertypen: Opendatasoft-Benutzer, lokale Benutzer und verknüpfte Benutzer.
es: El contenido de la ficha Identidades depende del tipo de usuario. Existen tres tipos de usuarios en Opendatasoft: usuarios de Opendatasoft, usuarios locales y usuarios vinculados.
fr: Le contenu de l'onglet Identités dépend du type d'utilisateur. Il existe 3 types d'utilisateur dans Opendatasoft : les utilisateurs Opendatasoft, les utilisateurs locaux et les utilisateurs liés.
nl: De inhoud van het tabblad Identiteiten hangt af van het type van de gebruiker. Er zijn 3 types van gebruikers in Opendatasoft: Opendatasoft-gebruikers, plaatselijke gebruikers en gekoppelde gebruikers.

source: For more information, see :doc:`../../configuring_domain/01_managing_security/saml` and :doc:`../../configuring_domain/01_managing_security/oidc`.
de: Weitere Informationen finden Sie hier: :doc:`../../configuring_domain/01_managing_security/saml` und hier: :doc:`../../configuring_domain/01_managing_security/oidc`.
es: Para obtener más información, consulte :doc:`../../configuring_domain/01_managing_security/saml` y :doc:`../../configuring_domain/01_managing_security/oidc`.
fr: Pour plus d'informations, consultez :doc:`../../configuring_domain/01_managing_security/saml` et :doc:`../../configuring_domain/01_managing_security/oidc`.
nl: Zie voor meer informatie :doc:`../../configuring_domain/01_managing_security/saml` en :doc:`../../configuring_domain/01_managing_security/oidc`.

source: Identities tab for Opendatasoft users
de: Die Registerkarte "Identitäten" für Opendatasoft-Benutzer
es: Ficha Identidades para usuarios de Opendatasoft
fr: Onglet Identités pour les utilisateurs Opendatasoft
nl: Tab Identiteiten voor Opendatasoft-gebruikers

source: For Opendatasoft users, the Identities tab only contains a link that allows Opendatasoft users to link their Opendatasoft account to a SAML or an OIDC identity. It makes them become linked users, which changes the content of the Identity tab.
de: Für Opendatasoft-Benutzer enthält die Registerkarte "Identitäten" nur einen Link, der es den Nutzern ermöglicht, ihr Opendatasoft-Konto mit einer SAML- oder OIDC-Identität zu verknüpfen. So werden sie zu verknüpften Benutzern, wodurch sich der Inhalt der Registerkarte "Identitäten" verändert.
es: Para los usuarios de Opendatasoft, la ficha Identidades solo contiene un vínculo que les permite vincular su cuenta de Opendatasoft a una identidad SAML u OIDC. De esta manera, se convierten en usuarios vinculados, con lo cual el contenido de la ficha Identidades cambia.
fr: Pour les utilisateurs Opendatasoft, l'onglet Identités ne contient qu'un lien leur permettant de lier leur compte Opendatasoft à une identité SAML ou OIDC. Ils deviennent ainsi des utilisateurs liés, ce qui change le contenu de leur onglet Identités.
nl: Voor Opendatasoft-gebruikers staat in het tabblad Identiteiten enkel een link die Opendatasoft-gebruikers toelaat om hun Opendatasoft-account te koppelen aan een SAML- of OIDC-identiteit. Hierdoor worden ze gekoppelde gebruikers, waardoor ook de inhoud van het tabblad Identiteit wijzigt.

source: To link the account to a SAML account, click the **Link your account to a SAML account on this domain** link.
de: Klicken Sie auf den Link **Verknüpfen Sie Ihr Konto mit einem SAML-Konto auf dieser Domain**, um das Konto mit einem SAML-Konto zu verknüpfen.
es: Para vincular la cuenta a una cuenta SAML, haga clic en el vínculo **Vincular la cuenta a una cuenta SAML en este dominio**.
fr: Pour lier le compte à un compte SAML, cliquez sur le lien **Lier votre compte à un compte SAML sur ce domaine**.
nl: Om het account aan een SAML-account te koppelen, klikt u op de link **Uw account koppelen aan een SAML-account op dit domein**.

source: To link the account to an OIDC account, click the **Link your account to an OIDC account on this domain** link.
de: Klicken Sie auf den Link **Verknüpfen Sie Ihr Konto mit einem OIDC-Konto auf dieser Domain**, um das Konto mit einem OIDC-Konto zu verknüpfen.
es: Para vincular la cuenta a una cuenta OIDC, haga clic en el vínculo **Vincular la cuenta a una cuenta OIDC en este dominio**.
fr: Pour lier le compte à un compte OIDC, cliquez sur le lien **Lier votre compte à un compte OIDC sur ce domaine**.
nl: Om het account aan een OIDC-account te koppelen, klikt u op de link **Uw account koppelen aan een OIDC-account op dit domein**.

source: Identities tab for local and linked users
de: Die Registerkarte "Identitäten" für lokale und verknüpfte Benutzer
es: Ficha Identidades para usuarios locales y vinculados
fr: Onglet Identités pour les utilisateurs locaux et liés
nl: Tab Identiteiten voor plaatselijke en gekoppelde gebruikers

source: For both local and linked users, the Identities tab contains information about the SAML or OIDC identity. Each SAML or OIDC identity is represented by a rectangle which contains all identity attributes sent by the identity provider.
de: Für lokale und verknüpfte Benutzer enthält die Registerkarte "Identitäten" Informationen über die SAML- oder die OIDC-Identität. Jede SAML- oder OIDC-Identität wird durch ein Rechteck dargestellt, das alle vom Identity Provider gesendeten Identitätsattribute enthält.
es: Tanto para los usuarios locales como para los vinculados, la ficha Identidades contiene información sobre la identidad SAML u OIDC. Cada identidad SAML u OIDC se representa mediante un rectángulo que contiene todos los atributos de identidad enviados por el proveedor de identidades.
fr: Pour les utilisateurs locaux et liés, l'onglet Identités comprend des informations concernant l'identité SAML ou OIDC. Chaque identité SAML ou OIDC est représentée par un rectangle contenant tous les attributs d'identité envoyés par le fournisseur d'identité.
nl: Zowel voor plaatselijke als gekoppelde gebruikers bevat het tabblad Identiteiten informatie over de SAML- of OIDC-identiteit. Elke SAML- of OIDC-identiteit wordt vertegenwoordigd door een rechthoek waarin alle identiteitsattributen staan die verstuurd zijn door een identity provider.

source: For linked users only, a "Revoke" button is also displayed at the top right corner of the SAML or OIDC identity rectangle. It allows to revoke the SAML or OIDC identity without deleting the Opendatasoft account: it makes the linked users become Opendatasoft users.
de: Für verknüpfte Benutzer wird oben rechts in diesem Rechteck zusätzlich der Button "Widerrufen" angezeigt. Mit ihm kann die SAML- oder OIDC-Identität widerrufen werden, ohne das Opendatasoft-Konto zu löschen: so werden die verknüpften Benutzer zu Opendatasoft-Benutzern.
es: En el caso únicamente de los usuarios vinculados, también se muestra un botón "Revocar" en la esquina superior derecha del rectángulo de identidad SAML u OIDC. Permite revocar la identidad SAML u OIDC sin suprimir la cuenta de Opendatasoft, con lo cual los usuarios vinculados se convierten en usuarios de Opendatasoft.
fr: Pour les utilisateurs liés uniquement, un bouton "Retirer" se trouve également dans le coin en haut à droite du rectangle d'identité SAML ou OIDC. Il permet de retirer l'identité SAML ou OIDC sans supprimer le compte Opendatasoft : les utilisateurs liés deviennent alors des utilisateurs Opendatasoft.
nl: Enkel voor gekoppelde gebruikers wordt een "Herroep"-knop weergegeven in de rechter bovenhoek van de SAML- of OIDC-identiteitsrechthoek. Hiermee kan de SAML- of OIDC-identiteit worden herroepen zonder dat het Opendatasoft-account wordt verwijderd: hierdoor worden gekoppelde gebruikers Opendatasoft-gebruikers.

source: To revoke a SAML or an OIDC identity:
de: Um eine SAML- oder OIDC-Identität zu widerrufen:
es: Para revocar una identidad SAML u OIDC:
fr: Pour retirer une identité SAML ou OIDC :
nl: Om een SAML- of OIDC-identiteit te herroepen:

source: Locate the identity you want to revoke, and click **Revoke**. A confirmation pop-up window appears.
de: Suchen Sie die Identität, die Sie widerrufen möchten und klicken Sie auf **Widerrufen**. Ein Bestätigungsfenster wird angezeigt.
es: Localice la identidad que desee revocar y haga clic en **Revocar**. Aparecerá una ventana emergente de confirmación.
fr: Localisez l'identité que vous souhaitez retirer, puis cliquez sur **Retirer**. Une fenêtre contextuelle de confirmation s'affiche.
nl: Zoek de identiteit die u wilt herroepen en klik op de knop **Herroepen**. Er verschijnt een bevestigingsvenster.

source: Click **OK** to confirm.
de: Klicken Sie zur Bestätigung auf **OK**.
es: Haga clic en **Aceptar** para confirmar.
fr: Cliquez sur **OK** pour confirmer.
nl: Klik ter bevestiging op **OK**.
