Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/05_configuring_domain/regional_settings.po
Languages: de, es, fr, nl

source: Regional settings
de: Regionale Einstellungen
es: Configuración regional
fr: Paramètres régionaux
nl: Regionale instellingen

source: Domain timezone
de: Zeitzone der Domain
es: Zona horaria del dominio
fr: Fuseau horaire du domaine
nl: Tijdzone van het domein

source: The time of the events reported in notification emails (reports and alerts) is based on the domain timezone. By default, the timezone of all Opendatasoft domains is UTC.
de: Die Zeit der in den Benachrichtigungs-E-Mails gemeldeten Ereignisse (Berichte und Warnungen) basiert auf der Zeitzone der Domain. Standardmäßig ist die Zeitzone aller Opendatasoft-Domains die UTC-Zeitzone.
es: La hora de los eventos indicada en los correos electrónicos de notificación (informes y alertas) se basa en la zona horaria del dominio. De forma predeterminada, la zona horaria del dominio de todos los dominios Opendatasoft es UTC.
fr: L'horaire des événements indiqué dans les emails de notifications (rapports et alertes) est basé sur le fuseau horaire du domaine. Par défaut, tous les domaines Opendatasoft sont définis sur le fuseau horaire UTC.
nl: Het tijdstip van de events die vermeld staan in kennisgevingse-mails (rapporten en waarschuwingen) is gebaseerd op de tijdzone van het domein. Standaard is de tijdzone van alle Opendatasoft-domeinen UTC.

source: To change the timezone of a domain, go to Configuration > Regional settings. In this subsection of the back office is displayed the Domain timezone configuration.
de: Um die Zeitzone einer Domain zu ändern, öffnen Sie Konfiguration > Regionale Einstellungen. In diesem Unterabschnitt des Backoffice wird die Konfiguration der Domain-Zeitzone angezeigt.
es: Para cambiar la zona horaria de un dominio, vaya a Configuración > Configuración regional. En esta subsección del back office se visualiza la configuración de la zona horaria del dominio.
fr: Pour modifier le fuseau horaire d'un domaine, accédez à Configuration > Paramètres régionaux. La configuration du fuseau horaire du domaine est accessible dans cette sous-section de l'interface d'administration.
nl: Om de tijdzone van een domein te veranderen, ga naar Configuratie > Regionale instellingen. In deze subsectie van de back office staat de configuratie van de tijdzone van het domein weergegeven.

source: Click on the Timezone drop-down menu.
de: Klicken Sie auf das Dropdown-Menü "Zeitzone".
es: Haga clic en el menú desplegable Zona horaria.
fr: Cliquez sur le menu déroulant Fuseau horaire.
nl: Klik op het drop-down menu Tijdzone.

source: Choose the right timezone.
de: Wählen Sie die gewünschte Zeitzone.
es: Elija la zona horaria apropiada.
fr: Sélectionnez le bon fuseau horaire.
nl: Kies de juiste tijdzone.

source: Click on the Save button in the top right corner of the page.
de: Klicken Sie oben rechts auf den Button "Speichern".
es: Haga clic en el botón Guardar de la esquina superior derecha de la página.
fr: Cliquez sur le bouton Enregistrer en haut à droite de la page.
nl: Klik op de knop Opslaan in de rechter bovenhoek van de pagina.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: It is also possible to directly write a city or zone in the textbox. A selection of matching existing timezones will appear.
de: Es ist auch möglich, eine Stadt oder Zeitzone direkt in das Textfeld einzutragen. Eine Auswahl der passenden vorhandenen Zeitzonen wird dann angezeigt.
es: También se puede escribir directamente una ciudad o zona en el cuadro de texto. Aparecerá una selección de las zonas horarias existentes coincidentes.
fr: Vous pouvez également saisir le nom d'une ville ou d'une région dans la zone de texte. Les résultats existants correspondants s'afficheront.
nl: Het is ook mogelijk om een stad of zone rechtstreeks in het tekstvak te schrijven. Er verschijnt dan een selectie van overeenkomstige bestaande tijdzones.

source: CSV delimiter
de: CSV-Trennzeichen
es: Delimitador CSV
fr: Séparateur CSV
nl: CSV-scheidingsteken

source: The preferred delimiter for CSV files, usually depending on geographical location, can either be a comma or a semicolon. The CSV delimiter configuration allows to define what delimiter will be used by default for catalog and dataset exports in CSV format (see :doc:`Exporting data </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).
de: Das bevorzugte Trennzeichen für CSV-Dateien ist üblicherweise abhängig vom geografischen Standort. Es kann sich dabei um ein Komma oder ein Semikolon handeln. Über die Konfiguration des CSV-Trennzeichens können Sie festlegen, welches Trennzeichen standardmäßig für den Export von Katalogen und Datensätzen im CSV-Format verwendet wird (siehe :doc:`Daten exportieren </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).
es: El delimitador preferido de los archivos CSV, dependiendo generalmente de la ubicación geográfica, puede ser una coma o un punto y coma. La configuración del delimitador CSV permite definir qué delimitador será utilizado de forma predeterminada para las exportaciones de conjuntos de datos y catálogos en formato CSV (consulte :doc:`Exportar datos </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).
fr: Le séparateur de fichiers CSV privilégié, qui dépend généralement de l'emplacement géographique, peut être une virgule ou un point-virgule. La configuration du séparateur CSV permet de définir celui à utiliser par défaut pour le catalogue et les exports de jeux de données au format CSV (voir :doc:`Exporter des données </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).
nl: Voor CSV-bestanden wordt er voorkeur gegeven aan een scheidingsteken. Deze kan, afhankelijk van de geografische locatie, een komma of een puntkomma zijn. Het scheidingsteken dat standaard gebruikt wordt voor het exporteren van catalogi en gegevenssets in CSV-formaat (zie :doc:`Gegevens exporteren </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`) kan bepaald worden met behulp van de CSV-scheidingsteken configuratie-instellingen.

source: This configuration does not apply to the API, which has its own way of choosing the delimiter for CSV exports (see API Search v1 and `API Search v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets>`_).
de: Diese Konfiguration gilt nicht für die API, die eine eigene Art der Wahl des Trennzeichens für CSV-Exporte hat. (siehe API Search v1 und `API Search v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets>`_).
es: Esta configuración no se aplica a la API, que tiene su propia manera de elegir el delimitador para las exportaciones CSV (consulte la API de búsqueda V1 y la `API de búsqueda V2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets>`_).
fr: Cette configuration ne s'applique pas à l'API, qui a sa propre méthode pour choisir le séparateur des exports CSV (voir API Search v1 et `API Search v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets>`_).
nl: Deze configuratie is niet van toepassing op de API, die een eigen manier heeft om het scheidingsteken voor CSV-exports te bepalen (Zie API Search v1 en 'API Search v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-datasets >'_).

source: To define the default delimiter for CSV exports, go to Configuration > Regional settings. In this subsection of the back office is displayed the CSV delimiter configuration.
de: Um das Standard-Trennzeichen für CSV-Exporte zu bestimmen, öffnen Sie Konfiguration > Regionale Einstellungen. In diesem Unterabschnitt des Back-Office haben Sie Zugriff auf die Konfiguration der CSV-Trennzeichen.
es: Para definir el delimitador predeterminado para las exportaciones CSV, vaya a Configuración > Configuración regional. En esta subsección del back office se visualiza la configuración del delimitador CSV.
fr: Pour définir le séparateur par défaut des exports CSV, accédez à Configuration > Paramètres régionaux. Cette sous-section de l'interface d'administration affiche la configuration du séparateur CSV.
nl: Als u het standaardscheidingsteken voor CSV-exports wilt instellen, ga dan naar Configuratie > Regionale Instellingen. In deze subsectie van de back office wordt de CSV-scheidingsteken configuratie weergegeven.

source: Click on the Delimiter drop-down menu.
de: Klicken Sie auf das Dropdown-Menü "Trennzeichen".
es: Haga clic en el menú desplegable Delimitador.
fr: Cliquez sur le menu déroulant Séparateur.
nl: Klik op het drop-down menu Scheidingsteken.

source: Choose either "Comma (,)" or "Semicolon (;)".
de: Wählen Sie entweder "Komma (,)" oder "Semikolon (;)".
es: Elija "Coma (,)" o "Punto y coma (;)".
fr: Choisissez entre "Virgule (,)" ou "Point-virgule (;)".
nl: Kies "Komma (,)" of "Puntkomma (;)".

source: Datasets default geographic coverage
de: Standardmäßige geografische Abdeckung der Datensätze
es: Cobertura geográfica predeterminada de los conjuntos de datos
fr: Couverture géographique par défaut des jeux de données
nl: Standaard geografische dekking van datasets

source: The :ref:`geographic coverage metadata <geographic-coverage-metadata>` indicates the location of the data contained in the dataset. Although the metadata can be set individually for each dataset afterward, it is possible to configure the default location(s) that will be automatically set as geographic coverage metadata for all datasets created afterward.
de: Die :ref:`Metadaten der geografischen Abdeckung <geographic-coverage-metadata>` geben den Standort der im Datensatz enthaltenen Daten an. Obwohl die Metadaten nachträglich für jeden Datensatz individuell festgelegt werden können, ist es möglich, den/die Standardstandort(e) zu konfigurieren, der/die automatisch als Metadaten für die geografische Abdeckung für alle danach erstellten Datensätze festgelegt wird/werden.
es: Los :ref:`metadatos de cobertura geográfica <geographic-coverage-metadata>` indican la ubicación de los datos contenidos en el conjunto de datos. Aunque los metadatos puedan establecerse individualmente para cada uno de los conjuntos de datos más adelante, es posible configurar la(s) ubicación(es) predeterminada(s) que se establecerá(n) automáticamente como metadatos de cobertura geográfica para todos los conjuntos de datos creados posteriormente.
fr: Les :ref:`métadonnées de couverture géographique<geographic-coverage-metadata>` indiquent l'emplacement des données du jeu de données. Même si les métadonnées peuvent être définies pour chaque jeu de données ultérieurement, vous pouvez configurer les emplacements par défaut qui seront automatiquement définis en tant que métadonnées de couverture géographique pour tous les jeux de données créés plus tard.
nl: De :ref:`geographische dekkingsmetadata <geographic-coverage-metadata>` geeft de locatie aan van de data die in de dataset zijn opgenomen. Hoewel de metadata achteraf individueel voor elke dataset kunnen worden ingesteld, is het mogelijk om de standaard locatie(s) te configureren die automatisch ingesteld zullen worden als geografische dekkingsmetadata voor alle datasets die achteraf worden aangemaakt.

source: In the Default geographic coverage textbox, write the name of the chosen location.
de: Geben Sie in das Textfeld "Standardmäßige geografische Abdeckung" den Namen des ausgewählten Standorts ein.
es: En el cuadro de texto Cobertura geográfica predeterminada, escriba el nombre de la ubicación que desee.
fr: Dans la zone de texte Couverture géographique par défaut, indiquez le nom de l'emplacement choisi.
nl: Schrijf de naam van de gekozen locatie in het tekstvak Standaard geografische dekking.

source: A drop-down selection of existing locations matching the name that was previously typed appears. Click on the right location.
de: Es erscheint eine Dropdown-Liste mit vorhandenen Standorten, die dem zuvor eingegebenen Namen entsprechen. Klicken Sie auf den gewünschten Standort.
es: Aparece una selección desplegable de ubicaciones existentes que coinciden con el nombre indicado anteriormente. Haga clic en la ubicación correcta.
fr: Une liste déroulante des emplacements existants qui correspondent au nom précédemment saisi s'affiche. Cliquez sur l'emplacement approprié.
nl: Er verschijnt een keuzelijst met een selectie van bestaande locaties die overeenstemmen met de naam die eerder was ingetypt. Klik op de juiste locatie.

source: (optional) Repeat steps 1 and 2 of this procedure to add other default locations (for example, if the data of the portal involves more than one administrative division).
de: (optional) Wiederholen Sie die Schritte 1 und 2 dieses Vorgangs, um weitere Standardstandorte hinzuzufügen (z.B. wenn die Daten des Portals mehr als eine Verwaltungseinheit betreffen).
es: (Opcional) Repita los pasos 1 y 2 de este procedimiento para añadir otras ubicaciones predeterminadas (por ejemplo, si los datos del portal abarcan más de una división administrativa).
fr: (optionnel) Répétez les étapes 1 et 2 de cette procédure pour ajouter d'autres emplacements par défaut (p. ex. dans le cas où le portail inclut plusieurs divisions administratives).

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: If more than one default location is added, they must be at the same administrative level (for example, countries, cities, regions, etc.).
de: Wenn mehrere Standardstandorte hinzugefügt werden, müssen diese die gleiche Verwaltungsebene betreffen (z.B. Länder, Städte, Regionen usw.).
es: Si se añaden varias ubicaciones predeterminadas, deben estar en el mismo nivel administrativo (por ejemplo, países, ciudades, regiones, etc.).
fr: Si plusieurs emplacements par défaut sont ajoutés, ils doivent se trouver au même niveau administratif (p.ex. pays, villes, régions, etc.).

source: (optional) Repeat steps 1 and 2 of this procedure to add other default locations (e.g. if the data of the portal involves more than one administrative division).
nl: (optioneel) Herhaal stappen 1 en 2 van de deze procedure om andere standaard locaties toe te voegen (bijv. wanneer bij de data van het portaal meer dan één administratieve afdeling betrokken is).

source: If more than one default location are added, they must be at the same administrative level (e.g. countries, cities, regions, etc.).
nl: Wanneer er meer dan één standaard locatie worden toegevoegd, moeten ze allemaal het allemaal hetzelfde administratieve niveau hebben (bijv. landen, steden, regio's, enz.).
