Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/05_configuring_domain/shared_catalog.po
Languages: de, es, fr

source: Configure a shared catalog
de: Einen gemeinsamen Katalog konfigurieren
es: Configurar un catálogo compartido
fr: Configurer un catalogue partagé

source: Important
de: Wichtig
es: Importante

source: Shared Catalogs are available with the Ultimate Plan. Contact your sales representative more information about our plans.
de: Gemeinsame Kataloge sind mit dem Ultimate Plan verfügbar. Weitere Informationen zu unseren Plänen erhalten Sie von Ihrem Vertriebsmitarbeiter.
es: Los catálogos compartidos están disponibles con el plan Ultimate. Póngase en contacto con su representante de ventas para obtener más información sobre nuestros planes.
fr: Le plan d'abonnement Ultimate inclut des catalogues partagés. Contactez votre représentant commercial pour plus d'informations sur nos plans d'abonnement.

source: What is a Shared Catalog and what is it for?
de: Was ist ein gemeinsamer Katalog und wofür wird er verwendet?
es: ¿Qué es un catálogo compartido y para qué sirve?
fr: Qu'est-ce qu'un catalogue partagé ? À quoi sert-il ?

source: What is a Shared Catalog?
de: Was ist ein gemeinsamer Katalog.
es: ¿Qué es un catálogo compartido?
fr: Qu'est-ce qu'un catalogue partagé ?

source: A Shared Catalog is a combination of the public datasets from two or more different ODS domains. The resulting combined catalog can then be configured to be visible at each of the individual domains, or else be its own separate, shared domain.
de: Ein gemeinsamer Katalog ist eine Kombination der öffentlichen Datensätze aus zwei oder mehr verschiedenen ODS-Domains. Der daraus resultierende kombinierte Katalog kann dann so konfiguriert werden, dass er in jeder der einzelnen Domains zu sehen ist. Er kann auch eine eigene separate, gemeinsame Domain sein.
es: Un catálogo compartido es una combinación de los conjuntos de datos públicos de 2 o más dominios ODS. El catálogo combinado resultante puede configurarse para ser visible en todos los dominios individuales, o para que sea su propio dominio compartido.
fr: Il s'agit des jeux de données publics combinés de deux domaines ODS différents ou plus. Le catalogue combiné résultant peut ensuite être configuré pour être visible dans chaque domaine ou être un domaine partagé distinct.

source: Why use a Shared Catalog?
de: Gründe für die Nutzung eines gemeinsamen Katalgos
es: ¿Por qué usar un catálogo compartido?
fr: Pourquoi utiliser un catalogue partagé ?

source: A Shared Catalog is a good idea if you want to group all of your datasets as part of a larger organization or initiative.
de: Ein gemeinsamer Katalog kann hilfreich sein, wenn Sie alle Ihre Datensätze als Teil einer größeren Organisation oder Initiative gruppieren möchten.
es: El uso de un catálogo compartido es conveniente si se desea agrupar todos los conjuntos de datos dentro de una organización o iniciativa más amplia.
fr: Un catalogue partagé est idéal si vous souhaitez regrouper tous vos jeux de données dans le cadre d'une initiative ou d'une organisation plus importante.

source: For example, a region can find it useful to bring together the data from all of its different administrative levels—the region, its states or departments, metropolitan areas, cities and towns, etc. This allows users to find all the relevant data for that region in one easy location.
de: So kann es beispielsweise für ein Gebiet nützlich sein, die Daten aller verschiedenen Verwaltungsebenen - Region, Bundesländer oder Bezirke, Ballungsräume, Städte und Gemeinden usw. - zusammenzuführen. Auf diese Weise können die Nutzer alle relevanten Daten für diese Region an einem einzigen Ort finden.
es: Por ejemplo, puede ser útil para una región reunir los datos de todos sus niveles administrativos: la región, sus estados o departamentos, áreas metropolitanas, ciudades y localidades, etc. Esto permite a los usuarios encontrar todos los datos relevantes de esa región en una sola ubicación de forma sencilla.
fr: Par exemple, il peut être utile pour une région de rassembler toutes les données associées aux différents niveaux administratifs (région, états ou départements, zones métropolitaines, villes, etc.). Les utilisateurs peuvent ainsi trouver toutes les données pertinentes relatives à cette région depuis un emplacement unique et facile d'accès.

source: Configuring the Shared Catalog
de: Einen gemeinsamen Katalog konfigurieren
es: Configurar el catálogo compartido
fr: Configurer le catalogue partagé

source: How to enable shared catalogs
de: Gemeinsame Kataloge aktivieren
es: Cómo activar los catálogos compartidos
fr: Activer les catalogues partagés

source: To enable Shared Catalogs, your portal must be public and must be part of the ODS Data Hub. Also note that some actions must be performed by your CSM.
de: Um gemeinsame Kataloge zu aktivieren, muss Ihr Portal öffentlich und Teil des ODS-Datenhubs sein. Beachten Sie auch, dass einige Aktionen von Ihrem CSM durchgeführt werden müssen.
es: Para activar los catálogos compartidos, el portal debe ser público y debe formar parte de ODS Data Hub. Tenga también en cuenta que su CSM deberá llevar a cabo algunas acciones.
fr: Pour activer les catalogues partagés, votre portail doit être public et faire partie du hub de données ODS. Par ailleurs, notez que certaines actions doivent être effectuées par votre CSM.

source: To make your portal public, in your back office, go to ``Configuration`` → ``Security``, and toggle the **Portal access** option to **Public portal**. (see :doc:`configuring your portal's general security policy </configuring_domain/01_managing_security/portal>`)
de: Um Ihr Portal öffentlich zu machen, wählen Sie in Ihrem Backoffice ``Konfiguration`` → ``Sicherheit`` und schalten Sie die Option **Portalzugang** auf **öffentliches Portal** um. (siehe :doc:`Konfigurieren der allgemeinen Sicherheitsrichtlinie Ihres Portals </configuring_domain/01_managing_security/portal>`)
es: Para hacer el portal público, en el back office, vaya a ``Configuración`` → ``Seguridad`` , y establezca la opción **Acceso al portal** como **Portal público**. (Consulte :doc:`Configurar la directiva de seguridad general del portal </configuring_domain/01_managing_security/portal>`).
fr: Pour que votre portail devienne public, dans l'interface d'administration, accédez à ``Configuration`` → ``Sécurité`` et définissez l'option **Accès au portail** sur **Portail public** (voir :doc:`configurer la politique de sécurité générale de votre portail </configuring_domain/01_managing_security/portal>`).

source: Make sure your portal is part of the `ODS Data Hub <https://academy.opendatasoft.com/exploiter-notre-reseau-de-donnees>`_ (check with your CSM if you’re not sure).
de: Achten Sie darauf, dass Ihr Portal Teil des `ODS Datenhubs <https://academy.opendatasoft.com/exploiter-notre-reseau-de-donnees>`_ ist (erkundigen Sie sich bei Ihrem CSM, wenn Sie sich nicht sicher sind).
es: Asegúrese de que el portal forma parte de `ODS Data Hub <https://academy.opendatasoft.com/exploiter-notre-reseau-de-donnees>`_ (ante la duda, consulte con su CSM).
fr: Vérifiez que votre portail fait partie du `hub de données ODS <https://academy.opendatasoft.com/exploiter-notre-reseau-de-donnees>`_ (vérifiez avec votre CSM si vous n'êtes pas sûr).

source: Define the **unique identifier for your shared catalog**. To perform this step you will need to contact your CSM. The identifier is the same for all the portals part of your shared catalog, so if a shared catalog was already started by another domain you must ask about the existing identifier and use it.
de: Bestimmen Sie die **eindeutige Kennung für Ihren gemeinsamen Katalog**. Um diesen Schritt durchzuführen, müssen Sie sich an Ihren CSM wenden. Die Kennung ist für alle Portale, die Teil Ihres gemeinsamen Katalogs sind, dieselbe. Wenn also ein gemeinsamer Katalog bereits von einer anderen Domain eingerichtet wurde, müssen Sie nach der bestehenden Kennung fragen und sie verwenden.
es: Defina el **identificador único del catálogo compartido**. Para completar este paso, deberá ponerse en contacto con el CSM. El identificador es el mismo para todos los portales del catálogo compartido, de modo que si un catálogo compartido ya ha sido iniciado por otro dominio, debe pedir el identificador ya existente y usarlo.
fr: Définissez l'**identifiant unique de votre catalogue partagé**. Pour effectuer cette étape, vous devez contacter votre CSM. L'identifiant est identique pour tous les portails de votre catalogue partagé. Par conséquent, si un catalogue partagé a été commencé par un autre domaine, vous devez demander l'identifiant existant et l'utiliser.

source: Choosing the default catalog for your domain
de: Auswahl des Standardkatalogs für Ihre Domain
es: Elegir el catálogo predeterminado del dominio
fr: Choisir le catalogue par défaut de votre domaine

source: Once the shared catalog is activated on your workspace, you have two different catalogs:
de: Sobald der gemeinsame Katalog auf Ihrem Arbeitsbereich aktiviert wurde, liegen Ihnen zwei unterschiedliche Kataloge vor:
es: Una vez activado el catálogo compartido en el espacio de trabajo, tiene 2 catálogos:
fr: Une fois le catalogue partagé activé sur votre espace de travail, vous avez deux catalogues distincts :

source: Your **local catalog** containing your own public and restricted datasets
de: Ihr **lokaler Katalog** mit Ihren eigenen öffentlichen und eingeschränkten Datensätzen
es: El **catálogo local** contiene sus propios conjuntos de datos públicos y restringidos.
fr: Votre **catalogue local** qui comprend vos jeux de données limités et publics.

source: Your **shared catalog** containing your public datasets and all the public datasets of the portals using this shared catalog
de: Ihr **gemeinsamer Katalog**, der Ihre öffentlichen Datensätze und alle öffentlichen Datensätze der Portale enthält, die diesen gemeinsamen Katalog verwenden
es: El **catálogo compartido** contiene sus conjuntos de datos públicos y todos los conjuntos de datos públicos de los portales que utilizan este catálogo compartido.
fr: Votre **catalogue partagé** qui contient vos jeux de données publics et tous les jeux de données publics des portails qui utilisent ce catalogue partagé.

source: By default, your local catalog is visible at your domain’s URL ending with ``/explore/``, but you can change this to show the shared catalog instead.
de: Standardmäßig ist Ihr lokaler Katalog unter der URL Ihrer Domain mit der Endung ``/explore/`` sichtbar. Sie können dies jedoch ändern, um stattdessen den gemeinsamen Katalog anzuzeigen.
es: De forma predeterminada, el catálogo local está visible en la dirección URL del dominio con ``/explore/``, pero puede cambiarlo para mostrar el catálogo compartido en su lugar.
fr: Par défaut, votre catalogue local est visible en suivant l'URL de votre domaine, qui se termine par ``/explore/``. Vous pouvez néanmoins modifier cela pour afficher le catalogue partagé à la place.

source: **Changing the default catalog needs to be performed by ODS. To make the shared catalog your default catalog, please contact your CSM.**
de: **Die Änderung des Standardkatalogs muss von ODS vorgenommen werden. Um den gemeinsamen Katalog zum Standardkatalog zu machen, wenden Sie sich bitte an Ihren CSM.**
es: **Cambiar el catálogo predeterminado debe ser realizado por ODS. Para que el catálogo compartido sea el catálogo predeterminado, póngase en contacto con el CSM.**.
fr: **La modification du catalogue par défaut doit être effectuée par ODS. Pour que le catalogue partagé soit votre catalogue par défaut, veuillez contacter votre CSM.**

source: Using the Shared Catalog
de: Den gemeinsamen Katalog verwenden
es: Utilizar el catálogo compartido
fr: Utiliser le catalogue partagé

source: How to access to your local and shared catalogs
de: Zugriff auf Ihre lokalen und gemeinsamen Kataloge
es: Cómo acceder a sus catálogos locales y compartidos
fr: Accéder à votre catalogue partagé et à votre catalogue local

source: Remember that whatever your default catalog, you can always access the local and shared catalogs using their specific URLs:
de: Denken Sie daran, dass Sie unabhängig von Ihrem Standardkatalog immer auf die lokalen und gemeinsamen Kataloge über ihre jeweiligen URLs zugreifen können:
es: Recuerde que cualquiera que sea su catálogo predeterminado, siempre puede acceder a los catálogos locales y compartidos con sus direcciones URL específicas:
fr: Pour rappel, quel que soit votre catalogue par défaut, vous pouvez toujours accéder au catalogue local et au catalogue partagé via leur URL spécifique :

source: Your **local catalog** is always available at your domain’s URL ending with ``/explore/?source=domain``
de: Ihr **lokaler Katalog** ist immer unter der URL Ihrer Domain verfügbar, die mit ``/explore/?source=domain`` endet.
es: El **catálogo local** siempre está disponible en la dirección URL del dominio que termina por ``/explore/?source=domain``.
fr: Votre **catalogue local** est toujours disponible en suivant l'URL de votre domaine qui se termine par ``/explore/?source=domain``.

source: The **shared catalog** is always visible at your domain’s URL ending with ``/explore/?source=shared``
de: Der **gemeinsame Katalog** ist immer unter der URL Ihrer Domain sichtbar, die mit ``/explore/?source=shared`` endet.
es: El **catálogo compartido** siempre está visible en la dirección URL del dominio que termina por ``/explore/?source=shared``.
fr: Le **catalogue partagé** est toujours visible en suivant l'URL de votre domaine qui se termine par ``/explore/?source=shared``.

source: Remember, only your public datasets are part of a shared catalog. Therefore, when you're browsing the shared catalog on your own domain, you will not see your own private datasets, no matter what permissions you have for your private datasets.
de: Denken Sie daran: Nur Ihre öffentlichen Datensätze sind Teil eines gemeinsamen Katalogs. Wenn Sie also den gemeinsamen Katalog auf Ihrer eigenen Domain durchsuchen, werden Sie Ihre eigenen privaten Datensätze nicht sehen, unabhängig davon, welche Berechtigungen Sie für Ihre privaten Datensätze haben.
es: Recuerde: solo los conjuntos de datos públicos forman parte de un catálogo compartido. Por lo tanto, al explorar el catálogo compartido en su dominio, no verá sus propios conjuntos de datos privados, independientemente de los permisos que tenga para sus conjuntos de datos privados.
fr: Pour rappel, seuls vos jeux de données publics font partie d'un catalogue partagé. Par conséquent, lorsque vous parcourez le catalogue partagé sur votre domaine, vous ne voyez pas vos jeux de données privés, quelles que soient les permissions définies pour ces derniers.

source: What’s different when I’m using the shared catalog feature?
de: Welche Unterschiede sind bei der Nutzung des gemeinsamen Katalogs zu brücksichtigen?
es: ¿Qué cambia con el uso de la función de catálogo compartido?
fr: Quels éléments diffèrent lorsque j'utilise la fonction de catalogue partagé ?

source: **Your portal’s appearance**
de: **Das Aussehen Ihres Portals**
es: **Apariencia del portal**
fr: **L'apparence de votre portail**

source: Using the shared catalog option does not change the appearance of your datasets, nor change what information is visible in them.
de: Mit der Nutzung des gemeinsamen Katalogs werden weder das Aussehen Ihrer Datensätze noch die darin enthaltenen Informationen verändert.
es: El uso de la opción de catálogo compartido no cambia la apariencia de los conjuntos de datos, ni cambia la información visible en ellos.
fr: Utiliser l'option de catalogue partagé ne change pas l'apparence de vos jeux de données, ni les informations qu'ils contiennent.

source: **The order your datasets are displayed**
de: **Die Reihenfolge, in der Ihre Datensätze angezeigt werden**
es: **Orden de visualización de los conjuntos de datos**
fr: **L'ordre d'affichage de vos jeux de données**

source: **Your local public datasets are always displayed first**. This is to ensure that your own datasets are promoted and remain visible. No matter how your portal’s datasets are filtered (alphabetically, by last modified, etc.), your local public datasets are displayed first, before the shared datasets that might otherwise come first.
de: **Ihre lokalen öffentlichen Datensätze werden immer zuerst angezeigt**. Damit wird sichergestellt, dass Ihre eigenen Datensätze hervorgehoben werden und sichtbar bleiben. Unabhängig davon, wie die Datensätze Ihres Portals gefiltert werden (alphabetisch, nach letzter Änderung usw.), werden Ihre lokalen öffentlichen Datensätze zuerst angezeigt, noch vor den gemeinsam genutzten Datensätzen, die normalerweise an erster Stelle stehen würden.
es: **Los conjuntos de datos públicos locales siempre se visualizan primero**. Esto permite asegurarse de que los propios conjuntos de datos sean promovidos y visibles. Al margen de cómo se filtren los conjuntos de datos del portal (alfabéticamente, por última modificación, etc.), los conjuntos de datos públicos locales se visualizan primero, antes de los conjuntos de datos compartidos (que, de lo contrario, podrían ser los primeros en mostrarse).
fr: **Vos jeux de données publics locaux sont toujours affichés en premier**. Cela permet de s'assurer que vos jeux de données sont mis en avant et restent visibles. Quels que soient les filtres appliqués pour les jeux de données dans votre portail (ordre alphabétique, date de dernière modification, etc.), vos jeux de données publics locaux sont affichés en premier, avant les jeux de données partagés.

source: **Metadata**
de: **Metadaten**
es: **Metadatos**
fr: **Métadonnées**

source: The metadata ``shared_catalog`` (visible while using the ODS Management APIs) is populated with the value of the unique identifier of the shared catalog.
de: Die Metadaten ``shared_catalog`` (sichtbar bei der Verwendung der ODS-Verwaltungs-APIs) werden mit dem Wert der eindeutigen Kennung des gemeinsamen Katalogs ausgefüllt.
es: Los metadatos de ``shared_catalog`` (visibles al usar las API de administración de ODS) contienen el valor del identificador exclusivo del catálogo compartido.
fr: Les métadonnées ``shared_catalog`` (visibles lors de l'utilisation des API ODS Management) sont renseignées avec la valeur de l'identifiant unique du catalogue partagé.

source: **API Explore V2**
es: **API de exploración V2**

source: With the `API Explore V2 <https://help.opendatasoft.com/apis/ods-explore-v2/>`_ , ``/api/v2/catalog/dataset`` allows you to see the local catalog, and ``/api/v2/shared/datasets`` allows you to see the shared catalog.
de: Mit `API Explore V2 <https://help.opendatasoft.com/apis/ods-explore-v2/>`_ , ``/api/v2/catalog/dataset`` können Sie den lokalen Katalog und ``/api/v2/shared/datasets`` den gemeinsamen Katalog sehen.
es: Con la `API de exploración V2 <https://help.opendatasoft.com/apis/ods-explore-v2/>`_ , ``/api/v2/catalog/dataset`` permite ver el catálogo local, y ``/api/v2/shared/datasets`` permite ver el catálogo compartido.
fr: L'`API Explore V2 <https://help.opendatasoft.com/apis/ods-explore-v2/>`_ , ``/api/v2/catalog/dataset`` vous permet de consulter le catalogue local, et ``/api/v2/shared/datasets`` vous permet de consulter le catalogue partagé.
