Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/configuring_domain/05_configuring_domain/tabs.po
Languages: de, es, fr, nl

source: Configure catalog & dataset pages
de: Katalog- und Datensatzseiten konfigurieren
es: Configurar páginas de catálogo y conjunto de datos
fr: Configuration des pages de jeux de données et du catalogue
nl: Catalogus- en datasetpagina's configureren

source: This section explains which features can be configured on the catalog and dataset pages.
de: Dieser Abschnitt erklärt, welche Funktionen auf den Katalog- und Datensatzseiten konfiguriert werden können.
es: En esta sección se describen las funciones que se pueden configurar en las páginas de catálogo y conjunto de datos.
fr: Cette section présente les fonctionnalités qui peuvent être configurées sur les pages de jeux de données et du catalogue.
nl: In dit deel wordt uitgelegd welke eigenschappen geconfigureerd kunnen worden op de catalogus- en datasetpagina's.

source: Default tab
de: Standardregister
es: Ficha predeterminada
fr: Onglet par défaut
nl: Standaard tabblad

source: By default, the dataset is opened on the **table view**, but you can choose to display the **information tab** instead. The table view by default is useful to give users direct access to the data, whereas the information tab by default is interesting to provide users with context and description first.
de: Ein Datensatz wird standardmäßig in der **Tabellenansicht** geöffnet, aber Sie können stattdessen auch die **Registerkarte Informationen** anzeigen lassen. Die standardmäßige Tabellenansicht ist hilfreich, um Benutzern Direktzugriff auf Daten zu gewähren, während die standardmäßige Anzeige der Registerkarte Informationen interessant ist, um Nutzern zunächst Kontext und eine Beschreibung bereitzustellen.

source: Catalog page — Geographic filter
de: Katalogseite - Geografischer Filter
es: Página de catálogo — Filtro geográfico
fr: Page de catalogue - Filtre géographique
nl: Cataloguspagina — Geografische filter

source: The geographic filter allows to search datasets in the catalog based on the territory covered by the data they contain (see :ref:`Filtering the catalog using the geographic filter <using-the-minimap>`). By default, this filter is not activated.
de: Der geografische Filter ermöglicht die Suche nach Datensätzen im Katalog basierend auf dem Gebiet, das von den darin enthaltenen Daten abgedeckt wird (siehe :ref:`Filtern des Katalogs mit geografischem Filter <using-the-minimap>`). Standardmäßig ist dieser Filter nicht aktiviert.
es: El filtro geográfico permite buscar conjuntos de datos en el catálogo basados en el territorio cubierto por los datos que contienen (consulte :ref:`Filtrar el catálogo mediante el filtro geográfico <using-the-minimap>`). Por defecto, este filtro no está activado.
fr: Le filtre géographique permet de rechercher des jeux de données dans le catalogue, en fonction du territoire couvert par les données qu'ils contiennent (voir :ref:`Filtrer le catalogue à l'aide du filtre géographique<using-the-minimap>`). Par défaut, ce filtre est désactivé.
nl: De geografische filter laat toe datasets te zoeken in de catalogus op basis van het grondgebied dat gedekt wordt door de data die ze bevatten (zie :ref:`De catalogus filteren door gebruik te maken van de geografische filter <using-the-minimap>`). Standaard is deze filter niet geactiveerd.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: The geographic filter can either enable filtering across the entire world or only on a specific, chosen country.
de: Der geografische Filter kann auf die ganze Welt oder nur auf ein bestimmtes Land angewendet werden.

source: When the geographic filter is configured for a specific country, very precise refining is available through multiple available administrative divisions.
de: Ist der geografische Filter für ein bestimmtes Land konfiguriert, ist eine sehr präzise Verfeinerung mit mehreren verfügbaren Verwaltungsabteilungen möglich.

source: When the geographic filter is configured for the entire world, users can filter the catalog with almost every country of the world, but most of the time, precise refining is not possible. For most countries, only the highest administrative divisions are available.
de: Ist der geografische Filter für die ganze Welt konfiguriert, können Benutzer den Katalog nach fast jedem Land der Welt filtern. Allerdings ist eine präzise Verfeinerung in diesem Fall meist nicht möglich. Für die meisten Länder stehen nur die höchsten Verwaltungseinheiten zur Verfügung.
es: Cuando se configura el filtro geográfico para todo el mundo, los usuarios pueden filtrar el catálogo con casi todos los países del mundo, pero por lo general no es posible un refinamiento preciso. Para la mayoría de los países, solamente están disponibles las divisiones administrativas de nivel superior.
fr: Quand le filtre géographique est configuré au niveau mondial, les utilisateurs peuvent filtrer le catalogue avec pratiquement tous les pays du monde, mais la plupart du temps, il est impossible d'affiner de façon précise les résultats. Pour la majorité des pays, seules les divisions administratives les plus élevées sont disponibles.
nl: Wanneer de geografische filter wordt geconfigureerd voor de gehele wereld, kunnen gebruikers de catalogus filteren met vrijwel elk land ter wereld, maar in de meeste gevallen is een precieze verfijning niet mogelijk. Voor de meeste landen zijn enkel de hoogste administratieve afdelingen beschikbaar.

source: To activate and configure the geographic filter:
de: Zur Aktivierung und Konfiguration des geografischen Filters:
es: Para activar y configurar el filtro geográfico:
fr: Pour activer et configurer le filtre géographique :
nl: Om de geografische filter te activeren en te configureren:

source: Click on the "Enable geographic filter" toggle button.
de: Klicken Sie auf die Schaltfläche "Geographischen Filter aktivieren"
es: Haga clic en el botón de alternancia "Activar filtro geográfico".
fr: Cliquez sur le bouton "Activer le filtre géographique".
nl: Klik op de toggle-knop "Geografische filter activeren".

source: Choose for which country the geographic filter will be available, using the drop-down selection. To configure the geographic filter for the entire world, choose "All countries" and skip to step 3 of this procedure.
de: Wählen Sie über die Dropdown-Liste, für welches Land der geografische Filter verfügbar sein soll. Um den geografischen Filter für die ganze Welt zu konfigurieren, wählen Sie "Alle Länder" und fahren Sie mit Schritt 3 dieser Anleitung fort.
es: Elija para qué país estará disponible el filtro geográfico, utilizando la selección desplegable. Para configurar el filtro geográfico en todo el mundo, seleccione "Todos los países" y vaya directamente al paso 3 de este procedimiento.
fr: Dans la liste déroulante, choisissez le pays auquel appliquer le filtre géographique. Pour configurer le filtre géographique au niveau mondial, sélectionnez "Tous les pays" et passez à l'étape 3 de cette procédure.
nl: Kies voor welk land de geografische filter beschikbaar zal zijn. Gebruik hiervoor de keuzelijst. Om de geografische filter voor de gehele wereld te configureren, kies "Alle landen" en sla stap 3 van deze procedure over.

source: Choose the highest administrative division available in the geographic filter, using the drop-down selection.
de: Nutzen Sie die Dropdown-Liste, um die höchste Verwaltungseinheit des geografischen Filters auszuwählen.
es: Elija la división administrativa superior disponible en el filtro geográfico, utilizando la selección desplegable.
fr: À l'aide de la liste déroulante, choisissez la division administrative la plus élevée disponible dans le filtre géographique.
nl: Kies de hoogste administratieve afdeling die beschikbaar is in de geografische filter. Gebruik hiervoor de keuzelijst.

source: Choose the lowest administrative division available in the geographic filter, using the drop-down selection. Users will be able to refine with administrative divisions comprised between the defined highest and lowest ones.
de: Nutzen Sie die Dropdown-Liste, um die niedrigste Verwaltungseinheit des geografischen Filters auszuwählen. Die Nutzer können Verfeinerungen zwischen den höchsten und niedrigsten Verwaltungseinheiten vornehmen.
es: Elija la división administrativa inferior disponible en el filtro geográfico, utilizando la selección desplegable. Los usuarios podrán refinar la selección con las divisiones administrativas incluidas entre la superior y la inferior definidas.
fr: À l'aide de la liste déroulante, choisissez la division administrative la plus basse disponible dans le filtre géographique. Les utilisateurs pourront affiner les résultats avec les divisions administratives comprises entre le niveau le plus élevé et le niveau le plus bas définis.
nl: Kies de laagste administratieve afdeling die beschikbaar is in de geografische filter. Gebruik hiervoor de keuzelijst. Gebruikers kunnen verfijnen met administratieve afdelingen die liggen tussen de gedefinieerde hoogste en laagste afdelingen.

source: Define the default filter that will be used first when the geographic filter is activated.
de: Legen Sie den Standardfilter fest, der zuerst verwendet wird, sobald der geografische Filter aktiviert wird.
es: Defina el filtro predeterminado que se utilizará primero cuando se active el filtro geográfico.
fr: Définissez le filtre par défaut qui sera utilisé en premier lors de l'activation du filtre géographique.
nl: Definieer de standaard filter die het eerst gebruikt zal worden wanneer de geografische filter wordt geactiveerd.

source: (optional) Switch the "Apply the default filter when loading the catalog" toggle button for the default filter to be automatically activated and applied on the catalog at loading.
de: (optional) Aktivieren Sie den Schalter "Den Standardfilter beim Laden des Katalogs anwenden" damit der Standardfilter automatisch beim Laden auf den Katalog angewendet wird.
es: (opcional) Cambie el botón de alternancia "Aplicar el filtro predeterminado al cargar el catálogo" para que el filtro predeterminado se active automáticamente y se aplique en el catálogo al cargarlo.
fr: (optionnel) Cliquez sur le bouton "Appliquer le filtre par défaut lors du chargement du catalogue" pour que le filtre par défaut soit automatiquement activé et appliqué lors du chargement du catalogue.

source: (optional) Switch the "Display by default all datasets that include the selected territory" toggle button for all datasets related to a chosen territory to be displayed by default.
de: (optional) Aktivieren Sie den Schalter "Standardmäßig alle Datensätze, die das ausgewählte Territorium beinhalten anzeigen" damit automatisch alle mit einem ausgewählten Territorium in Beziehung stehenden Datensätze angezeigt werden.

source: Click on the Save button in the top right corner.
de: Klicken Sie oben rechts auf den Button Speichern.
es: Haga clic en el botón Guardar en la esquina superior derecha.
fr: Cliquez sur le bouton Enregistrer en haut à droite.
nl: Klik op de knop Opslaan in de rechter bovenhoek.

source: By default the dataset is opened on the **table view**, but you can choose to display the **information tab** instead. The table view by default is useful to give users with a direct access to the data, whereas the information tab by default is interesting to provide users with context and description first.
es: El conjunto de datos se abre de forma predeterminada con la **vista de tabla**, pero puede elegir visualizar la **ficha de información**. La visualización predeterminada de la vista de tabla resulta útil para permitir a los usuarios acceder directamente a los datos, mientras que la visualización predeterminada de la ficha de información es interesante para brindarles en primer lugar la información de contexto y descripción.
fr: Par défaut, le jeu de données s'ouvre sur la **vue tableau**, mais vous pouvez afficher **l'onglet informations** à la place. Choisir la vue tableau permet aux utilisateurs d'accéder directement aux données tandis que l'onglet Informations leur donnera d'abord le contexte et la description.
nl: Standaard wordt de dataset geopend met de **tabelweergave**, maar u kan er in de plaats voor kiezen om het **informatietabblad** weer te geven. De standaard tabelweergave is nuttig om gebruikers rechtstreeks toegang te geven tot de data, terwijl het standaard informatietabblad interessant is om gebruikers eerst de context en de omschrijving te geven.

source: The geographic filter can either enable filtering across the entire world, or only on a specific, chosen country.
es: El filtro geográfico puede permitir el filtrado en todo el mundo, o solamente en un país específico seleccionado.
fr: Vous pouvez choisir d'appliquer un filtrage au niveau mondial ou bien au niveau d'un pays en particulier.
nl: De geografische filter laat toe om ofwel over de gehele wereld te filteren of enkel op een specifiek, gekozen land.

source: When the geographic filter is configured for a specific country, very precise refining is available, through multiple available administrative divisions.
es: Cuando se configura el filtro geográfico para un país específico, hay disponible un refinamiento muy preciso, mediante diversas divisiones administrativas disponibles.
fr: Quand le filtre géographique est configuré pour un pays spécifique, vous avez la possibilité d'affiner de façon très précise le filtrage parmi les nombreuses divisions administratives disponibles.
nl: Wanneer de geografische filter wordt geconfigureerd voor een specifiek land, is een zeer precieze verfijning beschikbaar door middel van meerdere beschikbare administratieve afdelingen.

source: (optional) Switch the "Display by default all datasets that include the selected territory" toggle button for all datasets related to a chosen territory to be dislayed by default.
es: (opcional) Cambie el botón de alternancia "Visualizar de forma predeterminada todos los datos que incluyen el territorio seleccionado" para que se muestren de forma predeterminada todos los datos relacionados con el territorio seleccionado.
fr: (optionnel) Cliquez sur le bouton "Afficher par défaut tous les jeux de données qui incluent le territoire sélectionné" pour afficher par défaut tous les jeux de données liés au territoire sélectionné.
