Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/api/csw/intro.po
Languages: fr

source: Using the service
fr: Utilisation du service

source: OpenDataSoft datasets can be accessed through a Catalog Service for the Web (CSW). This is a standard for exposing a catalogue of geospatial records in XML. The OpenDataSoft platform uses the CSW specification version 2.0.2.
fr: Les jeux de données OpenDataSoft sont accessibles grâce à un 'Catalog Service for the Web' (CSW). Il s'agit d'un standard permettant d'exposer des données géospatiales en XML. La plateforme OpenDataSoft utilise la version 2.0.2 de la spécification CSW.

source: Operations supported
fr: Opérations supportées

source: OpenDataSoft platform implements four operations defined by the CSW standard :
fr: La plateforme OpenDataSoft implémente quatre opérations définies par le standard CSW :

source: CSW Operations
fr: Opérations CSW

source: Operation
fr: Opération

source: Retrieve service metadata.
fr: Récupère les métadonnées du service.

source: Discover elements of the information model by the catalogue.
fr: Permet de récupérer les éléments du modèle d'information.

source: Search for records and get their metadata and identifier.
fr: Recherche des enregistrements et récupère leur identifiant et leurs métadonnées.

source: Search for a record with a specific identifier.
fr: Recherche un enregistrement avec un identifiant donné.

source: Service address and methods
fr: Adresse et méthodes du service

source: The service can be reached at the following entry address :
fr: Le service est accessible à l'adresse suivante :

source: For this documentation, we use the the domain ``http://public.opendatasoft.com`` as an example but you should replace it by your custom domain name.
fr: Pour cette documentation, nous utilisons le domaine ``http://public.opendatasoft.com`` à titre d'exemple, il convient de le remplacer par votre propre nom de domaine.

source: The CSW supports both ``GET`` and ``POST`` HTTP methods.
fr: Le service CSW supporte les méthodes HTTP ``GET`` et ``POST``.

source: Request Headers
fr: En-têtes des requêtes

source: The only supported HTTP header is the optional ``Content-Type`` header, which must be set to ``text/xml`` when using a ``POST`` HTTP request.
fr: La seule en-tête HTTP supportée est l'en-tête ``Content-Type`` . Elle est optionnelle et devrait avoir pour valeur ``text/xml`` si elle est utilisée lors de requêtes HTTP ``POST``.

source: Parameters
fr: Paramètres

source: When the HTTP ``GET`` method is used, the parameters are appended to the URL using a Keyword Value Pair (KVP) encoding. When the HTTP ``POST`` method is used, the operation request message is encoded as an XML document in the body of the ``POST`` message.
fr: Lorsque la méthode HTTP ``GET`` est utilisée, les paramètres sont ajoutées à l'URL en utilisant un système de pairs clé/valeur. Lorsque la méthode HTTP ``POST`` est utilisée, les paramètres et l'opération doivent être renseignés au sein d'un document XML composant le corps (body) de la requête.

source: Here is the list of the common parameters, supported by all CSW operations :
fr: Voici une liste des paramètres supportés par toutes les opérations CSW :

source: Request Parameters
fr: Paramètres des requêtes

source: Possible values
fr: Valeurs possibles

source: Optionality and use
fr: Fréquence d'utilisation et caractère optionnel

source: The requested service
fr: Le service demandé

source: One (Mandatory)
fr: Un (obligatoire)

source: The requested operation
fr: L'opération demandée

source: The requested version of the service.
fr: La version demandée du service.

source: One (Optional)
fr: Un (Optionnel)

source: Exception reports
fr: Rapports d'erreurs

source: When an error occurs, the service respond to the client using an Exception Report message to describe the error.
fr: Lorsqu'une erreur survient, le service répond au client en utilisant un 'Exception Report' message pour décrire l'erreur.

source: Parameters in Exception element
fr: Paramètres de l'élément 'Exception'

source: Name
fr: Nom

source: Definition
fr: Définition

source: Data type and value
fr: Type de donnée et valeur

source: Multiplicity and use
fr: Multiplicité et utilisation

source: Text describing specific exception represented by the exceptionCode
fr: Un texte décrivant l'erreur représentée par le code d'exception

source: Character String type, not empty. Value is an exception description as defined by individual servers
fr: Chaîne de caractères non vide. Sa valeur est une description de l'erreur définie par le serveur

source: Zero or more (optional). Omitted only when no more useful information available
fr: Zéro ou plus (optionnel). Omis lorsqu'aucune information utile n'est disponible.

source: Code representing type of this exception
fr: Code représentant le type de cette exception

source: Character String type, not empty. Allowed values are specified by each implementation specification and server implementation
fr: Chaine de caractères non vide. Les valeurs possibles sont dépendantes de l'implémentation du serveur et de la version utilisée

source: One (mandatory)
fr: Un (obligatoire)

source: Indicator of location in the client's operation request where this exception was encountered
fr: Indication à propos de l'endroit où l'erreur s'est produite dans la requête du client.

source: Character String type, not empty. Contents defined for each allowed exceptionCode value for each operation
fr: Chaine de caractères non vide.

source: Zero or one (optional). Omitted when no useful value available
fr: Zéro ou un (optionnel). Omis lorsqu'aucune information utile n'est disponible.

source: Example :
fr: Exemple :
