Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/03_sharing_page/sharing_page.po
Languages: de, es, fr, nl

source: Sharing & embedding a content page
de: Eine Inhaltsseite teilen und einbetten
es: Compartir e incrustar una página de contenido
fr: Partager et intégrer une page de contenu
nl: Een contentpagina delen & embedden

source: The Sharing tab of a content page displays several options to share or embed that page.
de: Die Registerkarte Teilen einer Inhaltsseite zeigt mehrere Optionen zum Freigeben oder Einbetten dieser Seite an.
es: La ficha Compartir de una página de contenido muestra varias opciones para compartir o incrustar esa página.
fr: Plusieurs options permettant de partager ou d'intégrer une page de contenu sont disponibles dans l'onglet Partager de cette page.
nl: In de tab Delen van een contentpagina staan verschillende opties weergegeven om die pagina te delen of te embedden.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Sharing and/or embedding a content page depends on the security configured for both the domain and the page itself.
de: Die Freigabe und/oder Einbettung einer Inhaltsseite hängt von der Sicherheit ab, die für die Domain und die Seite selbst konfiguriert ist.
fr: Le partage et/ou l'intégration d'une page de contenu dépend des paramètres de sécurité définis pour le domaine et la page en elle-même.
nl: Het delen en/of embedden van een contentpagina hangt wel af van de beveiliging die geconfigureerd is voor zowel het domein als de pagina zelf.

source: Sharing a page via a direct URL
de: Eine Seite über eine URL freigeben
es: Compartir una página mediante una dirección URL directa
fr: Partager une page via une URL directe
nl: Een pagina delen via een rechtstreekse URL

source: The "Direct link" area contains a URL to share direct access to the page.
de: Der Bereich "Direktlink" enthält eine URL, die den direkten Zugriff auf die Seite ermöglicht.
fr: La zone "Lien direct" contient une URL pour partager un accès direct à la page.
nl: In de rubriek "Rechtstreekse link" staat een URL om een rechtstreekse toegang tot de pagina te delen.

source: Click on the copy button |icon-copypaste| to copy the URL.
de: Klicken Sie auf den Button Kopieren |icon-copypaste|, um die URL zu kopieren.
es: Haga clic en el botón de copiar |icon-copypaste| para copiar la dirección URL.
fr: Cliquez sur le bouton de copie |icon-copypaste| pour copier l'URL.
nl: Klik op de kopieerknop |icon-copypaste| om de URL te kopiëren.

source: Embedding a page via an iFrame
de: Eine Seite über einen iFrame einbetten
es: Incrustar una página mediante un iFrame
fr: Intégrer une page via un iFrame
nl: Een pagina embedden via een iFrame

source: The "Embed" area contains the iframe code of the content page (see :doc:`Sharing & embedding data visualizations </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>` for more information about iframes).
de: Der Bereich "Einbetten" enthält den Iframe-Code der Inhaltsseite (siehe :doc:`Eine Datenvisualisierung teilen und einbetten </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>` für weitere Informationen über iframes).
es: El área "Incrustar" contiene el código iframe de la página de contenido (consulte :doc:`Compartir e incrustar visualizaciones de datos </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>` para obtener más detalles acerca de los iframes).
fr: La zone "Intégrer" contient le code de l'iframe de la page de contenu (voir :doc:`Partager et intégrer des visualisations de données</exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>` pour en savoir plus sur les iframes).
nl: In de rubriek "Embed" staat de iframe-code van de contentpagina (zie :doc:`Dataweergaven delen & embedden </exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations>` voor meer informatie over iframes).

source: Choose the size of the page from the drop-down list.
de: Wählen Sie die Größe der Seite aus der Dropdown-Liste.
fr: Dans la liste déroulante, choisissez la taille de la page.
nl: Kies de grootte van de pagina uit de drop-down lijst.

source: Click on the copy button |icon-copypaste| to copy the iframe code.
de: Klicken Sie auf den Button Kopieren |icon-copypaste|, um den Iframe-Code zu kopieren.
es: Haga clic en el botón de copiar |icon-copypaste| para copiar el código del iframe.
fr: Cliquez sur le bouton de copie |icon-copypaste| pour copier le code de l'iframe.
nl: Klik op de knop Kopiëren |icon-copypaste| om de iframe-code te kopiëren.

source: Sharing and/or embedding a content page however depends on the security configured for both the domain and the page itself.
es: No obstante, compartir y/o incrustar una página de contenido depende de la seguridad configurada tanto para el dominio como para la página en sí.

source: The "Direct link" area contains a URL to share a direct access to the page.
es: El área "Vínculo directo" contiene una dirección URL para compartir un acceso directo a la página.

source: Choose the size of the page, from the drop-down list.
es: Elija el tamaño de la página en la lista desplegable.
