Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/arcgis_opendata.po
Languages: fr, it

source: ArcGIS OpenData harvester
fr: Moissonneur ArcGIS OpenData
it: Harvester OpenData ArcGIS

source: Retrieve datasets from an ArcGIS OpenData portal.
fr: Récupérer les jeux de données d'un portail ArcGIS Open Data
it: Richiama i dataset da un portale OpenData ArcGIS.

source: Parameters
fr: Paramètres
it: Parametri

source: Name
fr: Nom
it: Nome

source: Description
it: Descrizione

source: Example
fr: Exemple
it: Esempio

source: API url (portal_url)
fr: URL de l'API (portal_url)
it: URL API (portal_url)

source: The base URL of the portal
fr: L'URL de base du portail
it: URL base del portale

source: Compute geographical area (compute_geo_area)
fr: Calculer la zone géographique (compute_geo_area)
it: Calcola area geografica (compute_geo_area)

source: If set, automatically computes the geographic area covered by the dataset ("Geographic area" option in the publish interface information tab)
fr: Calcule automatiquement la zone géographique couverte par le jeu de données (option "Zone géographique" de l'onglet informations de l'interface de publication)
it: Se impostato, questo parametro calcola l'area geografica coperta dal dataset (opzione "Area geografica" nella scheda Informazioni dell'interfaccia di pubblicazione).

source: Process data (fetch_data)
fr: Récupérer les données (fetch_data)
it: Elabora dati (fetch_data)

source: Download the data if true, else only download metadata and link to actual data
fr: Si oui, télécharge les données, sinon, récupérer uniquement les métadonnées
it: Se impostato su "true" esegue il download dei dati, altrimenti scarica solo i metadati e il link ai dati.
