Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/arcgis.po
Languages: es

source: ArcGIS harvester
es: Recopilador de ArcGIS

source: Retrieve datasets from an ArcGIS Server REST API.
es: Recuperar juegos de datos de una API REST ArcGIS Server.

source: This harvester is not available by default. If you need to use it, please contact OpenDataSoft support team.
es: Este recopilador no está disponible de forma predeterminada. Si necesita usarlo, póngase en contacto con el equipo de soporte de OpenDataSoft.

source: Parameters
es: Parámetros

source: Name
es: Nombre

source: Description
es: Descripción

source: Example
es: Ejemplo

source: URL (arcgis_url)
es: Dirección URL (arcgis_url)

source: The base URL of the ArcGIS REST service without parameters.
es: Dirección URL base del servicio REST ArcGIS sin parámetros.

source: If you are not sure whether you have the correct URL, look for the **ArcGIS Services Directory** page. It should display the message "**Folder: /**" and a list of folders and services.
es: Si no está seguro de que tenga la dirección URL correcta, busque la página del **directorio de servicios de ArcGIS**. Debería mostrar el mensaje "**Folder: /**" y una lista de carpetas y servicios.
