Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/ckan.po
Languages: es

source: CKAN harvester
es: Recopilador de CKAN

source: Retrieve datasets from a CKAN portal.
es: Recuperar juegos de datos de un portal CKAN.

source: Parameters
es: Parámetros

source: Name
es: Nombre

source: Description
es: Descripción

source: Example
es: Ejemplo

source: CKAN root URL (url)
es: Dirección URL raíz de CKAN (url)

source: The base url of the portal
es: Dirección URL base del portal

source: Maximum results to harvest (limit)
es: Número máximo de resultados para recopilar (limit)

source: Only retrieve a certain amount of datasets.
es: Recuperar solo una determinada cantidad de juegos de datos.

source: Number of results to skip before starting the harvest (offset)
es: Número de resultados para omitir antes de iniciar la recopilación (offset)

source: Skip a certain amount of datasets before starting to harvest.
es: Omitir una determinada cantidad de juegos de datos antes de empezar a recopilar.

source: Sort parameter (sort)
es: Parámetro de ordenación (sort)

source: Sorting of the CKAN search results. Default: 'relevance asc, metadata_modified desc'. This is a comma-separated string of field names and sort-orderings.
es: Ordenación de los resultados de búsqueda CKAN. Valor predeterminado: "relevance asc, metadata_modified desc". Es una cadena de nombres de campo y valores de ordenación.

source: CKAN API Key (api_key)
es: Clave de API de CKAN (api_key)

source: If the portal requires authentication, your API Key.
es: Si el portal requiere autenticación, la clave de API.

source: CKAN Group (group)
es: Grupo de CKAN (group)

source: Name of the group you want to harvest.
es: Nombre del grupo que desea recopilar.
