Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/csw.po
Languages: it

source: CSW harvester
it: Harvester CSW

source: Retrieve datasets from a Catalog Service for the Web (CSW portal).
it: Richiama i dataset da un servizio di cataloghi per il Web (Catalog Service for the Web), cioè un portale CSW.

source: The CSW server must provide the following capabilities:
it: Il server CSW deve avere le seguenti caratteristiche:

source: CSW version: 2.0.2
it: Versione CSW: 2.0.2

source: This harvester is not available by default. If you need to use it, please contact OpenDataSoft support team.
it: Questo harvester non è disponibile in modo predefinito. Se desideri utilizzarlo ti preghiamo di contattare il team di assistenza OpenDataSoft.

source: Parameters
it: Parametri

source: Name
it: Nome

source: Description
it: Descrizione

source: Example
it: Esempio

source: Csw url (cswurl)
it: URL del CSW (cswurl)

source: The base URL of the CSW geoportal
it: URL base del geoportale CSW.

source: Theme thesaurus (theme_thesaurus)
it: Thesaurus dei temi (theme_thesaurus)

source: The name of the thesaurus used to fill the themes metadata
it: Nome del thesaurus utilizzato per compilare i metadati dei temi.

source: Constraint language to CQL_TEXT (constraint_language)
it: Linguaggio vincolo per CQL_TEXT (constraint_language)

source: Set this option to True if the portal requires to constraint the language to CQL_TEXT
it: Imposta questa opzione su True se il portale richiede di vincolare il linguaggio a CQL_TEXT.

source: User (username)
it: Utente (username)

source: The username if the CSW service needs authentication
it: Username, se il servizio CSW richiede l'autenticazione.

source: The password if the CSW service needs authentication
it: Password, se il servizio CSW richiede l'autenticazione.
