Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/datagouv.po
Languages: es, it

source: data.gouv.fr harvester
es: Recopilador de data.gouv.fr
it: Harvester data.gouv.fr

source: Retrieve datasets from a data.gouv.fr portal.
es: Recuperar juegos de datos de un portal data.gouv.fr.
it: Richiama i dataset dal portale data.gouv.fr.

source: Parameters
es: Parámetros
it: Parametri

source: Name
es: Nombre
it: Nome

source: Description
es: Descripción
it: Descrizione

source: Example
es: Ejemplo
it: Esempio

source: Organization ID (organization_id)
es: ID de organización (organization_id)
it: ID organizzazione (organization_id)

source: The **id** of the organization you want to harvest (found here: http://www.data.gouv.fr/api/1/organizations/)
es: El **ID** de la organización que desea recopilar (se encuentra aquí: http://www.data.gouv.fr/api/1/organizations/).

source: Attachment (generate attachment)
es: Asociación (Generar asociación)
it: Allegato (genera allegato)

source: Check this if you want to attach resources as attachments instead of using them as sources
es: Seleccione esta opción si desea asociar los recursos en lugar de usarlos como orígenes.
it: Seleziona questa opzione per utilizzare le risorse come allegati anziché come risorse vere e proprie.

source: Filter parameter name (filter_name)
es: Nombre de parámetro de filtro (filter_name)
it: Filtra il nome del parametro (filter_name)

source: Name of the parameter you want to pass to the data.gouv.fr API to filter the request that will be performed
es: Nombre del parámetro que desea pasar a la API data.gouv.fr para filtrar la solicitud que se ejecutará.
it: Nome del parametro da inviare all'API data.gouv.fr per filtrare la richiesta da eseguire.

source: Filter parameter value (filter_value)
es: Valor de parámetro de filtro (filter_value)
it: Filtra il valore del parametro (filter_value)

source: Value of the above parameter
es: Valor del parámetro anterior.
it: Valore del suddetto parametro.
