Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/datajson.po
Languages: es

source: data.json harvester
es: Recolector de data.json

source: Retrieve datasets from a /data.json file at the root of a portal. The data.json norm is promoted by the `Project Open Data <https://project-open-data.cio.gov/>`_
es: Recuperar conjuntos de datos de un archivo /data.json en la raíz de un portal. La norma data.json es promovida por `Project Open Data <https://project-open-data.cio.gov/>`_

source: Parameters
es: Parámetros

source: Name
es: Nombre

source: Description
es: Descripción

source: Example
es: Ejemplo

source: Portal url
es: Dirección URL del portal

source: The URL of the portal you want to harvest. Azavea, Ckan, Dkan, ESRI, Junar, OpenDataSoft, OpenGov, Socrata portals implements the data.json norm.
es: La dirección URL del portal que desea recolectar. Los portales Azavea, Ckan, Dkan, ESRI, Junar, OpenDataSoft, OpenGov y Socrata implementan la norma data.json.

source: Number of datasets
es: Número de conjuntos de datos

source: If set, only retrieve a certain amount of datasets.
es: Si se establece, recuperar solo una determinada cantidad de conjuntos de datos.
