Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/fred.po
Languages: it

source: FRED harvester
it: Harvester FRED

source: Retrieve datasets from the `Federal Reserve Bank of St. Louis <https://fred.stlouisfed.org/>`_.
it: Recupera i datasets da `Federal Reserve Bank of St. Louis <https://fred.stlouisfed.org/>`_.

source: Disclaimer
it: Esclusione di responsabilità

source: This product uses the FRED® API but is not endorsed or certified by the Federal Reserve Bank of St. Louis.
it: Questo prodotto utilizza l'API FRED® ma non è consigliato né certificato dalla Federal Reserve Bank of St. Louis.

source: Parameters
it: Parametri

source: Name
it: Nome

source: Description
it: Descrizione

source: Example
it: Esempio

source: FRED API key
it: Chiave API FRED

source: Your own `FRED API key <https://research.stlouisfed.org/docs/api/api_key.html>`_
it: La tua `chiave API FRED <https://research.stlouisfed.org/docs/api/api_key.html>`_

source: Can be either a dataset ID or a query to match series against
it: Può essere l'ID di un dataset o una query a cui associare una serie

source: Number of datasets
it: Numero dei dataset

source: The number of datasets that will be harvested. If no value is set, all datasets will be harvested (up to 1000).
it: Numero dei dataset su cui verrà eseguito l'harvester. Se non si imposta alcun valore, verrà applicato su tutti i dataset (fino a 1000).
