Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/ftp_with_meta_csv.po
Languages: es, fr, it

source: FTP with meta CSV harvester
es: Recopilador de FTP con CSV de metadatos
fr: Moissonneur FTP avec CSV de métadonnées
it: FTP con harvester CSV di metadati

source: This harvester allows users to create datasets from an FTP folder. The FTP folder must contain:
es: Este recolector permite a los usuarios crear conjuntos de datos a partir de una carpeta FTP que contiene:
it: Questo harvester permette agli utenti di creare dataset a partire da una cartella FTP. La cartella deve contenere:

source: one **metadata CSV file** (separated with semicolons)
es: un **archivo CSV de metadatos** (separado por puntos y coma)
it: un **file CSV di metadati** (separati da punti e virgola);

source: several **resources**
es: varios **recursos**
it: varie **risorse**;

source: (optional) several **CSV schema files**
es: (opcional) varios **archivos de esquema CSV**
it: (facoltativo) vari **file di schema CSV**.

source: Metadata CSV file
es: Diseño de carpeta FTP
it: File CSV di metadati

source: The **metadata CSV file** (named ``index.csv`` by default) is a semicolon separated file which contains:
es: El **archivo CSV de metadatos** (denominado ``index.csv`` de forma predeterminada) es un archivo separado por puntos y coma que contiene:
it: Il **file CSV di metadati** (denominato ``index.csv`` per impostazione predefinita) è un file con valori separati da punti e virgola contenente:

source: one header row
es: una fila de encabezado
it: una riga di intestazione;

source: several other rows, each one dedicated to a dataset to harvest
es: varias filas adicionales, una por conjunto de datos por recopilar
it: diverse altre righe, ognuna di esse dedicata a un dataset da raccogliere.

source: **Example:**
es: **Ejemplo:**
it: **Esempio:**

source: name
es: nombre

source: title
es: Título

source: description
es: Descripción

source: theme
es: Tema

source: keyword
es: Palabras claves

source: Chocolate bars database
es: Base de datos de barritas de chocolate
it: Database dei cioccolatini

source: A database of chocolate bars
es: Una base de datos de barritas de chocolate
it: Un database di cioccolatini.

source: Health
es: Salud
it: Salute

source: Venture Capital Investments
es: Inversiones de capital riesgo

source: Venture capital industry statistics.
es: Estadísticas del sector del capital riesgo.
it: Statistiche del settore degli investimenti speculativi.

source: Economy, Business
es: Economía, negocios
it: Economia, Finanza

source: Venture capital;Investments;IPO;Acquisitions
es: Capital riesgo;Inversiones;OPI;Adquisiciones

source: The ``name`` column contains an identifier for each row. These identifiers can be anything as long as they only contain letters and numbers, are unique across the file, and don't change over time.
es: La columna ``name`` contiene un identificador para cada fila. Estos identificadores pueden ser cualquier cadena de caracteres siempre que esta contenga únicamente letras y números, sea exclusiva en el archivo y no cambie con el tiempo.
it: La colonna ``name`` contiene un identificatore per ogni riga. Questi identificatori possono presentare qualsiasi lunghezza, a patto che contengano solo lettere e numeri, che siano unici all’interno del file e che non cambino nel corso del tempo.

source: The **CSV resource column** (``source_dataset`` by default) contains the resource for each row.
es: La **columna de recursos CSV** (``source_dataset`` de forma predeterminada) contiene el recurso de cada fila.
it: La **colonna risorse CSV** (``source_dataset`` per impostazione predefinita) contiene la risorsa di ogni riga.

source: The optional **CSV shema column** (here, ``schema_file``) contains the schema file for each row.
es: La **columna de esquema CSV** opcional (aquí, ``schema_file``) contiene el archivo de esquema para cada fila.
it: La **colonna schema CSV** facoltativa (``schema_file`` in questo esempio) contiene il file di schema di ogni riga.

source: Every other column is a metadata (e.g: ``title``, ``description``, ``theme``, ``keyword``, ``license``, ``language``, but there are other ones you can add). Note: use double quotes at the beginning and end of lists like ``keywords``, where you have to use semicolons to separate words.
es: Las demás columnas son metadatos (p. ej. ``title``, ``description``, ``theme``, ``keyword``, ``license``, ``language``, pero puede añadir otras). Nota: Utilice comillas dobles al principio y al final de listas como las de ``keywords``, donde tiene que usar puntos y coma para separar las palabras.
it: Ogni altra colonna è costituita da metadati (ad es.: ``title``, ``description``, ``theme``, ``keyword``, ``license``, ``language``, ma è possibile aggiungerne altri). Nota bene: all'inizio e alla fine di elenchi come le ``keywords`` inserisci le virgolette doppie, mentre per separare le parole al loro interno utilizza i punti e virgola.

source: Resources
es: Recursos
it: Risorse

source: Resources can either be:
es: Los recursos pueden ser:
it: Le risorse possono essere:

source: files on the FTP server, in the same folder as the ``index.csv`` file, or under a subdirectory by specifying the relative path to the file in the column (e.g "resources/chocolate.csv")
es: archivos del servidor FTP, en la misma carpeta que el archivo ``index.csv`` o en un subdirectorio si se específica la ruta relativa al archivo en la columna (p. ej., \"resources/chocolate.csv\")
it: file sul server FTP, nella stessa cartella del file ``index.csv`` o in una sottodirectory (specificare il percorso nella colonna: ad es. "resources/chocolate.csv");

source: any URL pointing towards a supported format
es: cualquier URL que apunte a un formato permitido
it: un URL che punti a un formato supportato.

source: If the column is empty, the dataset will only contain metadata.
es: Si la columna está vacía, el conjunto de datos solo contendrá metadatos.
it: Se la colonna è vuota, il dataset conterrà solo metadati.

source: Resources in any format supported by the platform can be harvested. However, as the harvester heavily relies on automatic parameters detection for the connector's configuration, files must be simple enough to be correctly extracted.
es: Pueden recopilarse recursos en cualquier formato que la plataforma permita. Sin embargo, puesto que el recolector depende en gran medida de la detección de parámetros automáticos para la configuración del conector, los archivos deben ser lo suficientemente simples para extraerse correctamente.
it: L'harvesting può essere eseguito sulle risorse in qualsiasi formato supportato dalla piattaforma. Poiché l'harvester si basa ampiamente sulla rilevazione automatica dei parametri per configurare il connettore, i file devono essere sufficientemente semplici da poter essere estratti correttamente.

source: Schema CSV file
es: Archivo CSV de esquema
it: File CSV dello schema

source: For each resource, the FTP folder can contain a **CSV schema file** that defines labels and descriptions for each field of the dataset.
es: Para cada recurso, la carpeta FTP puede contener un **archivo de esquema CSV** que defina las etiquetas y las descripciones para cada campo de la base de datos.
it: Per ogni risorsa, la cartella FTP può contenere un **file di schema CSV** che definisce le etichette e le descrizioni di ogni campo del dataset.

source: The filename of each schema file must be written in the **CSV schema column**. This file has the following specifications:
es: El nombre del archivo de esquema debe escribirse en la **columna de esquema CSV**. Este archivo tiene las especificaciones siguientes:
it: Il nome di ogni file di schema deve essere riportato nella **colonna dello schema CSV**. Il file in questione presenta le seguenti specifiche:

source: a ``name`` column holds each field name in lowercase (e.g. on a CSV resource, this would be the column names in lowercase)
es: Una columna ``name`` contiene todos los nombres de campo en minúsculas (p. ej. en un recurso CSV serían los nombres de columna en minúsculas).
it: una colonna ``name`` contenente il nome di ogni campo in lettere minuscole (nel caso di una risorsa CSV, conterrà i nomi delle colonne in lettere minuscole);

source: a ``label`` column (optional) holds the label of the corresponding field
es: Una columna ``label`` (opcional) contiene la etiqueta del campo correspondiente.
it: una colonna ``label`` (facoltativa) con l'etichetta del campo corrispondente;

source: a ``description`` column (optional) holds the description of the corresponding field
es: Una columna ``description`` (opcional) contiene la descripción del campo.
it: una colonna ``description`` (facoltativa) con la descrizione del campo corrispondente.

source: label
es: etiqueta

source: Company
es: Empresa

source: The company that makes the bar
es: La empresa que fabrica la barrita
it: La società che produce i cioccolatini.

source: Reference
es: Referencia

source: The product id of the chocolate bar
es: El ID de producto de la barrita de chocolate
it: Il codice prodotto dei cioccolatini.

source: The schema files do not need to contain a row for each field, and it is not required to provide a schema file for each dataset in the ``index.csv``. In the latter case, keep the corresponding cell empty.
es: Los archivos de esquema no tienen que contener una fila para cada campo y no es necesario proporcionar un archivo de esquema para cada conjunto de datos en "index.csv". En este último caso, mantenga vacía la celda correspondiente.
it: I file dello schema non devono necessariamente contenere una riga per ogni campo e non è necessario creare un file di schema per ogni dataset del file ``index.csv``. In quest'ultimo caso, la cella corrispondente resta vuota.

source: Parameters
es: Parámetros
fr: Paramètres
it: Parametri

source: Name
es: Nombre
fr: Nom
it: Nome

source: Description
es: Descripción
it: Descrizione

source: Example
es: Ejemplo
fr: Exemple
it: Esempio

source: URL of the FTP server
es: Dirección URL del servidor FTP.
fr: URL du serveur FTP
it: URL del server FTP

source: **User** (user)
es: **Usuario** (user)
fr: **Utilisateur** (user)

source: Your username
es: Su nombre de usuario.
fr: Votre nom d'utilisateur
it: Il tuo nome utente

source: **Password** (password)
es: **Contraseña** (password)
fr: **Mot de passe** (password)

source: Your password
es: Su contraseña.
fr: Votre mot de passe
it: La tua password

source: Subdirectory (subdir)
es: Subdirectorio (subdir)
fr: Sous-dossier (subdir)

source: The directory containing the data you want to harvest.
es: El directorio que contiene los datos que desea recopilar.
fr: Le dossier contenant les données à moissonner.
it: La directory contenente i dati su cui desideri effettuare l'harvesting.

source: **Metadata CSV filename** (metadata_file)
es: **Nombre de archivo CSV de metadatos** (metadata_file)
fr: **Nom du fichier CSV de métadonnées** (metadata_file)

source: The file holding the metadata and filenames (see above for more precise specifications).
es: El archivo que contiene los metadatos y nombres de archivo (consulte las especificaciones precisas indicadas anteriormente).
fr: Le fichier contenant les métadonnées et les noms de fichiers (voire ci-dessus pour une description plus précise).
it: Il file che contiene i metadati e i nomi dei file. Per informazioni più specifiche, vedi sopra.

source: **Metadata CSV resource column** (resource_location_column)
es: **Columna CSV de recursos de metadatos** (resource_location_column)
fr: **Colonne des ressources CSV des métadonnées** (resource_location_column)

source: This column holds a filename or an URL with the dataset resource.
es: Esta columna contiene un nombre de archivo o una dirección URL con el recurso de juego de datos.
fr: Nom de la colonne contenant le nom du fichier ou l'URL contenant les données.
it: Questa colonna contiene il nome di un file o un URL con la risorsa del dataset.

source: Metadata CSV schema column (resource_schema_column)
es: Columna CSV de esquema de metadatos (resource_schema_column)
fr: Colonne du schéma CSV des métadonnées (resource_schema_column)

source: This column holds a filename with the resource schema (column labels and descriptions).
es: Esta columna contiene un nombre de archivo con el esquema de recurso (etiquetas de columna y descripciones).
fr: Cette colonne contient un nom de fichier contenant le schéma des ressources (descriptions et labels des colonnes).
it: Questa colonna contiene il nome di un file con lo schema della risorsa (descrizioni ed etichette delle colonne).

source: Chocolate
it: Cioccolato

source: Harvester for FTP folders with one **metadata CSV file** (semicolon separated) for several **resources**.
fr: Moissonneur pour dossiers FPT avec un **fichier CSV de métadonnées** (séparé par des points-virgules) pour plusieurs **ressources**.

source: The CSV file must have a ``name`` column with the id of the dataset.
fr: Le fichier CSV doit comporter une colonne ``name`` contenant l'id du jeu de données.

source: One of the CSV columns (resource_location_column) contains the resource location as a filename on the same FTP folder, or an http/https/ftp URL. If this column is empty, the dataset will only contain metadata.
fr: L'une des colonnes du fichier CSV (resource_location_column) contient l'emplacement de la ressource sous forme d'un nom de fichier dans le même dossier FTP, ou une URL http/https/ftp. Si cette colonne est vide, le jeu de données contiendra uniquement les métadonnées.

source: The other columns are for dataset metadata, the column name being standard metadata field names.
fr: Les autres colonnes contiennent les métadonnées des jeux de données, le nom de la colonne étant un nom standard de métadonnée.

source: For each resource, the FTP folder can contain a **schema CSV file**, whose filename must then be written in the resource schema column. This file has the following specifications:
fr: Pour chaque ressource, le dossier FTP peut contenir un **fichier de schéma CSV**, dont le nom doit ensuite être reporté dans la colonne du schéma de ressource. Ce fichier présente les spécifications suivantes :

source: a ``name`` column holds each field name (e.g. on a CSV resource, this would be the column names),
fr: Une colonne ``name`` contient chaque nom de champ (par ex. sur une ressource CSV, ce serait les noms de colonne).

source: a ``label`` column (optional) holds the label of the corresponding field,
fr: Une colonne ``label`` (en option) contient le label du champ correspondant.

source: a ``description`` column (optional) holds the description of the corresponding field.
fr: Une colonne ``description`` (en option) contient la description du champ correspondant.

source: **Host** (host)
fr: **Hôte** (host)
