Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/junar.po
Languages: de, es, fr, nl

source: Junar harvester
es: Recopilador de Junar
fr: Moissonneur Junar

source: Retrieve datasets from a Junar portal.
de: Datensätze von einem Junar-Portal abrufen.
es: Recuperar juegos de datos de un portal Junar.
fr: Récupérer les jeux de données d'un portail Junar
nl: Haal datasets op uit een Junar-portaal.

source: This harvester is not available by default. If you need to use it, please contact OpenDataSoft support team.
de: Dieser Harvester ist nicht standardmäßig verfügbar. Sollten Sie ihn benötigen, wenden Sie sich bitte an das OpenDataSoft-Supportteam.
es: Este recopilador no está disponible de forma predeterminada. Si necesita usarlo, póngase en contacto con el equipo de soporte de OpenDataSoft.
fr: Ce moissonneur n'est pas disponible par défaut. Si vous souhaitez l'utiliser, veuillez contacter le support OpenDataSoft.
nl: Deze harvester is standaard niet beschikbaar. Indien u deze moet gebruiken, neem dan contact op met het Support Team van OpenDataSoft.

source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
nl: Voorbeeld

source: API url (portal_url)
es: Dirección URL de la API (portal_url)
fr: URL de l'API (portal_url)

source: The base URL of the portal
de: Die Basis-URL des Portals
es: Dirección URL base del portal.
fr: L'URL de base du portail
nl: De basis-URL van het portaal

source: API key (auth_key)
de: API-Schlüssel (auth_key)
es: Clave de API (auth_key)
fr: Clé d'API (auth_key)
nl: API-sleutel (auth_key)

source: Your API Key.
de: Ihr API-Schlüssel.
es: Su clave de API.
fr: Votre clé d'API.
nl: Uw API-sleutel.

source: Query (query_string)
de: Abfrage (query_string)
es: Consulta (query_string)
nl: Vraag (query_string)

source: Will be passed as the *query* parameter to the request (see Junar documentation)
de: Wird als *Abfrage*-Parameter verwendet (siehe Junar-Dokumentation)
es: Se pasará como parámetro *query* a la solicitud (consulte la documentación de Junar).
fr: Sera passé comme paramètre *query* lors de la requête (c.f la documentation Junar)
nl: Zal doorgaan als de "vraag" parameter voor het verzoek (zie Junar-documentatie)

source: Categories (categories)
de: Kategorien (categories)
es: Categorías (categories)
fr: Catégories (categories)
nl: Categorieën (categorieën)

source: Will be passed as the *categories* parameter to the request (see Junar documentation)
de: Wird als *Kategorien*-Parameter verwendet (siehe Junar-Dokumentation)
es: Se pasará como parámetro *categories* a la solicitud (consulte la documentación de Junar).
fr: Sera passé comme paramètre *categories* lors de la requête (c.f la documentation Junar)
nl: Zal doorgaan als de "categorieën" parameter voor het verzoek (zie Junar-documentatie)
