Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/ods.po
Languages: fr, it

source: OpenDataSoft Federation harvester
fr: Moissonneur Fédération OpenDataSoft
it: Harvester di federazione OpenDataSoft

source: Harvest another OpenDataSoft domain to create federated datasets automatically.
fr: Moissonne un autre portail OpenDataSoft pour créer des jeux de données fédérés automatiquement.
it: Esegue l'harvesting su un altro dominio OpenDataSoft per creare automaticamente dataset federati.

source: Parameters
fr: Paramètres
it: Parametri

source: Name
fr: Nom
it: Nome

source: Description
it: Descrizione

source: Example
fr: Exemple
it: Esempio

source: Domain ID (domain_id)
fr: ID du domaine (domain_id)
it: ID del dominio (domain_id)

source: The ID of the domain you want to harvest.
it: L'ID del dominio su cui desideri eseguire l'harvesting.

source: Refines (refines)
it: Affina (refines)

source: The refines you want to pass to filter the query (URL encoded)
fr: Les filtres à passer à la requête (URL encodé)
it: L'affinamento che desideri applicare per filtrare la query (URL codificato).

source: Api key (api_key)
fr: Clé d'API (api_key)
it: Chiave Api (api_key)

source: The Api key used to access the other portal
fr: La clé d'API utilisée pour accéder à l'autre portail
it: La chiave API utilizzata per accedere all'altro portale.

source: If you want to harvest a single OpenDataSoft dataset, you can use the :doc:`federation </sourcing_and_processing_data/federation>`
fr: Si vous souhaitez moissonner un seul jeu de données OpenDataSoft, vous pouvez utiliser la :doc:`fédération </sourcing_and_processing_data/federation>`
it: Se desideri eseguire l'harvesting su un unico dataset OpenDataSoft, puoi utilizzare la :doc:`federazione </sourcing_and_processing_data/federation>`.

source: The ID or base URL of the domain you want to harvest.
fr: L'ID ou l'URL de base du domaine que vous souhaitez moissonner.
