Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/harvesters/quandl.po
Languages: es

source: Quandl harvester
es: Recolector de Quandl

source: Retrieve datasets from `Quandl API <https://www.quandl.com/what-we-do>`_
es: Recuperar conjuntos de datos de una `API Quandl <https://www.quandl.com/what-we-do>`_

source: This harvester is not available by default. If you need to use it, please contact OpenDataSoft support team.
es: Este recolector no está disponible de forma predeterminada. Si necesita usarlo, póngase en contacto con el equipo de soporte de OpenDataSoft.

source: Parameters
es: Parámetros

source: Name
es: Nombre

source: Description
es: Descripción

source: Example
es: Ejemplo

source: Database code
es: Código de base de datos

source: The code of the database you want to harvest
es: El código de la base de datos que desea recolectar

source: Quandl API key
es: Clave de API Quandl

source: Your API key available in `your account settings <https://www.quandl.com/account/api>`_
es: Su clave de API disponible en `la configuración de su cuenta <https://www.quandl.com/account/api>`_

source: Number of datasets
es: Número de conjuntos de datos

source: Only retrieve a certain amount of datasets.
es: Recuperar solo una determinada cantidad de conjuntos de datos.
