Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/arcgis.po
Languages: fr

source: ArcGIS connector
fr: Connecteur ArcGIS

source: The ArcGIS connector is used to import layers from an ArcGIS server via ArcGIS REST API, using the following syntax:
fr: Le connecteur ArcGIS permet d'importer des couches d'un serveur ArcGIS via l'API REST ArcGIS à l'aide de la syntaxe suivante :

source: Creation
fr: Création

source: Choose an option:
fr: Choisissez une option :

source: If you want to create a dataset, click **Catalog** > **Datasets** and click the **New dataset** button.
fr: Si vous souhaitez créer un jeu de données, cliquez sur **Catalogue** > **Jeux de données**, puis cliquez sur le bouton **Nouveau jeu de données**.

source: If you want to add a source to an existing dataset, click **Catalog** > **Datasets** and select the desired dataset. Then, click **Add a source**.
fr: Si vous souhaitez ajouter une source à un jeu de données existant, cliquez sur **Catalogue** > **Jeux de données**, et sélectionnez le jeu de données souhaité. Cliquez ensuite sur **Ajouter une source**.

source: In the wizard that opens, select **ArcGIS** under the **Configure a remote service** section.
fr: Sélectionnez **ArcGIS** dans l'assistant qui s'ouvre, sous la section **Configurer un service distant**.

source: Configure your HTTP connection to import the ArcGIS layer:
fr: Configurez votre connexion HTTP pour importer la couche ArcGIS :

source: Under the **Connection information to the HTTP server** section, enter the URL to the ArcGIS server in the **Server URL** box. For example, ``http://sampleserver3.arcgisonline.com/``.
fr: Sous la section **Informations de connexion au serveur HTTP**, saisissez l'URL du serveur ArcGIS dans le champ **URL du serveur**. Par exemple, ``http://sampleserver3.arcgisonline.com/``.

source: Under the **Path** section, enter the path to the layer. For example, ``/ArcGIS/rest/services/Hurricanes/NOAA_Tracks_1851_2007/MapServer/0``.
fr: Sous la section **Chemin d'accès**, saisissez le chemin d'accès à la couche. Par exemple, ``/ArcGIS/rest/services/Hurricanes/NOAA_Tracks_1851_2007/MapServer/0``.

source: From the preview of the first 20 records that appears, configure the source.
fr: Configurez la source dans l'aperçu des 20 premiers enregistrements qui s'affiche.

source: Configure the dataset information or use the pre-filled values:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :

source: In the **Dataset name** field, enter the title for this dataset.
fr: Dans le champ **Nom du jeu de données**, saisissez le titre de ce jeu de données.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
fr: Dans le champ **Identifiant technique du jeu de données**, saisissez un identifiant explicite pour ce jeu de données.

source: If you want anyone with access to your domain to be able to explore the dataset, toggle off **Access restricted to allowed users and groups**.
fr: Si vous souhaitez que tout utilisateur ayant accès à votre domaine puisse explorer le jeu de données, désactivez l'option **Accès limité aux utilisateurs et aux groupes autorisés**.

source: Name
fr: Nom

source: Usage
fr: Utilisation

source: Decode values
fr: Décoder des valeurs

source: Decode coded values for a domain
fr: Décoder des valeurs codées pour un domaine

source: For coded domains in ArcGIS, coded values are associated with a more user-friendly description, for example, "70" for "Bus lane".
fr: Pour les domaines codés dans ArcGIS, les valeurs codées sont associées à une description plus simple, par exemple "70" pour "Voie de bus".

source: When the source includes coded values, this option is toggled on by default.
fr: Quand la source inclut des valeurs codées, cette option est activée par défaut.

source: Coded values (for example, "70") are decoded to display a more user-friendly description of what the code value means (for example, "Bus Lane").
fr: Les valeurs codées (par exemple, "70") sont décodées pour afficher une description plus simple de ce que la valeur codée signifie (par exemple, "Voie de bus").
