Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/azure_blob_storage.po
Languages: de, es, fr

source: Azure Blob storage connector
de: Azure-Blob-Storage-Konnektor
es: Conector de Azure Blob Storage
fr: Connecteur de stockage d'objets blob Azure

source: The Azure Blob storage connector retrieves content from a file stored in Blob storage.
de: Der Azure-Blob-Storage-Konnektor ruft Inhalte aus einer in einem Blob Storage gespeicherten Datei ab.
es: El conector de Azure Blob Storage recupera contenido de un archivo almacenado en Blob Storage.
fr: Le connecteur de stockage d'objets blob Azure récupère le contenu d'un fichier stocké dans le stockage d'objets blob Azure.

source: Prerequisites
de: Voraussetzungen
es: Requisitos previos
fr: Prérequis

source: You need an Azure account to use the Blob storage connector.
de: Sie benötigen ein Azure-Konto, um den Blob-Storage-Konnektor verwenden zu können.
es: Necesita una cuenta de Azure para usar el conector de Azure Blob Storage.
fr: Un compte Azure est requis pour utiliser le connecteur de stockage d'objets blob Azure.

source: Creation
de: Erstellung
es: Creación
fr: Création

source: Choose an option:
de: Wählen Sie eine Option:
es: Elija una opción:
fr: Choisissez une option :

source: If you want to create a dataset, click Catalog > Datasets and click the New dataset button.
de: Wenn Sie einen Datensatz erstellen möchten, klicken Sie auf "Katalog" > "Datensätze" und dann auf den Button "Neuer Datensatz".
es: Si quiere crear un conjunto de datos, haga clic en Catálogo > Conjuntos de datos y haga clic en el botón Conjunto de datos nuevo.
fr: Si vous souhaitez créer un jeu de données, cliquez sur Catalogue > Jeux de données, puis cliquez sur le bouton Nouveau jeu de données.

source: If you want to add a source to an existing dataset, click Catalog > Datasets and select the desired dataset. Then, click Add a source.
de: Wenn Sie eine Quelle zu einem bestehenden Datensatz hinzufügen möchten, klicken Sie auf "Katalog" > "Datensätze" und wählen Sie den gewünschten Datensatz aus. Klicken Sie dann auf "Quelle hinzufügen".
es: Si quiere añadir un origen a un conjunto de datos existente, haga clic en Catálogo > Conjuntos de datos y seleccione el conjunto de datos deseado. Acto seguido, haga clic en Añadir un origen.
fr: Si vous souhaitez ajouter une source à un jeu de données existant, cliquez sur Catalogue > Jeux de données, et sélectionnez le jeu de données souhaité. Cliquez ensuite sur Ajouter une source.

source: Select Azure Blob storage under the "Configure a remote service section."
de: Wählen Sie in dem sich öffnenden Assistenten unter dem Abschnitt "Remote-Dienst konfigurieren" die Option Azure Blob Storage.
es: Seleccione Azure Blob Storage en la "sección Configurar un servicio remoto."
fr: Sélectionnez Stockage d'objets blob Azure sous la section "Configurer un service distant".

source: Select an existing Azure Blob storage connection or create a new one.
de: Wählen Sie eine bestehende Azure-Blob-Storage-Verbindung oder erstellen Sie eine neue Verbindung.
es: Seleccione una conexión Azure Blob Storage existente o cree una nueva conexión.
fr: Sélectionnez une connexion de stockage d'objets blob Azure existante ou créez-en une.

source: If you want to create a new connection, fill the following informations:
de: Geben Sie die folgenden Informationen ein, um eine neue Verbindung zu erstellen:
es: Si quiere crear una nueva conexión, especifique esta información:
fr: Indiquez les informations suivantes si vous souhaitez créer une connexion :

source: Storage account name
de: Name des Storage-Kontos
es: Nombre de cuenta de almacenamiento
fr: Nom du compte de stockage

source: Shared access key
de: Gemeinsamer Zugangsschlüssel
es: Clave de acceso compartida
fr: Clé d'accès partagée

source: Set the source configuration in the preview screen displaying the first 20 records of the file.
de: Legen Sie die Quellkonfiguration im Vorschaubildschirm fest, der die ersten 20 Datensätze der Datei anzeigt.
es: Establezca la configuración de la fuente en la pantalla de vista previa de los 20 primeros registros del archivo.
fr: Définissez la configuration source dans l'écran d'aperçu affichant les 20 premiers enregistrements du fichier.

source: Configure the dataset information or use the pre-filled values:
de: Konfigurieren Sie die Datensatzinformationen oder verwenden Sie die vorausgefüllten Werte:
es: Configure la información del conjunto de datos o use los valores precompletados:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :

source: Enter the title for this dataset in the **Dataset name** field.
de: Geben Sie in dem Feld **Datensatztitel** einen Titel für den Datensatz ein.
es: Introduzca el título de este conjunto de datos en el campo **Nombre de conjunto de datos**.
fr: Saisissez un titre pour ce jeu de données dans le champ **Nom du jeu de données**.

source: Enter a meaningful identifier for this dataset in the **Dataset technical identifier** field.
de: Geben Sie in das Feld **Technische Kennung des Datensatzes** eine aussagekräftige Kennung für diesen Datensatz ein.
es: Introduzca un identificador significativo para este conjunto de datos en el campo **Identificador técnico de conjunto de datos**.
fr: Saisissez un identifiant explicite pour ce jeu de données dans le champ **Identifiant technique du jeu de données**.
