Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/dataset_of_datasets.po
Languages: de, fr

source: Dataset of datasets (domain) connector
de: Konnektor Datensatz der Datensätze (Domain)
fr: Connecteur Jeu de données de jeux de données (domaine)

source: The Dataset of datasets connector allows creating an index of the datasets of an Opendatasoft domain, optionally with all their related metadata and analytics, in the form of a dataset.
de: Der Konnektor Datensatz der Datensätze ermöglicht es, einen Index der Datensätze einer Opendatasoft-Domain in Form eines Datensatzes zu erstellen (optional mit allen zugehörigen Metadaten und Analysen).
fr: Le connecteur Jeu de données de jeux de données vous permet de créer un index des jeux de données d'un domaine Opendatasoft, avec éventuellement toutes les métadonnées et statistiques associées, sous la forme d'un jeu de données.

source: Warning
de: Warnung
fr: Avertissement

source: Use this connector with much caution because it can give visibility to private data.
de: Verwenden Sie diesen Konnektor mit großer Vorsicht, da er private Daten sichtbar machen kann.
fr: Utilisez ce connecteur avec prudence car il permet de rendre des données privées visibles.

source: Creation
de: Erstellung
fr: Création

source: Note
de: Hinweis
fr: Remarque

source: The Edit dataset permission is required to use this connector.
de: Die Berechtigung "Datensatz bearbeiten" ist erforderlich, um diesen Konnektor nutzen zu können.
fr: Vous avez besoin de la permission Modifier un jeu de données pour utiliser ce connecteur.

source: Choose an option:
de: Wählen Sie eine Option:
fr: Choisissez une option :

source: If you want to create a dataset, click **Catalog** > **Datasets** and click the **New dataset** button.
de: Wenn Sie einen Datensatz erstellen möchten, klicken Sie auf **Katalog** > **Datensätze** und dann auf den Button **Neuer Datensatz**.
fr: Si vous souhaitez créer un jeu de données, cliquez sur **Catlogue** > **Jeux de données**, puis cliquez sur le bouton **Nouveau jeu de données**.

source: If you want to add a source to an existing dataset, click **Catalog** > **Datasets** and select the desired dataset. Then, click **Add a source**.
de: Wenn Sie eine Quelle zu einem bestehenden Datensatz hinzufügen möchten, klicken Sie auf **Katalog** > **Datensätze** und wählen Sie den gewünschten Datensatz aus. Klicken Sie dann auf **Quelle hinzufügen**.
fr: Si vous souhaitez ajouter une source à un jeu de données existant, cliquez sur **Catalogue** > **Jeux de données**, et sélectionnez le jeu de données souhaité. Cliquez ensuite sur **Ajouter une source**.

source: In the wizard that opens, select **Dataset of datasets** under the **Configure a remote service** section.
de: Wählen Sie in dem sich öffnenden Assistenten **Datensatz der Datensätze** unter dem Abschnitt **Remote-Service konfigurieren**.
fr: Sélectionnez **Jeu de données de jeux de données** dans l'assistant qui s'ouvre, sous la section **Configurer un service distant**.

source: From the preview of the first 20 records that appears, configure the source.
de: Konfigurieren Sie die Quelle über die Vorschau der ersten 20 Datensätze, die angezeigt wird.
fr: Configurez la source dans l'aperçu des 20 premiers enregistrements qui s'affiche.

source: Configure the dataset information or use the pre-filled values:
de: Konfigurieren Sie die Datensatzinformationen oder verwenden Sie die vorausgefüllten Werte:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :

source: In the **Dataset name** field, enter the title for this dataset.
de: Geben Sie in das Feld **Datensatzname** den Titel für diesen Datensatz ein.
fr: Dans le champ **Nom du jeu de données**, saisissez le titre de ce jeu de données.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
de: Geben Sie in das Feld **Technische Kennung des Datensatzes** eine sinnvolle Kennung für diesen Datensatz ein.
fr: Dans le champ **Identifiant technique du jeu de données**, saisissez un identifiant explicite pour ce jeu de données.

source: Configuration
de: Konfiguration

source: Description
de: Beschreibung

source: Interoperability Metadata
de: Interoperabilitäts-Metadaten
fr: Métadonnées d'interopérabilité

source: If selected, interoperability metadata are retrieved and added to the dataset.
de: Wenn ausgewählt, werden die Interoperabilitäts-Metadaten abgerufen und dem Datensatz hinzugefügt.
fr: Si cette option est sélectionnée, les métadonnées d'interopérabilité sont récupérées et ajoutées au jeu de données.

source: Custom Metadata
de: Benutzerdefinierte Metadaten
fr: Métadonnées personnalisées

source: If selected, custom metadata are retrieved and added to the dataset.
de: Wenn ausgewählt, werden die benutzerdefinierten Metadaten abgerufen und dem Datensatz hinzugefügt.
fr: Si cette option est sélectionnée, les métadonnées personnalisées sont récupérées et ajoutées au jeu de données.

source: Statistics
de: Statistiken
fr: Statistiques

source: If selected, statistics of the dataset are retrieved and added to the dataset:
de: Wenn ausgewählt, werden die Statistiken des Datensatzes abgerufen und dem Datensatz hinzugefügt:
fr: Si cette option est sélectionnée, les statistiques du jeu de données sont récupérées et ajoutées au jeu de données :

source: number of datasets,
de: Anzahl der Datensätze,
fr: nombre de jeux de données,

source: size of the records in the dataset (in bytes),
de: Größe der Einträge im Datensatz (in Bytes),
fr: taille des enregistrements dans le jeu de données (en octets),

source: number of reuses,
de: Anzahl der Weiterverwendungen,
fr: nombre de réutilisations,

source: number of API calls,
de: Anzahl der API-Aufrufe,
fr: nombre d'appels d'API,

source: number of downloads,
de: Anzahl der Downloads,
fr: nombre de téléchargements,

source: number of downloads of the datasets attachments,
de: Anzahl der Downloads der Datensatzanhänge,
fr: nombre de téléchargements des pièces jointes des jeux de données,

source: number of downloads of the file fields,
de: Anzahl der Downloads aller Felder,
fr: nombre de téléchargements des champs du fichier,

source: popularity score.
de: Beliebtheitsgrad.
fr: score de popularité.

source: Private datasets
de: Private Datensätze
fr: Jeux de données privés

source: If selected, private datasets are added to the dataset. It also adds a "Visibility" field to the dataset. This field indicates whether the datasets are public ("domain") or private ("restricted").
de: Wenn ausgewählt, werden dem Datensatz private Datensätze hinzugefügt. Außerdem wird ein Feld "Sichtbarkeit" zum Datensatz hinzugefügt. Es gibt an, ob die Datensätze öffentlich ("Domain") oder privat ("eingeschränkt") sind.
fr: Si cette option est sélectionnée, les jeux de données privés sont ajoutés au jeu de données. Un champ "Visibilité" est également ajouté. Il indique si les jeux de données sont publics ("domaine") ou privés ("restreints").

source: Staged datasets
de: Bereitstehende Datensätze
fr: Jeux de données en attente

source: If selected, staged datasets (meaning datasets that are created but not published) are added to the dataset. It also adds a "Published" field to the dataset. This field indicates whether the datasets are published ("true") or not ("false").
de: Wenn ausgewählt, werden dem Datensatz bereitstehende Datensätze (d.h. Datensätze, die erstellt, aber nicht veröffentlicht wurden) hinzugefügt. Außerdem wird ein Feld "Veröffentlicht" hinzugefügt. Es gibt an, ob die Datensätze veröffentlicht wurden ("wahr") oder nicht ("falsch").
fr: Si cette option est sélectionnée, les jeux de données en attente (c'est-à-dire les jeux de données créés mais non publiés) sont ajoutés au jeu de données. Un champ "Publié" est également ajouté. Il indique si les jeux de données sont publiés ("true") ou non ("false").

source: Admin metadata
de: Admin-Metadaten
fr: Métadonnées admin

source: If selected, admin metadata are retrieved and added to the dataset.
de: Wenn ausgewählt, werden die Admin-Metadaten abgerufen und dem Datensatz hinzugefügt.
fr: Si cette option est sélectionnée, les métadonnées d'administration sont récupérées et ajoutées au jeu de données.

source: Name
fr: Nom
