Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/ecocounter.po
Languages: de, es, fr, nl

source: Eco Counter connector
de: Eco-Counter-Konnektor
es: Conector de Eco Counter
fr: Connecteur Eco-Compteur

source: The Eco Counter connector retrieves count data from Eco Counter's Eco-Visio platform. It creates a dataset with records about counting sites and counters.
de: Der Eco-Counter-Konnektor ruft Zähldaten von der Eco-Visio-Plattform von Eco Counter ab. Er erstellt einen Datensatz mit Einträgen über Zählstellen und Zähler.
es: El conector de Eco Counter recupera datos de recuento de la plataforma Eco-Visio de Eco Counter. Crea un conjunto de datos con registros sobre los sitios de recuento y contadores.
fr: Le connecteur Eco-Compteur récupère les données de comptage de la plateforme Eco-Visio. Il crée ensuite un jeu de données avec les enregistrements sur les compteurs et sites de comptage.
nl: De Eco Counter-connector haalt telgegevens op uit het Eco-Visio platform van Eco Counter. Hij maakt een dataset aan met records over het tellen van sites en tellers.

source: Using the Eco Counter connector, you can retrieve two types of data:
de: Mit dem Eco-Counter-Konnektor können Sie zwei Arten von Daten abrufen:
es: Mediante el conector de Eco Counter, puede recuperar 2 tipos de datos:
fr: Le connecteur Eco-Compteur vous permet de récupérer deux types de données :
nl: Met de Eco Counter-connector kunt u twee soorten gegevens ophalen:

source: Eco Counter Data provides data about a counter, including the counting Site ID where the counter is installed, etc.
de: Eco Counter Data liefert Daten über einen Zähler, einschließlich der ID der Zählstelle, an welcher der Zähler installiert ist usw.
es: Datos de Eco Counter facilita datos sobre un contador, incluido el ID de sitio de recuento donde está instalado el contador, etc.
fr: Les informations d'Eco-Compteur fournissent des données sur un compteur, notamment l'ID du site de comptage où le compteur est installé, etc.
nl: Eco Counter Data verschaft data over een teller, inclusief het tellen van Site ID's waar de teller is geÃ¯nstalleerd, enz.

source: Eco Counter Sites provides data about counting sites, including site position, installation date, etc.
de: Eco Counter Sites liefert Daten über Zählstandorte, wie Standort, Installationsdatum usw.
es: Sitios de Eco Counter facilita datos sobre los sitios de recuento, incluida la posición del sitio, la fecha de instalación, etc.
fr: Les sites d'Eco-Compteur fournissent des données sur les sites de comptage, notamment la position du site, la date d'installation, etc.
nl: Eco Counter Sites verschaft data over het tellen van sites, inclusief de ligging van de site, de installatiedatum, enz.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: This connector is not available by default. Please contact Opendatasoft for the activation of this connector on a given Opendatasoft domain.
de: Dieser Konnektor ist nicht standardmäßig verfügbar. Wenden Sie sich an Opendatasoft, wenn dieser Konnektor für eine Opendatasoft-Domain aktiviert werden soll.
es: Este conector no está disponible de forma predeterminada. Póngase en contacto con Opendatasoft para solicitar la activación de este conector en un dominio Opendatasoft determinado.
fr: Ce connecteur n'est pas disponible par défaut. Veuillez contacter Opendatasoft si vous souhaitez l'activer dans un domaine Opendatasoft donné.
nl: Deze connector is standaard niet beschikbaar. Gelieve contact op te nemen met Opendatasoft om deze connector voor een welbepaald Opendatasoft-domein te activeren.

source: Creation
de: Erstellung
es: Creación
fr: Création
nl: Aanmaak

source: Before you begin, retrieve your Eco Counter API key.
de: Bevor Sie beginnen, rufen Sie Ihren Eco Counter API-Schlüssel ab.
es: Antes de empezar, recupere la clave de la API de Eco Counter.
fr: Avant de commencer, récupérez votre clé d'API Eco-Compteur.
nl: Alvorens te beginnne, haal uw Eco Counter API-sleutel op.

source: Choose an option:
de: Wählen Sie eine Option:
es: Elija una opción:
fr: Choisissez une option :
nl: Kies een optie:

source: If you want to create a dataset, click **Catalog** > **Datasets** and click the **New dataset** button.
de: Wenn Sie einen Datensatz erstellen möchten, klicken Sie auf **Katalog** > **Datensätze** und dann auf den Button **Neuer Datensatz**.
es: Si quiere crear un conjunto de datos, haga clic en **Catálogo** > **Conjuntos de datos** y haga clic en el botón **Conjunto de datos nuevo**.
fr: Si vous souhaitez créer un jeu de données, cliquez sur **Catlogue** > **Jeux de données**, puis cliquez sur le bouton **Nouveau jeu de données**.
nl: Indien u een dataset wilt aanmaken, klik op **Catalogus** > **Datasets** en klik op de knop **Nieuwe dataset**.

source: If you want to add a source to an existing dataset, click **Catalog** > **Datasets** and select the desired dataset. Then, click **Add a source**.
de: Wenn Sie eine Quelle zu einem bestehenden Datensatz hinzufügen möchten, klicken Sie auf **Katalog** > **Datensätze** und wählen Sie den gewünschten Datensatz aus. Klicken Sie dann auf **Quelle hinzufügen**.
es: Si quiere añadir un origen a un conjunto de datos existente, haga clic en **Catálogo** > **Conjuntos de datos** y seleccione el conjunto de datos deseado. Acto seguido, haga clic en **Añadir un origen**.
fr: Si vous souhaitez ajouter une source à un jeu de données existant, cliquez sur **Catalogue** > **Jeux de données**, et sélectionnez le jeu de données souhaité. Cliquez ensuite sur **Ajouter une source**.
nl: Indien een bron wilt toevoegen aan een bestaande dataset, klik op **Catalogus** > **Datasets** en selecteer de gewenste dataset. Klik vervolgens op **Een bron toevoegen**.

source: In the wizard that opens, select **EcoCounter** under the **Configure a remote service** section.
de: Wählen Sie in dem sich öffnenden Assistenten **EcoCounter** unter dem Abschnitt **Remote-Service konfigurieren**.
es: En el asistente que aparece, seleccione **EcoCounter** en la sección **Configurar un servicio remoto**.
fr: Sélectionnez **Eco-Compteur** dans l'assistant qui s'ouvre, sous la section **Configurer un service distant**.
nl: Selecteer in de wizard die wordt geopend **EcoCounter** onder de rubriek **Een service op afstand configureren**.

source: Under the **Retrieve data from EcoCounter** section, enter your EcoCounter API key in the **API key** box.
de: Geben Sie unter dem Abschnitt **Daten von EcoCounter abrufen** Ihren EcoCounter-API-Schlüssel in das Feld **API-Schlüssel** ein.
es: En la sección **Recuperar datos de EcoCounter**, especifique la clave de API de EcoCounter en el cuadro **Clave de API**.
fr: Sous la section **Récupérer des données d'Eco-Compteur**, saisissez la clé de votre API Eco-Compteur dans le champ **Clé d'API**.
nl: Noteer onder de rubriek **Data ophalen uit EcoCounter** uw EcoCounter API-sleutel in het vak **API-sleutel**.

source: From the preview of the first 20 records that appears, do the following:
de: Gehen Sie in der angezeigten Vorschau der ersten 20 Einträge wie folgt vor:
es: En la vista previa de los 20 primeros registros que aparece, haga lo siguiente:
fr: Effectuez les actions suivantes depuis l'aperçu des 20 premiers enregistrements qui s'affiche :
nl: Doe vanuit de voorbeeldweergave van de eerste 20 records die verschijnen, het volgende:

source: From the **Type** list, select whether you want to retrieve **Eco Counter Data** or **Eco Counter Sites**.
de: Wählen Sie aus der Liste **Typ**, ob Sie **Eco Counter Data*- oder **Eco Counter Sites**-Daten abrufen möchten.
es: En la lista **Tipo**, seleccione si desea recuperar **Datos de Eco Counter** o **Sitios de Eco Counter**.
fr: Dans la liste **Type**, sélectionnez les éléments à récupérer : **Informations Eco-Compteur** ou **Sites Eco-Compteur**.
nl: Selecteer uit de lijst **Type** of u **Eco Counter Data** of **Eco Counter Sites** wilt ophalen.

source: Configure the source.
de: Konfigurieren Sie die Quelle.
es: Configure el origen.
fr: Configurez la source.
nl: De bron configureren.

source: Configure the dataset information or use the pre-filled values:
de: Konfigurieren Sie die Datensatzinformationen oder verwenden Sie die vorausgefüllten Werte:
es: Configure la información del conjunto de datos o use los valores precompletados:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :
nl: Configureer de datasetinformatie of gebruik de vooraf ingevulde waarden:

source: In the **Dataset name** field, enter the title for this dataset.
de: Geben Sie in das Feld **Datensatzname** den Titel für diesen Datensatz ein.
es: En el campo **Nombre de conjunto de datos**, especifique el título de este conjunto de datos.
fr: Dans le champ **Nom du jeu de données**, saisissez le titre de ce jeu de données.
nl: Voer de titel voor deze dataset in in het veld **Naam van de dataset**.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
de: Geben Sie in das Feld **Technische Kennung des Datensatzes** eine sinnvolle Kennung für diesen Datensatz ein.
es: En el campo **Identificador técnico de conjunto de datos**, especifique un identificador significativo para este conjunto de datos.
fr: Dans le champ **Identifiant technique du jeu de données**, saisissez un identifiant explicite pour ce jeu de données.
nl: Voer in het veld **Technische identifier van de dataset** een betekenisvolle identifier voor deze dataset in.

source: Configuration
de: Konfiguration
es: Configuración
nl: Configuratie

source: Data Extraction configuration (for Eco Counter Data only)
de: Konfiguration der Datenextraktion (nur für Eco Counter Data)
es: Configuración de la extracción de datos (solo para Datos de Eco Counter)
fr: Configuration de l'extraction des données (pour les informations Eco-Compteur uniquement)
nl: Configuratie van Data Extraction (enkel voor Eco Counter Data)

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
nl: Gebruik

source: Beginning of the period
de: Beginn des Zeitraums
es: Inicio del periodo
fr: Début de la période
nl: Begin van de periode

source: Start date of the data period (included). If no start date has been defined, the first data date will be used.
de: Anfangsdatum des Datenzeitraums (einschließlich). Wenn kein Startdatum definiert wurde, wird das erste Datendatum verwendet.
es: Fecha de inicio del periodo de datos (incluido). Si no se ha definido una fecha de inicio, se usará la primera fecha de datos.
fr: Date de début de la période des données (incluse). Si aucune date de début n'a été définie, la première date des données sera utilisée.
nl: Startdatum van de dataperiode (inclusief). Indien geen startdatum gedefinieerd is geweest, zal de eerste datadatum worden gebruikt.

source: From the calendar, select the start date.
de: Wählen Sie das Startdatum im Kalender aus.
es: En el calendario, seleccione la fecha de inicio.
fr: Sélectionnez la date de début dans le calendrier.
nl: Selecteer vanuit de kalender de startdatum.

source: End of the period
de: Ende des Zeitraums
es: Fin del periodo
fr: Fin de la période
nl: Einde van de periode

source: End of the data period (included). If no end date has been defined, the last data date will be used.
de: Enddatum des Datenzeitraums (einschließlich). Wenn kein Enddatum definiert wurde, wird das letzte Datendatum verwendet.
es: Fecha de finalización del periodo de datos (incluido). Si no se ha definido una fecha de finalización, se usará la última fecha de datos.
fr: Fin de la période des données (incluse). Si aucune date de fin n'a été définie, la dernière date des données sera utilisée.
nl: Einde van de dataperiode (inclusief). Indien geen einddatum gedefinieerd is geweest, zal de laatste datadatum worden gebruikt.

source: From the calendar, select the end date.
de: Wählen Sie das Enddatum im Kalender aus.
es: En el calendario, seleccione la fecha de finalización.
fr: Sélectionnez la date de fin dans le calendrier.
nl: Selecteer vanuit de kalender de einddatum.

source: Step
de: Schritt
es: Paso
fr: Étape
nl: Stap

source: Data interval
de: Datenintervall
es: Intervalo de datos
fr: Intervalle de données

source: From the **step** list, select the data interval.
de: Wählen Sie in der Liste **Schritt** das Datenintervall aus.
es: En la lista **Paso**, seleccione el intervalo de datos.
fr: Sélectionnez l'intervalle de données dans la liste **étape**.
nl: Selecteer vanuit de lijst **Stap** de data-interval.

source: Complete data holes with null values
de: Datenlöcher mit Nullwerten füllen
es: Completar los huecos de datos con valores nulos
fr: Compléter les données manquantes avec des valeurs null
nl: Datagaten aanvullen met nulwaarden

source: Completes data holes with null values
de: Die Datenlöcher werden mit Nullwerten gefüllt
es: Completa los huecos de datos con valores nulos.
fr: Complète les données manquantes avec des valeurs null
nl: Vult datagaten aan met nulwaarden

source: This option is toggled on by default.
de: Diese Option ist standardmäßig aktiviert.
es: De forma predeterminada, esta opción está activada.
fr: Cette option est activée par défaut
nl: Deze optie is standaard uitgevinkt.

source: Extract channel data
de: Kanaldaten extrahieren
es: Extraer datos de canal
fr: Extraire des données de chaîne
nl: Kanaaldata extraheren

source: Extract channels
de: Kanäle extrahieren
es: Extraer canales
fr: Extraire des chaînes
nl: Kanalen extraheren

source: Extracts the list of the channels of the counting site
de: Extrahiert die Liste der Kanäle der Zählstelle
es: Extrae la lista de los canales del sitio de recuento
fr: Extrait la liste des chaînes du site de comptage
nl: Extraheert de lijst met de kanalen van de telsite

source: Toggle on this option to extract the list of the channels of the counting site in additional fields.
de: Aktivieren Sie diese Option, um die Liste der Kanäle der Zählstelle in zusätzliche Felder zu extrahieren.
es: Active esta opción para extraer la lista de los canales del sitio de recuento en campos adicionales.
fr: Activez cette option pour extraire la liste des chaînes du site de comptage dans des champs supplémentaires.
nl: Vink deze optie aan om de lijst met de kanalen van de telsite in extra velden te extraheren.
