Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/google_drive.po
Languages: fr

source: Google Drive connector
fr: Connecteur Google Drive

source: The Google Drive connector retrieves files from Google Drive with a maximum limit of 10MB per file.
fr: Le connecteur Google Drive récupère des fichiers de Google Drive avec une limite maximale de 10 Mo par fichier.

source: For more information about the supported file formats, see :ref:`supportedformats`.
fr: Pour plus d'informations sur les formats de fichiers pris en charge, consultez :ref:`supportedformats`.

source: Creation
fr: Création

source: Choose an option:
fr: Choisissez une option :

source: If you want to create a dataset, click **Catalog** > **Datasets** and click the **New dataset** button.
fr: Si vous souhaitez créer un jeu de données, cliquez sur **Catalogue** > **Jeux de données**, puis cliquez sur le bouton **Nouveau jeu de données**.

source: If you want to add a source to an existing dataset, click **Catalog** > **Datasets** and select the desired dataset. Then, click **Add a source**.
fr: Si vous souhaitez ajouter une source à un jeu de données existant, cliquez sur **Catalogue** > **Jeux de données**, et sélectionnez le jeu de données souhaité. Cliquez ensuite sur **Ajouter une source**.

source: In the wizard that opens, select **Google Drive** under the **Configure a remote service** section.
fr: Sélectionnez **Google Drive** dans l'assistant qui s'ouvre, sous la section **Configurer un service distant**.

source: Select an existing Google Drive connection or create a new connection.
fr: Sélectionnez une connexion Google Drive existante ou créez-en une.

source: If you want to create a new connection, perform the following steps:
fr: Procédez comme suit si vous souhaitez créer une connexion :

source: Click **Sign in with Google** and connect to your Google account.
fr: Cliquez sur **Se connecter avec Google** et connectez-vous à votre compte Google.

source: After evaluating the permissions requested, click **Allow** to grant authorization to the Google Drive connector to access your Google Drive folders and files.
fr: Après avoir identifié les permissions demandées, cliquez sur **Autoriser** pour accorder au connecteur Google Drive l'autorisation d'accéder à vos dossiers et fichiers Google Drive.

source: Under **Retrieve the file**, click **Browse Google Drive folder**.
fr: Sous **Récupérer le fichier**, cliquez sur **Parcourir le dossier Google Drive**.

source: From the dialog box that appears, select the file to be used a source.
fr: Dans la boîte de dialogue qui s'affiche, sélectionnez le fichier à utiliser comme source.

source: From the preview of the first 20 records that appears, configure the source.
fr: Configurez la source dans l'aperçu des 20 premiers enregistrements qui s'affiche.

source: Configure the dataset information or use the pre-filled values:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :

source: In the **Dataset name** field, enter the title for this dataset.
fr: Dans le champ **Nom du jeu de données**, saisissez le titre de ce jeu de données.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
fr: Dans le champ **Identifiant technique du jeu de données**, saisissez un identifiant explicite pour ce jeu de données.
