Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/jcdecaux.po
Languages: fr

source: JCDecaux connector
fr: Connecteur JCDecaux

source: The JCDecaux connector retrieves the state of JCDecaux bicycle stations. It creates a dataset with records containing bicycle stations data.
fr: Le connecteur JCDecaux récupère l'état des stations de vélos JCDecaux. Il crée un jeu de données avec des enregistrements contenant des données sur des stations de vélos.

source: Note
fr: Remarque

source: The JCDecaux Bike Stations dataset is available on the `Opendatasoft data network <https://data.opendatasoft.com/explore/dataset/jcdecaux_bike_data@public/>`_. You can federate it to use the data.
fr: Le jeu de données des stations de vélos JCDecaux est disponible sur le `réseau de données Opendatasoft <https://data.opendatasoft.com/explore/dataset/jcdecaux_bike_data@public/>`_. Vous pouvez le fédérer pour en utiliser les données.

source: Using the JCDecaux connector, you can retrieve two types of data:
fr: Le connecteur JCDecaux vous permet de récupérer deux types de données :

source: JCDecaux Bicycle Stations Data provides dynamic real-time data (no historical data), including station state, number of available bikes, number of free bike stands, etc.
fr: Les informations sur les stations de vélos JCDecaux fournissent des données dynamiques en temps réel (aucune donnée historique), notamment l'état des stations, le nombre de vélos disponibles, le nombre de supports de vélos libres, etc.

source: JCDecaux Bicycle Stations provides static and stable data, including station position, number of bike stands, payment terminal availability, etc.
fr: Les stations de vélos JCDecaux fournissent des données statiques et stables, notamment l'emplacement des stations, le nombre de supports de vélos, la disponibilité des terminaux de paiement, etc.

source: This connector is not available by default. Please contact Opendatasoft for the activation of this connector on a given Opendatasoft domain.
fr: Ce connecteur n'est pas disponible par défaut. Veuillez contacter Opendatasoft si vous souhaitez l'activer dans un domaine Opendatasoft donné.

source: Creation
fr: Création

source: Before you begin, retrieve your API key from JCDecaux's developer website.
fr: Avant de commencer, récupérez votre clé d'API sur le site Web de développement de JCDecaux.

source: Choose an option:
fr: Choisissez une option :

source: If you want to create a dataset, click **Catalog** > **Datasets** and click the **New dataset** button.
fr: Si vous souhaitez créer un jeu de données, cliquez sur **Catalogue** > **Jeux de données**, puis cliquez sur le bouton **Nouveau jeu de données**.

source: If you want to add a source to an existing dataset, click **Catalog** > **Datasets** and select the desired dataset. Then, click **Add a source**.
fr: Si vous souhaitez ajouter une source à un jeu de données existant, cliquez sur **Catalogue** > **Jeux de données**, et sélectionnez le jeu de données souhaité. Cliquez ensuite sur **Ajouter une source**.

source: In the wizard that opens, select **JCDecaux** under the **Configure a remote service** section.
fr: Sélectionnez **JCDecaux** dans l'assistant qui s'ouvre, sous la section **Configurer un service distant**.

source: Under the **Retrieve data from JCDecaux** section, enter your JCDecaux API key in the **API key** box.
fr: Sous la section **Récupérer des données depuis JCDecaux**, saisissez la clé de votre API JCDecaux dans le champ **Clé d'API**.

source: From the preview of the first 20 records that appears, do the following:
fr: Effectuez les actions suivantes depuis l'aperçu des 20 premiers enregistrements qui s'affiche :

source: From the **Type** list, select whether you want to retrieve **JCDecaux Bicycle Stations Data** (dynamic real-time data) or **JCDecaux Bicycle Stations** (static and stable data).
fr: Dans la liste **Type**, sélectionnez les éléments à récupérer : **Informations sur les stations de vélos JCDecaux** (données dynamiques en temps réel) ou **Stations de vélos JCDecaux** (données statiques et stables).

source: Configure the source.
fr: Configurez la source.

source: Configure the dataset information or use the pre-filled values:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :

source: In the **Dataset name** field, enter the title for this dataset.
fr: Dans le champ **Nom du jeu de données**, saisissez le titre de ce jeu de données.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
fr: Dans le champ **Identifiant technique du jeu de données**, saisissez un identifiant explicite pour ce jeu de données.

source: Name
fr: Nom

source: Usage
fr: Utilisation

source: Cities
fr: Villes

source: Filter data by city
fr: Filtrer les données par ville

source: In the resulting dataset, the ``contract_name`` column contains city names where JCDecaux bicycle stations are located.
fr: Dans le jeu de données résultant, la colonne ``contract_name`` contient les noms des villes où se trouvent les stations de vélos JCDecaux.

source: No value is selected by default, meaning that data from bicycle stations in all cities is retrieved.
fr: Aucune valeur n'est sélectionnée par défaut ; les données des stations de vélos de toutes les villes sont donc récupérées.

source: From the **Cities** list, you can select one or more city names to only retrieve data about those cities.
fr: Dans la liste **Villes**, vous pouvez sélectionner un ou plusieurs noms de villes pour récupérer uniquement les données au sujet de ces villes.
