Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/json.po
Languages: de, es, fr, it, nl

source: JSON files
de: JSON-Dateien
es: Archivos JSON
fr: Fichiers JSON
nl: JSON-bestanden

source: JSON is an open-standard format that uses human-readable text to transmit data objects consisting of key-value pairs. It is the most common data format to build web APIs.
de: JSON ist ein offenes Standardformat, das menschenlesbaren Text verwendet, um Datenobjekte zu übertragen, die aus Schlüssel-Wert-Paaren bestehen. Es ist das gängigste Format zur Erstellung von APIs.
es: JSON es un formato de estándar abierto que utiliza texto en lenguaje natural para transmitir objetos de datos formados por pares clave-valor. Es el formato de datos más habitual para la compilación de interfaces API de sitios web.
fr: JSON est un format standard ouvert qui utilise un texte lisible par l'homme pour transmettre des objets de données constitués de paires clé-valeur. Il s'agit du format de données le plus couramment utilisé pour créer des API Web.
nl: JSON is een open-standaard formaat dat tekst gebruikt die door mensen kan worden gelezen om datavoorwerpen door te sturen die uit sleutel-waarde paren bestaan. Het is het meest gebruikte dataformaat om web-API's te bouwen.

source: As JSON documents can have a lot of different forms, the platform can extract data from JSON files, JSON Lines files, and JSON dictionaries.
de: JSON-Dokumente können viele verschiedene Formen haben. Deshalb kann die Plattform Daten aus JSON-Dateien, JSON-Zeilen-Dateien und JSON-Wörterbüchern extrahieren.
es: Como los documentos JSON pueden tener muchos formatos diferentes, la plataforma puede extraer los datos de archivos JSON, archivos de líneas JSON y diccionarios JSON.
fr: Les documents JSON pouvant revêtir différentes formes, la plateforme peut extraire des données à partir des fichiers JSON, des fichiers Lignes JSON et des dictionnaires JSON.
nl: Aangezien JSON-documenten heel veel verschillende vormen kunnen hebben, kan het platform data halen uit JSON-bestanden, JSON Lines-bestanden en JSON bibliotheken.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: If the platform does not fully extract a document with a complex structure, use one of the JSON processors to complete the extraction.
de: Wenn die Plattform die Extraktion eines Dokuments mit komplexer Struktur nicht vollständig abschließt, können Sie einen der JSON-Prozessoren verwenden, um die Extraktion abzuschließen.
es: Si la plataforma no extrae por completo un documento con una estructura compleja, emplee uno de los procesadores JSON para efectuar la extracción.
fr: Si la plateforme n'extrait pas intégralement un document présentant une structure complexe, utilisez l'un des processeurs JSON pour terminer l'extraction.
nl: Indien het platform er niet in slaagt een document met een complexe structuur volledig te extraheren, gebruik dan een van de JSON-processoren om de extractie te voltooien.

source: JSON File
de: JSON-Datei
es: Archivo JSON
fr: Fichier JSON
it: File JSON
nl: JSON-bestand

source: You can use a JSON file as a source. From this file, the platform extracts a valid JSON document (array or object) into one dataset of several records:
de: Sie können eine JSON-Datei als Quelle verwenden. Aus dieser Datei extrahiert die Plattform ein gültiges JSON-Dokument (Array oder Objekt) in einen Datensatz mit mehreren Einträgen:
es: Puede utilizar un archivo JSON como origen. De este archivo, la plataforma extrae un documento JSON válido (matriz u objeto) en un conjunto de datos de varios registros:
fr: Vous pouvez utiliser un fichier JSON en tant que source. À partir de ce fichier, la plateforme extrait un document JSON valide (tableau ou objet) dans un jeu de données constitué de plusieurs enregistrements :
nl: U kunt een JSON-bestand als een bron gebruiken. Vanuit dit bestand extraheert het platform een geldig JSON-document (reeks of voorwerp) in één dataset met verschillende records:

source: If the document is a JSON array, a record will be created for each object inside the array (the keys will be used as column names).
de: Ist das Dokument ein JSON-Array, wird für jedes Objekt innerhalb des Arrays ein Eintrag erstellt (die Schlüssel dienen als Spaltennamen).
es: Si el documento es una matriz JSON, se creará un registro para cada uno de los objetos en la matriz (las claves se usarán como nombres de columna).
fr: Si un document est un tableau JSON, un enregistrement sera créé pour chaque objet du tableau (les clés seront utilisées en tant que noms de colonne).
it: Se il documento è un array JSON, il sistema crea un record per ogni oggetto che vi è contenuto e le chiavi vengono utilizzate come nomi delle colonne.
nl: Indien het document een JSON-reeks is, zal een record worden aangemaakt voor elk voorwerp binnen de reeks (de sleutels zullen gebruikt worden als kolomnamen).

source: If the document is a JSON object, the "JSON root" parameter should contain a dot-separated path to the array inside your object. If not provided, the platform tries ``items``.
de: Ist das Dokument ein JSON-Objekt, sollte der Parameter "JSON-Stamm" einen durch einen Punkt getrennten Pfad zum Array in Ihrem Objekt enthalten. Bei fehlender Angabe probiert der Konnektor ``Elemente``.
es: Si el documento es un objeto JSON, el parámetro "JSON root" debe contener una ruta separada por un punto de la matriz dentro del objeto. Si no se proporciona, la plataforma prueba con ``items``.
fr: Si le document est un objet JSON, le paramètre "Racine JSON" doit contenir un chemin d'accès séparé par des points menant au tableau contenu dans votre objet. S'il n'est pas inclus, la plateforme essaye les ``items``.
nl: Indien het document een JSON-voorwerp is zou de parameter "JSON root" een door punten gescheiden pad naar de reeks in uw voorwerp moeten hebben. Indien niet voorzien, probeert het platform ``items``.

source: For each item inside the array, the platform can follow another path before extracting the records with the parameter "JSON object".
de: Dank des Parameters "JSON-Objekt" kann die Plattform vor dem Extrahieren der Einträge einen anderen Pfad für jedes Element innerhalb des Arrays verfolgen.
es: Para cada uno de los elementos de la matriz, la plataforma puede seguir otra ruta antes de extraer los registros con el parámetro "Objeto JSON".
fr: Pour chaque élément dans le tableau, la plateforme peut suivre un autre chemin d'accès avant d'extraire les enregistrements avec le paramètre "objet JSON".
nl: Voor elk item binnen de reeks kan het platform een ander pad volgen alvorens de records te extraheren dankzij de parameter "JSON object".

source: Supported field types
de: Unterstützte Feldtypen
es: Tipos de archivo permitidos
fr: Types de champs pris en charge
it: Tipi di file supportati
nl: Ondersteunde veldtypes

source: Regular fields (decimal, boolean, string)
de: Reguläre Felder (dezimal, boolesch, Zeichenfolge)
es: Campos regulares (decimal, booleano, string)
fr: Champs normaux (décimal, booléen, chaîne de caractères)
nl: Regelmatige velden (decimaal, bool, string)

source: JSON object: used as-is
de: JSON-Objekte werden verwendet wie sie sind
es: Objeto JSON: se usa tal cual.
fr: Objet JSON : utilisé tel quel
nl: JSON-voorwerp: zal gebruikt worden in de staat waarin het zich bevindt

source: If the array contains JSON objects, it is used as-is.
de: Enthält das Array JSON-Objekte, wird es verwendet, wie es ist.
es: Si la matriz contiene objetos JSON, se usa tal cual.
fr: Si le tableau contient des objets JSON, il est utilisé tel quel.
nl: Indien de reeks JSON-voorwerpen bevat, zal ze gebruikt worden in de staat waarin ze zich bevindt.

source: If the array contains strings, a multivalued field is created with all the strings separated by a semicolon (``;``).
de: Enthält das Array Zeichenfolgen, wird ein mehrwertiges Feld mit allen durch ein Semikolon (";") getrennten Zeichenfolgen erstellt.
es: Si la matriz contiene cadenas, se crea un campo multivalor con todas las cadenas separadas por un punto y coma (``;``).
fr: Si le tableau contient des chaînes de caractères, un champ à valeurs multiples est créé avec toutes les chaînes de caractères séparées par un point-virgule `(`;``).
nl: Indien de reeks strings bevat, zal een veld met meerdere waarden worden aangemaakt waarbij alle strings gescheiden zijn door een punt komma (";").

source: Creation
de: Erstellung
es: Creación
fr: Création
nl: Aanmaak

source: For more information about adding a file source, see :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
de: Weitere Informationen zum Hinzufügen einer Dateiquelle finden Sie hier :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
es: Para obtener más información sobre cómo añadir un origen de archivo, consulte :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
fr: Pour plus d'informations sur l'ajout d'une source de fichier, consultez :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
nl: Voor meer informatie over het toevoegen van een bestandsbron, zie :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.

source: Configuration
de: Konfiguration
es: Configuración
it: Configurazione
nl: Configuratie

source: JSON parameters
de: JSON-Parameter
es: Parámetros JSON
fr: Paramètres JSON

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
nl: Omschrijving

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
nl: Gebruik

source: JSON root
de: JSON-Stamm
es: Raíz JSON
fr: Racine JSON
it: Radice JSON

source: `ijson <https://pypi.org/project/ijson/>`_ path to the JSON array that contains the objects to be extracted as dataset records
de: `ijson <https://pypi.org/project/ijson/>`_ Pfad zum JSON-Array, das die Objekte enthält, die als Datensatzeinträge extrahiert werden sollen
es: Ruta `ijson <https://pypi.org/project/ijson/>`_ de la matriz JSON que contiene los objetos para extraer como registros de conjuntos de datos
fr: Le chemin d'accès `ijson <https://pypi.org/project/ijson/>`_ au tableau JSON qui contient les objets à extraire en tant qu'enregistrements de jeu de données
nl: `ijson <https://pypi.org/project/ijson/>`_ pad naar een JSON-reeks die de voorwerpen bevat die geëxtraheerd moeten worden als records van een dataset

source: ijson is a syntax to navigate inside JSON objects. It consists of separating the attribute names with dots (for example, `content.trains`). More features are available for advanced users.
de: ijson ist eine Syntax zur Navigation innerhalb von JSON-Objekten. Dabei werden die Attributnamen durch Punkte getrennt (z.B. "content.trains"). Für fortgeschrittene Benutzer stehen weitere Funktionen zur Verfügung.
es: iJSON es una sintaxis para navegar dentro de los objetos JSON. Consiste en separar los nombres de atributos por puntos (por ejemplo, `content.trains`). Hay más funciones disponibles para los usuarios avanzados.
fr: ijson est une syntaxe permettant de naviguer dans les objets JSON. Elle consiste à séparer les noms d’attribut avec des points (par exemple, `content.trains`). Des fonctionnalités supplémentaires sont disponibles pour les utilisateurs avancés.
nl: ijson is een syntax om in JSON-voorwerpen te navigeren. Het bestaat uit het scheiden van attribuutnamen met puntjes (bijv. `content.trains`). Voor geavanceerde gebruikers zijn er extra functies beschikbaar.

source: If the JSON array is at the root of the document, leave the **JSON root** box empty. If the JSON file is a JSON object, enter the ijson path to the array in the **JSON root** box.
de: Befindet sich das JSON-Array an der Wurzel des Dokuments, lassen Sie das Feld **JSON root** leer. Handelt es sich bei der JSON-Datei um ein JSON-Objekt, geben Sie den ijson-Pfad zum Array in das Feld **JSON-Root** ein.
es: Si la matriz JSON está en la raíz del documento, deje el cuadro **Raíz JSON** vacío. Si el archivo JSON es un objeto JSON, especifique la ruta iJSON de la matriz en el cuadro **Raíz JSON**.
fr: Si le tableau JSON se trouve à la racine du document, laissez le champ **Racine JSON** vide. Si le fichier JSON est un objet JSON, indiquez le chemin d'accès ijson au tableau dans le champ **Racine JSON**.
nl: Wanneer de JSON-array rechtstreeks aan het begin van het document staat, laat het vak **JSON root** dan leeg. Wanneer het JSON-bestand een JSON-voorwerp is, noteer dan het ijson-pad naar de reeks in het vak **JSON root**.

source: JSON object
de: JSON-Objekt
es: Objeto JSON
fr: Objet JSON
it: Oggetto JSON
nl: JSON-voorwerp

source: Relative path to the JSON object to extract
de: Relativer Pfad des zu extrahierenden JSON-Objekts
es: Ruta relativa al objeto JSON que se debe extraer
fr: Chemin d'accès relatif à l'objet JSON à extraire
nl: Relatief pad naar het JSON-voorwerp dat geëxtraheerd moet worden.

source: After setting the JSON root, if the preview shows irrelevant columns, and that the JSON object has been extracted as the value of one column, enter the name of that column in the **JSON object** box.
de: Wenn nach dem Festlegen des JSON-Stammes in der Vorschau irrelevante Spalten angezeigt werden und das JSON-Objekt als Wert einer Spalte extrahiert wurde, geben Sie den Namen dieser Spalte in das Feld **JSON-Objekt** ein.
es: Tras establecer la raíz JSON, si la vista previa muestra columnas irrelevantes, y el objeto JSON se ha extraído como valor de una columna, especifique el nombre de esa columna en el cuadro **Objeto JSON**.
fr: Une fois le dossier racine JSON défini, si l'aperçu montre des colonnes non pertinentes et si l'objet JSON a été extrait en tant que valeur d'une colonne, indiquez le nom de cette colonne dans le champ **Objet JSON**.
nl: Eenmaal de JSON-root is ingesteld, wanneer in de voorbeeldweergave irrelevante kolommen worden getoond en het JSON-voorwerp geëxtraheerd is geworden als de waarde van één kolom, noteer dan de nam van die kolom in het vak **JSON-voorwerp**.

source: Extract filename
de: Dateinamen extrahieren
es: Extraer nombre de archivo
fr: Extraire le nom de fichier
nl: Extraheer bestandsnaam

source: Creates a new column with the name of the source file.
de: Es wird eine neue Spalte mit dem Namen der Quelldatei erstellt.
es: Crea una columna nueva con el nombre del archivo de origen.
fr: Crée une colonne avec le nom du fichier source.
nl: Maakt een nieuwe kolom aan met de naam van de bronbestand.

source: By default, this option is toggled off. Toggle on this option to extract the file name in an additional column.
de: Standardmäßig ist diese Option deaktiviert. Aktivieren Sie diese Option, um den Dateinamen in einer zusätzlichen Spalte zu extrahieren.
es: De forma predeterminada, esta opción está desactivada. Active esta opción para extraer el nombre de archivo en una columna adicional.
fr: Par défaut, cette option est désactivée. Activez-la pour extraire le nom de fichier dans une colonne supplémentaire.
nl: Standaard is deze optie niet aangevinkt. Vink deze optie aan om de bestandsnaam te extraheren in een toegevoegde kolom.

source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples
nl: Voorbeelden

source: Example 1:
de: 1. Beispiel:
es: Ejemplo 1:
fr: Exemple 1 :
nl: Voorbeeld 1:

source: In this JSON file, the JSON array is directly at the root. You can leave the **JSON root** box empty.
de: In dieser JSON-Datei befindet sich das JSON-Array direkt am Stamm. Sie können das Feld **JSON root** leer lassen.
es: En este archivo JSON, la matriz JSON está directamente en la raíz. Puede dejar el cuadro **Raíz JSON** vacío.
fr: Dans ce fichier JSON, le tableau JSON se trouve directement à la racine. Par conséquent, vous pouvez laisser le champ **Racine JSON** vide.
nl: In dit JSON-bestand is de JSON-reeks rechtstreeks aan het begin. U kunt het vak **JSON root** leeg laten.

source: The resulting dataset will be:
de: Der entstehende Datensatz lautet:
es: El conjunto de datos resultante será:
fr: Le jeu de données résultant sera :
nl: De resulterende dataset zal zijn:

source: origin
de: Herkunft
es: origen
nl: vertrekpunt

source: destination
de: Ziel
nl: bestemming

source: The column order may vary.
de: Die Reihenfolge der Spalten kann unterschiedlich sein.
es: El orden de las columnas puede variar.
fr: L'ordre des colonnes peut varier.
nl: De volgorde van de kolommen kan verschillen.

source: Example 2:
de: 2. Beispiel:
es: Ejemplo 2:
fr: Exemple 2 :
nl: Voorbeeld 2:

source: For this complex JSON file, the correct JSON root is ``content.trains``. If ``content.trains`` is set as the JSON root, the resulting dataset will be:
de: Für diese komplexe JSON-Datei lautet der korrekte JSON-Stamm ``content.trains``. Wenn ``content.trains`` als JSON-Stamm festgelegt ist, dann resultiert folgender Datensatz daraus:
es: Para este archivo JSON complejo, la raíz JSON correcta es ``content.trains``. Si ``content.trains`` se ha establecido como raíz JSON, el conjunto de datos resultante será:
fr: Pour ce fichier JSON complexe, le dossier racine JSON correct est ``content.trains``. Si ``content.trains`` est défini en tant que dossier racine JSON, le jeu de données résultant sera :
nl: Voor dit complexe JSON-bestand is de juiste JSON-root ``content.trains``. Wanneer ``content.trains`` is ingesteld als JSON-root, zal de resulterende dataset de volgende zijn:

source: {"origin": "Agra Cantt", "destination": "New Delhi", "name": "Agra Express"}
de: {"Herkunft": "Agra Cantt", "Ziel": "New Delhi", "Name": "Agra Express"}
nl: {"vertrekpunt": "Agra Cantt", "bestemming": "New Delhi", "naam": "Agra Express"}

source: {"origin": "Balurghat", "destination": "Sealdah", "name": "Gour Express"}
de: {"Herkunft": "Balurghat", "Ziel": "Sealdah", "Name": "Gour Express"}
nl: {"vertrekpunt": "Balurghat", "bestemming": "Sealdah", "naam": "Gour Express"}

source: To only extract the ``info`` JSON objects, and skip the ``id`` number, the correct JSON object is ``info``. If ``info`` is set as a JSON object, the resulting dataset will be:
de: Um nur die JSON-Objekte ``info`` zu extrahieren und die ``id`` Nummer zu überspringen, ist das richtige JSON-Objekt ``info``. Wenn ``info`` als ein JSON-Objekt festgelegt ist, dann resultiert folgender Datensatz daraus:
es: Para extraer tan solo los objetos JSON ``info`` y pasar por alto el número ``id``, el objeto JSON correcto es ``info``. Si ``info`` se ha establecido como objeto JSON, el conjunto de datos resultante será:
fr: Pour extraire uniquement les objets JSON ``info`` et ignorer le nombre ``id``, l'objet JSON correct est ``info``. Si ``info`` est défini en tant qu'objet JSON, le jeu de données résultant sera :
nl: Om enkel de ``info`` van JSON-voorwerpen te extraheren en het ``id`` nummer over te slaan, is het juiste JSON-voorwerp ``info``. Wanneer ``info`` is ingesteld als JSON-voorwerp, zal de resulterende dataset de volgende zijn:

source: JSON Lines
de: JSON-Zeilen
es: Líneas JSON
fr: Lignes JSON

source: You can use a JSON Lines file as a source. In JSON Lines files, each line is a one-line JSON document. The whole file is not a valid JSON document but each line is.
de: Sie können eine JSON-Zeilen-Datei als Quelle verwenden. In JSON Zeilen-Dateien ist jede Zeile ein einzeiliges JSON-Dokument. Die gesamte Datei ist kein gültiges JSON-Dokument, aber jede Zeile ist es.
es: Puede utilizar un archivo de líneas JSON como origen. En los archivos de líneas JSON, cada una de las líneas es un documento JSON de una línea. El archivo entero no es un documento JSON válido, pero sí lo es cada una de las líneas.
fr: Vous pouvez utiliser un fichier Lignes JSON en tant que source. Dans les fichiers Lignes JSON, chaque ligne est un document JSON d'une seule ligne. Contrairement à chacune des lignes qu'il contient, le document en lui-même n'est pas un document JSON valide.
nl: U kunt een JSON Lines-bestand gebruiken als een bron. In JSON Lines-bestanden is elke lijn een JSON-document van één lijn. Het volledige bestand is geen geldig JSON-document maar elke lijn is dat wel.

source: Two modes are supported:
de: Es werden zwei Modi unterstützt:
es: Se admiten 2 modos:
fr: Deux modes sont pris en charge :
nl: Er worden twee modi ondersteund:

source: One JSON array on each line (or one array altogether)
de: Ein JSON-Array in jeder Zeile (oder ein Array insgesamt)
es: Una matriz JSON en cada una de las líneas (o una matriz entera)
fr: Un tableau JSON sur chaque ligne (ou un tableau global)
it: un array JSON per ogni riga (o un array in tutto);
nl: Eén JSON-reeks op elke lijn (of één reeks alles samen)

source: One JSON object on each line
de: Ein JSON-Objekt in jeder Zeile
es: Un objeto JSON en cada una de las líneas
fr: Un objet JSON sur chaque ligne
it: un oggetto JSON su ogni riga.
nl: Eén JSON-voorwerp op elke lijn

source: Regular fields (decimal, string)
de: Reguläre Felder (dezimal, Zeichenfolge)
es: Campos regulares (decimal, string)
fr: Champs normaux (décimal, chaîne de caractères)
nl: Regelmatige velden (decimaal, string)

source: Array: used as-is
de: Array: wird verwendet, so wie es ist
es: Matriz: se usa tal cual
fr: Tableau : utilisé tel quel
nl: Reeks: zal worden gebruikt in de toestand waarin deze zich bevindt

source: First line number
de: Nummer der ersten Zeile
es: Primer número de línea
fr: Numéro de la première ligne
it: Numero della prima riga
nl: Nummer van de eerste lijn

source: For files that do not start at the first line, it is possible to define which line is considered the first one. The lines above will be skipped from the dataset.
de: Bei Dateien, die nicht in der ersten Zeile beginnen, kann festgelegt werden, welche Zeile als die erste angesehen werden soll. Die Zeilen darüber werden vom Datensatz übersprungen.
es: Para los archivos que no empiezan en la primera línea, se puede definir qué línea se considera la primera. Las líneas por encima de esta se pasarán por alto en el conjunto de datos.
fr: Pour les fichiers qui ne commencent pas dès la première ligne, vous pouvez définir quelle ligne doit être considérée comme telle. Les lignes précédentes seront ignorées du jeu de données.
nl: Voor bestanden die niet op de allereerste lijn beginnen, is het mogelijk te beslissen met welke lijn eerst rekening moet worden gehouden. De lijnen erboven zullen worden overgeslagen in de dataset.

source: By default, the dataset starts at line 1. Enter the number of the line that should be considered the beginning of the dataset.
de: Standardmäßig beginnt der Datensatz in Zeile 1. Geben Sie die Nummer der Zeile ein, die als Anfang des Datensatzes berücksichtigt werden soll.
es: De forma predeterminada, el conjunto de datos empieza en la línea 1. Especifique el número de la línea que debe considerarse el comienzo del conjunto de datos.
fr: Par défaut, le jeu de données commence à la ligne 1. Indiquez le numéro de la ligne qui doit être considérée comme le début du jeu de données.
nl: Standaard start de dataset op lijn 1. Vermeld het nummer van de lijn die overwogen zou moeten worden als het begin van de dataset.

source: Headers
de: Überschriften
es: Encabezados
fr: En-têtes
it: Header

source: For files whose first line contains field names
de: Für Dateien, deren erste Zeile Feldnamen enthält.
es: Para los archivos en que la primera línea contiene nombres de campo.
fr: Pour les fichiers dont la première ligne contient des noms de champ
nl: Voor bestanden waarvan de eerste lijn veldnamen bevat
