Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/json.po
Languages: de, es, fr, it, nl

source: By default, this option is toggled on. It makes the values of the first line field labels. Toggle off this option if the first line doesn't contain field names but data: the field labels will then be empty by default.
de: Standardmäßig ist diese Option aktiviert. Sie bezieht sich auf die Werte der ersten Zeile der Feldbeschriftungen. Schalten Sie diese Option aus, wenn die erste Zeile keine Feldnamen, sondern Daten enthält: Die Feldbeschriftungen sind dann standardmäßig leer.
es: De forma predeterminada, esta opción está activada. Hace de los valores de la primera línea las etiquetas de campo. Desactive esta opción si la primera línea no contiene nombres de campo sino datos: así, las etiquetas de campo estarán vacías de forma predeterminada.
fr: Par défaut, cette option est activée. Les valeurs de la première ligne deviennent des labels de champs. Désactivez cette option si la première ligne ne contient pas de noms de champs mais des données : les labels de champs seront vides par défaut.
nl: Standaard is deze optie aangevinkt. Het maakt de waarden van de eerste lijn tot veldlabels. Vink deze optie uit wanneer de eerste lijn geen veldnamen maar data bevat: de veldlabels zullen dan standaard leeg zijn.

source: You can use a JSON dictionary as a source. The platform extracts a valid JSON document (array or object) into one dataset of several records.
de: Sie können ein JSON-Wörterbuch als Quelle verwenden. Die Plattform extrahiert ein gültiges JSON-Dokument (Array oder Objekt) in einen Datensatz mit mehreren Einträgen.
es: Puede utilizar un diccionario JSON como origen. La plataforma extrae un documento JSON válido (matriz u objeto) en un conjunto de datos de varios registros.
fr: Vous pouvez utiliser un dictionnaire JSON en tant que source. La plateforme extrait un document JSON valide (tableau ou objet) dans un jeu de données constitué de plusieurs enregistrements.
nl: U kunt een JSON-bibliotheek als bron gebruiken. Het platform extraheert een geldig JSON-document (reeks of voorwerp) in één dataset met verschillende records.

source: The platform expects a JSON object where each key contains a record. The platform then creates records with:
de: Die Plattform erwartet ein JSON-Objekt, in dem jeder Schlüssel einen Eintrag enthält. Die Plattform erstellt dann Einträge mit:
es: La plataforma espera un objeto JSON donde cada clave contiene un registro. A continuación, la plataforma crea registros con:
fr: La plateforme attend un objet JSON là où chaque clé contient un enregistrement. La plateforme crée ensuite des enregistrements avec :
nl: Het platform verwacht een JSON-voorwerp waar elke sleutel een record omvat. Het platform maakt vervolgens records aan met:

source: one column to hold the key
de: einer Spalte für den Schlüssel
es: una columna para contener la clave,
fr: une colonne pour héberger la clé
nl: één kolom om de sleutel te houden

source: one column for each attribute of the corresponding object (or a single column named "value" if the value is a string instead of an object).
de: einer Spalte für jedes Attribut des entsprechenden Objekts (oder einer einzelnen Spalte mit dem Namen "Wert", wenn der Wert eine Zeichenfolge statt eines Objekts ist).
es: una columna para cada atributo del objeto correspondiente (o una sola columna denominada "value" si el valor es una cadena en lugar de un objeto).
fr: une colonne pour chaque attribut de l'objet correspondant (ou une colonne unique nommée "value" si la valeur est une chaîne de caractères plutôt qu'un objet).
nl: één kolom voor elk attribuut van het overeenkomstige voorwerp (of één enkele kolom met de naam "waarde" wanneer de waarde een karakterreeks is in plaats van een voorwerp).

source: Regular fields (decimal, bool, string)
de: Reguläre Felder (dezimal, boolesch, Zeichenfolge)
es: Campos regulares (decimal, bool, string)
fr: Champs normaux (décimal, booléen, chaîne de caractères)
nl: Regelmatige velden (decimaal, bool, string)

source: JSON object: will be used as-is
de: JSON-Objekte werden verwendet wie sie sind
es: Objeto JSON: se usará tal cual.
fr: Objet JSON : sera utilisé tel quel
it: Oggetto JSON, che viene utilizzato così com'è.
nl: JSON-voorwerp: zal gebruikt worden in de staat waarin het zich bevindt

source: Key field name
de: Schlüssel-Feldname
es: Nombre de campo clave
fr: Nom du champ de la clé
it: Nome del campo della chiave
nl: Naam sleutelveld

source: Label of the "key" column
de: Beschriftung der Spalte "Schlüssel"
es: Etiqueta de la columna "key"
fr: Label de la colonne "key".
nl: Label van de kolom "sleutel"

source: The default value is "key". Enter the new label of the "key" column in the **Key field name** box. It will modify both the label and the technical identifier of the column.
de: Der Standardwert lautet "Schlüssel". Geben Sie die neue Bezeichnung der Spalte "Schlüssel" in das Textfeld ein. Es wird sowohl die Beschriftung als auch die technische Kennung der Spalte geändert.
es: El valor predeterminado es "key". Especifique la nueva etiqueta de la columna "key" en el cuadro **Nombre de campo clave**. Así se modificará tanto la etiqueta como el identificador técnico de la columna.
fr: La valeur par défaut est "key". Indiquez le nouveau label de la colonne "key" dans le champ **Nom du champ de la clé**. Le label et l’identifiant technique de la colonne seront modifiés.
nl: De standaard waarde is "sleutel". Noteer het nieuwe label van de kolom "sleutel" in het vak **Naam sleutelveld**. Hierdoor zal zowel het label als de technische identifier van de kolom worden gewijzigd.

source: If you leave the **JSON root** box empty, the resulting dataset will be:
de: Wenn Sie das Feld **JSON root** leer lassen, dann resultiert folgender Datensatz daraus:
es: Si deja el cuadro **Raíz JSON** vacío, el conjunto de datos resultante será:
fr: Si vous laissez le champ **Racine JSON** vide, le jeu de données résultant sera :
nl: Wanneer u het vak **JSON root** leeg laat, zal de resulterende dataset de volgende zijn:

source: key
de: Schlüssel
es: llave
nl: sleutel

source: type1
de: Typ1

source: type2
de: Typ2

source: For this complex JSON file, the correct JSON root is ``results.datasets.item``.
de: Für diese komplexe JSON-Datei lautet der korrekte JSON-Root ``results.datasets.item``.
es: Para este archivo JSON complejo, la raíz JSON correcta es ``results.datasets.item``.
fr: Pour ce fichier JSON complexe, la racine JSON est ``results.datasets.item``.
it: Per questo file JSON complesso, la radice JSON corretta è ``results.datasets.item``.
nl: Voor dit complexe JSON-bestand, is de correcte JSON root "results.datasets.item".

source: ``results.datasets`` leads to the array
de: ``results.datasets`` führt zum Array
es: ``results.datasets`` lleva a la matriz
fr: ``results.datasets`` mène au tableau
nl: ``results.datasets`` leidt naar de reeks

source: ``item`` iterates inside the array and gets each object
de: ``item`` iteriert innerhalb des Arrays und ruft jedes Objekt ab
es: ``item`` itera dentro de la matriz y obtiene cada uno de los objetos
fr: ``item`` effectue une itération dans le tableau et récupère chaque objet
nl: ``item`` herhaalt binnen de reeks en krijgt elk voorwerp

source: description
de: Beschreibung
es: Descripción
nl: omschrijving

source: title
de: Titel
es: Título
nl: titel

source: A description about ABC
de: Eine Beschreibung von ABC
es: Una descripción acerca de ABC
nl: Een omschrijving over ABC

source: Another description
de: Eine andere Beschreibung
es: Otra descripción
nl: Een andere omschrijving

source: Array:
es: Matriz:
fr: Tableau :

source: Name
es: Nombre
fr: Nom
it: Nome
nl: Naam

source: JSON Dict
es: Dic JSON

source: JSON connectors
it: Connettori JSON

source: JSON is an open-standard format that uses human-readable text to transmit data objects consisting of key–value pairs. It is the most common data format to build web APIs.
it: JSON è un formato a standard aperto che utilizza testo comprensibile per trasmettere oggetti di dati composti da coppie chiave-valore. È il formato di dati più diffuso per la creazione delle API Web.

source: As JSON documents can have a lot of different forms, there are two JSON connectors you can choose to extract your data. If the connector did not manage to fully extract a document with a complex structure, you can use one of the platform's JSON processors to complete the extraction.
it: Poiché i documenti JSON possono presentarsi in forme diverse, sono disponibili due connettori JSON, che permettono di scegliere come estrarre i dati desiderati. Se il connettore utilizzato non riesce a terminare l'estrazione di un documento dalla struttura complessa, è possibile completare l'operazione mediante uno dei processori JSON della piattaforma.

source: This connector extracts a valid JSON document (array or object) into one dataset of several records.
it: Questo connettore estrae un documento JSON (array o oggetto) in un dataset composto da vari record.

source: If the document is a JSON object, the parameter "JSON root" should contain a dot-separated path to the array inside your object. If not provided, the connector tries ``items``.
it: Se il documento è un oggetto JSON, il parametro "JSON root" deve includere un percorso con punti separatori che porta all'array contenuto. Se questo non viene fornito, il connettore prova con il parametro ``items``.

source: For each item inside the array, the connector can follow another path before extracting the records thanks to the parameter "JSON object".
it: Per ogni elemento all'interno dell'array, il connettore può seguire un altro percorso prima di estrarre i record, grazie al parametro "Oggetto JSON".

source: regular fields like decimal, bool, string
it: Campi normali, come decimal, bool, string.

source: if the array contains JSON objects, it will be used as-is
it: se l'array contiene oggetti JSON, viene utilizzato così com'è;

source: if it contains strings, a multivalued field will be created with all the strings separated by a semicolon (";")
it: se contiene stringhe, queste vengono inserite in nuovo campo multivalore separate da punti e virgola (";").

source: Values
it: Valori

source: Path to the json array on which the connector will iterate to get the records
it: Percorso che porta all'array JSON, sul quale il connettore eseguirà l'iterazione per ottenere i record.

source: None if JSON array, "items" if JSON object
it: Nessuno se si tratta di un array JSON, "items" se si tratta di un oggetto JSON

source: Relative path of the json object you want to extract (from JSON root)
it: Percorso relativo dell'oggetto JSON da estrarre dalla radice JSON

source: JSON Line
it: Riga JSON

source: This connector expects a file in which each line is a one-line JSON documents. The whole file is not a valid JSON document but each line is.
it: Questo connettore deve ricevere un file in cui ogni riga è costituita da documenti JSON di una sola riga. L'intero file non è un documento JSON valido, mentre ogni riga è valida.

source: The connector supports two modes:
it: Il connettore supporta due modalità:

source: regular fields like decimal, string
it: Campi normali, come decimal e string.

source: array: will be used as-is
it: Array: viene utilizzato così com'è.

source: The connector will start processing the sheet at this line
it: Il connettore inizia l'elaborazione del foglio da questa riga.

source: Indicates first row contains field labels.
it: Indica che la prima riga contiene le etichette dei campi.

source: Yes
it: Sì

source: It expects a JSON object where each key contains a record, and create records with one column to hold the key, and one column for each attribute of the corresponding object (or a single column named "value" if the value is a string instead of an object).
it: Questo connettore prevede un oggetto JSON con un record per ogni chiave. Il connettore crea record con una colonna dedicata alla chiave e una colonna per ogni attributo dell'oggetto corrispondente (oppure, se il valore corrisponde a una stringa e non a un oggetto, un'unica colonna denominata "value").

source: ijson path to the object that contains the records
it: percorso ijson verso l'oggetto che contiene i record

source: start from the root if empty, ijson path like "result.datasets", or "item" to iterate in an array
it: inizia dalla radice se vuota, percorso ijson come "result.datasets", oppure "item" per iterare in un array

source: Label of the column that holds the key value
it: Etichetta della colonna che contiene il valore della chiave

source: Example 1
it: Esempio 1

source: With an empty JSON root, results in:
it: Nel caso in cui la radice JSON sia vuota:

source: Example 2
it: Esempio 2

source: ``results.datasets`` makes us move inside the JSON file to the array
it: ``results.datasets`` ci consente di muoverci all'interno del file JSON fino all'array

source: ``item`` means to iterate inside the array and get each object
it: ``item`` significa che vogliamo iterare nell'array e recuperare ogni oggetto
