Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/mapinfo.po
Languages: it

source: MapInfo connector
it: Connettore MapInfo

source: A MapInfo ZIP archive, containing the following files:
it: Archivio ZIP MapInfo contenente i seguenti file:

source: ``.mid`` Stores the attribute data
it: ``.mid``: memorizza i dati relativi agli attributi;

source: ``.mif`` Stores the structure and the geometries
it: ``.mif``: memorizza la struttura e le geometrie;

source: or
it: o

source: ``.map`` Stores the graphic and geographic information needed to display each vector feature on a map
it: ``.map``: memorizza le informazioni grafiche e geografiche necessarie per visualizzare ogni entità vettore su una mappa;

source: ``.tab`` Store the link between all other files and holds information about the type of data set file
it: ``.tab``: memorizza il link tra tutti gli altri file e le informazioni sul tipo di file del dataset;

source: ``.id`` Stores information linking graphic data to the database information
it: ``.id``: memorizza le informazioni che collegano i dati grafici alle informazioni del database;

source: ``.dat`` Stores the attribute data
it: ``.dat``: memorizza i dati degli attributi.

source: The ZIP archive must be flat, all files must be at the root path (not sub directory).
it: L'archivio ZIP deve essere flat, cioè tutti i file devono trovarsi a livello radice, senza sub-directory.
