Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/openagenda.po
Languages: es, nl

source: OpenAgenda connector
es: Conector de OpenAgenda

source: Important
es: Importante
nl: Belangrijk

source: This connector is not available by default. Please contact Opendatasoft for the activation of this connector on a given Opendatasoft domain.
es: Este conector no está disponible de forma predeterminada. Póngase en contacto con Opendatasoft para solicitar la activación de este conector en un dominio Opendatasoft determinado.
nl: Deze connector is standaard niet beschikbaar. Gelieve contact op te nemen met Opendatasoft om deze connector voor een welbepaald Opendatasoft-domein te activeren.

source: The OpenAgenda connector extracts events from an agenda, using the OpenAgenda REST API. For more information, refer to the `OpenAgenda documentation <https://developers.openagenda.com/>`__.
es: El conector de OpenAgenda extrae eventos de una agenda, usando la API REST de OpenAgenda. Para obtener más información, consulte la `documentación de OpenAgenda <https://developers.openagenda.com/>`__.
nl: De OpenAgenda connector extraheert gebeurtenissen uit een agenda en gebruikt daarvoor de OpenAgenda REST API. Voor meer informatie verwijzen we naar de `OpenAgenda documentatie <https://developers.openagenda.com/>`__.

source: Creation
es: Creación
nl: Aanmaak

source: Enter a space in the Enter a URL area, when creating a new dataset.
es: Introduzca un espacio en el área Especificar una dirección URL cuando cree un conjunto de datos nuevo.
nl: Voer een spatie in de zone Voer een URL in wanneer een nieuwe dataset wordt aangemaakt.

source: Press Enter, or click the + button.
es: Pulse Intro o haga clic en el botón +.
nl: Druk op Enter of klik op de knop "+".

source: Select OpenAgenda V2 Extractor from the Type list in the Source configuration area.
es: Seleccione Extractor de OpenAgenda V2 en la lista Tipo del área Configuración de origen.
nl: Selecteer OpenAgenda V2 Extractor uit de lijst Type in de configuratiezone Bron.

source: Configuration
es: Configuración
nl: Configuratie

source: Name
es: Nombre
nl: Naam

source: Description
es: Descripción
nl: Omschrijving

source: Usage
es: Uso
nl: Gebruik

source: Unique identifier for the agenda.
es: Identificador único de la agenda.
nl: Unieke identifier voor de agenda

source: This field is required.
es: Este campo es obligatorio.
nl: Dit veld is verplicht.

source: API key
es: Clave de API
nl: API-sleutel

source: Unique identifier for your OpenAgenda account. You can find your API key in your OpenAgenda account settings.
es: Identificador único de su cuenta de OpenAgenda. Puede encontrar su clave de API en la configuración de la cuenta OpenAgenda.
nl: Unieke identifier voor uw OpenAgenda account. U kunt uw API-sleutel terugvinden in de instellingen van uw OpenAgenda account.

source: Providing an API key is optional, but it lets you access OpenAgenda data faster.
es: Proporcionar una clave de API es opcional, pero le permitirá acceder a los datos de OpenAgenda más rápido.
nl: Het verschaffen van een API-sleutel is optioneel, maar hij laat u toe sneller toegang te krijgen tot OpenAgenda-gegevens.

source: Incremental updates
es: Actualizaciones incrementales
nl: Incrementele updates

source: When enabling incremental updates, the first publication loads all data. Subsequent updates are incremental.
es: Al habilitar las actualizaciones incrementales, la primera publicación carga todos los datos. Las actualizaciones posteriores son incrementales.
nl: Wanneer incrementele updates worden geactiveerd, worden bij de eerste publicatie alle gegevens geladen. Daaropvolgende updates zijn incrementeel.

source: To enable incremental updates, click the toggle.
es: Para habilitar las actualizaciones incrementales, haga clic en el botón de alternancia.
nl: Klik op de toggle om incrementele updates te activeren.

source: Language
es: Idioma
nl: Taal

source: Language for the event, if specified. Represented as the language code for the specified language.
es: Idioma del evento, si se especifica. Representado como el código de idioma del idioma especificado.
nl: Taal voor de gebeurtenis, indien gespecificeerd. Vertegenwoordigd als de taalcode voor de gespecificeerde taal.

source: If no value has been selected or entered, then events in all languages are extracted.
es: Si no se ha seleccionado ni introducido ningún valor, se extraerán los eventos de todos los idiomas.
nl: Wanneer er geen waarde werd geselecteerd of ingevoerd, worden gebeurtenissen in alle tallen geëxtraheerd.

source: Country
es: País

source: Country where the event takes place. Represented as the country code for this country.
es: País donde tiene lugar el evento. Representado como el código de país de este país.
nl: Land waar de gebeurtenis plaatsvindt. Vertegenwoordigd als de landcode voor dit land.

source: If no value has been selected or entered, then events for all country codes are extracted.
es: Si no se ha seleccionado ni introducido ningún valor, se extraerán los eventos de todos los códigos de país.
nl: Wanneer geen waarde werd geselecteerd of ingevoerd, worden gebeurtenissen voor alle landcodes geëxtraheerd.

source: Languages to extract
es: Idiomas para extraer
nl: Talen om te extraheren

source: Languages to be extracted from multilingual fields.
es: Idiomas que se extraerán de campos multilingües.
nl: Talen die uit velden met meerdere talen moeten worden geëxtraheerd.

source: Allowed values are ``fr`` (French), ``en`` (English), ``de`` (German), ``it`` (Italian), and ``es`` (Spanish). When creating the dataset, ``fr`` is the default value.
es: Los valores permitidos son ``fr`` (francés), ``en`` (inglés), ``de`` (alemán), ``it`` (italiano) y ``es`` (español). Cuando se crea el conjunto de datos, ``fr`` es el valor predeterminado.
nl: Toegelaten waarden zijn ``fr`` (Frans), ``en`` (Engels), ``de`` (Duits), ``it`` (Italiaans) en ``es`` (Spaans). Wanneer de dataset wordt aangemaakt, is ``fr`` de standaard waarde.

source: If no value has been selected or entered, then multilingual fields are not extracted.
es: Si no se ha seleccionado ni introducido ningún valor, no se extraerán los campos multilingües.
nl: Wanneer er geen waarde werd geselecteerd of ingevoerd, worden velden met meerdere talen niet geëxtraheerd.

source: Labels language
es: Idioma de las etiquetas
nl: Taal van de labels

source: Language of the fields used as column headers.
es: Idioma de los campos utilizados como encabezados de columna.
nl: Taal van de velden die gebruikt worden als kolomtitels.

source: Allowed values are ``fr`` (French) and ``en`` (English). ``fr`` is the default value.
es: Los valores permitidos son ``fr`` (francés) y ``en`` (inglés). ``fr`` es el valor predeterminado.
nl: Toegelaten waarden zijn ``fr`` (Frans) en ``en`` (Engels). ``fr`` is de standaard waarde.

source: Custom fields to extract
es: Campos personalizados para extraer
nl: Gepersonaliseerde velden die moeten worden geëxtraheerd

source: Custom fields that do not belong to the standard fields in OpenAgenda agendas.
es: Campos personalizados que no pertenecen a los campos estándar en las agendas OpenAgenda.
nl: Gepersonaliseerde velden die niet behoren tot de standaard velden in OpenAgenda-agenda's.

source: For more information, refer to the `OpenAgenda documentation <https://developers.openagenda.com/export-json-dun-agenda/>`__.
es: Para obtener más información, consulte la `documentación de OpenAgenda <https://developers.openagenda.com/export-json-dun-agenda/>`__.
nl: Voor meer informatie verwijzen we naar de `OpenAgenda documentatie <https://developers.openagenda.com/export-json-dun-agenda/>`__.

source: Enter the name of the custom fields to be extracted. Each custom field is extracted as a text field.
es: Especifique el nombre de los campos personalizados que se van a extraer. Cada campo personalizado se extrae como un campo de texto.
nl: Voer de naam in van de gepersonaliseerde velden die moeten worden geëxtraheerd. Elk gepersonaliseerd veld wordt geëxtraheerd als een tekstveld.

source: Tags to extract
es: Etiquetas para extraer
nl: Tags die moeten worden geëxtraheerd

source: Tags represent properties of an event. Tag groups categorize tags.
es: Las etiquetas representan propiedades de un evento. Los grupos de etiquetas categorizan las etiquetas.
nl: Tags vertegenwoordigen eigenschappen van een gebeurtenis. Taggroepen brengen tags onder in categorieën.

source: Enter the name of the tag groups to be extracted. Each tag group is extracted as a text field.
es: Especifique el nombre de los grupos de etiquetas que se van a extraer. Cada grupo de etiquetas se extrae como un campo de texto.
nl: Voer de naam in van de taggroepen die moeten worden geëxtraheerd. Elke taggroep wordt geëxtraheerd als een tekstveld.
