Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/osm.po
Languages: de, es, fr, nl

source: OSM files
de: OSM-Dateien
es: Archivos OSM
fr: Fichiers OSM
nl: OSM-bestanden

source: You can use an OpenStreetMap file (.osm) as a source.
de: Sie können eine OpenStreetMap-Datei (.osm) als Quelle verwenden.
es: Puede utilizar un archivo OpenStreetMap (.osm) como origen.
fr: Vous pouvez utiliser un fichier OpenStreetMap (.osm) en tant que source.
nl: U kunt een OpenStreetMap-bestand (.osm) gebruiken als bron.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: `Geofabrik <http://download.geofabrik.de>`_. is a reliable server to download extracts from the OpenStreetMap project. It provides exports for different regions of the world.
de: `Geofabrik <http://download.geofabrik.de>`_. ist ein zuverlässiger Server zum Herunterladen von Auszügen aus dem OpenStreetMap-Projekt. Er bietet Exporte für verschiedene Regionen der Welt.
es: `Geofabrik <http://download.geofabrik.de>`_. es un servidor fiable para descargar extracciones del proyecto OpenStreetMap. Proporciona exportaciones de distintas regiones del mundo.
fr: `Geofabrik <http://download.geofabrik.de>`_. est un serveur fiable pour télécharger des extraits du projet OpenStreetMap. Il fournit des exports de différentes régions du monde.
nl: `Geofabrik <http://download.geofabrik.de>`_. is een betrouwbare server om uittreksels uit het OpenStreetMap-project te downloaden. Het verschaft exports voor verschillende regio's in de wereld.

source: Creation
de: Erstellung
es: Creación
fr: Création
nl: Aanmaak

source: For more information about adding a file source, see :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
de: Weitere Informationen zum Hinzufügen einer Dateiquelle finden Sie hier :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
es: Para obtener más información sobre cómo añadir un origen de archivo, consulte :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
fr: Pour plus d'informations sur l'ajout d'une source de fichier, consultez :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
nl: Voor meer informatie over het toevoegen van een bestandsbron, zie :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.

source: Configuration
de: Konfiguration
es: Configuración
nl: Configuratie

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
nl: Gebruik

source: Keep only amenities
de: Behalten Sie nur, was Sie brauchen
es: Mantener solo servicios básicos
fr: Conserver uniquement les équipements
nl: Behoud enkel overheidsdiensten

source: Filters the export to only keep nodes and ways with the "amenity" tag. Amenities are important facilities for visitors and residents.
de: Filtert den Export, um nur Knoten und Wege mit dem "Amenity"-Tag zu behalten. Bei "Amenities" handelt es sich um wichtige Einrichtungen für Bewohner und Besucher.
es: Filtra la exportación para conservar únicamente los nodos y caminos con la etiqueta "amenity". Los servicios básicos son recursos importantes para los visitantes y residentes.
fr: Filtre l'export pour conserver uniquement les nœuds et les chemins présentant le tag "amenity". Les équipements sont des installations importantes pour les visiteurs et les résidents.
nl: Filtert de exports om enkel knopen en wegen bij te houden met de tag "voorziening". Voorzieningen zijn belangrijke faciliteiten voor bezoekers en bewoners.

source: By default, this option is toggled on. Toggle off this option to include all nodes and ways.
de: Standardmäßig ist diese Option aktiviert. Deaktivieren Sie diese Option, um alle Knoten und Wege einzubeziehen.
es: De forma predeterminada, esta opción está activada. Desactive esta opción para incluir todos los nodos y caminos.
fr: Par défaut, cette option est activée. Désactivez-la pour inclure tous les nœuds et chemins.
nl: Standaard is deze optie aangevinkt. Vink deze optie uit om alle manieren op te nemen.

source: Load additional OSM versioning metadata
de: Zusätzliche OSM-Metadaten zur Versionsverwaltung laden
es: Cargar metadatos en versión OSM adicionales
fr: Charger des métadonnées de versionnage OSM supplémentaires
nl: Extra OSM metadata voor versiebeheer opladen

source: Extracts the version number of each object. Values are stored in a "version" column.
de: Extrahiert die Versionsnummer der einzelnen Objekte. Die Werte werden in der Spalte "Version" gespeichert.
es: Extrae el número de versión de cada objeto. Los valores se almacenan en una columna "version".
fr: Extrait le numéro de version de chaque objet. Les valeurs sont stockées dans une colonne "version".
nl: Extraheert het versienummer van elk voorwerp. Waarden worden opgeslagen in een kolom "versie".

source: By default, this option is toggled off.
de: Standardmäßig ist diese Funktion deaktiviert.
es: De forma predeterminada, esta opción está desactivada.
fr: Cette option est désactivée par défaut.
nl: Standaard is deze optie uitgevinkt.

source: Use centroid for polygons instead of shapes
de: Schwerpunkt für Polygone anstelle von Formen verwenden
es: Utilizar baricentros de polígonos en lugar de formas
fr: Utiliser le centroïde des polygones plutôt que des formes
nl: Gebruik centroid voor polygons in plaats van vormen

source: Uses the centroid of the polygons.
de: Verwendet den Flächenschwerpunkt der Polygone.
es: Utiliza el baricentro de los polígonos.
fr: Utilise le centroïde des polygones.
nl: Gebruikt de centroid van de polygons.

source: By default, this option is toggled off, meaning that shapes are used for polygons.
de: Standardmäßig ist diese Funktion deaktiviert, d.h. es werden Formen für Polygone verwendet.
es: De forma predeterminada, esta opción está desactivada, de modo que se utilizan las siluetas para los polígonos.
fr: Cette option est désactivée par défaut, ce qui signifie que des formes sont utilisées pour les polygones.
nl: Standaard is deze optie uitgevinkt, wat betekent dat vormen gebruikt worden voor veelhoeken.

source: Extract filename
de: Dateinamen extrahieren
es: Extraer nombre de archivo
fr: Extraire le nom de fichier
nl: Extraheer bestandsnaam

source: Creates a new column with the name of the source file.
de: Es wird eine neue Spalte mit dem Namen der Quelldatei erstellt.
es: Crea una columna nueva con el nombre del archivo de origen.
fr: Crée une colonne avec le nom du fichier source.
nl: Maakt een nieuwe kolom aan met de naam van de bronbestand.

source: By default, this option is toggled off. Toggle on this option to extract the file name in an additional column.
de: Standardmäßig ist diese Option deaktiviert. Aktivieren Sie diese Option, um den Dateinamen in einer zusätzlichen Spalte zu extrahieren.
es: De forma predeterminada, esta opción está desactivada. Active esta opción para extraer el nombre de archivo en una columna adicional.
fr: Par défaut, cette option est désactivée. Activez-la pour extraire le nom de fichier dans une colonne supplémentaire.
nl: Standaard is deze optie niet aangevinkt. Vink deze optie aan om de bestandsnaam te extraheren in een toegevoegde kolom.

source: OSM tags to map
de: OSM-Tags auf Karte
es: Etiquetas de OSM a mapa
fr: Tags OSM à cartographier
nl: OSM-tags naar kaart

source: Tags to extract from the nodes and ways.
de: Aus Knoten und Wegen zu extrahierende Tags.
es: Las etiquetas que se extraerán de los nodos y caminos.
fr: Tags à extraire des nœuds et des chemins.
nl: Tags om te extraheren uit knopen en wegen.

source: Enter the tags to extract in the **OSM tags to map** box. Tags should be separated with a comma.
de: Geben Sie die zu extrahierenden Tags in das Feld **OSM-Tags auf Karte** ein. Die Tags sollten durch ein Komma getrennt werden.
es: Especifique las etiquetas para extraer en el cuadro **Etiquetas de OSM a mapa**. Las etiquetas deben ir separadas por una coma.
fr: Indiquez les tags à extraire dans le champ **Tags OSM à cartographier**. Les tags doivent être séparés avec une virgule.
nl: Voer de tags die geëxtraheerd moeten worden in in het vak **OSM-tags om te mappen**. Tags moeten gescheiden worden door middel van een komma.

source: Relation tags
de: Bezogene Tags
es: Etiquetas de relación
fr: Tags de relation
nl: Relatietags

source: Tags to extract from attached relations.
de: Aus Relationen zu extrahierende Tags.
es: Las etiquetas que se extraerán de las relaciones asociadas.
fr: Tags à extraire des relations jointes.
nl: Tags om te extraheren uit verbonden relaties.

source: Enter the tags to extract in the **Relation tags** box. Tags should be separated with a comma.
de: Geben Sie die zu extrahierenden Tags in das Feld **Relations-Tags** ein. Die Tags sollten durch ein Komma getrennt werden.
es: Especifique las etiquetas para extraer en el cuadro **Etiquetas de relación**. Las etiquetas deben ir separadas por una coma.
fr: Indiquez les tags à extraire dans le champ **Tags de relation**. Les tags doivent être séparés avec une virgule.
nl: Voer de tags die geëxtraheerd moeten worden in in het vak **Relatietags**. Tags moeten gescheiden worden door middel van een komma.
