Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/salesforce.po
Languages: de, fr, it

source: Salesforce connector
de: Salesforce-Konnektor
fr: Connecteur Salesforce
it: Connettore Salesforce

source: The Salesforce connector extracts data from the Force.com REST API. You need to create and configure an application on your Salesforce instance. See the `documentation <https://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/intro_understanding_username_password_oauth_flow.htm>`_ for more information.
de: Der Salesforce-Konnektor extrahiert Daten von der Force.com REST-API. Sie müssen eine Anwendung auf Ihrer Salesforce-Instanz erstellen und konfigurieren. Weitere Informationen finden Sie in der `Dokumentation <https://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/intro_understanding_username_password_oauth_flow.htm>`_.
fr: Le connecteur Salesforce extrait les données à partir de l'API REST Force.com. Vous devez créer et configurer une application sur votre instance Salesforce. Reportez-vous à la `documentation <https://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/intro_understanding_username_password_oauth_flow.htm>`_ pour plus d'informations.
it: Il connettore Salesforce estrae i dati dall'API REST Force.com. È necessario creare e configurare un'applicazione sull'istanza Salesforce utilizzata. Per maggiori informazioni, consulta la `documentazione <https://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/intro_understanding_username_password_oauth_flow.htm>`_.

source: Name
fr: Nom
it: Nome

source: Client Id
fr: Id client
it: ID client

source: The Consumer Key from the connected app definition.
de: Consumer Key von der verbundenen App-Definition.
fr: Clé du consommateur provenant de la définition de l'application connectée.
it: La chiave del cliente dalla definizione dell'applicazione collegata.

source: Client Secret
fr: Mot de passe client
it: Segreto client

source: The Consumer Secret from the connected app definition.
de: Consumer Secret von der verbundenen App-Definition.
fr: Mot de passe du consommateur provenant de la définition de l'application connectée.
it: Segreto del cliente dalla definizione dell'applicazione collegata.

source: Username
fr: Nom d'utilisateur

source: End-user’s username.
de: Benutzername des Endbenutzers.
fr: Nom d'utilisateur de l'utilisateur final.
it: Nome dell'utente finale.

source: Password
de: Passwort
fr: Mot de passe

source: End-user’s password.
de: Kennwort des Endbenutzers.
fr: Mot de passe de l'utilisateur final
it: Password dell'utente finale

source: Security Token
fr: Jeton d'accès de sécurité
it: Token di sicurezza

source: End-user’s security token.
de: Sicherheitstoken des Endbenutzers.
fr: Jeton d'accès de sécurité de l'utilisateur final.
it: Token di sicurezza dell'utente finale.

source: Filtered Fields
fr: Champs filtrés
it: Campi filtrati

source: The fields to retrieve from the object. Relationship can be followed with this notation: GC_OBO_Referential__r.Name
de: Die vom Objekt abzurufenden Felder. Beziehung kann mit dieser Formel verfolgt werden: GC_OBO_Referential__r.Name
fr: Champs à récupérer depuis l'objet. La relation peut être suivie avec la notation suivante : GC_OBO_Référentiel__r.Nom
it: Campi da richiamare dall'oggetto. La relazione può essere seguita dalla notazione: GC_OBO_Referential__r.Name.

source: Creation
de: Erstellung
fr: Création
it: Creazione

source: Enter the ``force://`` followed by the object name in the URL box, for example: ``force://GC_MY_Object__c``
de: Geben Sie ``force://`` gefolgt vom Objektnamen in die URL-Box ein, z. B.: ``force://GC_MY_Object__c``
fr: Saisissez ``force://`` suivi du nom de l'objet dans le champ URL, par exemple : ``force://GC_MY_Object__c``
it: Inserisci ``force://`` seguito dal nome dell'oggetto nella casella dell'URL, ad esempio: ``force://GC_MY_Object__c``.

source: Configuration
de: Konfiguration
it: Configurazione

source: Description
de: Beschreibung
it: Descrizione
