Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/sharepoint.po
Languages: de, es, nl

source: SharePoint connector
de: SharePoint-Konnektor
es: Conector de SharePoint

source: The SharePoint connector retrieves files from Microsoft SharePoint.
de: Der SharePoint-Konnektor ruft Dateien von Microsoft SharePoint ab.
es: El conector de SharePoint recupera archivos de Microsoft SharePoint.
nl: De SharePoint-connector haalt bestanden op uit Microsoft SharePoint.

source: For more information about the supported file formats, see :ref:`supportedformats`.
de: Weitere Informationen zu den unterstützten Dateiformaten finden Sie unter :ref:`Supportedformats`.
es: Para obtener más información sobre los formatos de archivo permitidos, consulte :ref:`supportedformats`.
nl: Voor meer informatie over de ondersteunde bestandsformaten, zie :ref:`supportedformats`.

source: Prerequisite
de: Voraussetzung
es: Requisito previo
nl: Voorvereiste

source: You need a Microsoft 365 account to use the SharePoint connector.
de: Sie benötigen ein Microsoft 365-Konto, um den SharePoint-Konnektor verwenden zu können.
es: Necesita una cuenta de Microsoft 365 para usar el conector de SharePoint.
nl: U heeft een Microsoft 365 account nodig om de SharePoint-connector te kunnen gebruiken.

source: Creation
de: Erstellung
es: Creación
nl: Aanmaak

source: Choose an option:
de: Wählen Sie eine Option:
es: Elija una opción:
nl: Kies een optie:

source: If you want to create a dataset, click **Catalog** > **Datasets** and click the **New dataset** button.
de: Wenn Sie einen Datensatz erstellen möchten, klicken Sie auf **Katalog** > **Datensätze** und dann auf den Button **Neuer Datensatz**.
es: Si quiere crear un conjunto de datos, haga clic en **Catálogo** > **Conjuntos de datos** y haga clic en el botón **Conjunto de datos nuevo**.
nl: Indien u een dataset wilt aanmaken, klik op **Catalogus** > **Datasets** en klik op de knop **Nieuwe dataset**.

source: If you want to add a source to an existing dataset, click **Catalog** > **Datasets** and select the desired dataset. Then, click **Add a source**.
de: Wenn Sie eine Quelle zu einem bestehenden Datensatz hinzufügen möchten, klicken Sie auf **Katalog** > **Datensätze** und wählen Sie den gewünschten Datensatz aus. Klicken Sie dann auf **Quelle hinzufügen**.
es: Si quiere añadir un origen a un conjunto de datos existente, haga clic en **Catálogo** > **Conjuntos de datos** y seleccione el conjunto de datos deseado. Acto seguido, haga clic en **Añadir un origen**.
nl: Indien een bron wilt toevoegen aan een bestaande dataset, klik op **Catalogus** > **Datasets** en selecteer de gewenste dataset. Klik vervolgens op **Een bron toevoegen**.

source: In the wizard that opens, select **SharePoint** under the **Configure a remote service** section.
de: Wählen Sie in dem sich öffnenden Assistenten **SharePoint** unter dem Abschnitt **Remote-Service konfigurieren**.
es: En el asistente que aparece, seleccione **SharePoint** en la sección **Configurar un servicio remoto**.
nl: Selecteer in de wizard die wordt geopend **SharePoint** onder de rubriek **Een service op afstand configureren**.

source: Select an existing SharePoint connection or create a new connection.
de: Wählen Sie eine bestehende SharePoint-Verbindung oder erstellen Sie eine neue Verbindung.
es: Seleccione una conexión SharePoint existente o cree una nueva conexión.
nl: Selecteer een bestaande SharePoint-verbinding of maak een nieuwe verbinding aan.

source: If you want to create a new connection, perform the following steps:
de: Gehen Sie wie folgt vor, um eine neue Verbindung zu erstellen:
es: Si quiere crear una nueva conexión, siga estos pasos:
nl: Indien u een nieuwe verbinding wilt aanmaken, volg dan de volgende stappen:

source: Click **Sign in with Microsoft** and connect to your Microsoft 365 account.
de: Klicken Sie auf **Mit Microsoft anmelden** und verbinden Sie sich mit Ihrem Microsoft 365-Konto.
es: Haga clic en **Iniciar sesión con Microsoft** y conéctese a su cuenta de Microsoft 365.
nl: Klik op **Meld u aan met Microsoft** en maak verbinding met uw Microsoft 365 account.

source: After evaluating the permissions requested, click **Accept** to grant authorization to the SharePoint connector to access your SharePoint folders and files.
de: Nachdem Sie die angeforderten Berechtigungen geprüft haben, klicken Sie auf **Akzeptieren**, um dem SharePoint-Konnektor die Berechtigung für den Zugriff auf Ihren SharePoint-Ordner und die entsprechenden Dateien zu erteilen.
es: Tras evaluar los permisos solicitados, haga clic en **Aceptar** para conceder autorización al conector de SharePoint a fin de que pueda acceder a sus carpetas y archivos de SharePoint.
nl: Na beoordeling van de gevraagde toelatingen, klik op **Aanvaarden** om de SharePoint-connector toelating te verlenen tot uw SharePoint-mappen en -bestanden.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Your Office administrator approval might be required before you can use the SharePoint connector.
de: Möglicherweise ist die Genehmigung Ihres Office-Administrators erforderlich, bevor Sie den SharePoint Konnektor verwenden können.
es: Tal vez necesite la aprobación del administrador de Office para poder utilizar el conector de SharePoint.
nl: Mogelijk is de toelating van uw Office-beheerder vereist alvorens u de SharePoint-connector kunt gebruiken.

source: Under **Retrieve the file**, click **Browse SharePoint**.
de: Klicken Sie unter **Datei abrufen** auf **SharePoint-Ordner durchsuchen**.
es: En **Recuperar el archivo**, haga clic en **Explorar carpeta Sharepoint**.
nl: Klik onder **Het bestand ophalen** op **SharePoint doorbladeren**.

source: From the dialog box that appears, select the file to be used a source.
de: Wählen Sie in dem daraufhin angezeigten Dialogfeld die Datei aus, die als Quelle verwendet werden soll.
es: En el cuadro de diálogo que aparece, seleccione el archivo que se utilizará como origen.
nl: Selecteer uit het dialoogvenster dat verschijnt het bestand dat gebruikt moet worden als bron.

source: From the preview of the first 20 records that appears, configure the source.
de: Konfigurieren Sie die Quelle über die Vorschau der ersten 20 Datensätze, die angezeigt wird.
es: En la vista previa de los 20 primeros registros que aparece, configure el origen.
nl: Configureer de bron vanuit de voorbeeldweergave van de eerste 20 records die verschijnen.

source: Configure the dataset information or use the pre-filled values:
de: Konfigurieren Sie die Datensatzinformationen oder verwenden Sie die vorausgefüllten Werte:
es: Configure la información del conjunto de datos o use los valores precompletados:
nl: Configureer de datasetinformatie of gebruik de vooraf ingevulde waarden:

source: In the **Dataset name** field, enter the title for this dataset.
de: Geben Sie in das Feld **Datensatzname** den Titel für diesen Datensatz ein.
es: En el campo **Nombre de conjunto de datos**, especifique el título de este conjunto de datos.
nl: Voer de titel voor deze dataset in in het veld **Naam van de dataset**.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
de: Geben Sie in das Feld **Technische Kennung des Datensatzes** eine sinnvolle Kennung für diesen Datensatz ein.
es: En el campo **Identificador técnico de conjunto de datos**, especifique un identificador significativo para este conjunto de datos.
nl: Voer in het veld **Technische identifier van de dataset** een betekenisvolle identifier voor deze dataset in.
