Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/wfs.po
Languages: es, fr, it

source: WFS connector
es: Conector de WFS
fr: Connecteur WFS
it: Connettore WFS

source: The WFS connector is used to extract data from a WFS service.
es: El conector de WFS se utiliza para extraer datos de un servicio WFS.

source: Important
es: Importante

source: This connector is not available by default. Please contact Opendatasoft for the activation of this connector on a given Opendatasoft domain.
es: Este conector no está disponible de forma predeterminada. Póngase en contacto con Opendatasoft para solicitar la activación de este conector en un dominio Opendatasoft determinado.

source: Creation
es: Creación
fr: Création
it: Creazione

source: Choose an option:
es: Elija una opción:

source: If you want to create a dataset, click **Catalog** > **Datasets** and click the **New dataset** button.
es: Si quiere crear un conjunto de datos, haga clic en **Catálogo** > **Conjuntos de datos** y haga clic en el botón **Conjunto de datos nuevo**.

source: If you want to add a source to an existing dataset, click **Catalog** > **Datasets** and select the desired dataset. Then, click **Add a source**.
es: Si quiere añadir un origen a un conjunto de datos existente, haga clic en **Catálogo** > **Conjuntos de datos** y seleccione el conjunto de datos deseado. Acto seguido, haga clic en **Añadir un origen**.

source: In the wizard that opens, select **WFS** under the **Configure a remote service** section.
es: En el asistente que aparece, seleccione **WFS** en la sección **Configurar un servicio remoto**.

source: Configure your HTTP connection:
es: Configurar la conexión HTTP:

source: Under the **Connection information to the HTTP server** section, enter the URL to the server in the **Server URL** box.
es: En la sección **Información de conexión al servidor HTTP**, especifique la dirección URL con el servidor en el cuadro **Dirección URL del servidor**.

source: Under the **Path to the file** section, enter the path to the layer. It must contain the ``TypeName`` parameter. (for example, ``/wfs?service=WFS&TypeName=layername``)
es: En la sección **Ruta del archivo**, especifique la ruta de la capa. Debe contener el parámetro ``TypeName``. (Por ejemplo, ``/wfs?service=WFS&TypeName=layername``)

source: From the preview of the first 20 records that appears, configure the source.
es: En la vista previa de los 20 primeros registros que aparece, configure el origen.

source: Configure the dataset information or use the pre-filled values:
es: Configure la información del conjunto de datos o use los valores precompletados:

source: In the **Dataset name** field, enter the title for this dataset.
es: En el campo **Nombre de conjunto de datos**, especifique el título de este conjunto de datos.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
es: En el campo **Identificador técnico de conjunto de datos**, especifique un identificador significativo para este conjunto de datos.

source: Configuration
es: Configuración
it: Configurazione

source: Encoding
es: Codificación
fr: Encodage
it: Codifica

source: Name
es: Nombre
fr: Nom
it: Nome

source: Description
es: Descripción
it: Descrizione

source: Usage
es: Uso

source: File encoding
es: Codificación de archivo

source: Encoding of the file
es: Codificación del archivo

source: Character encoding is the way characters are represented in a saved file. Unicode (or UTF-8) is the universal standard, but some files might be encoded in a legacy format (for example, old versions of Excel), which would require setting the encoding manually. On modern software, this is usually unnecessary.
es: La codificación de caracteres es la forma en que los caracteres están representados en un archivo guardado. Unicode (o UTF-8) es el estándar universal, pero algunos archivos pueden estar codificados en un formato heredado (por ejemplo versiones de Excel anteriores), lo que requeriría establecer la codificación manualmente. En el software moderno, esto suele ser innecesario.

source: By default, the platform uses a heuristic to guess the encoding. If the guessed encoding is not right, select the right encoding to apply from the list or enter it in the **Other** text box. You can use any aliases from `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_.
es: De forma predeterminada, la plataforma utiliza una técnica heurística para averiguar la codificación. Si el resultado no es correcto, elija la codificación adecuada en la lista o especifíquela en el cuadro de texto **Otros**. Puede utilizar cualquier alias de `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_.

source: WFS parameters
es: Parámetros WFS

source: Indicate the EPSG code matching the coordinate system (SRS)
es: Indicar el código EPSG coincidente con el sistema de coordenadas (SRS)

source: Forces the SRS value if missing from the remote WFS service.
es: Fuerza el valor SRS si este no se encuentra en el servicio WFS remoto.

source: Enter the right EPSG code in the box.
es: Especifique el código EPSG adecuado en el cuadro.

source: Force the coordinate system conversion to WSG84
es: Forzar la conversión de sistema de coordenadas a WSG84

source: Converts the geographical coordinates to EPSG:4326.
es: Convierte las coordenadas geográficas en EPSG:4326.

source: By default, this option is toggled on.
es: De forma predeterminada, esta opción está activada.

source: Invert coordinates
es: Invertir coordenadas

source: Some WFS services return the coordinates reversed. This option inverts the coordinate order.
es: Algunos servicios WFS devuelven las coordenadas invertidas. Esta opción invierte el orden de las coordenadas.

source: By default, option is toggled off.
es: De forma predeterminada, opción está desactivada.

source: Extract filename
es: Extraer nombre de archivo

source: Creates a new column with the name of the source file.
es: Crea una columna nueva con el nombre del archivo de origen.

source: By default, this option is toggled off. Toggle on this option to extract the file name in an additional column.
es: De forma predeterminada, esta opción está desactivada. Active esta opción para extraer el nombre de archivo en una columna adicional.

source: Data can be extracted from an WFS service.
fr: Les données peuvent être extraites depuis un service WFS.
it: È possibile estrarre i dati da un servizio WFS.

source: Values
fr: Valeurs
it: Valori

source: Convert spatial reference to EPSG:4326
fr: Convertir les références spatiales au format EPSG:4326
it: Converti il sistema di riferimento spaziale in formato EPSG:4326

source: True if you want to convert the coordinate to EPSG:4326
fr: Définissez cette option sur true si vous souhaitez convertir les coordonnées au format EPSG:4326
it: Impostare su "true" per convertire le coordinate in formato EPSG:4326.

source: ``true`` or ``false``
fr: ``true`` ou ``false``
it: ``true`` o ``false``

source: The file encoding.
fr: Encodage du fichier.
it: Codifica del file.

source: The encoding can be manually set, we provide a list of common value.
fr: L'encodage peut être défini manuellement, nous fournissons une liste des valeurs généralement utilisées.
it: Il valore della codifica può essere impostato manualmente. È disponibile un elenco dei valori più comuni.

source: Any alias from `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_ can be used.
fr: N'importe quel alias `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_ peut être utilisé.
it: È possibile utilizzare qualsiasi alias `Python <https://docs.python.org/2/library/codecs.html#standard-encodings>`_.

source: Inverse coordinates
fr: Inverser les coordonnées
it: Coordinate inverse

source: Inverse the geographical coordinates if True. Sometimes the connector cannot guess the correct coordinate representation, this option can fix it.
fr: Si cette option est définie sur true, les coordonnées géographiques sont inversées. Parfois, le connecteur ne parvient pas à deviner la représentation correcte des coordonnées, cette option permet de corriger ce problème.
it: Se impostato su "true", le coordinate geografiche vengono invertite. Talvolta il connettore non riesce a individuare la rappresentazione corretta delle coordinate e questa opzione consente di correggere l'errore.

source: Force wfs origin srs value
fr: Forcer la valeur srs d'origine du service wfs
it: Forza il valore srs della sorgente WFS

source: If the srs value is missing in the remote WFS service you can force it.
fr: Si la valeur srs est manquante dans le service WFS distant, vous pouvez la forcer.
it: Se il valore srs del servizio WFS remoto è mancante, è possibile forzarlo.

source: An value EPSG code.
fr: Code de valeur EPSG.
it: Un valore codice EPSG.

source: Enter the URL to the layer in the URL box, it must contains the TypeName. For example ``http://example.com?service=WFS&TypeName=mylayer``
fr: Saisissez l'URL de la couche dans le champ URL, il doit contenir le TypeName. Par exemple ``http://example.com?service=WFS&TypeName=mylayer``
it: Inserisci l'URL del layer, che deve contenere TypeName, nella relativa casella. Ad esempio ``http://example.com?service=WFS&TypeName=miolayer``.
