Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/connectors/xml.po
Languages: fr

source: XML files
fr: Fichiers XML

source: You can use an XML (.xml) file as a source.
fr: Vous pouvez utiliser un fichier XML (.xml) en tant que source.

source: This platform creates records from an arbitrary XML structure by converting all elements at a specific depth (optionally filtered by tag) to a set of records. For each element converted to a record, attributes, enclosed tags, and content are converted to fields. Complex data inside fields is converted to a JSON representation containing both attributes and content.
fr: Cette plateforme crée des enregistrements à partir d'une structure XML arbitraire en convertissant tous les éléments à une profondeur spécifique (éventuellement filtrés par tag) en un ensemble d'enregistrements. Pour chaque élément converti en enregistrement, les attributs, les tags encadrés et le contenu sont convertis en champs. Les données complexes présentes dans les champs sont converties en une représentation JSON regroupant les attributs et le contenu.

source: Creation
fr: Création

source: For more information about adding a file source, see :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.
fr: Pour plus d'informations sur l'ajout d'une source de fichier, consultez :doc:`/publishing_data/01_creating_a_dataset/retrieving_file`.

source: XML parameters
fr: Paramètres XML

source: Name
fr: Nom

source: Usage
fr: Utilisation

source: Parent tags
fr: Tags parents

source: Number of parents to get attributes from
fr: Nombre de parents desquels récupérer les attributs

source: If the enclosing tags contain relevant attributes, use this option to add them to the records.
fr: Si les tags encadrants contiennent des attributs pertinents, utilisez cette option pour les ajouter aux enregistrements.

source: Enter the number of parent tags to get attributes from (for example, ``2``).
fr: Indiquez le nombre de tags parents auprès desquels obtenir des attributs (par exemple, ``2``).

source: Name of the tags to be extracted
fr: Noms des tags à extraire

source: If irrelevant tags are at the same depth as the extracted elements, use this option to only filter relevant tags.
fr: Si des tags non pertinents se trouvent à la même profondeur que les éléments extraits, utilisez cette option pour filtrer uniquement les tags pertinents.

source: Enter the tag to extract (for example, ``item``) in the **Name of the tags to be extracted** box. If you leave the box empty, all tags at the specified depth will be converted into records.
fr: Indiquez le tag à extraire (par exemple, ``item``) dans le champ **Noms des tags à extraire**. Si vous laissez le champ vide, tous les tags à la profondeur spécifiée seront convertis en enregistrements.

source: Tag depth
fr: Profondeur de tag

source: Depth of the tags that must be converted to records
fr: Profondeur des tags devant être convertis en enregistrements

source: Enter the depth of the repeated tag in the **Tag depth** box (for example, ``3``).
fr: Indiquez la profondeur du tag répété dans le champ **Profondeur de tag** (par exemple, ``3``).

source: Extract filename
fr: Extraire le nom de fichier

source: Creates a new column with the name of the source file.
fr: Crée une colonne avec le nom du fichier source.

source: By default, this option is toggled off. Toggle on this option to extract the file name in an additional column.
fr: Par défaut, cette option est désactivée. Activez-la pour extraire le nom de fichier dans une colonne supplémentaire.

source: Technical specifications
fr: Spécifications techniques

source: Field creation
fr: Création du champ

source: The policy for creating fields from an item is defined as shown in the following examples.
fr: La politique relative à la création de champs à partir d'un élément est définie dans les exemples suivants.

source: **attribute**
fr: **attribut**

source: **other_attribute**
fr: **autre_attribut**

source: **indicator**
fr: **indicateur**

source: **country**
fr: **pays**

source: **decimal**
fr: **décimal**

source: **content**
fr: **contenu**

source: attribute value
fr: valeur d'attribut

source: other attribute value
fr: autre valeur d'attribut

source: GDP per capita
fr: PIB par habitant

source: Andean Region
fr: Région des Andes

source: 2nd data tag
fr: 2e tag de données

source: Text only
fr: Texte uniquement

source: JSON representation
fr: Représentation JSON

source: Complex data inside fields is converted to JSON as shown in the following example.
fr: Les données complexes à l'intérieur des champs sont converties en JSON comme illustré dans l'exemple suivant.

source: Examples
fr: Exemples

source: Example 1
fr: Exemple 1

source: In this example:
fr: Dans cet exemple :

source: **Tag depth** is set to ``2`` because ``wb:data`` is at the second level of the XML tree (``wb:rows/wb:data``).
fr: Le champ **Profondeur de tag** est défini sur ``2`` car ``wb:data`` est au deuxième niveau de l'arborescence XML (``wb:rows/wb:data``).

source: You do not need to filter tags out because all elements at this depth are records.
fr: Vous n'avez pas besoin de filtrer les tags, car tous les éléments à cette profondeur sont des enregistrements.

source: The resulting dataset looks like this:
fr: Le jeu de données résultant ressemble à ce qui suit :

source: wb:indicator
fr: wb:indicateur

source: wb:country
fr: wb:pays

source: wb:value
fr: wb:valeur

source: wb:decimal
fr: wb:décimal

source: {"#text": "GDP per capita (2005 USD)", "@id": "6.0.GDPpc"}
fr: {"#texte": "PIB par habitant (en USD en 2005)", "@id": "6.0.GDPpc"}

source: {"#text": "Andean Region", "@id": "L5"}
fr: {"#texte": "Région des Andes", "@id": "L5"}

source: {"#text": "Bolivia", "@id": "BO"}
fr: {"#texte": "Bolivie", "@id": "BO"}

source: Example 2
fr: Exemple 2

source: In this example, the XML tree is complex. As a result, the automatic parameters detection cannot guess the proper depth. You must configure the source manually:
fr: Dans cet exemple, l'arborescence XML est complexe. Par conséquent, la détection automatique des paramètres ne peut pas déterminer la profondeur correcte. Vous devez configurer la source manuellement :

source: **Tag depth** must be set to ``3`` because the ``item`` node is at the third level of the XML tree (``shoppingList/basket/item``).
fr: Le champ **Profondeur de tag** doit être défini sur ``3`` car le nœud ``item`` est au troisième niveau de l'arborescence XML (``shoppingList/basket/item``).

source: **Name of the tags to be extracted** must be set to ``item`` because ``itemCount`` and ``totalQuantity`` are also at the third level but not relevant.
fr: Le champ **Noms des tags à extraire** doit être défini sur ``item``, car ``itemCount`` et ``totalQuantity`` sont également au troisième niveau mais ne sont pas pertinents.

source: quantity
fr: quantité

source: potato
fr: pomme de terre

source: banana
fr: banane

source: tomato
fr: tomate
