Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_account/01_configuring_account_settings/configuring_account_settings.po
Languages: de, es, fr, nl

source: Configuring account settings
de: Kontoeinstellungen konfigurieren
es: Configurar los ajustes de la cuenta
fr: Configurer les paramètres du compte
nl: Accountinstellingen configureren

source: From the Settings tab of their account, authenticated users have the possibility to modify their name, email address, and password.
de: Über die Registerkarte "Einstellungen" ihres Kontos können authentifizierte Benutzer ihren Namen, ihre E-Mail-Adresse und ihr Passwort ändern.
es: En la ficha Configuración de su cuenta, los usuarios autenticados tienen la posibilidad de modificar su nombre, dirección de correo electrónico y contraseña.
fr: Depuis l'onglet Paramètres de leur compte, les utilisateurs authentifiés ont la possibilité de modifier leur nom, leur adresse e-mail et leur mot de passe.
nl: Vanuit de tab Instellingen van hun account hebben geauthentificeerde gebruikers de mogelijkheid om hun naam, e-mailadres en wachtwoord te wijzigen.

source: Modifying first and last name
de: Vor- und Nachname ändern
es: Modificar el nombre y el apellido
fr: Modifier le prénom et le nom de famille
nl: Voor- en familienaam wijzigen

source: (optional) In the Information area, write the new first name in the related textbox.
de: (optional) Geben Sie im Bereich "Informationen" den neuen Vornamen in das entsprechende Textfeld ein.
es: (Opcional) En el área Información, escriba el nombre en el cuadro de texto correspondiente.
fr: (optionnel) Dans la section Informations, saisissez le nouveau prénom dans la zone de texte correspondante.
nl: (optioneel) Noteer de nieuwe voornaam in het desbetreffende tekstvak in de informatieruimte.

source: (optional) In the Information area, write a new last name in the related textbox.
de: (optional) Geben Sie im Bereich "Informationen" einen neuen Nachnamen in das entsprechende Textfeld ein.
es: (Opcional) En el área Información, escriba un apellido en el cuadro de texto correspondiente.
fr: (optionnel) Dans la section Informations, saisissez le nouveau nom de famille dans la zone de texte correspondante.
nl: (optioneel) Noteer de nieuwe voornaam in het desbetreffende tekstvak in de informatieruimte.

source: Click on the Save my information button.
de: Klicken Sie auf den Button "Meine Informationen speichern".
es: Haga clic en el botón Guardar mi información.
fr: Cliquez sur le bouton Enregistrer mes informations.
nl: Klik op de knop Mijn informatie opslaan.

source: Modifying email address
de: E-Mail-Adresse ändern
es: Modificar la dirección de correo electrónico
fr: Modifier l'adresse email
nl: E-mailadres wijzigen

source: In the Email address area, write the new email address in the related textbox.
de: Geben Sie im Bereich "E-Mail-Adresse" die neue E-Mail-Adresse in das entsprechende Textfeld ein.
es: En el área Dirección de correo electrónico, escriba la dirección de correo electrónico en el cuadro de texto correspondiente.
fr: Dans la section Adresse email, saisissez la nouvelle adresse email dans la zone de texte correspondante.
nl: Noteer in de ruimte E-mailadres het nieuwe e-mailadres in het desbetreffende tekstvak.

source: Click on the Change my email address button.
de: Klicken Sie auf den Button "Meine E-Mail-Adresse ändern".
es: Haga clic en el botón Cambiar mi dirección de correo electrónico.
fr: Cliquez sur le bouton Changer mon adresse email.
nl: Klik op de knop Mijn e-mailadres wijzigen.

source: Modifying password
de: Passwort ändern
es: Modificar la contraseña
fr: Modifier le mot de passe
nl: Wachtwoord wijzigen

source: In the Password area, write the current password in the related textbox.
de: Geben Sie im Bereich "Passwort" das aktuelle Passwort in das entsprechende Textfeld ein.
es: En el área Contraseña, escriba la contraseña actual en el cuadro de texto correspondiente.
fr: Dans la section Mot de passe, indiquez le mot de passe actuel dans la zone de texte correspondante.
nl: Noteer in de ruimte Wachtwoord het huidige wachtwoord in het desbetreffende tekstvak.

source: In the Password area, write the new password in the related textbox.
de: Geben Sie im Bereich "Passwort" das neue Passwort in das entsprechende Textfeld ein.
es: En el área Contraseña, escriba la nueva contraseña en el cuadro de texto correspondiente.
fr: Indiquez ensuite le nouveau mot de passe dans la zone de texte correspondante.
nl: Noteer in de ruimte Wachtwoord het nieuwe wachtwoord in het desbetreffende tekstvak.

source: In the Password area, confirm the new password in the related textbox.
de: Bestätigen Sie im Bereich "Passwort" dann das neue Passwort in dem entsprechenden Textfeld.
es: En el área Contraseña, confirme la nueva contraseña en el cuadro de texto correspondiente.
fr: Puis, confirmez le nouveau mot de passe dans la zone de texte correspondante.
nl: Bevestig in de ruimte Wachtwoord het nieuwe wachtwoord in het desbetreffende tekstvak.

source: Click on the Change my password button.
de: Klicken Sie auf den Button "Mein Passwort ändern".
es: Haga clic en el botón Cambiar mi contraseña.
fr: Cliquez sur le bouton Changer mon mot de passe.
nl: Klik op de knop Mijn wachtwoord wijzigen.
