Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/advanced_dashboard/advanced_dashboard.po
Languages: de, es, fr, it, nl

source: For exemple, to define a threshold on our metrics, green if the pourcentage of canceled trains is below 0,20% and red is it's bigger, add this to your element :
de: Um beispielsweise einen Schwellenwert in unserer Metrik zu definieren, grün, wenn der Prozentsatz der gestrichenen Züge unter 0,20 liegt, und rot, wenn er darüber liegt, können Sie Ihrem Element Folgendes hinzufügen:
es: Por ejemplo, para definir un umbral en las métricas (verde si el porcentaje de trenes cancelados es inferior a 0,20% y rojo si es mayor), añada esto al elemento:
fr: Par exemple, pour définir des couleurs en fonction d'un seuil sur nos métriques, vert si le pourcentage de trains annulés est inférieur à 0,20 % et rouge s'il est supérieur, ajoutez ceci à votre élément :
it: Per definire le soglie delle metriche e attribuire loro colori differenti, ad esempio il verde se la percentuale di treni soppressi è inferiore allo 0,20% e il rosso quando è superiore, inserisci questo codice:
nl: Bijvoorbeeld: om een drempel voor onze cijfers te definiëren, groen indien het percentage geannuleerde treinen minder bedraagt dan 0,20ù en rood wanneer dit percentage groter is, voeg dit toe aan uw element:

source: And this CSS :
de: Und diesen CSS:
es: Y este código CSS:
fr: Et cette CSS :
it: E aggiungi questi CSS:
nl: En deze CSS:

source: Save, refresh, and see that our metrics is now red (the `bad` CSS class is used)
de: Nachdem Sie gespeichert und aktualisiert haben, sehen Sie, dass unsere Metrik nun rot ist (die 'falsche' CSS-Klasse wird verwendet)
es: Guarde los cambios, actualice y compruebe que las métricas ahora aparecen en rojo (se utiliza la clase CSS `bad`).
fr: Enregistrez, actualisez la page et vous verrez que nos métriques sont désormais affichées en rouge (la classe `bad` de la CSS est utilisée)
it: Salva, aggiorna e noterai come le nostre metriche siano ora diventate rosse (viene utilizzata la classe CSS `bad`)
nl: Sla op, hernieuw en zie dat ons cijfer nu rood is (de "slechte" CSS-klasse is gebruikt)

source: To clearly see the dynamic behavior, let's add some filters on the left of the table (on the second line). To do so :
de: Lassen Sie uns, um das dynamische Verhalten klar zu erkennen, ein paar Filter auf der linken Tabellenseite (in der zweiten Zeile) hinzufügen. Dazu:
es: Para ver claramente el comportamiento dinámico, vamos a añadir algunos filtros a la izquierda de la tabla (en la segunda línea). Para ello:
fr: Pour observer le comportement dynamique, ajoutons quelques filtres à gauche du tableau (sur la deuxième ligne). Pour cela :
it: Per mettere in risalto questo comportamento dinamico, aggiungiamo alcuni filtri sul lato sinistro della tabella, nella seconda riga. Per fare questo:
nl: Om het dynamisch gedrag duidelijk te zien, laten we enkele filters toevoegen links van de tabel (op de tweede lijn). Om dit te doen:

source: add a ``div`` with the ``row`` class to surround the table
de: ein `div`` der ``row`` Klasse hinzufügen, um die Tabelle zu umgeben
es: Añada ``div`` con la clase ``row`` para delimitar la tabla.
fr: ajoutez un tag ``div``avec la classe ``row`` autour du tableau
it: aggiungi un tag ``div`` con classe ``row`` per circondare la tabella;
nl: voeg een ``div`` met de klasse ``row`` om de tabel te omringen

source: add a ``div`` with ``col-md-9`` around the table
de: ein ``div`` dem ``col-md-9`` rund um die Tabelle hinzufügen
es: Añada ``div`` con ``col-md-9`` alrededor de la tabla.
fr: ajoutez un tag ``div`` avec la classe ``col-md-9`` autour du tableau
it: aggiungi un tag ``div`` con classe ``col-md-9`` attorno alla tabella;
nl: voeg een ``div`` met ``col-md-9`` rond de tabel

source: add a ``ods-facets`` widgets with 2 ``ods-facet`` for filters ``date`` and ``depart``
de: ein ``ods-facets`` Widget mit 2 ``ods-facet`` für die Filter ``date`` und ``depart`` hinzufügen
es: Añada un widget ``ods-facets`` con 2 ``ods-facet`` para los filtros ``date`` y ``depart``.
fr: ajoutez un widget ``ods-facets`` contenant 2 facettes ``ods-facet`` pour les filtres ``date`` et ``depart``
it: aggiungi un widget ``ods-facets`` con 2 ``ods-facet`` per i filtri ``date`` e ``depart``;
nl: voeg een ``ods-facets`` widget met 2 ``ods-facet`` voor filters ``datum`` en ``vertrek``

source: surround ``ods-facets`` with a ``div`` styled with ``col-md-3``
de: ``ods-facets`` mit einem ``div``, gestaltet mit ``col-md-3``, hinzufügen
es: Delimite ``ods-facets`` con ``div`` con el estilo ``col-md-3``.
fr: entourez les ``ods-facets`` d'un tag ``div`` avec le style ``col-md-3``
it: circonda gli ``ods-facets`` inserendo un tag ``div`` con formattazione ``col-md-3``;
nl: omring ``ods-facets`` met een ``div`` gestyled met ``col-md-3``

source: optionnaly add some ``ods-box`` styled ``div`` to surround blocks with a white background
de: optional ein paar ``ods-box`` hinzufügen, gestaltet mit ``div``, um die Blöcke mit einem weißen Hintergrund zu umranden
es: De modo opcional, añada varios ``ods-box`` con el estilo ``div`` para delimitar los bloques con un fondo blanco.
fr: si vous le souhaitez, ajoutez des tags ``div`` avec le style ``ods-box`` pour entourer les blocs avec un fond blanc
it: in maniera facoltativa, puoi aggiungere alcuni tag ``div`` con formattazione ``ods-box`` per dare ai blocchi uno sfondo bianco.
nl: voeg optioneel enkele ``ods-box`` gestyled ``div`` om blokken met een witte achtergrond te omringen

source: It should looks like this :
de: Das sollte so aussehen:
es: Debería tener el aspecto siguiente:
fr: Votre code devrait ressembler à ceci :
it: Ecco il codice da inserire:
nl: Het zou er zo moeten uitzien:

source: Save, refresh, and see how it behave when filters are selected, In 2013, Paris EST Station had less than 0,20% of canceled train. Have it a look.
de: Nachdem Sie gespeichert und aktualisiert haben, sehen Sie, wie es sich verhält, wenn Filter ausgesucht werden. 2013 wurden im Pariser Ostbahnhof weniger als 0,20% Züge gestrichen. Sehen Sie sich das an.
es: Guarde los cambios, actualice y observe el comportamiento con los filtros seleccionados. En 2013, la estación de París Este tuvo menos del 0,20% de trenes cancelados. Compruébelo.
fr: Enregistrez, actualisez la page et observez comment les métriques se comportent lorsque des filtres sont sélectionnés. En 2013, moins de 0,20 % des trains au départ de la gare Paris EST ont été annulés. Prenez le temps d'observer les effets des filtres sur les métriques.
it: Salva, aggiorna e verifica il comportamento delle metriche dopo la selezione dei filtri. Verifica ad esempio come nel 2013 la percentuale di treni soppressi nella stazione di Gare de l'Est di Parigi sia stata inferiore allo 0,20%.
nl: Sla op, hernieuw en zie hoe het zich gedraagt wanneer filters worden geselecteerd. In 2013 heeft Paris EST Station minder dan 0,20% geannuleerde treinen gehad. Neem eens een kijkje.

source: ``ng-class`` syntax is, surround by brackets, the CSS class in quotes followed by ``:`` then the AngularJS expression :
de: `Die `ng-class`` Syntax ist in Klammern eingeschlossen, die CSS-Klasse in Anführungszeichen, gefolgt von ``:`` und dem AngularJS Ausdruck:
es: La sintaxis de ``ng-class``, delimitada por corchetes, consiste en la clase CSS entrecomillada seguida de ``:`` y la expresión AngularJS:
fr: La syntaxe de la directive ``ng-class`` est, entre accolades, la classe CSS entre guillemets simples suivie de deux points ``:``, puis l'expression AngularJS :
it: La sintassi della direttiva ``ng-class``, racchiusa tra parentesi, è composta dalla classe CSS tra virgolette, seguita da ``:`` e dall'espressione AngularJS:
nl: ``ng-class`` syntax is, omringd door haakjes, de CSS-klasse tussen aanhalingstekens, gevolgd door ``:`` vervolgens de AngularJS-uitdrukking:

source: ``{ 'CSS class' : AngularJS expression, ... }``
es: ``{ 'clase CSS' : expresión AngularJS, ... }``
fr: ``{ 'classe CSS' : expression AngularJS, ... }``
it: ``{ 'CSS class' : espressione AngularJS, ... }``
nl: ``{ 'CSS-klasse' : AngularJS uitdrukking, ... }``

source: Several classes and expression can be specified, all the expressions will be tested, from left to right.
de: Es können mehrere Klassen und Ausdrücke angegeben werden. Sämtliche Ausdrücke werden von links nach rechts getestet.
es: Se pueden especificar varias clases y expresiones, y todas las expresiones se probarán de izquierda a derecha.
fr: Plusieurs classes et expressions peuvent être spécifiées, toutes les expressions seront testées, de gauche à droite.
it: È possibile specificare diversi tipi di classi ed espressioni; tutte le espressioni saranno testate, da sinistra a destra.
nl: Er kunnen verschillende klassen en uitdrukkingen worden gespecificeerd. Alle uitdrukkingen worden getest van links naar rechts.

source: Compare with filters : highlight differences with colors
de: Vergleich mit Filtern: Hervorhebung von Unterschieden mit Farben
es: Comparar con filtros: resaltar las diferencias con colores
fr: Faire des comparaisons à l'aide de filtres : mettre en valeur les différences avec des couleurs
it: Confronto con i filtri: evidenziare le differenze tramite i colori
nl: Vergelijk met filters: beklemtoon verschillen met kleuren

source: It's interresting to compare the full dataset, and a filtered view by the user and see if the metrics (specially pourcentages) are differents, bigger or smaller.
de: Es ist interessant, den gesamten Datensatz mit einer gefilterten Ansicht durch den Benutzer zu vergleichen und zu sehen, ob die Metriken (insbesondere die Prozentsätze) anders, größer oder kleiner sind.
es: Es interesante comparar el juego de datos completo y una vista filtrada por el usuario, y ver si las métricas (especialmente los porcentajes) son diferentes, mayores o menores.
fr: Il est intéressant de comparer l'ensemble du jeu de données avec une vue sur laquelle sont appliqués les filtres de l'utilisateur, afin de voir si les métriques (en particulier les pourcentages) varient à la hausse ou à la baisse.
it: È utile mettere a confronto un dataset intero con una visualizzazione filtrata dall'utente, verificando se i valori delle metriche (in particolare le percentuali) aumentano o diminuiscono.
nl: Het is interessant om de volledige dataset te vergelijken en een gefilterde weergave door de gebruiker te hebben en te zien of de cijfers (vooral percentages) verschillend, groter of kleiner zijn.

source: The plan is to have 2 contexts, one that will represent the full dataset, and one that can be filtered by the user. Once a filter is applied, if the metric is bigger or smaller that the full dataset metric, it will be highlighted by a color.
de: Zu dem Plan gehört es, 2 Kontexte zu haben, einen, der den gesamten Datensatz darstellt, und einen, der vom Benutzer gefiltert werden kann. Nach dem Anwenden des Filters wird die Metrik, je nachdem, ob sie größer oder kleiner als die Metrik des Gesamtdatensatzes ist, durch eine bestimmte Farbe hervorgehoben.
es: El plan es tener 2 contextos, uno que representa el juego de datos completo y otro que el usuario puede filtrar. Una vez aplicado un filtro, si la métrica es mayor o menor que la métrica del juego de datos completo, se resaltará con un color.
fr: L'idée consiste à avoir 2 contextes, le premier représentant le jeu de données dans son intégralité, et le second pouvant être filtré par l'utilisateur. Lorsqu'un filtre est appliqué, si la métrique est supérieure ou inférieure à la métrique du jeu de données complet, elle sera affichée dans une couleur différente.
it: L'idea è di creare 2 contesti: uno che visualizzi il dataset completo e l'altro nel quale applicare i filtri dell'utente. Una volta applicati i filtri, se il valore di una metrica aumenta o diminuisce rispetto ai dati interi, questo verrà contrassegnato con un colore diverso.
nl: Het plan is om 2 contexten te hebben, één die de volledige dataset vertegenwoordigt en één die gefilterd kan worden door de gebruiker. Eenmaal de filter is toegepast, wanneer het cijfer groter of kleiner is dan het cijfer voor de volledige dataset, zal dit worden beklemtoond door middel van een kleur.

source: To do so, you will need :
de: Dazu brauchen Sie:
es: Para ello, necesitará:
fr: Pour cela, vous devez :
it: Per fare questo, è necessario:
nl: Om dit te doen, hebt u het volgende nodig:

source: a secondary context
de: einen zweiten Kontext
es: Un contexto secundario
fr: disposer d'un contexte secondaire
it: un contesto secondario;
nl: een secundaire context

source: plug ``ods-facets`` and ``ods-table`` on this secondary context
de: Die Plugs ``ods-facets`` und ``ods-table`` in diesem sekundären Kontext
es: Complementar ``ods-filters`` y ``ods-table`` en este contexto secundario
fr: injecter ``ods-facets`` et ``ods-table`` sur ce contexte secondaire
it: inserire ``ods-facets`` e ``ods-table`` nel contesto secondario;
nl: plug ``ods-facets`` en ``ods-table`` op deze secundaire context

source: compute the same metrics for both contexts
de: berechnen Sie dieselben Metriken für beide Kontexte
es: Calcular las mismas métricas para ambos contextos
fr: calculer les mêmes métriques sur les deux contextes
it: calcolare le stesse metriche in entrambi i contesti;
nl: bereken hetzelfde cijfer voor beide contexten

source: add the secondary metric IF and ONLY IF a filter is selected
de: fügen Sie die zweite Metrik hinzu, WENN und NUR WENN ein Filter ausgewählt wurde
es: Añadir la métrica secundaria SI y SOLO SI se selecciona un filtro
fr: ajouter la métrique du contexte secondaire SI et SEULEMENT SI un filtre a été sélectionné
it: aggiungere la metrica del contesto secondario SE e SOLO SE viene selezionato un filtro;
nl: voeg het secundaire cijfer toe WANNEER en ENKEL WANNEER een filter is geselecteerd

source: configure the ``ng-class`` to compare full and filtered metric
de: Konfigurieren Sie die ``ng-class``, um die gesamte mit der gefilterten Metrik zu vergleichen
es: Configurar ``ng-class`` para comparar la métrica completa con la filtrada
fr: configurer la directive ``ng-class`` pour comparer le jeu de données complet et les métriques sur lesquelles sont appliqués des filtres
it: configurare la direttiva ``ng-class`` in modo da mettere a confronto la metrica del dataset completo con quella del dataset filtrato.
nl: configureer de ``ng-class`` om volledige en gefilterde cijfers te vergelijken

source: Let's go.
de: Los geht's.
es: Procedamos.
fr: C'est parti !
it: Cominciamo.
nl: Start!

source: Two contexts, one dataset :
de: Zwei Kontexte, ein Datensatz:
es: 2 contextos y 1 juego de datos:
fr: Deux contextes, un jeu de données :
it: Un dataset, due contesti:
nl: Twee contexten, één dataset:

source: Metrics full blocks should looks like this now :
de: Metriken in ganzen Blöcken sollten jetzt so aussehen:
es: Los bloques de métricas completos ahora deberían tener el aspecto siguiente:
fr: Les blocs entiers des métriques doivent désormais ressembler à ceci :
it: I blocchi delle metriche devono contenere questo codice:
nl: Blokken vol cijfers zouden er nu zo moeten uitzien:

source: Adapt CSS by updating or adding these classes :
de: CSS anpassen durch Updaten oder Hinzufügen folgender Klassen:
es: Adapte el código CSS actualizando o añadiendo estas clases:
fr: Adaptez la CSS en mettant à jour ou en ajoutant les classes suivantes :
it: Adatta i CSS aggiornando o aggiungendo queste classi:
nl: Pas CSS aan door deze klassen te updaten of toe te voegen:

source: Finally, let's colorize % delayed and % canceled metrics, if the filtered result is bigger than the total average, show it in red, else, if it's smaller (better) show it in green.
de: Lassen Sie uns abschließend % verspätete und % gestrichene Metriken farblich absetzen. Wenn das gefilterte Ergebnis größer als der Gesamtdurchschnitt ist, zeigen Sie es in rot an, wenn es kleiner (besser) ist, zeigen Sie es in grün an.
es: Por último, colorearemos las métricas de porcentajes de retrasos y cancelaciones. Si el resultado es mayor que el promedio total, lo mostraremos en rojo; y si es menor, en verde.
fr: Enfin, appliquez un code couleur sur les métriques % en retard et % annulés. Si le résultat des données filtrées est supérieur à la moyenne totale, affichez-le en rouge, s'il est inférieur (meilleur), affichez-le en vert.
it: Infine, colora le metriche sulle percentuali dei treni in ritardo e di quelli soppressi. Se il risultato dei dati filtrati è maggiore di quello del dataset completo, il valore sarà di colore rosso, mentre se è inferiore di colore verde.
nl: Laten we tot slot de cijfers % vertraagd en % geannuleerd kleur geven. Wanneer het gefilterde resultaat groter is dan het totaal gemiddelde, geef het weer in het rood. Zo niet, wanneer kleiner (beter) is, geef het weer in het groen.

source: Save, refresh, and test with year 2015 :
de: Nachdem Sie gespeichert und aktualisiert haben, testen Sie das Jahr 2015:
es: Guarde los cambios, actualice y pruebe con el año 2015:
fr: Enregistrez, actualisez la page et faites un essai sur l'année 2015 :
it: Salva, aggiorna e fai un test sull'anno 2015:
nl: Sla op, hernieuw en probeer met het jaar 2015:

source: Create a data table
de: Erstellen einer Datentabelle
es: Crear una tabla de datos
fr: Créer un tableau de données
it: Creazione di una tabella di dati
nl: Maak een datatabel aan

source: ``odsAnalysis`` get the analysis of one or several aggregation for each values if a field. It can be seen exactly like a chart, but instead of displaying curves, columns or pies, odsAnalysis returns each values, and you are free to display them in a table or other expression.
de: ``odsAnalysis`` holt sich die Analyse einer oder mehrerer Aggregationen für jeden Wert eines Feldes. Sie kann genau wie ein Diagramm angesehen werden, doch anstatt Kurven, Spalten oder Torten anzuzeigen, gibt odsAnalysis alle Werte zurück, und Sie können sie in einer Tabelle oder einem anderen Ausdruck anzeigen.
es: ``odsAnalysis`` obtiene el análisis de una o varias agregaciones para cada uno de los valores de un campo. Puede entenderse exactamente como un gráfico, pero en lugar de mostrar curvas, columnas o segmentos, odsAnalysis devuelve cada uno de los valores, y usted decide si los visualiza en una tabla u otra expresión.
fr: ``odsAnalysis`` permet d'obtenir l'analyse d'une ou de plusieurs agrégations pour chaque valeur d'un champ. Cette fonction peut être apparentée à un graphe, à la différence qu'elle n'affiche pas des courbes, des colonnes ou des secteurs, mais renvoie chaque valeur, et vous avez la possibilité d'afficher ces dernières dans un tableau ou à l'aide d'une autre expression.
it: ``odsAnalysis`` consente di analizzare una o più aggregazioni dei valori di un campo. Il risultato può essere paragonato a quello di un grafico, solo che invece di visualizzare curve, torte o colonne, odsAnalysis restituisce tutti i valori, in modo da poterli visualizzare in una tabella o in altro modo.
nl: ``odsAnalysis`` krijgt de analyse van één of verschillende aggregatie voor elke waarde indien een veld. Het gezien worden net zoals een grafiek, maar in plaats van curves, kolommen of taartpunten weer te geven, geeft odsAnalysis elke waarde en bent u vrij om deze in een tabel of andere uitdrukking weer te geven.

source: First, we will test the result by seting up the correct analysis in the analysis tab of the dataset. What could be interresting is to display the table of the top 10 regularity stations. To do so :
de: Zunächst testen wir das Ergebnis durch Einrichten der korrekten Analyse im Analyse-Register des Datensatzes. Es könnte beispielsweise interessant sein, eine Tabelle der Top 10 der regelmäßigsten Bahnhöfe anzuzeigen. Dafür:
es: En primer lugar, probaremos el resultado configurando el análisis correcto en la ficha de análisis del juego de datos. Podría ser interesante visualizar la tabla de las 10 estaciones con mejor regularidad. Para ello:
fr: Tout d'abord, nous allons tester le résultat en configurant l'analyse correcte dans l'onglet Analyse du jeu de données. Il peut être intéressant d'afficher dans un tableau les 10 gares présentant la régularité la plus élevée. Pour cela, suivez la procédure ci-après :
it: Come prima cosa, testeremo il risultato configurando l'analisi nella scheda Analizza del dataset. Un'analisi interessante potrebbe riguardare la ricerca delle prime 10 stazioni per regolarità. Per fare questo:
nl: Eerst testen we het resultaat door de correcte analyse in te stellen in het analysetabblad van de dataset. Wat interessant zou kunnen zijn, is om de tabel van de top 10 regelmatige stations weer te geven. Om dit te doen:

source: X axis
de: X-Achse
es: Eje X
fr: Axe X
it: Asse X
nl: X-as

source: "départ" (origin station)
de: "départ" (Abfahrtsbahnhof)
es: "départ" (estación de origen)
fr: "départ" (station d'origine)
it: "départ" (stazione di partenza).
nl: "départ" (oorspronkelijk station)

source: 4 series : - AVG Regularity (`Régularité`) - AVG Number of shceduled train (`nombre_de_trains_programmes`) - AVG Number of canceled train (`nombre_de_trains_annules`) - AVG Number of delayed train (`nombre_de_trains_en_retard_a_l_arrivee`)
de: 4 Serien: - AVG Regelmäßigkeit (`Régularité`) - AVG Anzahl der fahrplanmäßigen Züge (`nombre_de_trains_programmes`) - AVG Anzahl der gestrichenen Züge (`nombre_de_trains_annules`) - AVG Anzahl der verspäteten Züge (`nombre_de_trains_en_retard_a_l_arrivee`)
es: 4 series: - AVG (`régularité`) Regularidad - AVG (`nombre_de_trains_programmes`) Número de trenes programados - AVG (`nombre_de_trains_annules`) Número de trenes cancelados - AVG (`nombre_de_trains_en_retard_a_l_arrivee`) Número de trenes con retraso
fr: 4 séries : - AVG régularité (`Régularité`) - AVG nombre de trains programmés (`nombre_de_trains_programmes`) - AVG nombre de trains annulés (`nombre_de_trains_annules`) - AVG nombre de trains en retard à l'arrivée (`nombre_de_trains_en_retard_a_l_arrivee`)
it: 4 serie: - AVG regolarità (`régularité`) - AVG treni pianificati (`nombre_de_trains_programmes`) - AVG treni soppressi (`nombre_de_trains_annules`) - AVG treni in ritardo (`nombre_de_trains_en_retard_a_l_arrivee`).
nl: 4 reeksen: - gemiddelde regelmatigheid (`Régularité`) - gemiddeld aantal geplande treinen (`nombre_de_trains_programmes`) - gemiddeld aantal geannuleerde treinen (`nombre_de_trains_annules`) - gemiddeld aantal treinen met vertraging (`nombre_de_trains_en_retard_a_l_arrivee`)

source: sort by regularity serie
de: Nach der Regelmäßigkeitsserie sortieren
es: Ordenar por serie de regularidad
fr: triez la série par régularité
it: ordina la serie per regolarità;
nl: sorteer per regelmatigheidsreeks

source: Number of point : 10 max
de: Punktanzahl: max. 10
es: Número de puntos: 10 máx.
fr: Nombre de points : 10 max.
it: numero di punti: max 10.
nl: Aantal punten: maximaal 10
