Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/advanced_dashboard/advanced_dashboard.po
Languages: de, es, fr, it, nl

source: Metrics/KPI and Data tables
de: Metriken/KPI und Datentabellen
es: Métricas/KPI y tablas de datos
fr: Métriques/KPI et tableaux de données
it: Metriche/KPI e tabelle di dati
nl: Metrics/KPI en Data tables

source: Charts, Maps, tables, calendar are default views. Lot of additionnal parameters are waiting for you in the documentation. In the mean time, a lot of other widgets are as insterested as the main ones.
de: Diagramme, Karten, Tabellen und Kalender sind Standardansichten. In der Dokumentation warten zahlreiche weitere Parameter auf Sie. Bis dahin sind mehrere andere Widgets ebenso wichtig wie die Hauptwidgets.
es: Las vistas de gráficos, mapas, tablas y calendario son vistas predeterminadas. Tiene a su disposición múltiples parámetros adicionales en la documentación. Entre tanto, hay otros muchos widgets tan interesantes como los principales.
fr: Les graphes, les cartes, les tableaux et les calendriers sont les vues par défaut. Vous découvrirez de nombreux autres paramètres dans cette documentation. Vous verrez également des widgets moins connus mais tout aussi intéressants que ceux généralement utilisés.
it: I grafici, le mappe, le tabelle e il calendario sono le modalità di visualizzazione predefinite della piattaforma, ma la documentazione descrive anche molti altri parametri. Inoltre, accanto ai widget principali, ne scoprirai tanti altri di grande interesse.
nl: Grafieken, kaarten, tabellen en kalender zijn standaard weergaves. Er liggen een heleboel extra parameters op u te wachten in de documentatie. Intussen zijn een heleboel andere widgets net zo interessant als de belangrijkste.

source: Please have a look to the :ref:`widget list <widgets-list>` for more information.
es: Consulte la :ref:`lista de widgets <widgets-list>` para obtener más información.

source: Pick up a dataset
de: Datensatz aufnehmen
es: Seleccionar un juego de datos
fr: Choisir un jeu de données
it: Scelta di un dataset
nl: Een dataset oppikken

source: To illustrate metrics, KPI, advanced map tooltips and more, we will use a dataset that contains all regularity reports from the French Railway Society since 2011. This dataset contains, for each TGV (High speed train) line (100 lines), the number of scheduled train per month, the number of trains that didn't leave the station, and the number of trains in late.
de: Um Metriken, KPI, fortgeschrittene Karten-Tooltipps uvm. zu illustrieren, nutzen wir einen Datensatz, der sämtliche egelmäßigkeitsberichte der Französischen Bahn seit 2011 erfasst. Dieser Datensatz enthält für jede TGV (Hochgeschwindigkeitszug)-Verbindung (100 Verbindungen) die Anzahl der fahrplanmäßigen Züge pro Monat, die Anzahl der Züge, die den Bahnhof nicht verlassen haben und die Anzahl der verspäteten Züge.
es: Para ilustrar las métricas, los KPI, las ayudas de herramientas de mapas avanzadas y mucho más, utilizaremos un juego de datos con todos los informes de regularidad de la compañía ferroviaria francesa desde 2011. Este juego de datos contiene, para cada una de las líneas del tren de alta velocidad TGV (100 líneas), el número de trenes programados al mes, el número de trenes que no han salido de la estación y el número de trenes con retraso.
fr: Pour décrire les métriques, les KPI, les infobulles de cartes avancées, ainsi que d'autres fonctions, nous utiliserons un jeu de données contenant tous les rapports de régularité de la SNCF depuis 2011. Ce jeu de données contient, pour chaque ligne de TGV (100 lignes), le nombre de trains programmés chaque mois, le nombre de trains annulés et le nombre de trains en retard à l'arrivée.
it: Per illustrare le metriche, i KPI, i tooltip delle mappe avanzate e altro, ci serviremo di un dataset contenente tutti i report di regolarità creati dalla SNCF (la Società Nazionale delle Ferrovie Francesi) a partire dal 2011. Questo dataset contiene il numero dei treni TGV pianificati, in ritardo o soppressi ogni mese per le 100 linee ad alta velocità.
nl: Om metrics, KPI, geavanceerde kaarttooltips en meer te illustreren, gaan we een dataset gebruiken die allemaal regelmatige rapporten van de Franse spoorwegmaatschappij sinds 2011 bevatten. Deze dataset bevat voor elke TGV (hogesnelheidstrein) lijn (100 lijnen), het aantal geplande treinen per maand, het aantal treinen dat het station niet heeft verlaten en het aantal treinen dat te laat is binnengekomen.

source: Dataset id : ``regularite-mensuelle-tgv`` You can search for it on `data.opendatasoft.com <https://data.opendatasoft.com>`_ Then add this dataset to your domain (New dataset, Add a source from OpenDataSoft network, pick the dataset, save, publish)
es: ID de conjunto de datos: ``regularite-mensuelle-tgv`` Puede buscarlo en `data.opendatasoft.com <https://data.opendatasoft.com>`_. A continuación, añada este conjunto de datos al dominio: Conjunto de datos nuevo, Añadir un conjunto de datos de la red OpenDataSoft, seleccione el conjunto de datos, guárdelo y publíquelo.

source: Create some KPIs
de: KPIs erstellen
es: Crear indicadores KPI
fr: Créer des KPI
it: Creazione dei KPI
nl: Maak enkele KPI's aan

source: To create metrics / KPI, we use **odsAggregation**, to compute the sum, average, min, max of a data field. Based on the context, the metric will update dynamically all along the user navigation (queries, filters).
de: Zum Erstellen von Metriken/KPIs nutzen wir **odsAggregation**, um die Summe, den Durchschnitt, das Min. und das Max. eines Datenfelds zu berechnen. Je nach Kontext führt die Metrik für alles entlang der Benutzernavigation (Anfragen, Filter) ein dynamisches Update durch.
es: Para crear métricas/KPI, utilizamos **odsAggregation** a fin de calcular los valores de suma, promedio, mínimo y máximo de un campo de datos. En función del contexto, la métrica se actualizará dinámicamente durante la navegación del usuario (consultas y filtros).
fr: Pour créer des métriques/KPI, nous utilisons la fonction **odsAggregation**, afin de calculer la somme, la moyenne, la valeur minimale et la valeur maximale d'un champ de données. En fonction du contexte, la métrique se met à jour de manière dynamique à mesure que l'utilisateur poursuit sa navigation (requêtes, filtres).
it: Per creare metriche o KPI, utilizziamo **odsAggregation**, che consente di calcolare la somma, la media, il valore minimo e quello massimo di un campo di dati. Durante la navigazione dell'utente, la metrica viene aggiornata in modo dinamico in base al contesto (query, filtri).
nl: Om metrics / KPI aan te maken, gebruiken we **odsAggregation**, om de som, het gemiddelde, het minimum, het maximum van een dataveld te berekenen. Op basis van de context zullen de metrics dynamisch alles updaten volgens het surfgedrag van de gebruiker (zoekopdrachten, filters).

source: Starting from a new page, let's start by getting a context from this dataset. The simplest way is to go to the explore/catalog page, go to the dataset, then in the table view, copy and paste de widget code from the share links below :
de: Lassen Sie uns ausgehend von einer neuen Seite einen Kontext aus diesem Datensatz holen. Die einfachste Methode besteht darin, auf Durchsuchen/Katalogseite zu gehen, dann auf den Datensatz, danach in die Tabellenansicht und den Widget-Code aus den unten stehenden Teilen-Links zu kopieren und einzufügen:
es: A partir de una página nueva, empezamos obteniendo un contexto de este juego de datos. El procedimiento más sencillo es ir a la página de Explorar/catálogo, ir al juego de datos y, en la vista de tabla, copiar y pegar el código del widget de los vínculos de compartir siguientes:
fr: Depuis une nouvelle page, commençons par obtenir un contexte à partir de ce jeu de données. La méthode la plus simple consiste à accéder à la page d'exploration/du catalogue, puis d'accéder au jeu de données. Ensuite, dans la vue tableau, copiez et collez le code de widget depuis l'encadré ci-dessous :
it: Partendo da una pagina nuova, iniziamo a definire un contesto su questo dataset. Il modo più semplice consiste nel fare clic su Esplora/Catalogo e poi selezionare il dataset. A questo punto, copia e incolla nella visualizzazione Tabella il codice del widget sottostante:
nl: Laten we vanuit de nieuwe pagina een context krijgen uit deze dataset. De eenvoudigste manier is om naar de explore/cataloguspagina te gaan. Ga naar de dataset en vervolgens naar de tabelweergave, kopieer en plak de widgetcode uit de deel-koppelingen hieronder:

source: On top of the table view, we will add a counter based on the ``nombre_de_trains_programmes`` field (number of scheduled train). Let's get the number of trains scheduled since 2011 in France.
de: Oben in der Tabellenansicht fügen wir einen Zähler hinzu, der auf dem Feld ``nombre_de_trains_programmes`` basiert (Anzahl der fahrplanmäßigen Züge). Lassen Sie uns beispielsweise die Anzahl der fahrplanmäßigen Züge seit 2011 in Frankreich abfragen.
es: En la parte superior de la vista de tabla, añadiremos un contador basado en el campo ``nombre_de_trains_programmes`` (número de trenes programados). Vamos a obtener el número de trenes programados desde 2011 en Francia.
fr: Au-dessus de la vue tableau, nous allons ajouter un compteur basé sur le champ ``nombre_de_trains_programmes``. Cela nous permettra d'obtenir le nombre de trains programmés depuis 2011 en France.
it: Nella parte alta della visualizzazione Tabella aggiungeremo un contatore collegato al campo ``nombre_de_trains_programmes`` (numero dei treni pianificati), che mostrerà il numero di treni pianificati in Francia dal 2011.
nl: Boven de tabelweergave zullen we een teller toevoegen die gebaseerd is op het veld ``nombre_de_trains_programmes`` (aantal geplande treinen). Laten we het aantal treinen nemen dat sinds 2011 in Frankrijk gepland is.

source: With odsAggregation, the parameters are :
de: Mit odsAggregation lauten die Parameter:
es: Con odsAggregation, los parámetros son:
fr: Avec la fonction odsAggregation, les paramètres sont les suivants :
it: Con odsAggregation, i parametri sono:
nl: Met odsAggregation zijn de parameters:

source: the name of the variable that will store aggregation result
de: der Name der Variablen, die das Aggregationsergebnis speichert
es: El nombre de la variable que almacenará el resultado de la agregación
fr: le nom de la variable qui stockera le résultat de l'agrégation
it: il nome della variabile che conterrà il risultato dell'aggregazione;
nl: de naam van de variabele waarin het aggregatieresultaat zal worden opgeslagen

source: the context to work on
de: der Kontext, an dem zu arbeiten ist
es: El contexto para trabajar
fr: le contexte sur lequel travailler
it: il contesto su cui lavorare;
nl: de context om op te werken

source: the function
de: die Funktion
es: La función
fr: la fonction
it: la funzione;
nl: de functie

source: the expression (the name of the field)
de: der Ausdruck (der Name des Feldes)
es: La expresión (el nombre del campo)
fr: l'expression (le nom du champ)
it: l'espressione (il nome del campo).
nl: de uitdrukking (de naam van het veld)

source: With a ``number`` filter to display it correctly in an HTML ``span`` you should have something similar to this :
de: Mit einem "Nummer"-Filter, um es korrekt in einem HTML "Span" anzuzeigen, müssten Sie ungefähr folgendes Ergebnis erhalten:
es: Con un filtro ``number`` para que se visualice correctamente en un ``span`` HTML debería tener algo parecido a esto:
fr: Avec un filtre ``number`` pour un affichage correct dans un tag HTML ``span``, vous devriez obtenir le résultat suivant :
it: Utilizzando il filtro ``number`` per visualizzare correttamente i dati in un tag HTML ``span``, otterrai quanto segue:
nl: Met een filter ``aantal`` om dit correct weer te geven in een HTML "span" zou u iets gelijkaardigs moeten krijgen aan dit:

source: It displays a number (approx. 1.7 millions) at the beginning of the page that already need some CSS to be highlighted. Metric are often rounded in a box, with an important font size and weight.
de: Es zeigt eine Zahl (circa 1,7 Millionen) am Anfang der Seite an, die bereits etwas CSS benötigt, um hervorgehoben zu werden. Die Metriken sind oft abgerundet in einer Box, mit großer Schriftgröße und gewichtigem Schriftschnitt.
es: Visualiza un número (aprox. 1,7 millones) al principio de la página que ya necesita código CSS para resaltarlo. Las métricas suelen ir delimitadas en un cuadro, con un tamaño de fuente y un peso importantes.
fr: Un nombre (environ 1,7 million) s'affiche en haut de la page, il nécessite du code CSS pour le mettre en valeur. Les métriques sont souvent affichées dans un cadre, avec une grande taille de police et mises en gras.
it: All'inizio della pagina comparirà un numero (circa 1,7 milioni), che potrai subito mettere in risalto con il codice CSS. Di solito, le metriche appaiono all'interno di un riquadro, evidenziate in grassetto e con un carattere di grandi dimensioni.
nl: Er wordt een aantal (ongeveer 1,7 miljoen) weergegeven aan het begin van de pagina die reeds CSS nodig heeft om te worden beklemtoond. Cijfers worden vaak afgerond in een vakje met een belangrijke grootte en gewicht van het lettertype.

source: Add this CSS code to your page :
de: Fügen Sie Ihrer Seite folgenden CSS-Code hinzu:
es: Añada este código CSS a la página:
fr: Ajoutez ce code CSS à votre page :
it: Aggiungi il seguente codice CSS alla tua pagina:
nl: Voeg deze CSS-code toe aan uw pagina:

source: And add ``kpi`` class to your ``span`` tag.
de: Und fügen Sie Ihrem "Span"-Tag die Klasse "KPI" hinzu.
es: Y añada la clase ``kpi`` a la etiqueta ``span``.
fr: Ajoutez également la classe ``KPI`` à votre tag ``span``.
it: Aggiungi anche la classe ``kpi`` al tag ``span``.
nl: En voeg de klasse ``kpi`` toe aan uw ``span`` tag.

source: Save, refresh, and see that it's a bit better.
de: Speichern und aktualisieren Sie, Sie werden sehen, dass es schon ein bisschen besser ist.
es: Guarde los cambios, actualice y observe cómo ha mejorado.
fr: Enregistrez, actualisez la page et admirez le résultat.
it: Salva, aggiorna e verifica il risultato delle tue modifiche.
nl: Sla op, hernieuw en zie of het iets beter is.

source: Before going further with CSS and specially repsonsive code, let's add 2 more metrics : number of cancelled train (``nombre_de_trains_annules``) and number of delayed train (``nombre_de_trains_en_retard_a_l_arrivee``)
de: Lassen Sie uns 2 weitere Metriken hinzufügen, bevor es mit CSS und insbesondere mit dem responsiven Code weitergeht: Anzahl der gestrichenen Züge (``nombre_de_trains_annules``) und Anzahl der verspäteten Züge (``nombre_de_trains_en_retard_a_l_arrivee``)
es: Antes de proseguir con CSS y especialmente el código con capacidad de respuesta, vamos a añadir 2 métricas más: número de trenes cancelados (``nombre_de_trains_annules``) y número de trenes con retraso (``nombre_de_trains_en_retard_a_l_arrivee``).
fr: Avant de poursuivre avec CSS et en particulier avec le code responsive, ajoutons 2 métriques supplémentaires : ``nombre_de_trains_annules`` et ``nombre_de_trains_en_retard_a_l_arrivee``
it: Prima di continuare con i CSS e in particolare con il codice responsivo, aggiungiamo ancora 2 metriche: numero dei treni soppressi (``nombre_de_trains_annules``) e numero dei treni in ritardo (``nombre_de_trains_en_retard_a_l_arrivee``).
nl: Alvorens verder te gaan met CSS en vooral responsieve code, laten we 2 extra cijfers toevoegen: aantal geannuleerde treinen (``nombre_de_trains_annules``) en aantal treinen met vertraging (``nombre_de_trains_en_retard_a_l_arrivee``)

source: Result :
de: Ergebnis:
es: Resultado:
fr: Résultat :
it: Ecco il risultato:
nl: Resultaat:

source: It works but all metrics are independant. We can add filters to make them become dynamic depending on user filters etc... but we can't compute any thing from it. It would be interesting to have the pourcentage of canceled or delayed train out of the total.
de: Es funktioniert, alle Metriken sind jedoch unabhängig. Wir können Filter hinzufügen, damit sie dynamisch werden, je nach Benutzerfiltern etc. Wir können jedoch nichts mit ihnen berechnen. Es wäre z. B. interessant, den Prozentsatz der gestrichenen oder verspäteten Züge im Vergleich zur Gesamtzahl zu erhalten.
es: Funciona, pero todas las métricas son independientes. Podemos añadir filtros para que sean dinámicas en función de los filtros de usuario, etc. pero no podemos calcular nada a partir de ahí. Sería interesante tener el porcentaje de trenes cancelados o con retraso respecto del total.
fr: Cela fonctionne, mais toutes les métriques sont indépendantes. Nous pouvons ajouter des filtres pour les rendre dynamiques en fonction des filtres des utilisateurs, etc. mais elles ne peuvent pas être utilisées pour calculer quoi que ce soit. Il serait intéressant d'obtenir le pourcentage de trains annulés ou en retard.
it: Funziona, ma queste metriche restano variabili indipendenti. È possibile aggiungere i filtri per renderle dinamiche e aggiornarle in base ai filtri utilizzati dall'utente o altro, ma non ci consentono di fare alcun calcolo. Sarebbe utile ad esempio avere la percentuale sul totale dei treni soppressi o in ritardo.
nl: Het werkt, maar alle cijfers staan los van elkaar. We kunnen filters toevoegen om ze dynamisch te maken, afhankelijk van gebruikersfilters, enz. maar we kunnen ermee niets berekenen. Het zou interessant zijn om het percentage geannuleerde of vertraagde treinen uit het totaal te hebben.

source: To do this, you must chain ods-aggregation with different variable names.
de: Dazu müssen Sie ods-aggregation mit verschiedenen Variablennamen verketten.
es: Para ello, debe encadenar ods-aggregation con varios nombres de variables.
fr: Pour cela, vous devez chaîner la fonction ods-aggregation à différents noms de variables.
it: Per fare questo, è necessario collegare ods-aggregation a più nomi di variabili.
nl: Om dit te doen, moet u ods-aggregation koppelen aan verschillende variabele namen.

source: It must looks like that :
de: Das muss so aussehen:
es: Debe tener el aspecto siguiente:
fr: Votre code doit ressembler à ceci :
it: Il codice da inserire è il seguente:
nl: Het moet er zo uit zien:

source: Then, it's now possible, with AngularJS expression, to compute pourcentages between each values :
de: Jetzt können mit dem AngularJS Ausdruck Prozentsätze zwischen allen Werten berechnet werden:
es: A continuación, ya es posible, con la expresión AngularJS, calcular los porcentajes entre los valores:
fr: Il est désormais possible, avec une expression AngularJS, de calculer des pourcentages parmi les valeurs :
it: Ora, tramite un'espressione AngularJS, sarà possibile calcolare le percentuali tra i diversi valori:
nl: Nu is het met AngularJS-uitdrukking mogelijk om percentages tussen elke waarde te berekenen:

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: ``| number : 2`` is the AngularJS filter to pretty print numerical values. The optional parameter ``2`` is to limit to only 2 decimals
de: ``| Anzahl: 2`` ist der AngularJS Filter für eine schönere Darstellung numerischer Werte. Der optionale Parameter ``2`` dient zur Begrenzung auf 2 Dezimalstellen.
es: ``| number : 2`` es el filtro AngularJS para imprimir en un formato estético los valores numéricos. El parámetro opcional ``2`` limita los decimales a solo 2.
fr: ``| number : 2`` correspond au filtre AngularJS pour imprimer automatiquement des valeurs numériques. Le paramètre optionnel ``2`` permet de limiter la valeur à 2 décimales
nl: ``| number : 2`` is de AngularJS-filter om numerieke waarden mooi af te drukken. De optionele parameter ``2`` is om te beperken tot slechts 2 decimalen

source: Before going further let's clean up the HTML code to be able to apply CSS for responsive display, different font size between the title and the value etc... :
de: Lassen Sie uns, bevor wir weitergehen, den HTML-Code aufräumen, um CSS für die responsive Anzeige, unterschiedliche Schriftgrößen zwischen dem Titel und dem Wert etc. anzuwenden:
es: Antes de continuar vamos a limpiar el código HTML para poder aplicar CSS para una visualización con capacidad de respuesta, un tamaño de fuente distinto para el titulo y el valor, etc.:
fr: Avant de poursuivre, nettoyons le code HTML afin de pouvoir appliquer une CSS pour obtenir un affichage responsive, utiliser des tailles de polices différentes pour les titres et les valeurs, etc. :
it: Prima di continuare, ripulisci il codice HTML, in modo da poter inserire i CSS necessari per una visualizzazione responsiva, per una diversa dimensione di carattere tra titolo e valore, ecc.:
nl: Alvorens verder te gaan, laten we de HTML-code opkuisen om CSS te kunnen toepassen voor responsieve weergave, verschillende groottes lettertype tussen de titel en de waarde, enz.:

source: And replace the CSS :
de: Und den CSS ersetzen:
es: Sustituya el código CSS:
fr: Et remplacez la CSS :
it: E quindi sostituisci il codice CSS:
nl: En vervang de CSS:

source: Save, refresh, see :
de: Nachdem Sie gespeichert und aktualisiert haben, sehen Sie sich das Ganze an:
es: Guarde los cambios, actualice y observe:
fr: Enregistrez, actualisez la page et observez le résultat :
it: Salva e aggiorna:
nl: Sla op, hernieuw, zie:

source: Colorize your KPI - ng-class
de: Verleihen Sie Ihren KPI Farbe - ng-class
es: Colorear el KPI - ng-class
fr: intégrer un code couleur à la directive ng-class de vos KPI
it: Come colorare i KPI con la direttiva ng-class
nl: Geef uw KPI - ng-klasse kleur

source: ``ng-class`` directive is very conveniant when an HTML element must be styled depending on a value, the context, an expression or all other dynamic things that can be used in AngularJS expression.
de: Die ``ng-class`` Richtlinie ist sehr praktisch, wenn ein HTML-Element entworfen werden muss, das von einem Wert, dem Kontext, einem Ausdruck oder allen anderen dynamischen Dingen, die im AngularJS Ausdruck verwendet werden, abhängt.
es: La directiva ``ng-class`` es muy práctica para aplicar un estilo a un elemento HTML en función de un valor, el contexto, una expresión o cualquier otro contenido dinámico que se pueda emplear en una expresión AngularJS.
fr: La directive ``ng-class`` se révèle être très pratique lorsqu'un style doit être appliqué à un élément HTML en fonction d'une valeur, d'un contexte, d'une expression ou de tout autre élément dynamique pouvant être utilisé dans une expression AngularJS.
it: ``ng-class`` è una direttiva molto utile che consente di formattare un elemento HTML in base a un valore, al contesto, a un'espressione o a una qualsiasi altra variabile utilizzabile in un'espressione AngularJS.
nl: De ``ng-class`` richtlijn is zeer gemakkelijk wanneer een HTML-element stijl moet worden gegeven afhankelijk van een waarde, de context, een uitdrukking of alle andere dynamische zaken die gebruikt kunnen worden in AngularJS-uitdrukking.
