Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/tutorials/advanced_dashboard/advanced_dashboard.po
Languages: de, es, fr, it, nl

source: The aim is to reproduce this exact analysis with ``odsAnalysis``. As a reminder, please visit the documentation `here <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`_
de: Ziel ist es, diese genaue Analyse mit ``odsAnalysis`` wiederzugeben. Bitte lesen Sie zur Erinnerung folgende Dokumentation `hier <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`_
es: El objetivo es reproducir este análisis exacto con ``odsAnalysis``. A modo de recordatorio, consulte la documentación `aquí <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`_.
fr: L'objectif est de reproduire exactement cette analyse avec ``odsAnalysis``. Pour rappel, veuillez consulter la documentation `ici <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`_
it: L'obiettivo è riprodurre questa analisi con ``odsAnalysis``. Come promemoria, consulta la documentazione `qui <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`_.
nl: Het doel is om deze exacte analyse te reproduceren met ``odsAnalysis``. Ter herinnering: gelieve een kijkje te nemen in de documentatie `hier <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`_

source: ``odsAnalysis`` parameters :
de: ``odsAnalysis`` Parameter:
es: Parámetros de ``odsAnalysis``:
fr: Paramètres ``odsAnalysis`` :
it: Parametri ``odsAnalysis``:

source: ods-analysis : the name of the variable
de: ods-analysis: der Name der Variablen
es: ods-analysis: el nombre de la variable
fr: ods-analysis : le nom de la variable
it: ods-analysis : il nome della variabile;
nl: ods-analysis: de naam van de variabele

source: ods-analysis-context : the context to work on
de: ods-analysis-context : der Kontext, an dem zu arbeiten ist
es: ods-analysis-context: el contexto para trabajar
fr: ods-analysis-context : le contexte sur lequel travailler
it: ods-analysis-context : il contesto su cui lavorare;
nl: ods-analysis-context: de context om op te werken

source: ods-analysis-max : 10 elements max
de: ods-analysis-max : max. 10 Elemente
es: ods-analysis-max: 10 elementos máx.
fr: ods-analysis-max : 10 éléments max.
it: ods-analysis-max : limite di 10 elementi;
nl: ods-analysis-max: maximaal 10 elementen

source: ods-analysis-x : the field to work on (all aggregation will be computed for each values of this field)
de: ods-analysis-x : das Feld, an dem zu arbeiten ist (jede Aggregation wird für jeden Wert dieses Feldes berechnet)
es: ods-analysis-x: el campo para trabajar (se calculará toda la agregación para cada uno de los valores de este campo)
fr: ods-analysis-x : le champ sur lequel travailler (toutes les agrégations seront calculées pour chaque valeur de ce champ)
it: ods-analysis-x : il campo su cui lavorare (ogni aggregazione verrà calcolata su tutti i valori di questo campo);
nl: ods-analysis-x: het veld om op te werken (elke aggregatie zal berekend worden voor alle waarden van dit veld)

source: ods-analysis-serie-xxx : define a serie called xxx based on an expression (the field) and a function (AVG, MAX, MIN, SUM etc...)
de: ods-analysis-serie-xxx : definieren Sie eine Serie mit dem Namen xxx, die auf einem Ausdruck (dem Feld) und einer Funktion basiert (AVG, MAX, MIN, SUM etc.)
es: ods-analysis-serie-xxx: definir una serie denominada xxx a partir de una expresión (el campo) y una función (AVG, MAX, MIN, SUM, etc.)
fr: ods-analysis-serie-xxx : définit une série appelée xxx basée sur une expression (le champ) et sur une fonction (AVG, MAX, MIN, SUM, etc.)
it: ods-analysis-serie-xxx : definisce una serie xxx basata su un'espressione (il campo) e una funzione (AVG, MAX, MIN, SUM etc...);
nl: ods-analysis-serie-xxx: definieer een reeks met de naam xxx op basis van een uitdrukking (het veld) en een functie (AVG, MAX, MIN, SUM etc...)

source: ods-analysis-sort : sort on a serie by providing the name or -name to invert the sorting
de: ods-analysis-sort : Sortieren Sie eine Serie, indem Sie den Namen angeben bzw. den Namen für eine umgekehrte Sortierung angeben
es: ods-analysis-sort: ordenar en una serie especificando el nombre (o -nombre para invertir el orden)
fr: ods-analysis-sort : permet de trier une série en spécifiant l'argument name, ou -name pour inverser l'ordre du tri
it: ods-analysis-sort : ordina una serie specificando l'elemento name (o -name per invertire l'ordine).
nl: ods-analysis-sort: sorteer op een reeks door de naam of -naam op te geven om de sortering om te keren

source: Before jumping into the code (HTML) have a look to the result stored into the variable :
de: Bevor Sie mit dem Code (HTML) fortfahren, sehen Sie sich das in die Variable gespeicherte Ergebnis an:
es: Antes de pasar al código (HTML), examine el resultado almacenado en la variable:
fr: Avant de vous plonger dans le code (HTML), observez les résultats stockés dans la variable :
it: Prima di passare al codice HTML, osserva i risultati inclusi nella variabile:
nl: Alvorens naar de code (HTML) te gaan, neem een kijkje naar het resultaat dat opgeslagen is in de variabele:

source: Pretty print the json block :
de: Pretty Print des JSON-Blocks:
es: Una impresión del bloque json en formato bonito:
fr: Impression automatique du bloc JSON :
it: Stampa questo blocco JSON:
nl: Pretty print het json-blok:

source: We have a results json list, each block has an x value, the origin station, and 4 aggregations/values that correspond to our series. AngularJS directive ``ng-repeat`` allow to iterate over the ``results`` list. For each element, we print a new line in the table.
de: Wir haben nun eine Ergebnis-JSON-Liste, jeder Block hat einen x-Wert, den Abfahrtsbahnhof und 4 Aggregationen/Werte, die zu unseren Serien passen. Mit der AngularJS-Richtlinie ``ng-repeat`` kann die "Ergebnis"-Liste abgelaufen werden. Für jedes Element drucken wir eine neue Zeile in der Tabelle.
es: Tenemos una lista de resultados json. Cada uno de los bloques tiene un valor x, la estación de origen, y 4 agregaciones/valores que corresponden a las series. La directiva AngularJS ``ng-repeat`` permite iterar por la lista ``results``. Para cada uno de los elementos, imprimimos una línea nueva en la tabla.
fr: Nous avons une liste de résultats au format JSON, chaque bloc présente une valeur de x, la gare de départ, et 4 agrégations/valeurs correspondant à nos séries. La directive AngularJS ``ng-repeat`` permet de réaliser une itération sur la liste ``results``. Pour chaque élément, nous imprimons une nouvelle ligne dans le tableau.
it: Abbiamo un elenco di risultati in formato JSON, ogni blocco con un valore x (la stazione di partenza) e 4 aggregazioni/valori corrispondenti alle nostre serie. La direttiva AngularJS ``ng-repeat`` permette di eseguire un'iterazione sull'elenco ``results``. Per ciascun elemento, viene stampata una nuova riga nella tabella.
nl: We hebben een resultaten json-lijst, elk blok heeft een x-waarde, het vertrekstation, en 4 aggregaties/waarden die overeenstemmen met onze reeksen. De AngularJS richtlijn ``ng-repeat`` laat toe de ``resultaten`` lijst te herhalen. Voor elk element drukken we een nieuwe lijn in de tabel af.

source: Some CSS to render the HTML table nicely :
de: Ein bisschen CSS, um die HTML-Tabelle schön zu gestalten:
es: Algo de código CSS para una buena presentación de la tabla HTML:
fr: Un peu de CSS pour un beau rendu du tableau en HTML :
it: Alcuni CSS per formattare al meglio la tabella HTML:
nl: Enkele CSS om de HTML-tabel mooi te maken:

source: Save, refresh, play with filters :
de: Nachdem Sie gespeichert und aktualisiert haben, lassen Sie die Filter durchlaufen:
es: Guarde los cambios, actualice y juegue con los filtros:
fr: Enregistrez, actualisez la page et jouez avec les filtres :
it: Salva, aggiorna e gioca con i filtri a disposizione:
nl: Sla op, hernieuw, speel met filters:

source: Please have a look to the `widget list </editing_pages/integrate_content.html#widgets-list>`_ for more information.
de: Bitte sehen Sie sich die `Widget-Liste </editing_pages/integrate_content.html#widgets-list>`_ an, wenn Sie weitere Informationen wünschen.
fr: Reportez-vous à la `liste des widgets </editing_pages/integrate_content.html#widgets-list>`_ pour plus d'informations.
it: Per maggiori informazioni, consulta l'elenco completo dei `widget </editing_pages/integrate_content.html#widgets-list>`_.
nl: Neem een kijkje in de `widgetlijst </editing_pages/integrate_content.html#widgets-list>`_ voor meer informatie.

source: Dataset id : regularite-mensuelle-tgv You can search for it on `<data.opendatasoft.com>`_ Then add this dataset to your domain (New dataset, Add a source from OpenDataSoft network, pick the dataset, save, publish)
nl: Dataset-ID: regularite-mensuelle-tgv U kan dit opzoeken op `<data.opendatasoft.com>`_ Voeg deze dataset vervolgens toe aan uw domein (Nieuwe dataset, Voeg een bron uit het OpenDataSoft-netwerk toe, selecteer de dataset, sla op, publiceer)
