Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/07_configuring_visualizations/01_configuring_table_view/table.po
Languages: fr

source: Configuring the Table visualization
fr: Configurer la visualisation Tableau

source: Prerequisite
fr: Prérequis

source: For the Table visualization to be available, the dataset must contain at least 1 source.
fr: Pour que la visualisation Tableau soit disponible, le jeu de données doit contenir au moins 1 source.

source: In the edition interface of a dataset, the Visualizations > Table tab allows to configure the Table visualization displayed in the front office, once the dataset is published on the portal.
fr: Dans l'interface d'édition d'un jeu de données, l'onglet Visualisations > Tableau permet de configurer la visualisation Tableau qui s'affiche dans l'interface de navigation après la publication du jeu de données sur le portail.

source: The Table visualization cannot be disabled.
fr: La visualisation Tableau ne peut pas être désactivée.

source: To configure the Table visualization, follow the indications from the table below.
fr: Pour configurer la visualisation Tableau, suivez les indications du tableau ci-dessous.

source: Option name
fr: Nom de l'option

source: Usage
fr: Utilisation

source: Default sort
fr: Tri par défaut

source: By default, the Table visualization keeps the order of the records as it is after they have been processed. It is possible to define another default sort, by choosing a field and a sort type.
fr: Par défaut, la visualisation Tableau conserve l'ordre des enregistrements après leur traitement. Il est possible de définir un autre tri par défaut, en choisissant un champ et un type de tri.

source: Click on the "Default sort" list box.
fr: Cliquez sur le menu déroulant "Tri par défaut".

source: Choose a field from the dataset, on which the sorting will be based.
fr: Choisissez le champ du jeu de données sur lequel le tri doit être basé.

source: Click on the second list box, displayed below the first one.
fr: Cliquez sur la deuxième zone de liste qui s'affiche sous la première.

source: Choose a sort type.
fr: Choisissez une règle de tri.

source: Displayed fields
fr: Champs affichés

source: By default, the Table visualization keeps the order of the fields as it is after they have been processed. It is possible to reorder fields, as well as to hide them.
fr: Par défaut, la visualisation Tableau conserve l'ordre des enregistrements après leur traitement. Il est possible de modifier l'ordre des champs et de les masquer.

source: Reorganizing and hiding fields from the Table visualization configuration tab only changes the Table visualization displayed in the front office. In contrary to when :ref:`using the Processing tab<orderingfields>`, removing a field from the Table visualization will not remove it from the dataset itself, and it will still be available in other visualizations, as well as if the dataset is exported.
fr: En modifiant l'ordre des champs et en les masquant depuis l'onglet de configuration de la visualisation Tableau, seule la visualisation Tableau figurant dans l'interface de navigation est altérée. À l'inverse, :ref:`de l'onglet Traitement<orderingfields>`, supprimer un champ de la visualisation Tableau ne le supprimera pas du jeu de données et il restera disponible dans d'autres visualisations, ainsi que dans l'export du jeu de données.

source: To reorder fields:
fr: Pour modifier l'ordre des champs :

source: Click on a field among the list.
fr: Cliquez sur un champ dans la liste.

source: Drag and drop the field above or below another one.
fr: Glisser/déposer pour placer ce champ au-dessus ou en dessous d'un autre.

source: To hide a field from the Table visualization:
fr: Pour masquer un champ de la visualisation Tableau :

source: Find the field among the list.
fr: Cherchez le champ dans la liste.

source: Click on the X icon at the right of the field.
fr: Cliquez sur l'icône X à droite du champ.
