Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/02_integrating_content/integrate_content.po
Languages: de, es, fr, nl

source: This widget displays a wide searchbox that redirects the search on the Explore homepage of the domain.
de: Dieses Widget zeigt ein großes Suchfeld an, das die Suche auf die Explore-Homepage der Domain umleitet.
es: Este widget visualiza un cuadro de búsqueda amplio que redirige la búsqueda en la página principal Explorar del dominio.
fr: Ce widget affiche un grand champ de recherche qui redirige la recherche sur la page d'accueil Explorer du domaine.
nl: Deze widget geeft een breed zoekvak weer dat de zoekopdracht op de Explore homepagina van het domein doorstuurt.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSearchbox>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSearchbox>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSearchbox>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSearchbox>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSearchbox>`__

source: This widget displays a share button that on hover will reveal social media sharing buttons.
de: Dieses Widget zeigt eine Teilen-Schaltfläche an. Wenn Sie die Maus darüber bewegen, werden die Teilen-Schaltflächen sozialer Medien angezeigt.
es: Este widget visualiza un botón de compartir que al pasar por encima mostrará los botones de compartir en las redes sociales.
fr: Ce widget affiche un bouton de partage qui révèle les boutons de partage des différents réseaux lorsque vous passez la souris dessus.
nl: Deze widget geeft een deel-knop weer die deel-knoppen voor sociale media zal onthullen.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSocialButtons>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSocialButtons>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSocialButtons>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSocialButtons>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSocialButtons>`__

source: This widget displays the custom OpenDataSoft spinner. Its size and color match the current font's.
de: Dieses Widget zeigt das benutzerdefinierte OpenDataSoft-Steuerelement an. Größe und Farbe entsprechen der aktuellen Schriftart.
es: Este widget visualiza el control de número de OpenDataSoft personalizado. Su tamaño y color coinciden con la fuente actual.
fr: Ce widget affiche le bouton fléché OpenDataSoft personnalisé. Sa taille et sa couleur s'adaptent à la police actuelle.
nl: Deze widget geeft de aanpasbare OpenDataSoft-spinner weer. De grote en kleur ervan stemt overeen met de huidige lettertypes.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSpinner>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSpinner>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSpinner>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSpinner>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSpinner>`__

source: This widget displays a table view of a dataset, with infinite scroll and an ability to sort columns (depending on the types of the column).
de: Dieses Widget zeigt eine Tabellenansicht eines Datensatzes mit einer endlosen Scroll-Liste an, sowie die Möglichkeit, die Spalten zu sortieren (abhängig von den Spaltenarten).
es: Este widget visualiza una vista de tabla de un juego de datos, con todos los resultados en una página y la posibilidad de ordenar las columnas (según los tipos de columna).
fr: Ce widget affiche la vue tableau d'un jeu de données avec un défilement infini et la possibilité de trier les colonnes (en fonction du type des colonnes).
nl: Deze widget geeft een tabelweergave van een dataset weer met oneindige scroll en een mogelijkheid om kolommen te sorteren (afhankelijk van de soorten kolommen).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTable>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTable>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTable>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTable>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTable>`__

source: This widget displays a "tag cloud" of the values available in a facet (either the facet of a dataset, or a facet from the dataset catalog).
de: Dieses Widget zeigt eine "Tag-Cloud" der in einem Facet verfügbaren Werte an (entweder das Facet eines Datensatzes oder ein Facet aus dem Datensatzkatalog).
es: Este widget visualiza una "nube de etiquetas" de los valores disponibles en una faceta (la faceta de un juego de datos o una faceta del catálogo de juego de datos).
fr: Ce widget affiche un "nuage de tags" des valeurs disponibles dans une facette (celle d'un jeu de données ou celle d'un catalogue de jeux de données).
nl: Deze widget geeft een "tag cloud" weer van de waarden die beschikbaar zijn in een facet (ofwel de facet van een dataset of een facet uit de datasetcatalogus).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTagCloud>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTagCloud>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTagCloud>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTagCloud>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTagCloud>`__

source: This widget displays a search box that can be used to do a full-text search on a context.
de: Dieses Widget zeigt ein Suchfeld an, mit dem eine Volltextsuche in einem Kontext durchgeführt werden kann.
es: Este widget visualiza un cuadro de búsqueda que se puede utilizar para efectuar una búsqueda de texto completo en un contexto.
fr: Ce widget affiche un champ de recherche qui peut être utilisé pour des recherches en texte intégral dans un contexte.
nl: Deze widget geeft een zoekvak weer dat gebruikt kan worden om een zoekopdracht met volledige tekst uit te voeren op een context.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTextSearch>`__

source: This widget enumerates the themes available on the domain, by showing their pictos and the number of datasets they contain.
de: Dieses Widget zählt die verfügbaren Themen der Domain auf und zeigt deren Symbole sowie die Anzahl der darin enthaltenen Datensätze.
es: Este widget enumera los temas disponibles en el dominio, mostrando sus pictogramas y el número de juegos de datos que contienen.
fr: Ce widget énumère les thèmes disponibles sur le domaine en affichant leurs pictogrammes et le nombre de jeux de données qu'ils comprennent.
nl: Deze widget somt de thema's op die beschikbaar zijn op het domein, door het tonen van hun pictogrammen en het aantal datasets die ze bevatten.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemeBoxes>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemeBoxes>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemeBoxes>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemeBoxes>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemeBoxes>`__

source: This widget displays the "picto" of a theme.
de: Dieses Widget zeigt das "Pikto" (Symbol) eines Themas an.
es: Este widget visualiza el "pictograma" de un tema.
fr: Ce widget affiche le "pictogramme" d'un thème.
nl: Deze widget geeft de "picto" van een thema weer.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemePicto>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemePicto>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemePicto>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemePicto>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsThemePicto>`__

source: This widget displays two fields to select the two bounds of a date and time range.
de: Dieses Widget zeigt zwei Felder, um die beiden Grenzen eines Datums- und Zeitbereichs auszuwählen.
es: Este widget visualiza 2 campos para seleccionar los 2 límites de un rango de fecha y hora.
fr: Ce widget affiche deux champs pour sélectionner les limites des plages d'heures et de dates.
nl: Deze widget geeft de twee velden weer om de twee grenzen van een datum- en tijdbereik te selecteren.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimerange>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimerange>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimerange>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimerange>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimerange>`__

source: Displays a control to select either: last day, last week, last month or last year
de: Zeigt ein Steuerelement an, um Folgendes auszuwählen: letzter Tag, letzte Woche, letzter Monat oder letztes Jahr
es: Visualiza un control para seleccionar uno de estos: último día, última semana, último mes o último año.
fr: Affiche une option pour choisir entre : moins de 24 h, moins d'une semaine, moins d'un mois ou moins d'un an.
nl: Geeft een controle weer om ofwel laatste dag, laatste week, laatste maand of laatste jaar te selecteren.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimescale>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimescale>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimescale>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimescale>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTimescale>`__

source: This widget displays the 5 top publishers
de: Dieses Widget zeigt die 5 Top-Veröffentlicher an
es: Este widget visualiza los 5 publicadores principales.
fr: Ce widget affiche les 5 meilleurs producteurs.
nl: Deze widget geeft de 5 belangrijkste uitgevers weer

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTopPublishers>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTopPublishers>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTopPublishers>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTopPublishers>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTopPublishers>`__

source: Integrates a Twitter "widget" using the widget ID provided by Twitter.
de: Zur Integration eines "Twitter-Widgets" durch Verwendung der von Twitter bereitgestellten Widget-ID.
es: Integra un "widget" de Twitter con el ID de widget facilitado por Twitter.
fr: Intègre un "widget" Twitter grâce à l'ID du widget fourni par Twitter.
nl: Integreert een Twitter "widget" door gebruikt te maken van het widget-ID dat aangeleverd wordt door Twitter.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTwitterTimeline>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTwitterTimeline>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTwitterTimeline>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTwitterTimeline>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsTwitterTimeline>`__

source: Filters
de: Filter
es: Filtros
fr: Filtres

source: In addition to AngularJS filters, OpenDataSoft widgets library includes some additional that can be used in custom pages :
de: Zusätzlich zu den AngularJS-Filtern enthält die Widgets-Bibliothek von OpenDataSoft weitere Filter, die für benutzerdefinierte Seiten verwendet werden können:
es: Además de los filtros AngularJS, la biblioteca de widgets de OpenDataSoft incluye otros adicionales que se pueden utilizar en páginas personalizadas:
fr: En plus des filtres AngularJS, la bibliothèque de widgets d'OpenDataSoft en comprend quelques autres qui peuvent être utilisés dans les pages personnalisées :
nl: Naast AngularJS-filters, omvat de widgetsbibliotheek van OpenDataSoft enkele extra widgets die gebruikt kunnen worden in aanpasbare pagina's:

source: Creating dashboards
de: Dashboards erstellen
es: Crear paneles
fr: Créer des tableaux de bord
nl: Dashboards aanmaken

source: A step by step tutorial to create a simple dashboard with data visualization, filters, and counters.
de: Ein Schritt-für-Schritt-Tutorial, um ein einfaches Dashboard mit Datenvisualisierung, Filtern und Zählern zu erstellen.
es: Tutorial paso a paso sobre cómo crear un panel simple con visualización de datos, filtros y contadores.
fr: Un tutoriel pas à pas pour créer un tableau de bord simple avec des visualisations de données, des filtres et des compteurs.
nl: Een handleiding waarin stap voor stap wordt uitgelegd hoe een gewoon dashboard met dataweergave, filters en tellers kan worden aangemaakt.

source: Going further with advanced widgets
de: Weiter mit fortgeschrittenen Widgets
es: Continuar con los widgets avanzados
fr: Aller plus loin avec les widgets avancés
nl: Verder gaan met geavanceerde widgets
