Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/02_integrating_content/integrate_content.po
Languages: de, es, fr, nl

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeoSearch>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeoSearch>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeoSearch>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeoSearch>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeoSearch>`__

source: This directive, when used to surround a text, displays a tooltip showing a point and/or a shape in a map.
de: Wird ein Text mit dieser Richtlinie umgeben, wird ein Tooltip angezeigt, der einen Punkt und/oder eine Form auf einer Karte zeigt.
es: Cuando se utiliza para delimitar un texto, esta directiva visualiza una ayuda de herramienta que muestra un punto y/o una forma en un mapa.
fr: Lorsqu'elle encadre un texte, cette directive affiche une infobulle concernant un point ou une forme sur la carte.
nl: Deze richtlijn, wanneer deze gebruikt worden om een tekst te omringen, geeft een tooltip weer die een punt en/of een vorm in een kaart toont.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeotooltip>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeotooltip>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeotooltip>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeotooltip>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGeotooltip>`__

source: Integrates a Hubspot form given a portal ID and the form ID.
de: Integriert ein Hubspot-Formular mit einer Portal-ID und der Formular-ID.
es: Integra un formulario Hubspot a partir de un ID de portal y el ID de formulario.
fr: Intègre un formulaire Hubspot à partir de l'ID du portail et de l'ID du formulaire.
nl: Integreert een Hubspot-formulier waarbij een portaal-ID en het formulier-ID wordt gegeven.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsHubspotForm>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsHubspotForm>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsHubspotForm>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsHubspotForm>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsHubspotForm>`__

source: More information about `Hubspot <http://www.hubspot.com/>`_
de: Weitere Informationen zu `Hubspot <http://www.hubspot.com/>`_
es: Más información acerca de `Hubspot <http://www.hubspot.com/>`_
fr: Plus d'informations à propos de `Hubspot <http://www.hubspot.com/>`_
nl: Meer informatie over `Hubspot <http://www.hubspot.com/>`_

source: This widget displays the results of a query inside an infinite scroll list. It uses the HTML template inside the widget tag, and repeats it for each result.
de: Dieses Widget zeigt die Ergebnisse einer Abfrage in einer endlosen Scroll-Liste an. Es nutzt die HTML-Vorlage im Widget-Tag und wiederholt sie für jedes Ergebnis.
es: Este widget visualiza los resultados de una consulta en una lista con todos los resultados en una página. Utiliza la plantilla HTML dentro de la etiqueta de widget y la repite para cada uno de los resultados.
fr: Ce widget affiche les résultats d'une requête dans une liste à défilement infini. Il utilise le modèle HTML dans le tag du widget et le répète pour chaque résultat.
nl: Deze widget geeft de resultaten weer van een zoekopdracht in een oneindige scroll-lijst. Hij gebruikt de HTML-template in de widget tag en herhaalt deze voor elk resultaat.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsInfiniteScrollResults>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsInfiniteScrollResults>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsInfiniteScrollResults>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsInfiniteScrollResults>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsInfiniteScrollResults>`__

source: This widget displays the last datasets of a catalog (default is last 5), based on the modified metadata.
de: Dieses Widget zeigt basierend auf den geänderten Metadaten die letzten Datensätze eines Katalogs an (standardmäßig die letzten 5).
es: Este widget visualiza los últimos juegos de datos de un catálogo (valor predeterminado: 5 últimos) en función de los metadatos modificados.
fr: Ce widget affiche les derniers jeux de données d'un catalogue (par défaut les 5 derniers), en fonction des modifications des métadonnées.
nl: Deze widget geeft de laatste datasets van een catalogus weer (standaard is de laatste 5), gebaseerd op de gewijzigde metadata.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastDatasetsFeed>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastDatasetsFeed>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastDatasetsFeed>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastDatasetsFeed>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastDatasetsFeed>`__

source: This widget displays last reuses published on a domain (5 by default).
de: Dieses Widget zeigt die letzten Weiterverwendungen an, die auf einer Domain veröffentlicht wurden (standardmäßig die letzten 5).
es: Este widget visualiza las últimas reutilizaciones publicadas en un dominio (valor predeterminado: 5).
fr: Ce widget affiche les dernières réutilisations publiées sur un domaine (les 5 dernières par défaut).
nl: Deze widget geeft de laatste hergebruiken weer die gepubliceerd zijn op een domein (standaard 5).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastReusesFeed>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastReusesFeed>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastReusesFeed>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastReusesFeed>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsLastReusesFeed>`__

source: This widget allows you to build a map visualization and show data using various modes of display using layers. Each layer is based on a Dataset Context, a mode of display (clusters...), and various properties to define the display itself, such as colors.
de: Dieses Widget ermöglicht Ihnen, eine Karten-Visualisierung zu erstellen und Daten unter Einsatz unterschiedlicher Anzeigemodi und basierend auf Ebenen anzeigen zu lassen. Jede Ebene basiert auf einem Datensatz-Kontext, einem Anzeigemodus (Cluster etc.) und verschiedenen Eigenschaften, wodurch die Anzeige definiert wird, zum Beispiel die Farben.
es: Este widget permite crear una visualización de mapa y mostrar los datos en diversos modos de visualización mediante capas. Cada una de las capas se basa en un contexto de juego de datos, un modo de visualización (clústeres...) y diversas propiedades para definir la visualización en sí, como los colores.
fr: Ce widget vous permet de créer une visualisation sur carte et d'afficher les données à l'aide de différents modes d'affichage via des couches. Chaque couche s'appuie sur un contexte de jeu de données, un mode d'affichage (clusters...) et plusieurs propriétés définissant l'affichage, comme par exemple les couleurs.
nl: Met deze widget kan u een kaartweergave bouwen en data tonen door gebruik te maken van verschillende weergavemanieren met behulp van lagen. Elke laag is gebaseerd op een Dataset Context, een weergavemanier (clusters, ...) en verschillende eigenschappen om te weergave zelf te definiëren, zoals kleuren.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMap>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMap>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMap>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMap>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMap>`__

source: This widget displays an image gallery of a dataset containing media with thumbnails (images, pdf files...) with infinite scroll.
de: Dieses Widget zeigt eine Bildgalerie eines Datensatzes mit Thumbnails (Bilder, PDF-Dateien...) mit einer endlosen Scroll-Liste an.
es: Este widget visualiza una galería de imágenes de un juego de datos que contiene medios con miniaturas (imágenes, archivos pdf...) con todos los resultados en una página.
fr: Ce widget affiche une galerie d'images à défilement infini, pour un jeu de données dont les contenus disposent d'aperçus (images, fichiers pdf...).
nl: Deze widget geeft een afbeeldingengalerij van een dataset weer die media met thumbnails (afbeeldingen, pdf-bestanden, ...) bevat met oneindige scroll.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMediaGallery>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMediaGallery>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMediaGallery>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMediaGallery>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMediaGallery>`__

source: This widget displays the top datasets of a catalog (default is the 5 top datasets), based on the number of downloads.
de: Dieses Widget zeigt - basierend auf der Download-Anzahl - die Top-Datensätze eines Kataloges an (standardmäßig die ersten 5 Datensätze).
es: Este widget visualiza los juegos de datos principales de un catálogo (valor predeterminado: 5 juegos de datos principales) según el número de descargas.
fr: Ce widget affiche les jeux de données les plus populaires d'un catalogue (les 5 premiers par défaut), en fonction du nombre de téléchargements.
nl: Deze widget geeft de belangrijkste datasets van een catalogus weer (standaard de 5 belangrijkste datasets) op basis van het aantal downloads.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostPopularDatasets>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostPopularDatasets>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostPopularDatasets>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostPopularDatasets>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostPopularDatasets>`__

source: This widget displays the 5 most used themes.
de: Dieses Widget zeigt die 5 am häufigsten verwendeten Themen an.
es: Este widget visualiza los 5 temas más utilizados.
fr: Ce widget affiche les 5 thèmes les plus utilisés.
nl: Deze widget geeft de 5 meest gebruikte thema's weer.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostUsedThemes>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostUsedThemes>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostUsedThemes>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostUsedThemes>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsMostUsedThemes>`__

source: This widget displays a "picto" specified by a url and force a fill color on it. This element can be styled (height, width...), especially if the picto is vectorial (SVG).
de: Dieses Widget zeigt ein von einer URL angegebenes "Pikto" (Symbol) an und erzwingt eine Füllfarbe. Das Element kann bearbeitet (Höhe, Breite usw.) werden, insbesondere wenn es sich um eine Vektorgrafik handelt (SVG).
es: Este widget visualiza un "pictograma" especificado por una dirección URL y fuerza que se le aplique un color de relleno. Se puede personalizar el estilo de este elemento (altura, anchura...), especialmente si el pictograma es vectorial (SVG).
fr: Ce widget affiche un "pictogramme" défini par une URL et lui impose une couleur. Cet élément peut être stylisé (hauteur, largeur...), surtout si le pictogramme est vectoriel (SVG).
nl: Deze widget geeft een "picto" weer die gespecificeerd wordt door een URL en dwingt om een kleur ervoor in te vullen. Dit element kan gestyled worden (hoogte, breedte, ...), vooral wanneer de picto vectoreel is (SVG).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPicto>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPicto>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPicto>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPicto>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPicto>`__

source: Integrates a Plume Air Embed using a city name.
de: Bietet eine Plume-Air-Einbindung unter Verwendung eines Stadtnamens.
es: Integra una incrustación de Plume Air utilizando un nombre de ciudad.
fr: Affiche une intégration Plume Air pour une ville donnée.
nl: Integreert een Plume Air Embed door gebruik te maken van de naam van een stad.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPlumeAirQuality>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPlumeAirQuality>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPlumeAirQuality>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPlumeAirQuality>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsPlumeAirQuality>`__

source: More information about `Plume air <https://www.plumelabs.com/en/>`_
de: Weitere Informationen zu `Plume air <https://www.plumelabs.com/en/>`_
es: Más información acerca de `Plume Air <https://www.plumelabs.com/en/>`_
fr: Plus d'informations à propos de `Plume Air <https://www.plumelabs.com/>`_
nl: Meer informatie over `Plume air <https://www.plumelabs.com/en/>`_

source: Displays an image from a record.
de: Zeigt ein Bild aus einem Eintrag an.
es: Visualiza una imagen de un registro.
fr: Affiche une image à partir d'un enregistrement.
nl: Geeft een afbeelding uit een record weer.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRecordImage>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRecordImage>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRecordImage>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRecordImage>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRecordImage>`__

source: This widget forces a redirect to the login page of the domain if the user is not logged in.
de: Dieses Widget erzwingt eine Umleitung zur Login-Seite der Domain, wenn der Benutzer nicht angemeldet ist.
es: Este widget fuerza la redirección a la página de inicio de sesión del dominio si el usuario no tiene iniciada la sesión.
fr: Ce widget force une redirection vers la page de connexion du domaine si l'utilisateur n'est pas connecté.
nl: Deze widget forceert een doorsturing naar de inlogpagina van het domein wanneer de gebruiker niet ingelogd is.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRedirectIfNotLoggedIn>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRedirectIfNotLoggedIn>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRedirectIfNotLoggedIn>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRedirectIfNotLoggedIn>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsRedirectIfNotLoggedIn>`__

source: This widget enumerates the results of a search (records for a Dataset Context, datasets for a Catalog Context) and repeats the template (the content of the directive element) for each of them.
de: Dieses Widget zählt die Ergebnisse einer Suche auf (Einträge für einen Datensatz-Kontext, Datensätze für einen Katalog-Kontext) und wiederholt die Vorlage (den Inhalt des Richtlinienelements) für jedes einzelne.
es: Este widget enumera los resultados de una búsqueda (registros para un contexto de juego de datos y juegos de datos para un contexto de catálogo), y repite la plantilla (el contenido del elemento de directiva) para cada uno de ellos.
fr: Ce widget énumère les résultats d'une recherche (enregistrements pour un contexte de jeu de données, jeux de données pour un contexte de catalogue) et reproduit le modèle (le contenu de l'élément de la directive) pour chacun d'entre eux.
nl: Deze widget somt de resultaten op van een zoekopdracht (records voor een Dataset Context, datasets voor een Catalog Context) en herhaalt de template (de content van het richtlijnelement) voor elk ervan.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResultEnumerator>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResultEnumerator>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResultEnumerator>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResultEnumerator>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResultEnumerator>`__

source: This widget exposes the results of a search (as an array) in a variable available in the scope. It can be used with AngularJS's ngRepeat to simply build a list of results.
de: Dieses Widget stellt die Ergebnisse einer Suche (als Array) in einer Variable dar, die im Geltungsbereich verfügbar ist. Es kann gemeinsam mit ngRepeat von AngularJS genutzt werden, um eine Liste mit Ergebnissen zu erstellen.
es: Este widget expone los resultados de una búsqueda (como una matriz) en una variable disponible en el ámbito. Se puede usar junto con ngRepeat de AngularJS para crear una lista de resultados.
fr: Ce widget expose les résultats d'une recherche (sous forme de tableau) dans une variable disponible dans le scope. Il peut être utilisé avec le ngRepeat d'AngularJS pour créer facilement une liste de résultats.
nl: Deze widget geeft de resultaten weer van een zoekopdracht (als een array) in een variabele die beschikbaar is in het toepassingsgebied. Deze kan gebruikt worden met ngRepeat van AngularJS om gewoon een lijst met resultaten te bouwen.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResults>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResults>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResults>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResults>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsResults>`__

source: This widget displays all reuses published on a domain, in a infinite list of large boxes that presents them in a clear display. The lists show the more recent reuses first.
de: Dieses Widget zeigt alle auf einer Domain veröffentlichten Weiterverwendungen an, in Form einer endlosen Liste mit großen Kästen, die für eine übersichtliche Darstellung sorgen. Die Listen zeigen die neuesten Weiterverwendungen zuerst an.
es: Este widget visualiza todas las reutilizaciones publicadas en un dominio, en una lista infinita de cuadros grandes que las presenta en una visualización clara. Las listas muestran primero las reutilizaciones más recientes.
fr: Ce widget affiche toutes les réutilisations publiées sur un domaine dans une liste infinie de grands cadres qui les présentent clairement. La liste affiche les réutilisations les plus récentes en premier.
nl: Deze widget geeft alle hergebruiken weer die gepubliceerd zijn op een domein, in een oneindige lijst met grote vakken die deze weergeven in een duidelijke weergave. In de lijsten staan eerst de meest recente hergebruiken.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsReuses>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsReuses>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsReuses>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsReuses>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsReuses>`__
