Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/02_integrating_content/integrate_content.po
Languages: de, es, fr, nl

source: Integrating content
de: Inhalte integrieren
es: Integrar contenido
fr: Intégrer du contenu
nl: Content integreren

source: When editing your page in **expert mode**, you are able to integrate other content directly in your page.
de: Wenn Sie Ihre Seite im **Expertenmodus** bearbeiten, können Sie weitere Inhalte direkt in Ihre Seite integrieren.
es: Al editar la página en **modo experto**, puede integrar otro contenido directamente en la página.
fr: Quand vous éditez votre page en **mode expert**, vous pouvez directement intégrer d'autres contenus à votre page.
nl: Wanneer u uw pagina bewerkt in **expert modus**, kan u andere content rechtstreeks in uw pagina integreren.

source: Embedding an OpenDataSoft visualization
de: Einbinden einer OpenDataSoft-Visualisierung
es: Incrustar una visualización de OpenDataSoft
fr: Intégrer une visualisation OpenDataSoft
nl: Een OpenDataSoft-weergave invoegen

source: When you are browsing a visualization on an OpenDataSoft portal (including your own), you can see below a few options to share the content, including "Embed", which will provide you with a little HTML code that you can paste in your page. By doing so, you will embed the visualization inside your page.
de: Wenn Sie eine Visualisierung in einem OpenDataSoft-Portal (einschließlich Ihrem eigenen) durchsuchen, sehen Sie unten einige Optionen zum Teilen von Inhalten. Dazu gehört auch die Option "Einbetten", mit der Sie einen kleinen HTML-Code erhalten, den Sie auf Ihrer Seite einfügen können. Auf diese Weise können Sie die Visualisierung in Ihre Seite einbinden.
es: Cuando explore una visualización en un portal OpenDataSoft (incluido el suyo propio), podrá ver en la parte inferior algunas opciones para compartir el contenido, como "Incrustar", que le suministrará un código HTML para pegar en la página. Con esta operación, incrustará la visualización en la página.
fr: Plusieurs options de partage sont disponibles en dessous des visualisations sur les portails OpenDataSoft (le vôtre inclut). Parmi elles, l'option " Intégrer " crée un petit code HTML que vous pouvez coller sur votre page, intégrant ainsi la visualisation à celle-ci.
nl: Wanneer u een weergave op een OpenDataSoft-portaal (inclusief uw eigen portaal) doorbladert, kan u onderaan enkele opties zien om de content te delen, waaronder "Invoegen", die u een kleine HTML-code zal geven die u in uw pagina kan plakken. Hiermee kan u de weergave in uw pagina invoegen.

source: Embedding a Twitter timeline
de: Eine Twitter-Timeline einbinden
es: Incrustar una línea de tiempo de Twitter
fr: Intégrer un fil d'actualité Twitter
nl: Een Twitter-tijdslijn invoegen

source: If you have an account on Twitter, you can create Twitter "widgets" from your Twitter account page, which are designed to be integrated in other websites (like a blog). When you create a widget, Twitter provides you with a little "code" to paste in your HTML code. Due to security concerns, JavaScript is blocked in OpenDataSoft pages editor, so you can't directly use the code provided by Twitter. However, we provide an OpenDataSoft widget to achieve this instead.
de: Wenn Sie ein Konto bei Twitter haben, können Sie über die Seite Ihres Twitter-Kontos "Widgets" erstellen, die anschließend in andere Websites (z. B. einen Blog) eingebunden werden können. Wenn Sie ein Widget erstellen, erhalten Sie einen kleinen "Code" von Twitter, den Sie in Ihren HTML-Code einfügen können. Aus Sicherheitsgründen ist JavaScript im OpenDataSoft-Seiteneditor gesperrt, weshalb Sie den von Twitter bereitgestellten Code nicht direkt einbinden können. Zu diesem Zweck stellen wir ein OpenDataSoft-Widget zur Verfügung.
es: Si tiene una cuenta en Twitter desde su página de la cuenta Twitter, puede crear "widgets" de Twitter, diseñados para integrarse en otros sitios web (como un blog). Al crear un widget, Twitter le suministra un "código" para pegar en el código HTML. Por motivos de seguridad, JavaScript está bloqueado en el editor de páginas de OpenDataSoft, por lo que no podrá emplear directamente el código facilitado por Twitter. Sin embargo, en su lugar le ofrecemos un widget de OpenDataSoft con este fin.
fr: Si vous disposez d'un compte Twitter, vous pouvez créer des "widgets" Twitter depuis la page de votre compte. Ces derniers sont conçus pour être intégrés à d'autres sites Web (des blogs par exemple). Lorsque vous créez un widget, Twitter vous donne un petit "code" à coller dans votre code HTML. Pour des raisons de sécurité, JavaScript est bloqué dans l'éditeur de pages OpenDataSoft, il vous est donc impossible d'utiliser directement le code généré par Twitter. Nous vous fournissons donc un widget OpenDataSoft spécial à cet effet.
nl: Wanneer u een Twitter-account heeft, kan u Twitter "widgets" aanmaken vanuit de accountpagina van Twitter die speciaal ontwikkeld zijn om geïntegreerd te worden in andere websites (zoals een blog). Wanneer u een widget aanmaakt, geeft Twitter u een kleine "code" die u in uw HTML-code kan plakken. Uit veiligheidsoverwegingen is JavaScript geblokkeerd in de pagina editor van OpenDataSoft, dus kan u de code die gegeven wordt door Twitter niet rechtstreeks gebruiken. Wel bieden we u OpenDataSoft-widget om dit te doen.

source: First, you need to capture the "Widget ID", which is present in the first line of the code, in the ``data-widget-id`` attribute:
de: Zunächst müssen Sie die "Widget ID" erfassen, die in der ersten Zeile des Codes enthalten ist, im Attribut "data-widget-id":
es: En primer lugar, tiene que capturar el "ID de widget", que aparece en la primera línea del código, en el atributo ``data-widget-id``:
fr: Vous devez d'abord récupérer "l'ID de widget" qui se trouve dans la première ligne du code, dans l'attribut ``data-widget-id`` :
nl: Eerst moet u het "Widget-ID" terugvinden dat in de eerste lijn van de code staat in het attribuut ``data-widget-id``:

source: In this example, the Widget ID is "12341234123412341234".
de: Im vorliegenden Beispiel lautet die Widget ID "12341234123412341234".
es: En este ejemplo, el ID de widget es "12341234123412341234".
fr: Dans cet exemple, l'ID de widget est "12341234123412341234".
nl: In dit voorbeeld is het Widget-ID "12341234123412341234".

source: Then, add this widget in your page, using your Widget ID in the ``widget-id`` attribute:
de: Fügen Sie das Widget anschließend in Ihre Seite ein, indem Sie die Widget-ID im Attribut "widget-id" verwenden:
es: A continuación, añada este widget en la página, utilizando el ID de widget del atributo ``widget-id``:
fr: Ajoutez ensuite ce widget à votre page en indiquant l'ID de widget dans l'attribut ``widget-id`` :
nl: Voeg vervolgens deze widget toe in uw pagina met behulp van uw Widget-ID in het attribuut ``widget-id``:

source: Embedding other third-party content
de: Einbindung anderer Inhalte von Drittanbietern
es: Incrustar otro contenido de terceros
fr: Intégrer d'autres contenus tiers
nl: Content van derden invoegen

source: Services like YouTube often provides ways to embed their content into other websites, under the form of a pastable code. Due to security concerns, we don't allow users to write JavaScript into pages, and some of these embed codes may be done in JavaScript, which would therefore not work on our pages; but most services provide a code based on "iframes" which is fine. Working embeds include YouTube, Vimeo, or Dailymotion.
de: Dienste wie YouTube bieten oft Möglichkeiten, ihre eigenen Inhalte in andere Websites einzubinden, und bieten zu diesem Zweck einen Code, der kopiert/eingefügt werden kann. Aus Sicherheitsgründen erlauben wir Benutzern nicht das Schreiben von JavaScript auf unseren Seiten. Einige der genannten Codes wurden möglicherweise in JavaScript erstellt und funktionieren deshalb auf unseren Seiten nicht. Doch die meisten Dienste bieten einen Code auf Grundlage von "iframes", der keine Probleme bereitet. Auf diese Weise können etwa Inhalte von YouTube, Vimeo oder Dailymotion eingebunden werden.
es: Servicios como YouTube a menudo proporcionan métodos para incrustar su contenido en otros sitios web en forma de código listo para pegar. Por motivos de seguridad, no permitimos a los usuarios escribir código JavaScript en las páginas, y puede que algunos de estos códigos incrustados estén en JavaScript, de modo que no funcionarán en nuestras páginas; pero la mayoría de los servicios proporciona código basado en "iframes" que sí funciona. Entre las incrustaciones válidas se encuentran las de YouTube, Vimeo o Dailymotion.
fr: Des services tels que YouTube proposent des codes à coller pour intégrer le contenu qu'ils hébergent dans d'autres sites Web. Pour des raisons de sécurité, nous n'autorisons pas les utilisateurs à écrire du JavaScript dans les pages et certains de ces codes d'intégration peuvent avoir été écrits en JavaScript. Ces codes ne fonctionneront donc pas sur nos pages, mais la majorité des services proposent des codes basés sur des "iframes", qui eux fonctionnent très bien. Les intégrations possibles incluent Youtube, Vimeo ou encore Dailymotion.
nl: Diensten, zoals YouTube voorzien vaak manieren om hun content in te voegen in andere websites onder de vorm van een plakbare code. Uit veiligheidsoverwegingen laten we gebruikers niet toe om JavaScript te schrijven in pagina's en mogelijk zijn sommige van deze invoegcodes opgemaakt in JavaScript, waardoor deze niet zullen werken op uw pagina's. De meeste diensten voorzien evenwel een code die gebaseerd is op "iframes", wat ok is. Werkende embeds omvatten YouTube, Vimeo of Dailymotion.

source: Using widgets
de: Widgets nutzen
es: Utilizar widgets
fr: Utiliser des widgets
nl: Widgets gebruiken

source: When editing your page content in expert mode, you may want to use the ODS-Widgets library, which is a set of components, available as HTML elements, allowing you to natively integrate data visualizations in your page code, and building interactive pages by combining widgets together.
de: Wenn Sie den Inhalt Ihrer Seite im Expertenmodus bearbeiten, können Sie die ODS-Widgets-Bibliothek nutzen. Hier finden Sie unterschiedliche Komponenten im HTML-Format, mit denen Sie Datenvisualisierungen nativ in Ihren Seitencode integrieren können. So können Sie interaktive Seiten erstellen, indem Sie unterschiedliche Widgets miteinander kombinieren.
es: Al editar el contenido de la página en modo experto, tal vez desee utilizar la biblioteca ODS-Widgets, que es un conjunto de componentes disponibles en forma de elementos HTML que permiten integrar visualizaciones de datos de forma nativa en el código de la página, así como crear páginas interactivas combinando varios widgets.
fr: Lorsque vous éditez le contenu de votre page en mode expert, vous pouvez utiliser la bibliothèque ODS-Widgets. Celle-ci est en fait un ensemble de composants, disponibles sous la forme d'éléments HTML, qui vous permettent d'intégrer des visualisations de données dans le code votre page de manière native et de créer des pages interactives en combinant différents widgets.
nl: Wanneer u uw paginacontent bewerkt in expert modus, wil u misschien gebruik maken van de ODS-Widgets bibliotheek. Dit is een reeks componenten, die beschikbaar zijn als HTML-elementen en die u toelaten dataweergaves te integreren in uw paginacode en interactieve pagina's te bouwen door widgets te combineren.

source: The ODS-Widgets library is an open source, AngularJS-based framework developed and maintained by OpenDataSoft on `GitHub <https://github.com/opendatasoft/ods-widgets>`_. It comes with a complete and comprehensive `online documentation <https://opendatasoft.github.io/ods-widgets/docs/>`_.
de: Die ODS-Widgets-Bibliothek ist ein Open-Source-Framework auf Grundlage von AngularJS, das OpenDataSoft auf `GitHub <https://github.com/opendatasoft/ods-widgets>`_ entwickelt und wartet. Begleitet wird die Bibliothek von einer vollständigen und umfassenden `Online-Dokumentation <https://opendatasoft.github.io/ods-widgets/docs/>`_.
es: La biblioteca ODS-Widgets es un marco de código abierto basado en AngularJS, desarrollado y mantenido por OpenDataSoft en `GitHub <https://github.com/opendatasoft/ods-widgets>`_. Incorpora una extensa y completa `documentación en línea <https://opendatasoft.github.io/ods-widgets/docs/>`_.
fr: ODS-Widgets est une bibliothèque open source basée sur le framework AngularJS, développée et maintenue par OpenDataSoft sur `GitHub <https://github.com/opendatasoft/ods-widgets>`_. Elle s'accompagne d'une `documentation en ligne <https://opendatasoft.github.io/ods-widgets/docs/>`_ complète et exhaustive.
nl: De ODS-Widgets bibliotheek is een open source, AngularJS-gebaseerd kader dat door OpenDataSoft ontwikkeld en onderhouden wordt op `GitHub <https://github.com/opendatasoft/ods-widgets>`_. Ze beschikt over een volledige en allesomvattende `online documentatie <https://opendatasoft.github.io/ods-widgets/docs/>`_.

source: It can be used directly in your domain's content pages, or in third party Web sites as a standalone toolkit.
de: Sie kann direkt in den Seiten mit Inhalten Ihrer Domain genutzt werden. Alternativ kann sie in Drittanbieter-Websites als eigenständiges Toolkit verwendet werden.
es: Puede usarse directamente en las páginas de contenido del dominio, o en sitios web de terceros como un kit de herramientas independiente.
fr: Vous pouvez l'utiliser directement dans les pages de contenu de votre domaine comme dans des pages externes sur des sites Web tiers en la traitant comme une boîte à outils indépendante.
nl: Ze kan rechtstreeks gebruikt worden in de contentpagina's van uw domein of in websites van derden als een stand-alone toolkit.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Despite being based on AngularJS, the ODS-Widgets is designed to be used as a set of HTML elements, and are therefore entirely used in HTML code, with no JavaScript to write. It is therefore usable by anyone with a few notions of HTML, and doesn't require development skills. Moreover, many visualizations from OpenDataSoft provide the equivalent widgets code in real time when you use them from the portal, so you can learn by starting from the result of a visualization and iterate from there.
de: Auch wenn die ODS-Widgets auf AngularJS basieren, wurden sie entwickelt, um wie HTML-Elemente eingesetzt zu werden. Sie werden daher komplett in Form eines HTML-Codes verwendet, ohne dass JavaScript geschrieben werden müsste. So können sie von jedermann mit einigen HTML-Kenntnissen genutzt werden, ohne dass spezielle Entwicklungsfähigkeiten nötig wären. Darüber hinaus stellen viele Visualisierungen von OpenDataSoft den entsprechenden Widgets-Code in Echtzeit zur Verfügung. So können Sie auf Grundlage der Ergebnisse Erfahrungen sammeln und von dort aus iterieren.
es: Pese a basarse en AngularJS, ODS-Widgets se ha concebido para usar como un conjunto de elementos HTML; por consiguiente, se utilizan íntegramente en código HTML, sin JavaScript. Por lo tanto, cualquier usuario con nociones de HTML podrá utilizarlo, sin que requiera habilidades de desarrollo. Además, como muchas visualizaciones de OpenDataSoft proporcionan el código equivalente de los widgets en tiempo real cuando se utilizan en el portal, puede aprender empezando con el resultado de una visualización e iterando desde ahí.
fr: Même si elle se base sur AngularJS, la bibliothèque ODS-Widgets est conçue pour être utilisée comme un ensemble d'éléments HTML, elle est donc intégralement opérée en HTML, sans nécessiter d'écriture en JavaScript. Par conséquent, elle est accessible à quiconque ayant quelques notions en HTML et ne requiert pas de compétences en développement. De plus, beaucoup de visualisations d'OpenDataSoft indiquent le code des widgets correspondant en temps réel lorsque vous les utilisez sur le portail. Vous pouvez donc apprendre en observant le résultat d'une visualisation et en remontant à partir de là.
nl: Ondanks het feit dat ze gebaseerd zijn op AngularJS, zijn ODS-Widgets ontwikkeld om gebruik te worden als een reeks HTML-elementen en kunnen ze daardoor volledig gebruikt worden in HTML-code, zonder dat JavaScript moet geschreven worden. Daardoor kunnen ze door iedereen die enkele noties heeft van HTML gebruikt worden en vereisen ze geen ontwikkelingsvaardigheden. Bovendien verschaffen vele weergaves uit OpenDataSoft de equivalente widgetscode in real time wanneer u deze gebruikt vanuit het portaal. Dus kan u leren door te starten vanuit het resultaat van een weergave en van daaruit herhalen.

source: On top of all the widgets offered by the `ods-widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ library, a few additional directives are available for use within the content pages on the platform. Contrary to the widgets, these cannot be used on third-party websites for they are tightly coupled with the platform.
de: Zusätzlich zu allen Widgets, die in der `ODS-Widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ Bibliothek angeboten werden, stehen einige Richtlinien zur Verwendung auf den Inhaltsseiten auf der Plattform zur Verfügung. Im Gegensatz zu den Widgets können diese nicht auf Drittanbieter-Websites verwendet werden, denn sie sind eng mit der Plattform verbunden.
es: Además de todos los widgets que ofrece la biblioteca `ods-widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_, algunas directivas adicionales están disponibles para el uso en las páginas de contenido de la plataforma. A diferencia de los widgets, estas no se pueden usar en sitios web de terceros ya que están estrechamente unidas a la plataforma.
fr: En plus des widgets offerts par la bibliothèque `ods-widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_, quelques directives supplémentaires qui peuvent être utilisés au sein des pages de contenu sur la plateforme. Contrairement aux widgets, elles ne peuvent en revanche pas être utilisées sur des sites tiers car elles sont intimement liées à la plateforme.
nl: Naast alle widgets die aangeboden worden door de `ods-widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ bibliotheek, zijn er enkele bijkomende richtlijnen beschikbaar om te worden gebruikt binnen de contentpagina's op het platform. In tegenstelling tot de widgets, kunnen deze niet gebruikt worden op websites van derden aangezien deze strak gekoppeld zijn met het platform.

source: Widgets list
de: Liste der Widgets
es: Lista de widgets
fr: Liste des widgets
nl: Lijst met widgets

source: This widget exposes the results of an aggregation function on a dataset field. Can be used for example to expose the average temperature of a weather dataset. The result is exposed into a new variable that you can use in other widgets or directly in your HTML.
de: Dieses Widget stellt die Ergebnisse einer Kumulationsfunktion in einem Datensatzfeld dar. Kann beispielsweise dazu verwendet werden, um die durchschnittliche Temperatur eines Wetter-Datensatzes darzustellen. Das Ergebnis wird in einer neuen Variable dargestellt, die Sie in anderen Widgets oder direkt in Ihrem HTML einsetzen können.
es: Este widget expone los resultados de una función de agregación en un campo de juego de datos. Por ejemplo, se puede usar para exponer la temperatura promedio de un juego de datos de meteorología. El resultado se expone en una variable nueva que se puede usar en otros widgets o directamente en el código HTML.
fr: Ce widget expose les résultats d'une fonction d’agrégation appliquée sur un champ d'un jeu de données. Il peut être utilisé pour exposer la température moyenne d'un jeu de données météorologique par exemple. Le résultat est présenté sous la forme d'une nouvelle variable qui peut être utilisée dans un autre widget ou directement intégrée dans votre code HTML.
nl: Deze widget toont de resultaten van een aggregatiefunctie op een datasetveld. Kan bijvoorbeeld gebruikt worden om de gemiddelde temperatuur van een weerdataset weer te geven. Het resultaat wordt weergegeven in een nieuwe variabele die u in andere widgets of rechtstreeks in uw HTML kan gebruiken.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAggregation>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAggregation>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAggregation>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAggregation>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAggregation>`__

source: This widget exposes the results of multiple aggregation based on an axis. Like for a chart, for each value of the X axis, it computes aggregation functions. It can be used with AngularJS's ngRepeat to simply build a table of analysis results.
de: Dieses Widget stellt die Ergebnisse einer mehrfachen Aggregation auf Grundlage einer Achse dar. Wie für ein Diagramm werden für jeden Wert der X-Achse die Kumulationsfunktionen berechnet. Es kann gemeinsam mit ngRepeat von AngularJS genutzt werden, um eine Tabelle mit Analyseergebnissen zu erstellen.
es: Este widget expone los resultados de varias agregaciones en un eje. Como en un gráfico, para cada uno de los valores del eje X, calcula las funciones de agregación. Se puede usar junto con ngRepeat de AngularJS para crear una tabla de los resultados de análisis.
fr: Ce widget expose les résultats de plusieurs fonctions d'agrégation en se basant sur un axe. Comme pour un graphe, il calcule les fonctions d'agrégation pour chaque valeur de l'axe des abscisses. Il peut être utilisé avec le ngRepeat d'AngularJS pour créer facilement un tableau de résultats d'analyses.
nl: Deze widget toont de resultaten van meervoudige aggregatie op basis van een as. Net zoals voor een grafiek berekent ze voor elke waarde van de X-as aggregatiefuncties. Deze kan gebruikt worden met ngRepeat van AngularJS om gewoon een tabel met analyseresultaten te bouwen.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysis>`__

source: Linked to `odsAnalysisSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysisSerie>`_
de: Verbunden mit `odsAnalysisSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysisSerie>`_
es: Relacionado con `odsAnalysisSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysisSerie>`_
fr: En lien avec `odsAnalysisSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysisSerie>`_
nl: Gekoppeld aan `odsAnalysisSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsAnalysisSerie>`_
