Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content/02_integrating_content/integrate_content.po
Languages: de, es, fr, nl

source: Integrates a Breezometer "widget" using the widget key provided by Breezometer
de: Zur Integration eines "Breezometer-Widgets" durch Verwendung des von Breezometer bereitgestellten Widget-Schlüssels
es: Integra un "widget" de Breezometer utilizando la clave de widget facilitada por Breezometer.
fr: Intègre un "widget" Breezometer grâce à la clé de widget fournie par Breezometer.
nl: Integreert een Breezometer "widget" met behulp van de widgetsleutel die verschaft wordt door Breezometer

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsBreezometer>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsBreezometer>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsBreezometer>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsBreezometer>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsBreezometer>`__

source: This widget can take any dataset containing at least two datetime fields and a text field and use it to display a calendar. It can load at most 1000 events (records) at once.
de: Dieses Widget kann jeden Datensatz, der mindestens zwei datetime-Felder und ein Textfeld enthält, zur Anzeige eines Kalenders nutzen. Es kann maximal 1000 Ereignisse (Einträge) auf einmal laden.
es: Este widget puede tomar cualquier juego de datos que contenga como mínimo 2 campos de fecha y hora y 1 campo de texto, y utilizarlo para visualizar un calendario. Puede cargar 1.000 eventos (registros) a la vez como máximo.
fr: Ce widget peut créer un calendrier à partir de n'importe quel jeu de données contenant au moins deux champs de type datetime et un champ de texte. Il peut charger au maximum 1 000 événements (enregistrements à la fois.
nl: Deze widget kan elke dataset nemen die minstens twee datumtijdvelden en een tekstveld bevat en deze gebruiken om een kalender weer te geven. Deze kan in één keer maximaal 1000 gebeurtenissen (records) laden.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCalendar>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCalendar>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCalendar>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCalendar>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCalendar>`__

source: A "catalog context" represents the entire catalog (list) of datasets from a given domain, and a set of parameters used to query this catalog.
de: Ein "Katalogkontext" stellt den gesamten Katalog (Liste) mit Datensätzen einer bestimmten Domain dar, sowie einen Parametersatz, der zur Abfrage des Katalogs verwendet wird.
es: Un "contexto de catálogo" representa todo el catálogo (lista) de juegos de datos de un dominio específico, y un conjunto de parámetros utilizados para consultar este catálogo.
fr: Un "contexte de catalogue" représente le catalogue (liste) complet des jeux de données d'un domaine et un ensemble de paramètres servant à interroger ce catalogue.
nl: Een "cataloguscontext" vertegenwoordigt de volledige catalogus (lijst) van datasets uit een welbepaald domein en een reeks parameters die gebruikt worden op zoekopdrachten uit te voeren in deze catalogus.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCatalogContext>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCatalogContext>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCatalogContext>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCatalogContext>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsCatalogContext>`__

source: This widget is the base widget allowing to display charts from OpenDataSoft datasets. A Chart is defined by one or more series that get there data from form one or more dataset represented by an Dataset Context, a type of chart and multiple parameters to fine tune the appearance of chart.
de: Bei diesem Widget handelt es sich um das Basiswidget zur Anzeige von Diagrammen aus OpenDataSoft-Datensätzen. Ein Diagramm wird durch eine oder mehrere Verbindungslinien definiert, die ihre Daten von einem/mehreren Datensätzen beziehen. Diese wiederum werden durch einen Datensatz-Kontext repräsentiert, also einem Diagrammtyp und mehreren Parametern zur Abstimmung der Diagrammdarstellung.
es: Este widget es el widget de base que permite visualizar gráficos a partir de juegos de datos de OpenDataSoft. Un gráfico se define mediante una o varias series que obtienen sus datos de uno o varios juegos de datos representados por un contexto de juego de datos, un tipo de gráfico y varios parámetros para la personalización de la apariencia del gráfico.
fr: C'est le widget de base qui vous permet de créer des graphes à partir des jeux de données OpenDataSoft. Un graphe se compose d'une ou de plusieurs séries issues d'un ou de plusieurs jeux de données représentés par un contexte de jeu de données, avec un type de graphe défini et de multiples paramètres permettant d'affiner l’apparence du graphe.
nl: Deze widget is de basiswidget waarmee grafieken uit OpenDataSoft-datasets kunnen worden weergegeven. Een grafiek wordt gedefinieerd door één of meerdere reeksen die hun data krijgen uit één of meerdere datasets die vertegenwoordigd worden door een Dataset Context, een type grafiek en meerdere parameters om het voorkomen van de grafiek te finetunen.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChart>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChart>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChart>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChart>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChart>`__

source: Linked to `odsChartQuery <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartQuery>`_ and `odsChartSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartSerie>`_
de: Verbunden mit `odsChartQuery <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartQuery>`_ und `odsChartSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartSerie>`_
es: Relacionado con `odsChartQuery <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartQuery>`_ y `odsChartSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartSerie>`_
fr: En lien avec `odsChartQuery <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartQuery>`_ et `odsChartSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartSerie>`_
nl: Gekoppeld aan `odsChartQuery <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartQuery>`_ en `odsChartSerie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsChartSerie>`_

source: This widget displays a button which will clear all active filters in the given context.
de: Dieses Widget zeigt eine Schaltfläche an, mit der alle aktiven Filter im gegebenen Kontext gelöscht werden.
es: Este widget visualiza un botón que borrará todos los filtros activos de un contexto específico.
fr: Ce widget affiche un bouton permettant d'effacer tous les filtres actifs dans le contexte donné.
nl: Deze widget toont een knop die alle actieve filters in de gegeven context zal wissen.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsClearAllFilters>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsClearAllFilters>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsClearAllFilters>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsClearAllFilters>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsClearAllFilters>`__

source: If you wrap this directive around an element or a set of element, it will display an expandable card above it to show the title and description of the dataset, along with a link to the portal that shows the dataset, and the license attached to the data.
de: Wenn Sie ein Element oder eine Reihe von Elementen mit dieser Richtlinie umhüllen, wird eine erweiterbare Karte darüber angezeigt, in der Titel und Beschreibung des Datensatzes sowie ein Link zum Portal (auf dem der Datensatz dargestellt wird) und die zu den Daten gehörende Lizenz zu sehen sind.
es: Si esta directiva envuelve un elemento o un conjunto de elementos, se visualizará una tarjeta ampliable sobre este para mostrar el título y la descripción del juego de datos, junto con un vínculo con el portal que visualiza el juego de datos, y la licencia asociada a los datos.
fr: Si vous enveloppez un ou plusieurs éléments dans cette directive, elle affichera une carte au-dessus de celui-ci. Celle-ci peut être développée pour afficher le titre et la description du jeu de données, un lien vers le portail sur lequel le jeu de données est exposé et la licence rattachée aux données.
nl: Wanneer u deze richtlijn rond een element of een reeks elementen vouwt, geeft deze een uitrekbare kaart erboven weer om de titel en de beschrijving van de dataset te tonen, samen met een koppeling naar het portaal dat de dataset en de licentie die verbonden is aan de data toont.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetCard>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetCard>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetCard>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetCard>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetCard>`__

source: A "dataset context" represents a dataset, and a set of parameters used to query its data. A context can be used by one or more directives, so that they can share information (generally the query parameters).
de: Ein "Datensatz-Kontext" stellt einen Datensatz dar sowie einen Parametersatz, der zur Abfrage der Daten verwendet wird. Ein Kontext kann von einer oder mehreren Richtlinien zur gemeinsam Nutzung von Informationen (in der Regel die Abfrageparameter) verwendet werden.
es: Un "contexto de juego de datos" representa un juego de datos, y un conjunto de parámetros utilizados para consultar sus datos. Un contexto puede ser usado por una o varias directivas, a fin de compartir información (habitualmente, los parámetros de consulta).
fr: Le "contexte d'un jeu de données" représente un jeu de données et un ensemble de paramètres servant à interroger ses données. Un contexte peut être utilisé par une ou plusieurs directives afin qu'elles puissent partager des informations (les paramètres des requêtes le plus souvent).
nl: Een "datasetcontext" vertegenwoordigt een dataset en een reeks parameters die gebruikt worden om zoekopdrachten uit te voeren op deze data. Een context kan gebruikt worden door één of meerdere richtlijnen zodat deze informatie kunnen delen (meestal de parameters van de zoekopdracht).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatasetContext>`__

source: Get the ISO local datetime and store it into a variable (into the scope).
de: Erhalten Sie die lokale ISO-datetime und speichern Sie den Wert in Form einer Variable (in den Geltungsbereich).
es: Obtenga la fecha y hora local ISO y almacénela en una variable (en el ámbito).
fr: Récupère l'heure et la date ISO locales et les stocke dans une variable (dans le scope).
nl: Geeft de lokale ISO datumtijd en slaat deze op in een variabele (in het toepassingsgebied).

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatetime>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatetime>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatetime>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatetime>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDatetime>`__

source: This widget shows a Disqus panel where users can comment the page.
de: Dieses Widget zeigt ein Disqus-Fenster an, in dem Nutzer die Seite kommentieren können.
es: Este widget muestra un panel de Disqus en que los usuarios pueden comentar la página.
fr: Ce widget affiche un volet Disqus pour permettre aux utilisateurs de commenter la page.
nl: Deze widget toont een Disqus-paneel waar gebruikers commentaar kunnen geven op de pagina.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDisqus>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDisqus>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDisqus>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDisqus>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDisqus>`__

source: More information about `Configuring disqus` /!\ to be written
de: Weitere Informationen zu `Disqus konfigurieren` /!\ werden verfasst
es: Más información acerca de `Configurar Disqus` /!\ pendiente de escribir
fr: Plus d'informations sur la `Configuration de disqus` /!\ à écrire.
nl: Meer informatie over `Disqus configereren` /!\ nog te schrijven

source: This widget enumerates statistic values for a given catalog and injects them as variables in the context.
de: Dieses Widget zählt statistische Werte für einen bestimmten Katalog auf und speist sie als Variablen in den Kontext ein.
es: Este widget enumera los valores estadísticos de un catálogo específico y los inserta como variables en el contexto.
fr: Ce widget énumère les valeurs statistiques d'un catalogue donné et les injecte dans le contexte sous forme de variables.
nl: Deze widget somt statistische waarden op voor een welbepaalde catalogus en injecteert deze als variabelen in de context.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDomainStatistics>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDomainStatistics>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDomainStatistics>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDomainStatistics>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsDomainStatistics>`__

source: This widget fetches the results of enumerating the values ("categories") of a facet, and exposes it in a variable available in the scope. It can be used with AngularJS's ngRepeat to simply build a list of results.
de: Dieses Widget erfasst die Ergebnisse der Aufzählung der Werte ("Kategorien") eines Facets und stellt sie in einer Variable dar, die im Geltungsbereich verfügbar ist. Es kann gemeinsam mit ngRepeat von AngularJS genutzt werden, um eine Liste mit Ergebnissen zu erstellen.
es: Este widget captura los resultados de la enumeración de los valores ("categorías") de una faceta, y los expone en una variable disponible en el ámbito. Se puede usar junto con ngRepeat de AngularJS para crear una lista de resultados.
fr: Ce widget récupère les résultats d'énumération des valeurs ("catégories") d'une facette et les expose dans une variable disponible dans le scope. Il peut être utilisé avec le ngRepeat d'AngularJS pour créer facilement une liste de résultats.
nl: Deze widget haalt de resultaten op van het opsommen van de waarden ("categorieën") van een facet en stelt deze voor in een variabele die beschikbaar is in het toepassingsgebied. Deze kan gebruikt worden met ngRepeat van AngularJS om gewoon een lijst met resultaten te bouwen.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacetResults>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacetResults>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacetResults>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacetResults>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacetResults>`__

source: This widget displays filters (facets) for a dataset or a domain's catalog of datasets, allowing the users to dynamically "refine" on one or more categories for the context.
de: Dieses Widget zeigt Filter (Facets) für einen Datensatz oder einen Katalog mit Datensätzen einer Domain an. So können Benutzer eine oder mehrere Kategorien für den Kontext dynamisch "verfeinern".
es: Este widget visualiza los filtros (facetas) de un juego de datos o el catálogo de juegos de datos de un dominio, lo que permite a los usuarios "refinar" dinámicamente en una o más categorías del contexto.
fr: Ce widget affiche des filtres (facettes) pour un jeu de données ou le catalogue de jeux de données du domaine, permettant aux utilisateurs "d'affiner" leurs recherches de manière dynamique en fonction d'une ou de plusieurs catégories du contexte.
nl: Deze widget geeft filters (facetten) weer voor een dataset of een catalogus van datasets van een domein waardoor de gebruikers dynamisch kunnen "verfijnen" op één of meerdere categorieën voor de context.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFacets>`__

source: This widget displays a summary of all the active filters on a context: text search, refinements...
de: Dieses Widget zeigt eine Zusammenfassung aller aktiven Filter eines Kontexts an: Textsuche, Verfeinerungen...
es: Este widget visualiza un resumen de todos los filtros activos en un contexto: búsqueda de texto, refinamientos...
fr: Ce widget affiche un résumé de tous les filtres actifs sur un contexte : recherche de texte, affinage...
nl: Deze widget geeft een samenvatting weer van alle actieve filters op een context: zoekopdracht van tekst, verfijningen, ...

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFilterSummary>`__
de: `Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFilterSummary>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFilterSummary>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFilterSummary>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsFilterSummary>`__

source: This widget displays a gauge in one of the two following modes: circle or horizontal bar. The widget relies on CSS3 and SVG and as a result is entirely customizable in CSS.
de: Dieses Widget zeigt einen Maßstab in einem der folgenden Modi an: Kreis oder horizontaler Balken. Das Widget stützt sich auf CSS3 und SVG und ist damit vollständig in CSS anpassbar.
es: Este widget visualiza un medidor de uno de los 2 modos siguientes: círculo o barra horizontal. El widget utiliza CSS3 y SVG y, por consiguiente, es totalmente personalizable en CSS.
fr: Ce widget affiche une jauge sous la forme d'un disque ou d'une barre horizontale. Il repose sur CSS3 et SVG, ce qui le rend totalement personnalisable en CSS.
nl: Deze widget geeft een peilstok weer op één van de volgende twee manieren: cirkel of horizontale balk. De widget berust op CSS3 en SVG en het gevolg hiervan is dat deze volledig kan worden aangepast in CSS.

source: `Full documentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGauge>`__
de: Vollständige Dokumentation <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGauge>`__
es: `Documentación completa de <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGauge>`__
fr: `Documentation complète <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGauge>`__
nl: `Volledige documentatie <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsGauge>`__

source: This widget displays a mini map with a draw-rectangle tool that can be used to search through a catalog.
de: Dieses Widget zeigt eine Mini-Karte mit einem Tool zum Zeichnen von Rechtecken, mit dem ein Katalog durchsucht werden kann.
es: Este widget visualiza un minimapa con una herramienta de dibujo de rectángulo que se puede emplear para buscar en un catálogo.
fr: Ce widget affiche une mini-carte avec un outil permettant de dessiner des rectangles qui peut être utilisé pour faire des recherches dans le catalogue.
nl: Deze widget geeft een minikaart weer met een tool "teken rechthoek" die gebruikt kan worden om in een volledige catalogus te zoeken.
