Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/configuring-page-information.po
Languages: de, es, fr, nl

source: Configuring page information
de: Seiteninformationen konfigurieren
es: Configurar la información de página
fr: Configurer des informations de page
nl: Informatie over de pagina configureren

source: You can configure the page title, URL, and description. These pieces of information are required to publish a page. For more information, see :ref:`publishing-pages`.
de: Sie können den Titel, die URL und die Beschreibung der Seite konfigurieren. Diese Informationen sind erforderlich, um eine Seite zu veröffentlichen. Weitere Informationen finden Sie unter :ref:`publishing-pages`.
es: Puede configurar el título, la dirección URL y la descripción de la página. Esta información es necesaria para publicar una página. Para obtener más información, consulte :ref:`publishing-pages`.
fr: Vous pouvez configurer le litre, l'URL et la description de la page. Ces informations sont obligatoires pour publier une page. Pour en savoir plus, consultez :ref:`publishing-pages`.
nl: U kunt de titel, de URL en de omschrijving van een pagina configureren. Deze informatie is vereist om een pagina te kunnen publiceren. Voor meer informatie, zie :ref:`publishing-pages`.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Always keep the needs of your audience in mind when choosing the page title, URL, and content.
de: Denken Sie bei der Auswahl von Titel, URL und Inhalt der Seite stets an die Bedürfnisse Ihrer Besucher.
es: Ten siempre en mente las necesidades del público al elegir el título, la dirección URL y el contenido de la página.
fr: Gardez toujours les besoins de votre public à l'esprit lorsque vous choisissez le titre, l'URL et le contenu de la page.
nl: Denk altijd aan de noden van uw publiek wanneer u de titel, de URL en de content van de pagina kiest.

source: From the left side pane, click **Fill in page details** in the **Page information** section.
de: Klicken Sie im linken Fenster im Abschnitt **Seiteninformationen** auf **Seitendetails ausfüllen**.
es: En el panel izquierdo, haga clic en **Especificar detalles de página** en la sección **Información de página**.
fr: Dans le volet de gauche, cliquez sur **Renseigner les informations de la page** dans la section **Informations de la page**.
nl: Klik in het zijpaneel links op **De details van de pagina invullen** in de rubriek **Informatie over de pagina**.

source: Enter the general page information in the corresponding fields:
de: Geben Sie die allgemeinen Seiteninformationen in die entsprechenden Felder ein:
es: Especifique la información de página general en los campos correspondientes:
fr: Saisissez les informations générales de la page dans les champs correspondants :
nl: Voer de algemene informatie over de pagina in in de overeenkomstige velden:

source: **Page title**: the page title appears in the list of pages and is used as the tab title when browsing the page.
de: **Seitentitel**: Der Seitentitel erscheint in der Seitenliste und wird beim Durchblättern der Seite als Titel der Registerkarte verwendet.
es: **Título de página**: el título de la página aparece en la lista de páginas y se usa como título de la ficha al explorar la página.
fr: **Titre de la page** : le titre de la page apparaît dans la liste des pages. De plus, il est utilisé comme titre de l'onglet lors de la navigation sur la page.
nl: **Titel van de pagina**: de titel van de pagina verschijnt in de lijst van pagina's en wordt gebruikt als de titel van het tabblad wanneer de pagina wordt doorbladerd.

source: **URL**: the default URL is pre-filled according to the page title. You can change the URL freely, as long as the page is not published. If you need to change the page URL after publishing, you need to unpublish the page first. Please note that changing a URL will break all the existing links that pointed to the previous URL.
de: **URL**: Die Standard-URL ist entsprechend dem Seitentitel vorgegeben. Sie können die URL beliebig ändern, solange die Seite nicht veröffentlicht ist. Wenn Sie die Seiten-URL nach der Veröffentlichung ändern möchten, müssen Sie die Veröffentlichung der Seite zunächst aufheben. Bitte beachten Sie, dass bei einer Änderung der URL alle bestehenden Links, die auf die vorherige URL verweisen, ungültig werden.
es: **URL**: la dirección URL predeterminada está precompletada en función del título de página. Puede cambiar la dirección URL con total libertad, siempre que la página no esté publicada. Si tiene que cambiar la dirección URL de la página después de publicarla, primero debe cancelar la publicación de la página. Tenga en cuenta que cambiar una dirección URL romperá todos los vínculos que apuntan a la dirección URL anterior.
fr: **URL** : l'URL par défaut est préremplie en fonction du titre de la page. Vous pouvez changer l'URL à votre convenance tant que la page n'est pas publiée. Si vous avez besoin de modifier l'URL de la page après la publication, vous devrez dépublier la page au préalable. Veuillez noter que la modification d'une URL rend invalides tous les liens existants qui redirigeaient vers l'URL précédente.
nl: **URL**: de standaard URL is vooraf ingevuld volgens de titel van de pagina. U kunt de URL vrij wijzigen zolang de pagina niet is gepubliceerd. Indien u de URL van de pagina moet veranderen nadat de pagina is gepubliceerd, moet u eerst de publicatie van de pagina ongedaan maken. Gelieve er rekening mee te houden dat, wanneer u een URL verandert, alle bestaande links naar de vorige URL worden verbroken.

source: **Description**: the page description is used for accessibility purposes.
de: **Beschreibung**: Die Seitenbeschreibung wird für eine bessere Zugänglichkeit verwendet.
es: **Descripción**: la descripción de la página se utiliza con fines de accesibilidad.
fr: **Description** : la description de la page est utilisée à des fins d'accessibilité.
nl: **Omschrijving**: de omschrijving van de pagina wordt gebruikt voor toegankelijkheidsdoeleinden.

source: Click **Save** to save the entered information.
de: Klicken Sie auf **Speichern**, um die eingegebenen Informationen zu speichern.
es: Haga clic en **Guardar** para guardar la información especificada.
fr: Cliquez sur **Sauvegarder** pour enregistrer les informations saisies.
nl: Klik op **Opslaan** om de ingevoerde informatie op te slaan.

source: Please note that changing the title or the description after publishing the page will trigger the Draft status. It means that you must publish your page to make the changes visible for the visitors.
de: Bitte beachten Sie, dass eine Änderung des Titels oder der Beschreibung nach der Veröffentlichung der Seite den Status "Entwurf" auslöst. Das bedeutet, dass Sie Ihre Seite erneut veröffentlichen müssen, damit die Änderungen für die Besucher sichtbar werden.
es: Tenga en cuenta que al cambiar el título o la descripción después de publicar la página se desencadenará el estado Borrador. Esto significa que debe publicar la página si desea que los cambios sean visibles para los visitantes.
fr: Veuillez noter que la modification du titre ou de la description après la publication de la page déclenchera l'état Brouillon. Cela signifie que vous devez publier votre page pour que les modifications soient visibles pour les visiteurs.
nl: Gelieve er rekening mee te houden dat wanneer de titel of de omschrijving worden gewijzigd nadat de pagina is gepubliceerd, dit aanleiding zal geven tot de Ontwerpstatus. Dit betekent dat u uw pagina moet publiceren om de wijzigingen zichtbaar te maken voor de bezoekers.
