Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/editing-page-layout.po
Languages: de, es, fr, nl

source: Editing the page layout
de: Seitenlayout bearbeiten
es: Editar el diseño de página
fr: Modifier la disposition de la page
nl: De paginalay-out bewerken

source: Editing the page layout of your page allows you to configure how your content is displayed to your audience.
de: Indem Sie das Layout Ihrer Seite bearbeiten, können Sie konfigurieren, wie Ihr Inhalt für Ihre Besucher angezeigt wird.
es: Editar el diseño de página de la página permite configurar cómo se muestra el contenido al público.
fr: Le fait de modifier la disposition de votre page vous permet de configurer l'affichage de votre contenu pour votre audience.
nl: De paginalay-out van uw pagina bewerken laat u toe te configureren hoe uw content wordt weergegeven aan uw publiek.

source: The structure for each page is defined by its layout, which consists of sections and blocks:
de: Die Struktur jeder Seite wird durch ihr Layout vorgegeben, das aus Abschnitten und Blöcken besteht:
es: La estructura de cada una de las páginas viene definida por su diseño, que consta de secciones y bloques:
fr: La structure de chaque page est définie par sa disposition, qui se compose de sections et de blocs :
nl: De structuur voor elke pagina wordt bepaald door de lay-out ervan, die bestaat uit secties en blokken:

source: A page can contain up to 40 sections.
es: Una página puede contener un máximo de 40 secciones.
fr: Une page peut contenir 40 sections maximum.
nl: Een pagina kan tot 40 rubrieken omvatten.

source: Each section can contain up to 4 blocks.
de: Jeder Abschnitt kann maximal 4 Blöcke umfassen.
es: Cada una de las secciones puede contener un máximo de 4 bloques.
fr: Chaque section peut contenir 4 blocs maximum.
nl: Elke sectie kan tot 4 blokken bevatten.

source: All blocks of a section automatically have an equal width. For example, if a section contains 1 block, it will be 100% wide. If a section contains 2 blocks, each block will be 50% wide, etc.
de: Alle Blöcke eines Abschnitts haben automatisch die gleiche Breite. Enthält ein Abschnitt z. B. 1 Block, so ist er 100 % breit. Enthält ein Abschnitt 2 Blöcke, so ist jeder Block 50 % breit usw.
es: Todos los bloques de una sección automáticamente tienen el mismo ancho. Por ejemplo, si una sección contiene 1 bloque, este tendrá un ancho del 100%. Si una sección contiene 2 bloques, cada uno de los bloques tendrá un ancho del 50%, etc.
fr: Tous les blocs d'une section sont automatiquement de le même largeur. Par exemple, si une section contient 1 bloc, celui-ci occupera 100 % de l'espace en largeur. Si une section contient 2 blocs, chaque bloc occupera 50 % de l'espace en largeur, etc.
nl: Alle blokken van een sectie hebben automatisch een gelijke breedte. Bijvoorbeeld, wanneer een sectie 1 blok bevat, zal dit 100% breed zijn. Wanneer een sectie 2 blokken bevat, zal elk blok 50% breed zijn, enz.

source: Opening the layout editor
de: Den Layout-Editor öffnen
es: Abrir el editor de diseño
fr: Ouvrir l'éditeur de dispositions
nl: De lay-outbewerker openen

source: The layout editor can be accessed from the main page, in the sidebar on the left.
de: Der Layout-Editor kann über die linke Seitenleiste auf der Hauptseite aufgerufen werden.
es: Se puede acceder al editor de diseño desde la página principal, en la barra lateral izquierda.
fr: L'éditeur de dispositions est accessible depuis la page principale, dans la barre latérale, à gauche.
nl: De lay-outbewerker is toegankelijk vanaf de hoofdpagina in de zijbalk aan de linkerkant.

source: If you just created the page and didn't create any block yet, you will be able to directly create your first section from a button.
de: Wenn Sie die Seite gerade erst erstellt haben und noch keinen Block erstellt haben, können Sie Ihren ersten Abschnitt direkt über einen Button erstellen.
es: Si acaba de crear la página y aún no ha creado ningún bloque, podrá crear directamente la primera sección con un botón.
fr: Si vous venez de créer la page et que vous n'avez pas encore créé de bloc, vous pourrez directement créer votre première section à partir d'un bouton.
nl: Wanneer u de pagina net hebt aangemaakt en nog geen blok hebt aangemaakt, zal u met een knop onmiddellijk uw eerste sectie kunnen aanmaken.

source: Adding sections
de: Abschnitte hinzufügen
es: Añadir secciones
fr: Ajouter des sections
nl: Secties toevoegen

source: Using sections, you can define the page structure. Once you added a section, you can add blocks inside this section.
de: Mithilfe von Abschnitten können Sie die Seitenstruktur festlegen. Sobald Sie einen Abschnitt hinzugefügt haben, können Sie Blöcke in diesen Abschnitt einfügen.
es: Mediante las secciones, puede definir la estructura de la página. Tras añadir una sección, puede añadir bloques dentro de esta sección.
fr: Les sections vous permettent de définir la structure de la page. Une fois que vous avez ajouté une section, vous pouvez y insérer des blocs.
nl: Door gebruik te maken van secties kunt u de paginastructuur bepalen. Eenmaal u een sectie hebt toegevoegd, kunt u blokken in deze sectie toevoegen.

source: Click **Add section** at the bottom of the section list.
de: Klicken Sie am unteren Ende der Abschnittsliste auf **Abschnitt hinzufügen**.
es: Haga clic en **Añadir sección** en la parte inferior de la lista de secciones.
fr: Cliquez sur **Ajouter une section** en bas de la liste de section.
nl: Klik op **Sectie toevoegen** onderaan de sectielijst.

source: Select the number of blocks you want to have inside the section.
de: Wählen Sie die Anzahl der Blöcke, die Sie innerhalb des Abschnitts wünschen.
es: Seleccione el número de bloques que desea tener en la sección.
fr: Sélectionnez le nombre de blocs souhaités dans la section.
nl: Selecteer het aantal blokken dat u in de sectie wilt hebben.

source: Click **Save**.
de: Klicken Sie auf **Speichern**.
es: Haga clic en **Guardar**.
fr: Cliquez sur **Sauvegarder**.
nl: Klik op **Opslaan**.

source: The added section appears at the end of the section list. It also appears in the preview pane.
de: Der hinzugefügte Abschnitt erscheint am Ende der Abschnittsliste. Er wird auch im Vorschaufenster angezeigt.
es: La sección añadida aparece al final de la lista de secciones. También aparece in el panel de vista previa.
fr: La section que vous venez d'ajouter apparaît à la fin de la liste de section. Elle est également présente dans le volet d'aperçu.
nl: De toegevoegde sectie verschijnt op het einde van de sectielijst. Ze verschijnt ook in het voorbeeldweergavevenster.

source: If you change your mind, you can add or delete blocks from this section afterward. If you delete the last block of a section, both block and section will disappear.
de: Wenn Sie Ihre Meinung ändern, können Sie nachträglich Blöcke zu diesem Abschnitt hinzufügen oder löschen. Wenn Sie den letzten Block eines Abschnitts löschen, werden sowohl der Block als auch der Abschnitt gelöscht.
es: Si cambia de opinión, puede añadir o suprimir bloques de esta sección más tarde. Si suprime el último bloque de una sección, el bloque y la sección desaparecerán.
fr: Si vous changez d'avis, vous pouvez ajouter ou supprimer des blocs de cette section ultérieurement. Si vous supprimez le dernier bloc d'une section, le bloc et la section disparaîtront.
nl: Wanneer u van gedacht verandert, kunt u later blokken aan deze sectie toevoegen of eruit verwijderen. Wanneer u het laatste blok van een sectie verwijdert, verdwijnen zowel het blok als de sectie.

source: Adding blocks
de: Blöcke hinzufügen
es: Añadir bloques
fr: Ajouter des blocs
nl: Blokken toevoegen

source: A block allows you to add content to a section.
de: Mit einem Block können Sie einem Abschnitt Inhalte hinzufügen.
es: Un bloque permite añadir contenido a una sección.
fr: Un bloc vous permet d'ajouter du contenu à une section.
nl: Een blok laat u toe content toe te voegen aan een sectie.

source: From the left side pane, open the **Arrange your blocks** menu.
de: Öffnen Sie im linken Fenster das Menü **Blöcke anordnen**.
es: En el panel izquierdo, abra el menú **Organizar los bloques**.
fr: Depuis le volet de gauche, ouvrez le menu **Oragnaiser vos blocs**.
nl: Open vanuit het zijpaneel links het menu **Uw blokken schikken**.

source: Click the **+** on the right side of the section in which you wish to add a block. If the section already has 4 blocks, it cannot host more and the **+** is absent.
de: Klicken Sie auf das **+** auf der rechten Seite des Abschnitts, in den Sie einen Block einfügen möchten. Wenn der Abschnitt bereits 4 Blöcke enthält, kann er keine weiteren aufnehmen. Hier wird kein **+** angezeigt.
es: Haga clic en el signo **+** a la derecha de la sección en que desea añadir un bloque. Si la sección ya tiene 4 bloques, no puede incluir más, y el signo **+** no estará visible.
fr: Cliquez sur **+** à droite de la section à laquelle vous souhaitez ajouter un bloc. Si la section possède déjà 4 blocs, elle ne peut pas en accueillir davantage et le **+** n'est pas affiché.
nl: Klik op **+** aan de rechterzijde van de sectie waarin u een blok wenst toe te voegen. Wanneer de sectie reeds 4 blokken heeft, kan ze er geen meer bijnemen en is **+** afwezig.

source: The added block appears in the desired section, at the far right.
de: Der hinzugefügte Block erscheint im gewünschten Abschnitt ganz rechts.
es: El bloque añadido aparece en la sección correspondiente, totalmente a la derecha.
fr: Le bloc ajouté apparaît tout à droite dans la section souhaitée.
nl: Het toegevoegde blok verschijnt helemaal rechts in de gewenste sectie.

source: Rearranging elements
de: Elemente neu anordnen
es: Reorganizar elementos
fr: Réorganiser les éléments
nl: Elementen herschikken

source: You can rearrange blocks and sections by dragging them and dropping into the desired spot of the left side pane. Neither sections nor blocks can be moved outside the left side pane.
de: Sie können Blöcke und Abschnitte neu anordnen, indem Sie sie per Drag & Drop an die gewünschte Stelle des linken Seitenfensters ziehen. Weder Abschnitte noch Blöcke können außerhalb des linken Seitenfensters verschoben werden.
es: Puede reorganizar bloques y secciones arrastrándolos y soltándolos en la posición deseada del panel izquierdo. Ni las secciones ni los bloques pueden moverse fuera del panel izquierdo.
fr: Vous pouvez réorganiser les blocs et les sections en les glissant-déposant à l'endroit souhaité dans le volet de gauche. Ni les sections ni les blocs ne peuvent être déplacés en dehors du volet de gauche.
nl: U kunt blokken en secties herschikken door ze naar de gewenste plek van het zijpaneel links te slepen en te plaatsen. Secties of blokken kunnen niet buiten het zijpaneel links worden verplaatst.

source: Sections have a dedicated handle on their top left side. Drag the section while clicking on this handle to move the whole section. Release the handle to drop the section.
de: Abschnitte haben einen eigenen Ziehpunkt oben links. Bewegen Sie den Abschnitt, während Sie auf diesen Ziehpunkt klicken, um den gesamten Abschnitt zu verschieben. Lassen Sie den Ziehpunkt los, um den Abschnitt abzulegen.
es: Las secciones tienen un identificador específico en la parte superior izquierda. Arrastre la sección mientras hace clic en este indicador para mover toda la sección. Suelte el identificador para soltar la sección.
fr: Les sections ont une poignée dédiée en haut à gauche. Faites glissez la section tout en cliquant sur cette poignée pour déplacer toute la section. Relâchez la poignée pour déposer la section.
nl: Secties hebben een speciale hendel links bovenaan. Sleep de sectie terwijl u op deze hendel klikt om de volledige sectie te verplaatsen. Laat de hendel los om de sectie te plaatsen.

source: Blocks do not have handle, you can click anywhere in it do drag them into another spot.
de: Blöcke haben keine Ziehpunkte, Sie können sie mit einem Mausklick an eine andere Stelle ziehen.
es: Los bloques no tienen ningún identificador, por lo que puede hacer clic en cualquier parte de los mismos para arrastrarlos a otra posición.
fr: Les blocs ne possèdent pas de poignée ; vous pouvez cliquez n'importe où dans ces derniers pour les déposer à un autre emplacement.
nl: Blokken hebben geen hendel. U kunt er overal in klikken om deze naar een andere plek te slepen.

source: You can move a block to another section, as long as the target section is not at full capacity (i.e 4 blocks). Moving the last block of a section removes the section from the page.
de: Sie können einen Block in einen anderen Abschnitt verschieben, solange dieser Zielabschnitt nicht voll ist (d.h. 4 Blöcke). Wenn Sie den letzten Block eines Abschnitts verschieben, wird der Abschnitt von der Seite entfernt.
es: Puede mover un bloque a otra sección, siempre que la sección de destino no esté a plena capacidad (es decir, 4 bloques). Al mover el último bloque de una sección se elimina la sección de la página.
fr: Vous pouvez déplacer un bloc vers une autre section sous réserve que la section cible n'ait pas atteint sa capacité totale (c.-à-d. 4 blocs). Le fait de déplacer le dernier bloc d'une section supprime la section de la page.
nl: U kunt een blok naar een andere sectie verplaatsen zolang de doelsectie niet volledig vol is (m.a.w. 4 blokken). Wanneer het laatste blok van een sectie wordt verplaatst, wordt de sectie uit de pagina verplaatst.

source: You can create a new section by moving a block between two sections, above the first section or on the **Add section** button. The block will be the only one in the newly created section, but you can add other blocks by clicking **+**.
de: Sie können einen neuen Abschnitt erstellen, indem Sie einen Block zwischen zwei Abschnitte, über den ersten Abschnitt oder auf die Schaltfläche **Abschnitt hinzufügen** verschieben. Der Block wird zunächst der einzige in dem neu erstellten Abschnitt sein, aber Sie können weitere Blöcke hinzufügen, indem Sie auf **+** klicken.
es: Puede crear una nueva sección moviendo un bloque entre 2 secciones, sobre la primera sección o en el botón **Añadir sección**. El bloque será el único de la sección recién creada, pero puede añadir otros bloques haciendo clic en **+**.
fr: Vous pouvez créer une section en déplaçant un bloc entre deux sections, au-dessus de la première section ou sur le bouton **Ajouter une section**. Le bloc sera le seul de la section nouvellement créée, mais vous pouvez ajouter d'autres blocs en cliquant sur **+**.
nl: U kunt een nieuwe sectie aanmaken door een blok te verplaatsen tussen twee secties, boven de eerste sectie of door op de knop **Sectie toevoegen** te klikken. Het blok zal het enige zijn in de nieuw aangemaakte sectie maar u kunt andere blokken toevoegen door op **+** te klikken.
