Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/index.po
Languages: de, es, fr, nl

source: Creating content with the Studio
de: Inhalte mit dem Studio erstellen
es: Crear contenido con Studio
fr: Créer du contenu avec le studio
nl: Content aanmaken met de Studio

source: The Studio is the new no-code editor that helps create and edit pages. It contains all the features required, from the creation to the publishing of your page.
de: Das Studio ist der neue No-Code-Editor, mit dem Sie Seiten erstellen und bearbeiten können. Es enthält alle erforderlichen Funktionen, von der Erstellung bis zur Veröffentlichung Ihrer Seite.
es: Studio es el nuevo editor sin código que ayuda a crear y editar páginas. Contiene todas las funciones necesarias, desde la creación hasta la publicación de la página.
fr: Le studio est le nouvel éditeur sans code qui permet de créer et de modifier des pages. Il contient toutes les fonctionnalités obligatoires, de la création à la publication de votre page.
nl: De Studio is een nieuwe editor zonder code die helpt bij het aanmaken en bewerken van pagina's. Hij bevat alle vereiste functies, van het aanmaken tot het publiceren van uw pagina.

source: You can configure the page information (title, URL, and description) and access policy.
de: Sie können die Seiteninformationen (Titel, URL und Beschreibung) sowie die Zugriffsrichtlinie konfigurieren.
es: Puede configurar la información de la página (título, URL y descripción) y la directiva de acceso.
fr: Vous pouvez configurer les informations de la page (titre, URL et description), ainsi que la politique d'accès.
nl: U kunt de pagina-informatie (titel, URL en omschrijving) en het toegangsbeleid configureren.

source: You can arrange your own page layout using sections and blocks.
de: Mithilfe von Abschnitten und Blöcken können Sie Ihr eigenes Seiten-Layout gestalten.
es: Puede organizar su propio diseño de página por medio de secciones y bloques.
fr: Vous pouvez organiser la disposition de votre page à l'aide de sections et de blocs.
nl: U kunt de lay-out van uw eigen pagina schikken door middel van secties en blokken.

source: Within sections, you can configure the blocks that define the text and other visualizations such as images, charts, or KPIs.
de: Innerhalb der Abschnitte können Sie die Blöcke konfigurieren, die den Text und andere Visualisierungen wie Bilder, Diagramme oder KPIs enthalten.
es: Dentro de las secciones, puede configurar los bloques que definen el texto y otras visualizaciones como imágenes, gráficos o KPI.
fr: Dans les sections, vous pouvez configurer les blocs qui définissent le texte et les autres visualisations telles que les images, graphiques ou indicateurs.
nl: Binnen de secties kunt u de blokken configureren die de tekst bepalen en andere weergaves, zoals afbeeldingen, grafieken of KPI's.

source: Annotation
de: Anmerkung
es: Anotación
nl: Aantekening

source: Name
es: Nombre
fr: Nom
nl: Naam

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Side pane
de: Seitenfenster
es: Panel lateral
fr: Volet latéral
nl: Zijpaneel

source: Displays properties of the page and components and lets you edit them.
de: Zeigt die Eigenschaften der Seite und der Bestandteile an und ermöglicht deren Bearbeitung.
es: Muestra las propiedades de la página y los componentes, y permite su edición.
fr: Affiche les propriétés de la page, ainsi que les composants, et vous permet de les modifier.
nl: Geeft de eigenschappen van de pagina en de componenten weer en laat u toe deze te bewerken.

source: Also displays save status and notifications.
de: Hier werden außerdem der Speicherstatus und Benachrichtigungen angezeigt.
es: También muestra el estado guardado y las notificaciones.
fr: Affiche également l'état d'enregistrement et les notifications.
nl: Geeft ook de opslagstatus en kennisgevingen weer.

source: Toolbar
de: Symbolleiste
es: Barra de herramientas
fr: Barre d'outils

source: Allows you to
de: Sie haben folgende Möglichkeiten
es: Permite
fr: Vous permet :
nl: Laat u toe om

source: |preview-icon| preview your page
de: |preview-icon| Vorschau Ihrer Seite
es: obtener una vista previa |preview-icon| de la página
fr: d'obtenir un aperçu de votre page |preview-icon|
nl: |preview-icon| een voorbeeldweergave van uw pagina te krijgen

source: return to the back office
de: Zurück zum Back-Office
es: volver al back office
fr: de revenir à l'interface d'administration
nl: terug te keren naar de back office

source: publish your page
de: Ihre Seite veröffentlichen
es: publicar la página
fr: de publier votre page
nl: uw pagina te publiceren

source: Preview pane
de: Vorschaufenster
es: Panel de vista previa
fr: Volet d'aperçu
nl: Voorbeeldweergavevenster

source: Displays a live preview of the sections and blocks included in your page.
de: Zeigt eine Live-Vorschau der Abschnitte und Blöcke Ihrer Seite an.
es: Muestra una vista previa en directo de las secciones y los bloques de la página.
fr: Affiche un aperçu en direct des sections et des blocs inclus dans votre page.
nl: Geeft een live voorbeeldweergave van de secties en blokken die opgenomen zijn in uw pagina.

source: Also displays a preview of the first 20 records of the input dataset when configuring a visualization.
de: Wird eine Visualisierung konfiguriert, wird hier auch eine Vorschau der ersten 20 Einträge des Eingabedatensatzes angezeigt.
es: También muestra una vista previa de los 20 primeros registros del conjunto de datos de entrada al configurar una visualización.
fr: Affiche également un aperçu des 20 premiers enregistrements du jeu de données d'entrée lors de la configuration d'une visualisation.
nl: Geeft ook een voorbeeldweergave weer van de eerste 20 records van de input dataset wanneer een weergave wordt geconfigureerd.

source: Once created, the page status changes according to the actions you perform:
de: Nach der Erstellung ändert sich der Status der Seite je nach den von Ihnen durchgeführten Aktionen:
es: Una vez creada, el estado de la página cambia en función de las acciones realizadas:
fr: Une fois la page créée, son état change en fonction des actions que vous effectuez.
nl: Eenmaal aangemaakt wijzigt de paginastatus in functie van de acties die u uitvoert:

source: Draft: this tag indicates that you, or another editor, has edited the page without publishing it. The tag appears as soon as you perform one of the following kind of action: edit a block, edit the page layout, add or edit the page information. The tag disappears after you publish the page, until you edit the page again.
de: Entwurf: Dieses Tag zeigt an, dass Sie oder ein anderer Benutzer die Seite bearbeitet haben, ohne sie zu veröffentlichen. Das Tag erscheint, sobald Sie eine der folgenden Aktionen durchführen: Bearbeitung eines Blocks, Bearbeitung des Seitenlayouts, Hinzufügen oder Bearbeiten der Seiteninformationen. Das Tag wird gelöscht, nachdem Sie die Seite veröffentlicht haben, und erscheint erst wieder, wenn Sie die Seite erneut bearbeiten.
es: Borrador: esta etiqueta indica que usted u otro editor ha editado la página sin publicarla. La etiqueta aparece en cuanto se realiza algún tipo de acción: editar un bloque, editar el diseño de la página, añadir o editar la información de la página. La etiqueta desaparece después de publicar la página, hasta que se vuelva a editar la página.
fr: Brouillon : ce tag indique que vous ou un autre éditeur avez modifié la page sans la publier. Le tag apparaît dès que vous effectuez l'une des actions suivantes : modification d'un bloc ou d'une disposition de page, ajout ou modification des informations de la page. Le tag disparaît une fois la page publiée, jusqu'à ce que vous la modifiiez à nouveau.
nl: Ontwerp: deze tag geeft aan dat u of een andere editor de pagina heeft bewerkt zonder deze te publiceren. De tag verschijnt zodra u een van de volgende acties uitvoert: een blok bewerken, de paginalay-out bewerken, de pagina-informatie toevoegen of bewerken. De tag verdwijnt nadat u de pagina hebt gepubliceerd, tot u de pagina opnieuw bewerkt.

source: Published: this status means that the page is currently online and anyone with the right access can visit it. The status is permanent, until you choose to unpublish or delete the page.
de: Veröffentlicht: Dieser Status bedeutet, dass die Seite derzeit online ist und von allen Personen mit den entsprechenden Zugriffsrechten aufgerufen werden kann. Der Status ist dauerhaft, bis Sie sich entscheiden, die Veröffentlichung aufzuheben oder die Seite zu löschen.
es: Publicado: este estado significa que la página actualmente está en línea y cualquier usuario con el acceso adecuado puede visitarla. El estado es permanente, hasta que se decida cancelar la publicación o suprimir la página.
fr: Publié : cet état indique que la page est actuellement en ligne et que toute personne possédant les accès nécessaires peut la consulter. L'état est permanent jusqu'à ce que vous choisissiez de dépublier ou de supprimer cette page.
nl: Gepubliceerd: deze status betekent dat de pagina momenteel online is en dat iedereen met de juiste toegang deze kan bezoeken. De status is permanent tot u ervoor kiest om de publicatie van de pagina ongedaan te maken of de pagina te verwijderen.

source: Not published: this status means that the page is not online. By default, a page is not published when you create it; you must explicitely choose to publish it. You have the possibilty to unpublish your page to take it offline, in such circumstance, the status changes from Published to Not Published.
de: Nicht veröffentlicht: Dieser Status bedeutet, dass die Seite nicht online ist. Standardmäßig wird eine Seite nicht veröffentlicht, wenn Sie sie erstellen; Sie müssen sich ausdrücklich dafür entscheiden, sie zu veröffentlichen. Sie haben die Möglichkeit, die Veröffentlichung Ihrer Seite aufzuheben, um sie offline zu nehmen; in diesem Fall ändert sich der Status von "Veröffentlicht" zu "Nicht veröffentlicht".
es: No se ha publicado: este estado significa que la página no está en línea. De forma predeterminada, una página no se publica al crearla; hay que elegir explícitamente publicarla. Tiene la posibilidad de cancelar la publicación de la página para establecerla fuera de línea y, en ese caso, el estado Publicado pasará a No se ha publicado.
fr: Non publié : cet état signifie que la page n'est pas en ligne. Par défaut, une page n'est pas publiée lorsque vous la créez ; vous devez choisir explicitement de la publier. Vous avez la possibilité de dépublier votre page pour la mettre hors ligne et dans ce cas, son état passe de Publié à Non publié.
nl: Niet gepubliceerd: deze status betekent dat de pagina niet online is. Standaard is een pagina niet gepubliceerd wanneer u deze aanmaakt; u moet er expliciet voor kiezen op deze te publiceren. U hebt de mogelijkheid om de publicatie van uw pagina ongedaan te maken om deze offline te halen. In deze omstandigheid wijzigt de status van Gepubliceerd naar Niet gepubliceerd.

source: Published and Not Published are incompatible statuses, a page cannot be both online and offline at the same time. However, a page can be tagged as a Draft after being published.
de: Der Status "Veröffentlicht" ist nicht mit dem Status "Nicht veröffentlicht" kompatibel. Eine Seite kann nicht gleichzeitig online und offline sein. Eine Seite kann jedoch nach ihrer Veröffentlichung als Entwurf gekennzeichnet werden.
es: Los estados Publicado y No se ha publicado son incompatibles: una página no puede estar a la vez en línea y fuera de línea. Sin embargo, una página puede etiquetarse como Borrador después de publicarse.
fr: Les états Publié et Non publié sont incompatibles : une page ne peut pas être à la fois en ligne et hors ligne. Néanmoins, une page peut avoir un tag Brouillon après avoir été publiée.
nl: Gepubliceerd en Niet gepubliceerd zijn onverenigdbare statussen. Een pagina kan niet tezelfdertijd online en offline zijn. Een pagina kan wel getagd zijn als een Ontwerp nadat ze is gepubliceerd.

source: Example:
de: Beispiel:
es: Ejemplo:
fr: Exemple :
nl: Voorbeeld:

source: Paul creates a new page. Creation is the first step of editing, therefore the page is immediately tagged Draft. As Paul has not published the page yet, its status is Not Published. Once Paul has finished editing the page, he publishes it. The page is now Published and the Draft tag disappears.
de: Paul erstellt eine neue Seite. Die Erstellung ist der erste Schritt der Bearbeitung, daher wird die Seite sofort als Entwurf gekennzeichnet. Da Paul die Seite noch nicht veröffentlicht hat, lautet ihr Status "Nicht veröffentlicht". Sobald Paul die Bearbeitung der Seite abgeschlossen hat, veröffentlicht er sie. Die Seite ist nun veröffentlicht und das Tag "Entwurf" verschwindet.
es: Paul crea una página nueva. La creación es el primer paso de la edición, por lo que la página se etiqueta de inmediato como Borrador. Puesto que Paul todavía no ha publicado la página, su estado es No se ha publicado. Cuando Paul ha terminado de editar la página, la publica. La página ahora tiene el estado Publicado y la etiqueta Borrador desaparece.
fr: Paul crée une page. La création étant la première étape de la modification, un tag Brouillon est immédiatement ajouté sur la page. Comme Paul n'a pas encore publié la page, son état est défini sur Non publié. Une fois que Paul a terminé de modifier la page, il la publie. L'état de la page est désormais défini sur Publié et le tag Brouillon disparaît.
nl: Paul maakt een nieuwe pagina aan. Het aanmaken is de eerste stap van het bewerken. Daarom wordt de pagina onmiddellijk getagd als Ontwerp. Aangezien Paul de pagina nog niet heeft gepubliceerd, is de status ervan Niet gepubliceerd. Eenmaal Paul het bewerken van de pagina heeft voltooid, publiceert hij deze. De pagina is nu Gepubliceerd en de tag Ontwerp verdwijnt.

source: Several months later, Paul comes back to this page because he wants to change a KPI inside. The page status remains Published, since it has not been taken offline. However, it is now tagged Draft again, because editing the KPI created a new version of the page, which is different from the version currently online. The tag will remain, to remind Paul that the page within the Studio is different from the one he previously published. When he clicks on Publish again, the previously published version will be replaced and the Draft tag will disappear.
de: Einige Monate später möchte Paul eine KPI auf der Seite ändern. Der Status der Seite bleibt "Veröffentlicht", da sie nicht offline genommen wurde. Allerdings ist sie jetzt wieder als Entwurf gekennzeichnet, da durch die Bearbeitung der KPI eine neue Version der Seite erstellt wurde, die sich von der aktuellen Online-Version unterscheidet. Das Tag bleibt bestehen, um Paul daran zu erinnern, dass die Seite im Studio eine andere ist als die, die er zuvor veröffentlicht hat. Wenn er erneut auf "Veröffentlichen" klickt, wird die zuvor veröffentlichte Version ersetzt und das Tag "Entwurf" verschwindet.
es: Al cabo de unos meses, Paul vuelve a esta página porque quiere cambiar un KPI de la misma. El estado de la página se mantiene como Publicado, ya que no se ha establecido fuera de línea. Sin embargo, ahora se etiqueta nuevamente como Borrador, porque al editar el KPI se ha creado una nueva versión de la página, que es distinta de la versión actualmente en línea. La etiqueta se mantendrá para recordar a Paul que la página de Studio es distinta de la publicada anteriormente. Al volver a hacer clic en Publicar, la versión publicada anteriormente se sustituirá y la etiqueta Borrador desaparecerá.
fr: Quelques mois plus tard, Paul revient sur cette page, car il souhaite changer l'un des indicateurs qu'elle présente. L'état de la page reste défini sur Publié, puisqu'il ne l'a pas mise hors ligne. Toutefois, le tag Brouillon apparaît une nouvelle fois car la modification de l'indicateur a créé une nouvelle version de la page, différente de la version actuellement en ligne. Le tag reste présent pour rappeler à Paul que la page affichée dans le studio est différente de celle qu'il a précédemment publiée. Lorsqu'il clique à nouveau sur Publier, la version précédemment publiée est remplacée et le tag Brouillon disparaît.
nl: Enkele maanden later keert Paul terug naar deze pagina omdat hij een KPI erin wil wijzigen. De paginastatus blijft Gepubliceerd aangezien ze niet offline is gehaald. Ze staat nu echter opnieuw getagd als Ontwerp omdat het bewerken van de KPI een nieuwe versie van de pagina heeft gecreÃ«erd die verschillend is van de versie die momenteel online staat. De tag blijft om Paul eraan te herinneren dat de pagina in Studio verschillend is van diegene die hij eerder heeft gepubliceerd. Wanneer hij opnieuw op Publiceren klikt, zal de eerder gepubliceerde versie worden vervangen en zal de tag Ontwerp verdwijnen.

source: Two years later, the page has become obsolete. Paul decides to unpublish it. The page now has a Not Published status, and a Draft tag.
de: Zwei Jahre später ist die Seite überflüssig geworden. Paul beschließt, die Veröffentlichung aufzuheben. Die Seite hat nun den Status "Nicht veröffentlicht" und ist mit dem Tag "Entwurf" gekennzeichnet.
es: 2 años después, la página ha quedado obsoleta. Paul decide cancelar su publicación. La página ahora tiene el estado No se ha publicado y la etiqueta Borrador.
fr: Deux ans plus tard, la page est devenue obsolète et Paul décide de la dépublier. La page possède désormais un état Non publié et un tag Brouillon.
nl: Twee jaar later is de pagina verouderd geworden. Paul beslist om de publicatie ervan ongedaan te maken. De pagina heeft nu de status Niet gepubliceerd en een tag Ontwerp.

source: There is no page versioning in the Studio. The following actions are irreversible:
de: Eine Versionierung der Seiten gibt es im Studio nicht. Die folgenden Aktionen können nicht rückgängig gemacht werden:
es: No existe la función de versiones de páginas en Studio. Las acciones siguientes son irreversibles:
fr: Il n'existe pas de création de versions de pages différentes dans le studio. Les actions suivantes sont irréversibles :
nl: Er is geen pagina versiebeheer in de Studio. De volgende acties zijn onomkeerbaar:

source: After you delete a page, it cannot be recovered.
de: Nachdem Sie eine Seite gelöscht haben, kann sie nicht wiederhergestellt werden.
es: Después de suprimir una página, esta no se puede recuperar.
fr: Après la suppression d'une page, vous ne pouvez pas la récupérer.
nl: Nadat u een pagina hebt verwijderd, kan deze niet worden gerecupereerd.

source: If you publish a page that already has the status Published, the new published version will replace the previous one.
de: Wenn Sie eine Seite veröffentlichen, die bereits den Status "Veröffentlicht" hat, wird die neue veröffentlichte Version die vorherige ersetzen.
es: Si publica una página que ya tiene el estado Publicado, la nueva versión publicada sustituirá a la anterior.
fr: Si vous publiez une page qui a déjà l'état Publié, la nouvelle version publiée remplacera la précédente.
nl: Wanneer u een pagina publiceert die reeds de status Gepubliceerd heeft, zal de nieuw gepubliceerde versie de vorige vervangen.
