Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/managing-page-access.po
Languages: de, es, fr

source: Managing page access
de: Verwaltung des Seitenzugriffs
es: Gestionar el acceso de las páginas
fr: Gérer l'accès aux pages

source: Pages created with the Studio can be public or private:
de: Mit dem Studio erstellte Seiten können öffentlich oder privat sein:
es: Las páginas creadas con Studio pueden ser públicas o privadas.
fr: Les pages créées avec le studio peuvent être publiques ou privées :

source: A public page is accessible by anyone with an access to the portal.
de: Eine öffentliche Seite kann von jedem aufgerufen werden, der einen Zugang zum Portal hat.
es: Cualquier usuario con acceso al portal puede acceder a una página pública.
fr: Une page publique peut être consultée par toute personne disposant d'un accès au portail.

source: A private page is restricted to specifically defined users and groups. By default, a page is private.
de: Eine private Seite ist bestimmten Benutzern und Gruppen vorbehalten. Standardmäßig ist eine Seite privat.
es: Una página privada está restringida a los usuarios y grupos definidos específicamente. De forma predeterminada, una página es privada.
fr: Une page privée est limitée à certains groupes et utilisateurs définis. Par défaut, une page est privée.

source: You can also manage more than one user or group at a time, for more information see :ref:`bulk_edit_access`.
de: Sie können auch mehr als einen Benutzer oder eine Gruppe auf einmal verwalten. Weitere Informationen finden Sie unter :ref:`bulk_edit_access`.
es: También puede gestionar varios usuarios o grupos a la vez. Para obtener más información, consulte :ref:`bulk_edit_access`.
fr: Par ailleurs, vous pouvez gérer plusieurs utilisateurs ou groupes à la fois. Pour plus d'informations, consultez :ref:`bulk_edit_access`.

source: Important
de: Wichtig
es: Importante

source: While performing the following procedures, the access policy and rights you are configuring are instantly applied to users and groups. This means you cannot cancel the configuration while editing, you need to explicitly add or remove users, groups, and rights.
de: Bei den folgenden Vorgehensweisen werden die Zugriffsrichtlinie und die von Ihnen konfigurierten Rechte sofort auf Benutzer und Gruppen angewendet. Das bedeutet, dass Sie die Konfiguration während der Bearbeitung nicht unterbrechen können. Sie müssen explizit Benutzer, Gruppen und Rechte hinzufügen oder entfernen.
es: Al realizar los procedimientos siguientes, la directiva y los derechos de acceso que configure se aplicarán inmediatamente a los usuarios y grupos. Esto significa que no se puede cancelar la configuración durante la edición, sino que hay que añadir o eliminar explícitamente usuarios, grupos y derechos.
fr: Lorsque vous effectuez les procédures suivantes, la politique d'accès et les droits que vous configurez sont instantanément appliqués aux utilisateurs et groupes. Cela signifie que vous ne pouvez pas annuler la configuration lors de la modification, vous devez explicitement ajouter ou supprimer des utilisateurs, des groupes et des droits.

source: Setting an access policy
de: Eine Zugriffsrichtlinie einrichten
es: Establecer una directiva de acceso
fr: Définir une politique d'accès

source: The Studio lets you set a page-level access policy.
de: Im Studio können Sie eine Zugriffsrichtlinie auf Seitenebene festlegen.
es: Studio permite establecer una directiva de acceso a nivel de página.
fr: Le studio vous permet de définir une politique d'accès au niveau de la page.

source: From the left side pane, click **Edit** in the **Page access** section.
de: Klicken Sie im linken Fenster im Abschnitt **Seitenzugang** auf **Bearbeiten**.
es: En el panel izquierdo, haga clic en **Editar** en la sección **Acceso de página**.
fr: Dans le volet de gauche, cliquez sur **Modifier** dans la section **Accès à la page**.

source: Set the access policy:
de: Richten Sie die Zugriffsrichtlinie ein:
es: Establezca la directiva de acceso:
fr: Définissez la politique d'accès :

source: Click **Public** to let any user access the page, as long as they have access to the portal.
de: Klicken Sie auf **Öffentlich**, um jedem Benutzer den Zugriff auf die Seite zu ermöglichen, sofern er Zugriff auf das Portal hat.
es: Haga clic en **Público** para permitir a cualquier usuario acceder a la página, siempre que tenga acceso al portal.
fr: Cliquez sur **Public** pour permettre à tous les utilisateurs d'accéder à la page, sous réserve qu'ils aient accès au portail.

source: Click **Private** to restrict access to the page to specifically defined users and groups.
de: klicken Sie auf **Privat**, um den Seitenzugriff auf bestimmte Benutzer und/oder Benutzergruppen zu beschränken.
es: Haga clic en **Privado** para restringir el acceso a la página a los usuarios y grupos definidos específicamente.
fr: Cliquez sur **Privé** pour restreindre l'accès à la page à certains utilisateurs et groupes définis.

source: Click **Finish** to save the access policy.
de: Klicken Sie auf **Beenden**, um die Zugriffsrichtlinie zu speichern.
es: Haga clic en **Finalizar** para guardar la directiva de acceso.
fr: Cliquez sur **Terminer** pour enregistrer la politique d'accès.

source: Adding users and groups to a page
de: Einer Seite Benutzer und Gruppen hinzufügen
es: Añadir usuarios y grupos a una página
fr: Ajouter des utilisateurs et des groupes à une page

source: If you set the access policy to **Public**, the users and groups added to a page are granted, by default, editing rights for this page.
de: Wenn Sie die Zugriffsrichtlinie auf **Öffentlich** setzen, erhalten die Benutzer und Gruppen, die einer Seite hinzugefügt werden, standardmäßig Bearbeitungsrechte für diese Seite.
es: Si se establece la directiva de acceso en **Público**, se concede a los usuarios y grupos añadidos a una página, de forma predeterminada, derechos para editar esta página.
fr: Si vous définissez la politique d'accès sur **Public**, les utilisateurs et groupes ajoutés à une page bénéficient, par défaut, de droits de modification pour cette page.

source: If you set the access policy to **Private**, the users and groups added to a page are granted, by default, page access only for this page.
de: Wenn Sie die Zugriffsrichtlinie auf **Privat** setzen, erhalten die zu einer Seite hinzugefügten Benutzer und Gruppen standardmäßig nur Zugriff auf diese Seite.
es: Si se establece la directiva de acceso en **Privado**, solo se concede a los usuarios y grupos añadidos a una página, de forma predeterminada, el derecho de acceso a esta página.
fr: Si vous définissez la politique d'accès sur **Privé**, les utilisateurs et groupes ajoutés à une page bénéficient, par défaut, d'un accès à cette page uniquement.

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis

source: Users and groups must already exist in the back office, within the **Users & Groups** section, where users are invited to the portal and where groups are created.
de: Die Benutzer und Gruppen müssen bereits im Back-Office im Bereich **Benutzer und Gruppen** vorhanden sein. Hier können die Benutzer zum Portal eingeladen und die Gruppen erstellt werden.
es: Los usuarios y grupos ya deben existir en el back office, dentro de la sección **Usuarios y grupos**, donde los usuarios son invitados al portal y donde se crean los grupos.
fr: Les utilisateurs et les groupes doivent déjà exister dans l'interface d'administration, dans la section **Utilisateurs et groupes** où les utilisateurs sont invités à rejoindre le portail et où les groupes sont créés.

source: Click **+** in the **Users** or the **Group** section.
de: Klicken Sie im Abschnitt **Benutzer** oder **Gruppe** auf **+**.
es: Haga clic en **+** en la sección **Usuarios** o **Grupos**.
fr: Cliquez sur **+** dans la section **Utilisateurs** ou **Groupe**.

source: Perform one of the following actions:
de: Führen Sie eine der folgenden Aktionen aus:
es: Lleve a cabo una de las acciones siguientes:
fr: Effectuez l'une des actions suivantes :

source: Select a user or a group from the list.
de: Wählen Sie einen Benutzer oder eine Gruppe aus der Liste.
es: Seleccione un usuario o grupo en la lista.
fr: Sélectionnez un utilisateur ou un groupe dans la liste.

source: Select the **All** checkbox to select all users or groups.
de: Wählen Sie die Option **Alle**, um alle Benutzer oder Gruppen auszuwählen.
es: Seleccione la casilla **Todo** para seleccionar todos los usuarios o grupos.
fr: Cochez la case **Tout** pour sélectionner tous les utilisateurs ou groupes.

source: Click **Finish**.
de: Klicken Sie auf **Beenden**.
es: Haga clic en **Finalizar**.
fr: Cliquez sur **Terminer**.

source: Removing users and groups from a page
de: Benutzer und Gruppen von einer Seite entfernen
es: Eliminar usuarios y grupos de una página
fr: Supprimer des utilisateurs et des groupes d'une page

source: After you added a user or a group to a page, you can remove them.
de: Nachdem Sie einen Benutzer oder eine Gruppe zu einer Seite hinzugefügt haben, können Sie diese wieder entfernen.
es: Después de añadir un usuario o grupo a una página, puede eliminarlo.
fr: Après avoir ajouté un utilisateur ou un groupe à une page, vous pouvez les supprimer.

source: Note
de: Hinweis
es: Nota
fr: Remarque

source: A user cannot remove themselves from a page.
de: Ein Benutzer kann sich nicht selbst von der Seite entfernen.
es: Un usuario no puede eliminarse a sí mismo de una página.
fr: Un utilisateur ne peut pas se supprimer lui-même d'une page.

source: Hover over the user or group to be removed.
de: Bewegen Sie den Mauszeiger über den/die zu löschende/n Benutzer oder Gruppe.
es: Pase por encima del usuario o grupo que desea eliminar.
fr: Passez le curseur sur l'utilisateur ou le groupe à supprimer.

source: Click the bin icon.
de: Klicken Sie auf das Papierkorbsymbol
es: Haga clic en el icono de papelera.
fr: Cliquez sur l'icône de corbeille.

source: After removing a user or a group from a private page, they will not be able to access the page anymore.
de: Nachdem ein Benutzer oder eine Gruppe von einer privaten Seite entfernt wurde, können diese nicht mehr auf die Seite zugreifen.
es: Después de eliminar usuario o grupo de una página privada, este ya no podrá acceder a la página.
fr: Après avoir supprimé un utilisateur ou un groupe d'une page privée, ils ne peuvent plus accéder à cette page.

source: After removing a user or a group from a public page, they will not be able to edit the page anymore.
de: Nachdem ein Benutzer oder eine Gruppe von einer öffentlichen Seite entfernt wurde, können diese die Seite nicht mehr bearbeiten.
es: Después de eliminar usuario o grupo de una página pública, este ya no podrá editar la página.
fr: Après avoir supprimé un utilisateur ou un groupe d'une page publique, ils ne peuvent plus modifier cette page.

source: Granting users and groups editing rights
de: Benutzern und Gruppen Bearbeitungsrechte erteilen
es: Conceder derechos de edición a usuarios y grupos
fr: Accorder des droits de modification à des utilisateurs et des groupes

source: All the users and groups added to a private page are granted page access only for this page by default. You can grant them editing rights.
de: Alle Benutzer und Gruppen, die zu einer privaten Seite hinzugefügt werden, erhalten standardmäßig lediglich Zugriff auf diese Seite. Sie können ihnen auch Bearbeitungsrechte gewähren.
es: Solo se concede a todos los usuarios y grupos añadidos a una página privada el derecho de acceso a esta página de forma predeterminada. Si lo desea, también puede concederles derechos de edición.
fr: Tous les utilisateurs et groupes ajoutés à une page privée bénéficient par défaut d'un accès à cette page uniquement. Vous pouvez leur accorder des droits de modification.

source: If you added a user or a group to a public page, they are granted editing rights for this page. So, you do not need to perform the following steps.
de: Wenn Sie einen Benutzer oder eine Gruppe zu einer öffentlichen Seite hinzugefügt haben, erhalten diese Bearbeitungsrechte für die entsprechende Seite. In diesem Fall müssen Sie die folgenden Schritte nicht durchführen.
es: Si ha añadido un usuario o grupo a una página pública, se le concederá derechos de edición para esta página. Por consiguiente, no tendrá que seguir estos pasos.
fr: Si vous avez ajouté un utilisateur ou un groupe à une page publique, ils bénéficient de droits de modification pour cette page. Par conséquent, vous n'avez pas besoin d'effectuer les étapes suivantes.

source: Hover over the desired user or group.
de: Bewegen Sie den Mauszeiger über den/die gewünschte/n Benutzer oder Gruppe.
es: Pase por encima del usuario o grupo deseado.
fr: Passez le curseur sur le groupe ou l'utilisateur souhaité.

source: Click the |allow-edition-icon| icon.
de: Klicken Sie auf das Symbol |allow-edition-icon|.
es: Haga clic en el icono |allow-edition-icon|.
fr: Cliquez sur l'icône |allow-edition-icon|.

source: Revoking editing rights from users and groups
de: Benutzern und Gruppen Bearbeitungsrechte entziehen
es: Revocar derechos de edición de usuarios y grupos
fr: Retirer les droits de modification des utilisateurs et des groupes

source: After granting users and groups editing rights, you can revoke those rights.
de: Nachdem Sie Benutzern und Gruppen Bearbeitungsrechte erteilt haben, können Sie diese Rechte wieder entziehen.
es: Después de conceder los derechos de edición a usuarios y grupos, puede revocarlos.
fr: Après avoir accordé des droits de modification aux utilisateurs et groupes, vous pouvez retirer ces droits.

source: A user cannot revoke their own rights.
de: Ein Benutzer kann seine ihm erteilten Rechte nicht widerrufen.
es: Un usuario no puede revocar sus propios derechos.
fr: Un utilisateur ne peut pas retirer ses propres droits lui-même.

source: Click the |forbid-edition-icon| icon.
de: Klicken Sie auf das Symbol |forbid-edition-icon|.
es: Haga clic en el icono |forbid-edition-icon|.
fr: Cliquez sur l'icône |forbid-edition-icon|.

source: Bulk edit users, groups, and rights
de: Massenbearbeitung von Benutzern, Gruppen und Rechten
es: Editar de forma masiva usuarios, grupos y derechos
fr: Modifier plusieurs utilisateurs, groupes et droits à la fois

source: Through the Studio interface, you can edit more than one user and group at a time, and their rights.
de: Über die Arbeitsoberfläche des Studios können Sie mehr als einen Benutzer und eine Gruppe sowie deren Rechte gleichzeitig bearbeiten.
es: En la interfaz de Studio, puede editar varios usuarios y grupos a la vez, así como sus derechos.
fr: Via l'interface du studio, vous pouvez modifier plusieurs utilisateurs et groupes à la fois, ainsi que leurs droits.

source: Select the **Users** or **Groups** checkbox at the top of the list of users or groups.
de: Wählen Sie die Option **Benutzer** oder **Gruppen** am Anfang der Liste der Benutzer oder Gruppen.
es: Seleccione la casilla **Usuarios** o **Grupos** en la parte superior de la lista de usuarios o grupos.
fr: Cochez la case **Utilisateurs** ou **Groupes** en haut de la liste des utilisateurs ou des groupes.

source: Click one of the following icons to bulk edit users or groups:
de: Klicken Sie auf eines der folgenden Symbole, um Benutzer oder Gruppen massenhaft zu bearbeiten:
es: Haga clic en uno de los iconos siguientes para efectuar la edición masiva de usuarios o grupos:
fr: Cliquez sur l'une des icônes suivantes pour modifier plusieurs utilisateurs ou groupes à la fois :

source: |allow-edition-icon| lets you grant editing rights to all users or groups.
de: Mit |allow-edition-icon| können Sie allen Benutzern oder Gruppen Bearbeitungsrechte erteilen.
es: |allow-edition-icon| permite conceder derechos de edición a todos los usuarios o grupos.
fr: |allow-edition-icon| vous permet d'accorder des droits de modification à tous les utilisateurs ou groupes.

source: |forbid-edition-icon| lets you revoke editing rights from all users or groups.
de: Mit |forbid-edition-icon| können Sie allen Benutzern oder Gruppen die Bearbeitungsrechte entziehen.
es: |forbid-edition-icon| permite revocar los derechos de edición de todos los usuarios o grupos.
fr: |forbid-edition-icon| vous permet de retirer des droits de modification à tous les utilisateurs ou groupes.

source: |trash| lets you remove all users or groups from your page.
de: Mit |trash| können Sie alle Benutzer oder Gruppen von Ihrer Seite entfernen.
es: |trash| permite eliminar todos los usuarios o grupos de la página.
fr: |trash| vous permet de supprimer tous les utilisateurs ou groupes de votre page.
