Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_content_with_studio/publishing-page.po
Languages: de, es, fr, nl

source: Publishing a page
de: Eine Seite veröffentlichen
es: Publicar una página
fr: Publier une page
nl: Een pagina publiceren

source: You need to publish a page to make it available on your portal. After publishing, the page will be searchable and accessible to visitors, according to the visibility parameters you applied. If the page had already been published, what you publish will replace what was already online.
de: Um die Seite in Ihrem Portal verfügbar zu machen, müssen Sie sie veröffentlichen. Nach der Veröffentlichung kann die Seite gemäß den von Ihnen festgelegten Sichtbarkeitsparametern von Besuchern gesucht und aufgerufen werden. Wenn die Seite bereits veröffentlicht wurde, ersetzt diese neue Veröffentlichung den alten Online-Inhalt.
es: Tiene que publicar una página para que pueda estar disponible en su portal. Después de publicarla, los visitantes podrán buscar la página y acceder a ella, de acuerdo con los parámetros de visibilidad que haya aplicado. Si la página ya se había publicado, lo que publique sustituirá a lo que ya esté en línea.
fr: Vous devez publier une page pour la rendre disponible sur votre portail. Après sa publication, la page pourra être recherchée et consultée par les visiteurs, en fonction des paramètres de visibilité appliqués. Si la page a déjà été publiée, ce que vous publiez remplacera ce qui est déjà en ligne.
nl: U moet een pagina publiceren om deze beschikbaar te maken op uw portaal. Na het publiceren zal de pagina kunnen worden opgezocht en toegankelijk zijn voor bezoekers, volgens de zichtbaarheidsparameters die u hebt toegepast. Ingeval de pagina reeds gepubliceerd werd, zal datgene wat u publiceert datgene vervangen wat reeds online stond.

source: Prerequisites
de: Voraussetzungen
es: Requisitos previos
fr: Prérequis
nl: Voorvereisten

source: Before you can publish a page, you need to configure the page information and the page access.
de: Bevor Sie eine Seite veröffentlichen, müssen Sie die Seiteninformationen und den Zugriff auf die Seite konfigurieren.
es: Antes de poder publicar una página, tiene que configurar la información y el acceso de las páginas.
fr: Avant de pouvoir publier une page, vous devez configurer les informations et l'accès de la page.
nl: Alvorens u een pagina kunt publiceren, moet u de informatie over de pagina en de paginatoegang configureren.

source: For more information, see :ref:`configuring-page-info` and :ref:`managing-page-access`.
de: Weitere Informationen finden Sie unter :ref:`configuring-page-info` und :ref:`managing-page-access`.
es: Para obtener más información, consulte :ref:`configuring-page-info` y :ref:`managing-page-access`.
fr: Pour plus d'informations, consultez :ref:`configuring-page-info` et :ref:`managing-page-access`.
nl: Voor meer informatie, zie :ref:`configuring-page-info` en :ref:`managing-page-access`.

source: Publishing a page from the list of pages
de: Veröffentlichen einer Seite aus der Liste der Seiten
es: Publicar una página desde la lista de páginas
fr: Publier une page depuis la liste des pages
nl: Een pagina publiceren uit een lijst van pagina's

source: From the list of pages, you can publish a page in draft status.
de: Über die Liste der Seiten können Sie eine Seite veröffentlichen, die den Status "Entwurf" hat.
es: En la lista de páginas, puede publicar una página en estado de borrador.
fr: Depuis la liste des pages, vous pouvez publier une page à l'état Brouillon.
nl: Vanuit de lijst met pagina's kunt u een pagina publiceren in ontwerpstatus.

source: From the list of pages, hover over the desired page.
de: Bewegen Sie den Mauszeiger in der Liste der Seiten auf die gewünschte Seite.
es: En la lista de páginas, pase por encima de la página deseada.
fr: Passez le curseur sur la page souhaitée de la liste des pages.
nl: Ga vanuit de lijst met pagina's, met uw muis over de gewenste pagina.

source: Click the |eye| icon on the right side to publish the page.
de: Klicken Sie auf der rechten Seite auf das Symbol |eye|, um die Seite zu veröffentlichen.
es: Haga clic en el icono |eye| de la derecha para publicar la página.
fr: Cliquez sur l'icône |eye| à droite pour publier la page.
nl: Klik op het pictogram |eye| aan de rechterzijde om de pagina te publiceren.

source: Publishing a page from the preview
de: Veröffentlichen einer Seite aus der Vorschau
es: Publicar una página desde la vista previa
fr: Publier une page depuis l'aperçu
nl: Een pagina publiceren vanuit een voorbeeldweergave

source: When previewing a page, you can publish it directly from the preview.
de: Wenn Sie die Vorschau einer Seite aufrufen, können Sie die Seite direkt von dort aus veröffentlichen.
es: Al obtener la vista previa de una página, puede publicarla directamente desde the vista previa.
fr: Lorsque vous affichez l'aperçu d'une page, vous pouvez la publier directement depuis l'aperçu.
nl: Wanneer een voorbeeldweergave van een pagina wordt getoond, kunt u deze rechtstreeks vanuit de voorbeeldweergave publiceren.

source: When editing a page in the Studio, click the |play| icon from the left side pane.
de: Wenn Sie eine Seite im Studio bearbeiten, klicken Sie im linken Fenster auf das Symbol |play|.
es: Al editar una página en Studio, haga clic en el icono |play| del panel izquierdo.
fr: Lorsque vous modifiez une page dans le studio, cliquez sur l'icône |play| dans le volet de gauche.
nl: Wanneer een pagina wordt bewerkt in de Studio, klik op het pictogram |play| in het zijpaneel links.

source: Your page opens as a preview.
de: Eine Vorschau Ihrer Seite wird angezeigt.
es: Se abre la página en una vista previa.
fr: Votre page s'ouvre sous forme d'aperçu.
nl: Uw pagina wordt geopend als een voorbeeldweergave.

source: Click **Publish** in the top-right corner.
de: Klicken Sie oben rechts auf **Veröffentlichen**.
es: Haga clic en **Publicar** en la esquina superior derecha.
fr: Cliquez sur **Publier** en haut à droite.
nl: Klik op **Publiceren** in de rechter bovenhoek.

source: Publishing a page from the Studio
de: Veröffentlichen einer Seite im Studio
es: Publicar una página en Studio
fr: Publier une page depuis le studio
nl: Een pagina publiceren vanuit de Studio

source: From the Studio, you can publish a page in draft status.
de: Über das Studio können Sie eine Seite veröffentlichen, die den Status "Entwurf" hat.
es: En Studio, puede publicar una página en estado de borrador.
fr: Depuis le studio, vous pouvez publier une page à l'état Brouillon.
nl: Vanuit de Studio kunt u een pagina publiceren in ontwerpstatus.

source: From the list of pages, click the page to be published.
de: Klicken Sie in der Liste der Seiten auf die zu veröffentlichende Seite.
es: En la lista de páginas, haga clic en la página para publicar.
fr: Cliquez sur la page à publier dans la liste des pages.
nl: Klik vanuit de lijst van pagina's op de pagina die moet worden gepubliceerd.

source: The Studio opens.
de: Das Studio wird geöffnet.
es: Se abre Studio.
fr: Le studio s'ouvre.
nl: De Studio wordt geopend.

source: Click **Publish**.
de: Klicken Sie auf **Veröffentlichen**.
es: Haga clic en **Publicar**.
fr: Cliquez sur **Publier**.
nl: Klik op **Publiceren**.

source: Unpublishing a page from the list of pages
de: Die Veröffentlichung einer Seite über die Liste der Seiten aufheben
es: Cancelar la publicación de una página en la lista de páginas
fr: Dépublier une page depuis la liste des pages
nl: De publicatie van een pagina ongedaan maken vanuit de lijst van pagina's

source: From the list of pages, you can unpublish a page that has been previously published. This will make it unavailable to your users on your portal until you publish it again.
de: In der Seitenliste können Sie die Veröffentlichung einer bereits veröffentlichten Seite aufheben. Dadurch ist sie für Ihre Benutzer in Ihrem Portal nicht mehr sichtbar, bis Sie sie erneut veröffentlichen.
es: En la lista de páginas, puede cancelar la publicación de una página publicada con anterioridad. De este modo, dejará de estar disponible para los usuarios en su portal hasta que la publique de nuevo.
fr: Depuis la liste des pages, vous pouvez dépublier une page précédemment publiée. Celle-ci sera alors indisponible pour les utilisateurs de votre portail jusqu'à ce que vous la publiiez à nouveau.
nl: Vanuit de lijst van pagina's kunt u de publicatie van een pagina, die eerder werd gepubliceerd, ongedaan maken. Hierdoor wordt deze onbeschikbaar voor uw gebruikers op uw portaal tot u deze opnieuw publiceert.

source: Click the |eye-slash| icon on the right side to unpublish the page.
de: Klicken Sie auf der rechten Seite auf das Symbol |eye-slash|, um die Veröffentlichung der Seite aufzuheben.
es: Haga clic en el icono |eye-slash| de la derecha para cancelar la publicación de la página.
fr: Cliquez sur l'icône |eye-slash| à droite pour dépublier la page.
nl: Klik op het pictogram |eye-slash| aan de rechterzijde om de publicatie van de pagina ongedaan te maken.
