Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/about.po
Languages: fr

source: Introducing OpenDataSoft
fr: A propos d'OpenDataSoft

source: OpenDataSoft is a platform that has been specifically designed for non-technical business users to share, publish and reuse structured data.
fr: La plateforme OpenDataSoft a été conçue pour permettre à un utilisateur non technique de publier, partager et réutiliser des données structurées.

source: SaaS-based and with a cost-effective approach, it is the perfect solution to get the best out of data collection, transformation and sharing.
fr: Basée sur un modèle en SaaS et une approche économique, c'est une solution parfaite pour tirer le meilleur de vos données, de leur acquisition à leur publication en passant par leur transformation.

source: No need for intense training. Only a few hours are necessary to be fully up to speed.
fr: Nul besoin d'une formation intensive. Quelques heures d'entraînement seulement sont nécessaires pour maîtriser la plateforme.

source: Business users can publish and transform datasets.
fr: Les utilisateurs métiers peuvent transformer et publier leurs jeux de données.

source: Reusers can share easy-to-understand interactive data visualizations on the Web.
fr: Les simples utilisateurs peuvent partager sur le Web des visualisations de données interactives simples à comprendre et à utiliser.

source: Developers can integrate heterogeneous datasets into Web and mobile applications.
fr: Les développeurs peuvent intégrer les données et/ou le résultat d'analyses à leurs applications Web et mobile.

source: The OpenDataSoft platform can be used to build public Open Data portals, internal data management repositories, smart cities platforms, data market places...
fr: La plateforme OpenDataSoft peut être utilisée pour construire des portails Open Data, des systèmes de gestion de données internes, des plateformes smart cities, des places de marchée de données ...

source: The graph below displays the platform architecture in a simple way.
fr: La figure ci-dessous présente une vue macroscopique de l'architecture de la plateforme.

source: The OpenDataSoft platform is unique because it gathers in one single software all the features business users need to make value out of their data.
fr: L'approche d'OpenDataSoft est unique car elle rassemble dans une seule plateforme toutes les fonctionnalités dont les utilisateurs métiers ont besoin pour valoriser leurs données.

source: Of course, it might not be suitable for every data management use case: the setup of a dedicated ETL, BI platform, Big Data Analytics tool... can still be required. But whatever the case, OpenDataSoft can be used as the best complementary solution to ease the publishing workflow.
fr: La plateforme OpenDataSoft peut également être le complément idéal à des systèmes classiques (plus complexes à mettre en oeuvre mais parfois nécessaires, tels que des ETLs, plateformes de BI, plateformes d'analyse Big Data) pour simplifier et accélérer le processus de partage et/ou d'ouverture de données.

source: To sum up, if you have data, if you have applicative business use cases but no solution to fill the gap between your data and your applications, you are at the right place!
fr: En résumé, si vous produisez des données et si vous avez des cas d'applications métiers utilisant ces données mais que vous avez du mal à rapprocher les deux, vous êtes au bon endroit.

source: So, what about starting with our `free trial <http://playground.opendatasoft.com/signup>`_ version?
fr: Alors, pourquoi ne pas commencer par essayer notre `version d'essai <http://playground.opendatasoft.com/signup>`_ ?
