Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/accessibility.po
Languages: it

source: Accessibility
it: Accessibilità

source: OpenDataSoft uses two referentials' guidelines at AA levels for Accessibility:
it: Per l'accessibilità, OpenDataSoft adotta due linee guida di livello AA:

source: Here are a few examples of what the OpenDataSoft platform implements to improve accessibility:
it: Ecco alcune delle caratteristiche implementate nella piattaforma OpenDataSoft per aumentarne l'accessibilità:

source: The decorative elements have WAI-ARIA attributes to avoid text-to-speech triggering
it: Gli elementi decorativi presentano attributi WAI-ARIA per evitare l'attivazione involontaria della sintesi vocale.

source: The images are tagged with alt attributes and meaningful titles
it: Le immagini sono taggate con attributi ALT e titoli significativi.

source: The links are tagged with a meaningful description
it: I link sono taggati con descrizioni significative

source: All of the user interface elements are navigable with a keyboard (including tabs and tabular data)
it: Tutti gli elementi dell'interfaccia utente sono navigabili con la tastiera (incluse le schede e i dati delle tabelle).

source: When using different languages, elements are properly tagged to ensure a better text-to-speech
it: Nel caso in cui l'interfaccia sia multilingue, gli elementi sono taggati in modo da assicurare un'adeguata sintesi vocale.

source: The modal windows have appropriate focus and focus cycling
it: Le finestre modali presentano focus e cicli di focus adeguati.

source: Despite our best efforts, if you encounter an accessibility issue on the platform, please let us know by sending a report to accessibility@opendatasoft.com
it: Se malgrado i nostri sforzi per migliorare l'accessibilità riscontri un problema di questo tipo sulla piattaforma, inviaci un report all'indirizzo accessibility@opendatasoft.com

source: When sending a report, please include these information:
it: Al momento di inviare il tuo report, non dimenticare di includere queste informazioni:

source: **Your browser**\*
it: **Il tuo browser**\*

source: **Your operating system**\*
it: **Il tuo sistema operativo**\*

source: **Your screenreader**
it: **Il tuo screenreader**

source: **A description of the issues you're encountering**
it: **Una descrizione del problema riscontrato**

source: \*Please include the version numbers, use |thismachine| or |whatismybrowser| to find out easily
it: \*Segnala anche la versione: per recuperarla, puoi utilizzare |thismachine| o |whatismybrowser|.

source: We will do our best to fix those issues in the forthcoming releases.
it: Faremo del nostro meglio per risolvere questi problemi nelle prossime versioni della piattaforma.
