Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/faq.po
Languages: de, es, fr, it, nl

source: It is possible to activate the full DCAT template, thus adding the following additional metadata:
de: Es kann auch die gesamte DCAT-Vorlage aktiviert werden, hierzu müssen die folgenden zusätzlichen Metadaten hinzugefügt werden:
es: Se puede activar la plantilla DCAT completa y, por ende, añadir los metadatos adicionales siguientes:
fr: Il est également possible d'activer le modèle DCAT complet, permettant d'ajouter les métadonnées suivantes :
it: È inoltre possibile attivare il modello DCAT completo, aggiungendo così i seguenti metadati:
nl: Het is mogelijk om de volledige DCAT-template te activeren en zo de volgende extra metadata toe te voegen:

source: A full `INSPIRE <http://inspire.ec.europa.eu/index.cfm/pageid/101>`_ template is also available and can be activated on demand.
de: Eine komplette `INSPIRE <http://inspire.ec.europa.eu/index.cfm/pageid/101>`_ Vorlage ist ebenfalls verfügbar und kann auf Anfrage aktiviert werden.
es: También existe una plantilla `INSPIRE <http://inspire.ec.europa.eu/index.cfm/pageid/101>`_ completa que se puede activar bajo demanda.
fr: OpenDataSoft supporte également le modèle de métadonnées `INSPIRE <http://inspire.ec.europa.eu/index.cfm/pageid/101>`_, activable à la demande.
it: In aggiunta, è disponibile integralmente anche il modello `INSPIRE <http://inspire.ec.europa.eu/index.cfm/pageid/101>`_, attivabile su richiesta.
nl: Ook is een volledige `INSPIRE <http://inspire.ec.europa.eu/index.cfm/pageid/101>`_ template beschikbaar en deze kan op verzoek worden geactiveerd.

source: The metadata template can be customized (adding custom metadata). To do so, simply issue a support request from your OpenDataSoft's back-office.
de: Die Metadatenvorlage kann angepasst werden (durch Hinzufügen benutzerspezifischer Metadaten). Hierfür einfach eine Support-Anfrage aus Ihrem OpenDataSoft-Back-Office stellen.
es: La plantilla de metadatos se puede personalizar (añadiendo metadatos personalizados). Para ello, simplemente ejecute una solicitud de soporte desde el back office de OpenDataSoft.
fr: Le modèle de métadonnées est personnalisable (ajout de métadonnées personnalisées). À cette fin, envoyez une demande d'assistance depuis votre back office OpenDataSoft.
it: Il modello di metadati può essere personalizzato aggiungendo altri metadati. Per fare ciò, invia una richiesta di assistenza dall'interfaccia di back-office OpenDataSoft.
nl: De metadata-template kan gepersonaliseerd worden (door aanpasbare metadata toe te voegen). Hiervoor moet u gewoon een ondersteuningsverzoek indienen bij de back-office van OpenDataSoft.

source: **How many datasets can I create?**
de: **Wie viele Datensätze kann ich erstellen?**
es: **¿Cuántos conjuntos de datos puedo crear?**
fr: **Combien de jeux de données puis-je créer ?**
it: **Quanti dataset posso creare?**
nl: **Hoeveel datasets kan ik aanmaken?**

source: You can create as many datasets as you want within the limit set in your licensing plan.
de: Sie können so viele Datensätze erstellen, wie Sie möchten, so lange Sie die in Ihrem Lizenzplan eingestellte Grenze nicht überschreiten.
es: Puede crear tantos conjuntos de datos como desee dentro del límite establecido en el plan de licencia.
fr: Vous pouvez créer autant de jeu de données que votre licence le permet.
it: Puoi creare tutti i dataset che desideri, nei limiti previsti dalla tua licenza.
nl: Binnen de limiet van uw licentieplan kan u zoveel datasets aanmaken als u wil.

source: **How could I modify the look & feel of my OpenDataSoft domain?**
de: **Wie kann ich Aussehen & Eindruck meiner OpenDataSoft-Domain ändern?**
es: **¿Cómo puedo modificar la apariencia de mi dominio de OpenDataSoft?**
fr: **Comment puis-je modifier l'apparence de mon portail OpenDataSoft ?**
it: **Como posso modificare il look & feel del mio portale OpenDataSoft?**
nl: **Hoe kan ik de look & feel van mijn OpenDataSoft-domein wijzigen?**

source: As a domain administrator, you can fully customize the styling of your portal. Logos, pictos, colors, styles as well as the header, the footer and the dataset box layout in the catalog page can be fully customized.
de: Als Domain-Administrator können Sie den Stil Ihres Portals beliebig anpassen. Logos, Piktogramme, Farben, Styles sowie Kopf- und Fußzeilen und das Layout der Datensatz-Box auf der Katalogseite können komplett benutzerspezifisch angepasst werden.
es: Como administrador del dominio, puede personalizar por completo la apariencia del portal. Tanto los logotipos, pictogramas, colores y estilos como el diseño del encabezado, el pie de página y el cuadro de conjuntos de datos de la página de catálogo son totalmente personalizables.
fr: En tant qu'administrateur du domaine, vous pouvez totalement personnaliser l'apparence de votre portail. Les logos, les pictogrammes, les couleurs, les styles ainsi que la disposition de l'en-tête, du pied de page et des jeux de données dans la page du catalogue sont entièrement personnalisables.
it: In qualità di amministratore del dominio, puoi personalizzare totalmente l'aspetto del tuo portale: ad esempio, i loghi, i pittogrammi, i colori, gli stili, nonché il layout dell’header, del footer e dei dataset visualizzati nella pagina del catalogo.
nl: Als domeinbeheerder kan u de styling van uw portaal volledig personaliseren. Logo's, afbeeldingen, kleuren, stijlen, alsook de header, de footer en de lay-out van de datasetbox in de cataloguspagina kunnen volledig worden gepersonaliseerd.

source: **How can other people collaborate on dataset configuration?**
de: **Wie können andere an der Datensatzkonfiguration mitarbeiten?**
es: **¿Cómo pueden colaborar otras personas en la configuración de los conjuntos de datos?**
fr: **Plusieurs utilisateurs peuvent-ils participer à la configuration du même jeu de données ?**
it: **In che modo posso coinvolgere altri collaboratori nella configurazione del dataset?**
nl: **Hoe kunnen andere mensen helpen bij het configureren van datasets?**

source: Use the security section in your dataset's configuration page in OpenDataSoft's back-office to give other users or groups of users a write access to the dataset. These users should also have access to your domain to access your dataset. If this is not the case already, you should contact your domain administrator.
de: Um anderen Benutzern oder Benutzergruppen Schreibzugriff auf den Datensatz zu gewähren, können Sie den Abschnitt Sicherheit auf Ihrer Datensatz-Konfigurationsseite im OpenDataSoft-Back-Office nutzen. Diese Benutzer sollten auch Zugriff auf Ihre Domain haben, um auf Ihre Datensätze zugreifen zu können. Falls dies noch nicht der Fall ist, sollten Sie Ihren Domain-Administrator kontaktieren.
es: Utilice la sección de seguridad de la página de configuración del conjunto de datos en el back office de OpenDataSoft para dar a otros usuarios o grupos de usuarios acceso de escritura al conjunto de datos. Estos usuarios también deberían tener acceso al dominio para acceder al conjunto de datos. Si no es así, póngase en contacto con el administrador del dominio.
fr: Oui, il suffit de donner des droits d'accès en écriture sur le jeu de données à d'autres utilisateurs dans la section sécurité de la page de configuration de vos jeux de données. Ces utilisateurs doivent avoir accès à votre domaine pour pouvoir accéder au jeu de données. Si ce n'est pas le cas, contactez l'administrateur de votre domaine.
it: Nell’interfaccia di back-office, vai alla pagina di configurazione del dataset ed entra nella sezione Sicurezza: qui potrai assegnare l’accesso in scrittura ad altri utenti o gruppi. Per usufruire di tale permesso, gli utenti devono prima di ogni cosa avere accesso al dominio. In caso contrario, è necessario contattare l’amministratore del dominio stesso.
nl: Gebruik de veiligheidssectie in de configuratiepagina van uw dataset in de back-office van OpenDataSoft om andere gebruikers of groepen van gebruikers schrijftoegang te verlenen tot de dataset. Deze gebruikers zouden ook toegang moeten hebben tot uw domein om toegang te hebben tot uw dataset. Indien dit nog niet het geval is, dient u contact op te nemen met uw domeinbeheerder.

source: **How can I transform and enrich my datasets?**
de: **Wie kann ich meine Datensätze transformieren und anreichern?**
es: **¿Cómo puedo transformar y enriquecer mis conjuntos de datos?**
fr: **Comment puis-je transformer et enrichir mes jeux de données ?**
it: **Come posso trasformare e arricchire i miei dataset?**
nl: **Hoe kan ik mijn datasets transformeren en verrijken?**

source: A rich set of processing features is made available in the publishing console. Simply hit the **Add Processor** button.
de: In der Veröffentlichungskonsole steht Ihnen ein reichhaltiges Angebot an Verarbeitungsfunktionen zur Verfügung. Einfach auf die Schaltfläche **Prozessor hinzufügen** klicken.
es: En la consola de publicación encontrará a su disposición múltiples funciones de procesamiento. Tan solo debe hacer clic en el botón **Añadir procesador**.
fr: De nombreuses fonctions d'enrichissement et de transformation des données sont disponibles. Il vous suffit de cliquer sur le bouton **Ajouter un processeur** pour y accéder.
it: La console di pubblicazione offre un’ampia varietà di funzioni di elaborazione, che puoi selezionare cliccando su **Aggiungi un processore**.
nl: Een uitgebreide reeks verwerkingsfuncties is beschikbaar gesteld op de publicatieconsole. Druk gewoon op de knop "Voeg processor toe".

source: **Can I geocode a full-text address?**
de: **Kann ich eine Volltext-Adresse geokodieren?**
es: **¿Puedo geocodificar una dirección de texto completo?**
fr: **Est-ce que les processeurs peuvent me permettre de géocoder une adresse ?**
it: **È possibile effettuare la geocodifica di un indirizzo full-text?**
nl: **Kan ik een volledig tekstadres geocoden?**

source: Yes.
de: Ja.
es: Sí.
fr: Oui.
it: Sì.
nl: Ja.

source: OpenDataSoft supports Google and ESRI geocoding services. However, OpenDataSoft doesn't come with geocoding API keys. The domain administrator has to configure a geocoding API key for one of these services in the back-office configuration (*Configuration > Data processing*).
de: OpenDataSoft unterstützt die Google- und ESRI-Geocoding-Services. Dennoch bietet OpenDataSoft keine Geocoding API-Schlüssel. Der Domain-Administrator muss einen Geocoding API-Schlüssel für einen dieser Dienste in der Back-Office-Konfiguration (*Konfiguration > Datenverarbeitung*) einrichten.
es: OpenDataSoft admite los servicios de geocodificación de Google y ESRI. No obstante, OpenDataSoft no suministra las claves de la API de geocodificación. El administrador del dominio tiene que configurar una clave de API de geocodificación para uno de estos servicios en la configuración del back office (*Configuración > Procesamiento de datos*).
fr: OpenDataSoft prend en charge les services de géocodage d'ESRI et de Google, mais ne fournit pas les clés d'API correspondantes. L'administrateur du domaine doit configurer les clés d'API à utiliser pour ces services dans la configuration du back office (*Configuration > Traitement de données*).
it: OpenDataSoft supporta i servizi di geocodifica di Google ed ESRI, ma non fornisce una chiave API. Spetta all’amministratore del dominio configurare la chiave API di geocodifica per uno di questi servizi, nell’apposita sezione dell’interfaccia di back-office (*Configurazione > Elaborazione dei dati*).
nl: OpenDataSoft ondersteunt de geocoding diensten van Google en ESRI. OpenDataSoft is echter niet voorzien van geocoding API-sleutels. De domeinbeheerder moet een geocoding API-sleutel voor één van deze diensten configureren in de configuratie van de back-office ("Configuratie > Dataverwerking").

source: **I have geocoded data in my dataset but the map view doesn't display anything. What went wrong?**
de: **In meinem Datensatz befinden sich geokodierte Daten, doch auf der Kartenansicht ist nichts zu sehen. Wo liegt der Fehler?**
es: **He geocodificado datos en mi conjunto de datos pero la vista de mapa no muestra nada. ¿Qué ha pasado?**
fr: **Mon jeu de données contient des géocodes mais ma carte n'affiche rien. Que faire ?**
it: **Il mio dataset contiene dati geocodificati, ma la mappa non li visualizza. A cosa è dovuto il problema?**
nl: **Ik heb data in mijn dataset geocoded maar op de kaartweergave verschijnt niets. Wat is er fout gegaan?**

source: Remember that you dataset must contain at least a field of type **Geo Point** or **Geo Shape**
de: Ihr Datensatz muss zumindest ein Feld vom Typ **Geopunkt** oder **Geoform** enthalten
es: Recuerde que el conjunto de datos debe contener como mínimo un campo de tipo **Punto geográfico** o **Forma geográfica**.
fr: Rappelez-vous que pour proposer une visualisation cartographique, votre jeu de données doit contenir un champ de type **Geo Point** ou **Geo Shape**.
it: Ricorda che il tuo dataset deve contenere almeno un campo **geopoint** o **geoshape**.
nl: Denk eraan dat uw dataset minstens een veld van het type **Geo Point** of **Geo Shape** moet bevatten

source: Geo Point: ``latitude,longitude`` in WGS84, e.g.: ``48.2567,3.7689``.
de: Geopunkt: "Breitengrad, Längengrad" in WGS84, z. B.: ``48.2567,3.7689``.
es: Punto geográfico: ``latitud,longitud`` en WGS84, p. ej.: ``48.2567,3.7689``.
fr: Geo Point : ``latitude,longitude`` en WGS84, par exemple : ``48.2567,3.7689``.
it: Geopoint: ``latitudine,longitudine`` in formato WGS84. Ad esempio: ``48.2567,3.7689``.
nl: Geo Point: ``lengtegraad,breedtegraad`` in WGS84, bijv.: ``48.2567,3.7689``.

source: Geo Shape: any valid Geo JSON geometry in WGS84
de: Geoform: jede gültige JSON Geometrie in WGS84
es: Forma geográfica: cualquier geometría GeoJSON válida en WGS84
fr: Geo Shape: toute géométrie Geo JSON valide en WGS84.
it: Geoshape: qualsiasi geometria Geo JSON valida in formato WGS84.
nl: Geo Shape: elke geldige Geo JSON geometrie in WGS84

source: **What is a facet?**
de: **Was ist ein Facet?**
es: **¿Qué es una faceta?**
fr: **Qu'est-ce qu'une facette ?**
it: **Cos’è un facet?**
nl: **Wat is een facet?**

source: Facets are the backbone of most of the features made available by the OpenDataSoft platform. A facet is simply a field which has been given specific filtering and aggregation capabilities.
de: Facets sind die Grundlage für die meisten Funktionen, die die OpenDataSoft-Plattform anbietet. Ein Facet ist ganz einfach ein Feld, dem bestimmte Filter- und Aggregationseigenschaften verliehen wurden.
es: Las facetas constituyen la espina dorsal de la mayoría de las funciones disponibles a través de la plataforma OpenDataSoft. Una faceta es simplemente un campo con posibilidades de filtro y agregación específicas.
fr: Les facettes sont à la base d'un grand nombre de fonctionnalités proposées par la plateforme OpenDataSoft. Une facette est simplement un champ auquel ont été attribuées des capacités d'agrégation et de filtrage.
it: I facet sono alla base di gran parte delle funzionalità disponibili sulla piattaforma OpenDataSoft. Si tratta di campi a cui sono state assegnate facoltà di filtro e di aggregazione.
nl: Facetten zijn de ruggengraat van de meeste van de functionaliteiten die beschikbaar worden gesteld door het OpenDataSoft-platform. Een facet is gewoon een veld waaraan specifieke filter- en aggregatiemogelijkheden werden toegekend.

source: In the example above, the fields **country** and **year** have been defined as facets (notice the filter button next to the type select).
de: Im oben genannten Beispiel wurden die Felder **Land** und **Jahr** als Facets definiert (siehe Filter-Schaltfläche neben der Typ-Auswahl).
es: En el ejemplo anterior, los campos **country** y **year** se han definido como facetas (fíjese en el botón de filtro situado junto a la selección de tipo).
fr: Dans l'exemple ci-dessus, les champs **country** et **year** ont été définis comme facettes (notez le bouton **Facette** en surbrillance à côté du nom du champ).
it: Nell’esempio qui sopra, i campi **paese** e **anno** sono stati definiti come facet (il pulsante **Facet** si trova accanto alla selezione del tipo).
nl: In het bovenstaande voorbeeld werden de velden **land** en **jaar** gedefinieerd als facetten (merk de filterknop op naast het type selectie).

source: Facets can be seen as dimensions of a dataset. Facets can be defined on the following field types:
de: Facets kann man als Dimensionen eines Datensatzes ansehen. Facets können für folgende Feldtypen definiert werden:
es: Las facetas pueden entenderse como dimensiones de un conjunto de datos. Las facetas se pueden definir con los tipos de campo siguientes:
fr: Les facettes peuvent être assimilées aux dimensions des jeux de données. Les facettes peuvent être définies sur les types de champs suivants :
it: I facet possono essere considerati come grandezze di un dataset e si definiscono in base ai seguenti tipi di campi:
nl: Facetten kunnen beschouwd worden als de afmetingen van een dataset. Facetten kunnen gedefinieerd worden voor de volgende types velden:

source: Facets shall only be configured for fields that have a small number of different values compared to the number of records in a dataset. For instance, defining a facet on an field that would uniquely identify a record is useless as filtering on this field wouldn't bring any added value.
de: Facets sollten nur für Felder konfiguriert werden, die eine geringe Anzahl an verschiedenen Werten im Vergleich zu der Anzahl an Einträgen in einem Datensatz enthalten. So ist es beispielsweise sinnlos, ein Facet für ein Feld zu definieren, das nur einen einzigen Eintrag enthält, da ein Filtern dieses Felds keinen Mehrwert liefern würde.
es: Las facetas solo deben configurarse para aquellos campos que tengan un pequeño número de valores en comparación con el número de registros de un conjunto de datos. Por ejemplo, definir una faceta en un campo que identifica únicamente un registro es inútil puesto que filtrar este campo no aporta valor añadido.
fr: Les facettes ne sont utiles que pour les champs qui représentent un petit nombre de valeurs par rapport au nombre d'enregistrements du jeu de données. Configurer une facette sur un champ qui ne fait qu'identifier un enregistrement est complètement inutile par exemple, car le filtrage de celui-ci n'apporterait aucun avantage.
it: In un dataset, dovrebbero essere impostati come facet solo quei campi che contengono pochi valori differenti in rapporto alla mole dei record presenti. Farlo su un campo che identifichi già un unico record sarebbe inutile, poiché il filtro dei dati non apporterebbe alcun vantaggio.
nl: Facetten worden enkel geconfigureerd voor velden die een kleiner aantal verschillende waarden hebben in vergelijking met het aantal records in een dataset. Bijvoorbeeld, het definiëren van een facet voor een veld waardoor enkel één record wordt geïdentificeerd, is nutteloos aangezien het filteren op dit veld geen enkele toegevoegde waarde zou hebben.

source: Facets are then used in a couple of places.
de: Facets werden außerdem an zahlreichen verschiedenen Stellen eingesetzt.
es: Las facetas se utilizan en un par de sitios.
fr: Les facettes sont à la base de nombreuses fonctionnalités.
it: I facet vengono impiegati principalmente in due modi.
nl: Facetten worden vervolgens gebruik in een aantal plaatsen.

source: You can first use them to filter dataset records in the explore console.
de: Sie können sie zunächst zum Filtern von Datensatzeinträgen in der Untersuchungskonsole verwenden.
es: En primer lugar, puede usarlas para filtrar registros de conjuntos de datos en la consola de exploración.
fr: Filtrer les enregistrements dans la console d'exploration des jeux de données.
it: Innanzitutto puoi utilizzarli per filtrare i record dei dataset nella console di esplorazione.
nl: U kan deze in de eerste plaats gebruiken om records van datasets te filteren in de explore console.

source: As dimensions, facets support aggregations. You can thus use them to build advanced charts, as in the example below.
de: Als Dimensionen unterstützen Facets Aggregationen. Sie können sie somit zum Erstellen von erweiterten Diagrammen nutzen, wie im Beispiel unten gezeigt.
es: Al igual que las dimensiones, las facetas admiten agregaciones. Después puede usarlas para compilar gráficos avanzados, como en el ejemplo siguiente.
fr: En tant que dimensions, les facettes peuvent porter des agrégations. Ainsi, vous pouvez les utiliser pour construire des graphiques élaborés comme dans l'exemple ci-dessous.
it: In quanto grandezze dei dataset, supportano inoltre le aggregazioni, risultando così utili per la creazione di grafici avanzati come quello riportato qui sotto.
nl: Als afmetingen ondersteunen facetten aggregaties. U kan deze vervolgens gebruiken om geavanceerde grafieken te maken, zoals in onderstaand voorbeeld wordt geïllustreerd.

source: **I have an OpenDataSoft free trial account, how can I get a premium account?**
de: **Ich habe ein kostenloses Probekonto bei OpenDataSoft, wie kann ich ein Premium-Konto bekommen?**
es: **Tengo una cuenta OpenDataSoft de prueba gratuita, ¿cómo puedo conseguir una cuenta Premium?**
fr: **J'ai activé une version d'essai sur OpenDataSoft, comment passer au compte premium ?**
it: **Ho attivato un account di prova gratuito OpenDataSoft. Come posso passare a un account premium?**
nl: **Ik heb een gratis testaccount voor OpenDataSoft. Hoe kan ik een premium account bekomen?**

source: Please send a message to <contact@opendatasoft.com>.
de: Bitte kontaktieren Sie <contact@opendatasoft.com>.
es: Envíe un mensaje a <contact@opendatasoft.com>.
fr: Merci d'envoyer un message à `<contact@opendatasoft.com>`_.
it: Ti invitiamo a contattarci all’indirizzo: `<contact@opendatasoft.com>`_.
nl: U kan een bericht sturen naar <contact@opendatasoft.com>.

source: We will be happy to discuss your needs and to propose you one of our plans.
de: Wir freuen uns, mit Ihnen über Ihren Bedarf zu sprechen und Ihnen eines unserer Modelle vorzuschlagen.
es: Estaremos encantados de estudiar sus necesidades y proponerle uno de nuestros planes.
fr: Nous serons heureux de discuter de vos besoins et de vous proposer l'abonnement approprié.
it: Saremo lieti di conoscere le tue esigenze e di proporti l’abbonamento che fa al caso tuo.
nl: We zullen met veel plezier uw noden bespreken en u één van onze plannen voorstellen.

source: **How can I display points on a map?**
de: **Wie kann ich Punkte auf einer Karte anzeigen?**
es: **¿Cómo puedo visualizar puntos en un mapa?**
fr: **Comment puis-je afficher des points sur une carte ?**
it: **Come posso visualizzare i punti su una mappa?**
nl: **Hoe kan ik punten op een kaart weergeven?**

source: For a geo data visualization to be available, your dataset needs to contain a **Geo Point 2D** field with content in the ``latitude,longitude`` format. For instance: ``48.2567,3.7689``.
de: Damit die Geodatenvisualisierung zur Verfügung steht, muss Ihr Datensatz ein **2D-Geopunkt**-Feld mit Content im ``Breitengrad, Längengrad"-Format enthalten. Beispiel: ``48.2567,3.7689``.
es: Para que una visualización de datos geográficos esté disponible, el conjunto de datos tiene que incluir un campo **Punto geográfico** con contenido según el formato ``latitud,longitud``. Por ejemplo: ``48.2567,3.7689``.
fr: Pour une visualisation géographique des données, votre jeu de données doit contenir un champ de type **Point géo 2D** au format ``latitude,longitude``. Par exemple : ``48.2567,3.7689``.
it: Per poter visualizzare i dati geografici, il tuo dataset deve contenere un campo **geopoint 2D** nel formato ``latitudine,longitudine``. Ad esempio: ``48.2567,3.7689``.
nl: Opdat het weergeven van geo data beschikbaar is, moet uw dataset een **Geo Point 2D**-veld bevatten met content in het ``lengtegraad,breedtegraad`` formaat. Bijvoorbeeld: ``48.2567,3.7689``.
