Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/faq.po
Languages: de, es, fr, it, nl

source: **In the table view, I have not been able to sort the results using a specific field? What went wrong?**
de: **Ich konnte die Ergebnisse in der Tabellenansicht nicht mit einem spezifischen Feld sortieren. Wo liegt der Fehler?**
es: **En la vista de tabla, no he podido ordenar los resultados por un campo específico. ¿Qué ha pasado?**
fr: **Dans la vue tableau, je n'ai pas pu trier les résultats en fonction du champ qui m'intéressait ; que s'est-il passé ?**
it: **Non riesco a ordinare i risultati della visualizzazione Tabella in base a un campo specifico. A cosa è dovuto il problema?**
nl: **In het tabelbeeld kon ik de resultaten niet sorteren door gebruik te maken van een specifiek veld? Wat is er fout gegaan?**

source: By default, only the numerical fields are sortable. That is, fields having one of the following types:
de: Standardmäßig sind nur die numerischen Felder sortierbar. D. h. Felder mit einem der folgenden Typen:
es: De forma predeterminada, solo son ordenables los campos numéricos, es decir, los campos que tienen uno de los tipos siguientes:
fr: Par défaut, seuls les champs numériques sont triables. Cela inclut les types de champs suivants :
it: Per impostazione predefinita, solo i campi numerici sono ordinabili. In altri termini, il campo deve appartenere a uno dei seguenti tipi:
nl: Standaard kunnen enkel numerieke velden worden gesorteerd. Dit zijn velden van één van de volgende types:

source: **Text** fields are not sortable by default. The dataset owner may configure some text fields to be sortable. Sortable **text** fields can be identified through the API (``sortable`` annotation).
de: **Text**-Felder sind standardmäßig nicht sortierbar. Der Datensatzeigentümer kann einige Textfelder so konfigurieren, dass sie sortierbar sind. Sortierbare **Text**-Felder können über eine API gekennzeichnet werden (Anmerkung "sortierbar").
es: Los campos de **texto** no son ordenables de forma predeterminada. El propietario del conjunto de datos puede configurar algunos campos de texto para ser ordenables. Los campos de **texto** ordenables se pueden identificar mediante la API (anotación ``sortable``).
fr: Par défaut les champs de type **texte** ne sont pas triables, mais le propriétaire du jeu de données peut configurer individuellement un tel champ pour qu'il soit triable. Les champs **texte** qui peuvent être triés peuvent être identifiés via le schéma dans l'API (annotation ``sortable``).
it: Normalmente, i campi **testuali** non sono ordinabili, ma il proprietario del dataset potrebbe configurarne alcuni attribuendo loro questa proprietà. I campi **testuali** ordinabili possono essere identificati tramite l'API (annotazione ``sortable``).
nl: **Tekst**-velden kunnen standaard niet worden gesorteerd. De eigenaar van de dataset kan sommige tekstvelden zodanig configureren dat ze wel kunnen worden gesorteerd. Sorteerbare **tekst**-velden kunnen geïdentificeerd worden door middel van de API (opschrift "sorteerbaar")

source: **I published a dataset, but no category is displayed in the left column. What shall I do?**
de: **Ich habe einen Datensatz veröffentlicht, doch in der linken Spalte wird keine Kategorie angezeigt. Was soll ich tun?**
es: **He publicado un conjunto de datos, pero no se visualiza ninguna categoría en la columna izquierda. ¿Qué debo hacer?**
fr: **Je viens de publier un jeu de données, mais aucune catégorie n'est affichée dans la colonne de gauche. Que dois-je faire ?**
it: **Ho pubblicato un dataset, ma nella colonna di sinistra non compare nessuna categoria. Cosa posso fare?**
nl: **Ik heb een dataset gepubliceerd, maar er wordt geen categorie weergegeven in de linker kolom. Wat moet ik doen?**

source: Categories (facets) are built out of fields which have been defined as a **facet**. To set a field as a facet, simply click on the **filter** icon, in the field definition header in the publishing console.
de: Kategorien (Facets) werden aus Feldern erstellt, die als **Facet** definiert wurden. Um ein Feld als Facet einzurichten, klicken Sie einfach auf das "Filter"-Icon in der Feldbestimmungskopfzeile in der Veröffentlichungskonsole.
es: Las categorías (facetas) se crean a partir de los campos que se han definido como una **faceta**. Para establecer un campo como una faceta, simplemente haga clic en el icono de **filtro**, en el encabezado de definición del campo de la consola de publicación.
fr: Les catégories (facettes) sont construites à partir des champs qui ont été définis comme "facette". Pour cela, cliquez sur l'icône de **filtre** de l'entête du champ dans l'interface de publication.
it: Le categorie vengono elaborate a partire dai campi definiti come **facet**. Per assegnare a un campo il valore di facet, vai nella console di pubblicazione e clicca sull'icona di **filtro** presente nell'header di definizione del campo.
nl: Categorieën (facetten) zijn opgebouwd uit velden die werden gedefinieerd als een **facet**. Om een veld in te stellen als een facet, hoeft u enkel te klikken op het pictogram **filter** in de header van de definitie van het veld in de publicatieconsole.

source: **When I go to the analyze view, the displayed chart doesn't make any sense. How could I change this?**
de: **Wenn ich zur Analyseansicht gehe, ergibt das angezeigte Diagramm keinen Sinn. Wie kann ich das ändern?**
es: **Cuando voy a la vista de análisis, el gráfico que se visualiza no es significativo. ¿Cómo puedo cambiarlo?**
fr: **Lorsque j'arrive sur la vue analyse, le graphe affiché n'est pas très représentatif. Comment puis-je changer ce graphe affiché par défaut ?**
it: **Quando accedo alla visualizzazione di analisi, il grafico presenta i dati in maniera incoerente. Come posso risolvere questo problema?**
nl: **Wanneer ik naar het analysebeeld ga, is de weergegeven grafiek volkomen zinloos. Hoe kan ik dit veranderen?**

source: The dataset owner can easily define the default analytical representation of the dataset using the **analyze tab** in the publishing console. End-users can also simply choose different settings and build their own analytical data visualization using the available controls.
de: Der Datensatzeigentümer kann die standardmäßige analytische Darstellung des Datensatzes definieren, indem er den **Anaylse-Tab** in der Veröffentlichungskonsole verwendet. Auch Endbenutzer können verschiedene Einstellungen auswählen und ihre eigene analytische Datenvisualisierung unter Verwendung der verfügbaren Steuerelemente erstellen.
es: El propietario del conjunto de datos puede definir fácilmente la representación analítica predeterminada del conjunto de datos con la **ficha de análisis** en la consola de publicación. A su vez, los usuarios finales pueden simplemente elegir otra configuración y crear su propia visualización de datos analítica con los controles disponibles.
fr: Le propriétaire du jeu de données peut facilement choisir la représentation analytique par défaut via **l'onglet analyse** de l'interface de publication. Les utilisateurs finaux peuvent également configurer facilement leur propre visualisation de données en utilisant les options disponibles au-dessus du graphe.
it: Il proprietario del dataset può definire facilmente la rappresentazione analitica predefinita tramite la **scheda Analizza**, nella console di pubblicazione. Anche gli utenti finali hanno a disposizione diverse impostazioni di configurazione e, tramite i controlli disponibili, possono creare visualizzazioni analitiche personalizzate.
nl: De eigenaar van de dataset kan gemakkelijk de standaard analytische weergave van de dataset definiëren door middel van het **analyse tabblad** in de publicatieconsole. Eindgebruikers kunnen ook gewoon andere instellingen kiezen en de weergave van hun eigen analytische data bepalen door gebruik te maken van de beschikbare controlefuncties.

source: **How can I embed a data visualization on my website?**
de: **Wie kann ich eine Datenvisualisierung in meine Website einbetten?**
es: **¿Cómo puedo incrustar una visualización de datos en mi sitio web?**
fr: **Comment puis-je intégrer une visualisation de données sur mon site Web ?**
it: **Come posso integrare una visualizzazione di dati nel mio sito Web?**
nl: **Hoe kan ik een dataweergave invoegen op mijn website?**

source: There are three ways to embed OpenDataSoft's data visualizations on a website or any content management system:
de: Es gibt drei Möglichkeiten, OpenDataSoft-Datenvisualisierungen in eine Website oder ein beliebiges Content Management System einzubetten:
es: Hay 3 formas de incrustar visualizaciones de datos de OpenDataSoft en un sitio web o cualquier sistema de administración de contenido:
fr: Il existe trois façons d'intégrer une visualisation de données OpenDataSoft sur un site Web ou un blog :
it: Sono disponibili tre modi per integrare le visualizzazioni di dati OpenDataSoft in un sito Web o in un sistema di gestione dei contenuti:
nl: Er zijn drie manieren om dataweergaves in OpenDataSoft in te voegen op een website of op een contentbeheersysteem:

source: Copy-paste the embed code that can directly be found on the OpenDataSoft platform (usually located under the data visualization itself).
de: Kopieren-Einfügen des Einbettungscodes, der direkt auf der OpenDataSoft-Plattform zur Verfügung steht (normalerweise unter der Datenvisualisierung selbst).
es: Copie y pegue el código de incrustación que encontrará directamente en la plataforma OpenDataSoft (suele aparecer bajo la misma visualización de datos).
fr: Copier-coller le code d'intégration qui se trouve directement sur la plateforme OpenDataSoft (généralement en dessous de la visualisation).
it: Copiare e incollare il codice di embed disponibile direttamente nella piattaforma OpenDataSoft, generalmente sotto la relativa visualizzazione di dati.
nl: Kopieer-plak de invoegcode die rechtstreeks terug te vinden is op het OpenDataSoft-platform (deze bevindt zich meestal onder de dataweergave zelf).

source: Use `ODS Widgets, our open source widget library <https://github.com/opendatasoft/ods-widgets>`_ to build content pages tailored to your needs with one or several data visualizations at once.
de: Verwenden Sie `ODS Widgets, unsere Open Source Widget-Bibliothek <https://github.com/opendatasoft/ods-widgets>`_ , um bedarfsspezifische Content-Seiten mit einer oder mehreren Datenvisualisierungen gleichzeitig zu erstellen.
es: Utilice `ODS Widgets, nuestra biblioteca de widgets de código abierto <https://github.com/opendatasoft/ods-widgets>`_ para crear páginas de contenido que se ajusten a sus necesidades con una o varias visualizaciones de datos a la vez.
fr: Utiliser `ODS Widgets, notre bibliothèque de widgets open source <https://github.com/opendatasoft/ods-widgets>`_, afin de créer des pages sur mesure avec une ou plusieurs visualisations de données en simultané.
it: Utilizzare `ODS Widgets, la nostra libreria di widget open source <https://github.com/opendatasoft/ods-widgets>`_ per creare pagine di contenuto totalmente personalizzate e dotate di una o più visualizzazioni di dati.
nl: Gebruik `ODS Widgets, onze open bron widget-bibliotheek <https://github.com/opendatasoft/ods-widgets>`_ met één of verschillende datasetweergaves ineens om contentpagina's te maken die afgestemd zijn op uw noden.

source: Use OpenDataSoft's HTTP/REST APIs to develop your own embed.
de: Verwenden Sie die OpenDataSoft-HTTP/REST-APIs, um Ihre eigene Einbettung zu entwickeln.
es: Utilice las interfaces API HTTP/REST de OpenDataSoft para desarrollar su propia incrustación.
fr: Utiliser les API HTTP/REST d'OpenDataSoft afin de développer vos propres intégrations.
it: Utilizzare le API HTTP/REST OpenDataSoft per sviluppare personalmente il tuo embed.
nl: Gebruik HTTP/REST APIs van OpenDataSoft om uw eigen embed te ontwikkelen.

source: **What is "Cartograph"?**
de: **Was bedeutet "Cartograph"?**
es: **¿Qué es "Cartografía"?**
fr: **Qu'est-ce que "Cartographe" ?**
it: **Cos'è lo strumento "Cartografia"?**
nl: **Wat is "Cartograph"?**

source: Cartograph is a tool developed by OpenDataSoft to make it possible to build geo mashups out of datasets stored on the OpenDataSoft platform.
de: Cartograph ist ein von OpenDataSoft entwickeltes Tool zur Erstellung von Geo-Mashups aus Datensätzen, die auf der OpenDataSoft-Plattform gespeichert sind.
es: Cartografía es una herramienta desarrollada por OpenDataSoft para permitir compilar mashups geográficos a partir de conjuntos de datos almacenados en la plataforma OpenDataSoft.
fr: Cartographe est un outil développé par OpenDataSoft qui permet de créer des cartes avancées à partir de superpositions de jeux de données disponibles sur la plateforme OpenDataSoft.
it: Lo strumento Cartografia è stato sviluppato da OpenDataSoft per consentire di creare mappe avanzate sovrapponendo più dataset disponibili sulla piattaforma OpenDataSoft.
nl: Cartograph is een tool die ontwikkeld werd door OpenDataSoft om het mogelijk te maken om geo mashups te bouwen uit datasets die opgeslagen zijn op het OpenDataSoft-platform.

source: **What does API mean?**
de: **Was bedeutet API?**
es: **¿Qué significa API?**
fr: **Que signifie l'acronyme API ?**
it: **Cosa significa il termine API?**
nl: **Wat betekent API?**

source: API is an acronym for Applications Programming Interface. An API is a set of methods for computer programs to exchange information in an autonomous way. OpenDataSoft APIs allow for remote access to datasets using the HTTP protocol.
de: API ist das Akronym für Applications Programming Interface. Eine API ist ein Methodensatz für Computerprogramme für den anonymen Informationsaustausch. Die OpenDataSoft-APIs ermöglichen den Fernzugriff auf Datensätze mit dem HTTP-Protokoll.
es: API es un acrónimo de Application Programming Interface (interfaz de programación de aplicaciones). Una API es un conjunto de métodos pensados para permitir a los programas informáticos intercambiar información de forma autónoma. Las interfaces API de OpenDataSoft facilitan el acceso remoto a los conjuntos de datos mediante el protocolo HTTP.
fr: API est un acronyme pour Applications Programming Interface (interface de programmation applicative). Une API est un ensemble de méthodes d'échange autonome d'informations pour les programmes informatiques. Les API d'OpenDataSoft permettent un accès à distance aux jeux de données via le protocole HTTP.
it: API è l'acronimo di Application Programming Interface (interfaccia di programmazione di un'applicazione). Un'API è un insieme di metodi che consentono ai programmi di scambiarsi informazioni in maniera autonoma. Le API OpenDataSoft permettono l'accesso ai dataset da remoto tramite il protocollo HTTP.
nl: API is de afkorting van Applications Programming Interface. Een API is een reeks methodes voor computerprogramma's om autonoom informatie uit te wisselen. OpenDataSoft API's laten toe om op afstand toegang te krijgen tot datasets die het HTTP-protocol gebruiken.

source: **What are APIs made for?**
de: **Wofür wurden APIs entwickelt?**
es: **¿Para qué sirven las interfaces API?**
fr: ** À quoi servent les API ?**
it: **A che cosa servono le API?**
nl: **Waarvoor worden API's gebruikt?**

source: APIs are a set of tools that developers can use to integrate data in their applications (Web applications, mobile applications, business applications...).
de: APIs sind Tools für Entwickler, die ihnen zur Integration von Daten in Ihre Anwendungen dienen (Web-Anwendungen, mobile Anwendungen, Business-Anwendungen etc.).
es: Las interfaces API son un conjunto de herramientas que los desarrolladores pueden emplear para integrar datos en sus aplicaciones (aplicaciones web, aplicaciones móviles, aplicaciones empresariales...).
fr: Les API sont un ensemble d'outils qu'un développeur peut utiliser pour intégrer des données dans ses applications (web, mobile, applications métier...).
it: Le API comprendono un insieme di strumenti che gli sviluppatori possono utilizzare per integrare i dati nelle proprie applicazioni (Web, mobile, aziendali e così via).
nl: API's zijn een reeks tools die ontwikkelaars kunnen gebruiken om data te integreren in hun applicaties (internetapplicaties, mobiele applicaties, bedrijfsapplicaties, ...).

source: **How many API calls can I perform?**
de: **Wie viele APIs kann ich durchführen?**
es: **¿Cuántas llamadas de API puedo realizar?**
fr: **Combien d'appels d'API puis-je faire ?**
it: **Quante chiamate API posso effettuare?**
nl: **Hoeveel API calls kan ik uitvoeren?**

source: API endpoints are associated with quotas. OpenDataSoft customers can configure their own quotas policy. Contact your OpenDataSoft domain owner for more details.
de: API-Endpunkte sind mit Quoten verknüpft. OpenDataSoft-Kunden können Ihre eigenen Quotenrichtlinien konfigurieren. Weitere Einzelheiten erfahren Sie bei Ihrem OpenDataSoft-Domain-Eigentümer.
es: Los extremos de API tienen asociadas cuotas. Los clientes de OpenDataSoft pueden configurar su propia directiva de cuotas. Póngase en contacto con el propietario del dominio OpenDataSoft para obtener más detalles.
fr: Les points d'entrées d'APIs sont associés à des quotas. Les clients OpenDataSoft peuvent configurer leurs propres politiques de quotas. Contactez le propriétaire de votre domaine OpenDataSoft pour plus de détails.
it: Gli endpoint delle API dipendono dalle quote assegnate. I clienti OpenDataSoft possono configurare la propria politica sulle quote. Per maggiori dettagli, ti invitiamo a contattare i proprietari dei singoli domini OpenDataSoft.
nl: API-eindpunten zijn gekoppeld aan quota's. Klanten van OpenDataSoft kunnen hun eigen quotabeleid configureren. Neem voor meer details contact op met de eigenaar van uw OpenDataSoft-domein.

source: **Does every dataset have its own APIs?**
de: **Hat jeder Datensatz seine eigenen APIs?**
es: **¿Cada uno de los conjuntos de datos tiene sus propias interfaces API?**
fr: **Est-ce que chaque jeu de données possède ses propres API ?**
it: **I dataset dispongono di API dedicate?**
nl: **Heeft elke dataset zijn eigen API's?**

source: Whenever you publish a dataset, a dedicated API is created. See :doc:`APIs documentation</using_api/index>` for more information.
de: Immer wenn Sie einen Datensatz veröffentlichen, wird eine API erstellt. Weitere Informationen siehe :doc:`APIs Dokumentation</using_api/index>`.
es: Cuando usted publica un conjunto de datos, se crea una interfaz API específica. Consulte la :doc:`documentación de las interfaces API</using_api/index>` para obtener más información.
fr: Une API dédiée est créée à chaque fois que vous publiez un jeu de données. Voir la :doc:`documentation sur les API</using_api/index>` pour plus d'informations.
it: Quando pubblichi un dataset, viene sempre creata un'API dedicata. Per maggiori informazioni, consulta la :doc:`documentazione sulle API </using_api/index>`.
nl: Wanneer u een dataset publiceert, wordt een speciale API aangemaakt. Zie :doc:`APIs documentation</using_api/index>` voor meer informatie.

source: **What are the compatible browsers for OpenDataSoft's platform?**
de: **Welche Browser sind kompatibel mit der OpenDataSoft-Plattform?**
es: **¿Cuáles son los exploradores compatibles con la plataforma OpenDataSoft?**
fr: **Quels sont les navigateurs compatibles avec la plateforme OpenDataSoft ?**
it: **Quali browser sono compatibili con la piattaforma OpenDataSoft?**
nl: **Welke browsers zijn compatibel voor het platform van OpenDataSoft?**

source: Browser
es: Explorador
fr: Navigateur

source: Version 9+
es: Versión 9+
it: Versione 9 o successiva
nl: Versie 9+

source: Version 10+
es: Versión 10+
it: Versione 10 o successiva
nl: Versie 10+

source: Latest version
de: Neueste Version
es: Última versión
fr: Dernière version
it: Ultima versione
nl: Meest recente versie

source: Version 6+
es: Versión 6+
it: Versione 6 o successiva
nl: Versie 6+

source: OS
fr: Système d'exploitation
it: Sistema operativo

source: No.
de: Nein.
fr: Non.
nl: Neen.
