Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/faq.po
Languages: de, es, fr, it, nl

source: Frequently asked questions (FAQ)
de: Häufig gestellte Fragen (FAQ)
es: Preguntas frecuentes
fr: Foire aux questions (FAQ)
it: FAQ

source: **What is OpenDataSoft?**
de: **Was ist OpenDataSoft?**
es: **¿Qué es OpenDataSoft?**
fr: **Qu'est-ce qu'OpenDataSoft ?**
it: **Cos'è OpenDataSoft?**
nl: **Wat is OpenDataSoft?**

source: OpenDataSoft is a turnkey SaaS platform developed for business users to easily share, publish and reuse structured datasets.
de: OpenDataSoft ist eine schlüsselfertige SaaS-Plattform für Geschäftskunden zum einfachen Teilen, Veröffentlichen und Wiederverwenden strukturierter Datensätze.
es: OpenDataSoft es una plataforma SaaS llave en mano desarrollada para que los usuarios profesionales compartan, publiquen y reutilicen fácilmente conjuntos de datos estructurados.
fr: OpenDataSoft est une plateforme SaaS clé en main conçue pour permettre à des utilisateurs métiers de simplement publier, partager et réutiliser des données structurées. OpenDataSoft est également le nom de la société qui commercialise la plateforme du même nom.
it: OpenDataSoft è una piattaforma SaaS pronta all'uso e sviluppata per permettere a utenti business di condividere, pubblicare e riutilizzare in modo semplice dataset strutturati.
nl: OpenDataSoft is een turnkey SaaS-platform dat ontwikkeld werd voor zakelijke gebruikers om gemakkelijk gestructureerde datasets te delen, te publiceren en te hergebruiken.

source: **Is OpenDataSoft open source?**
de: **Ist OpenDataSoft ein Open-Source-Angebot?**
es: **¿OpenDataSoft es de código abierto?**
fr: **Est-ce qu'OpenDataSoft est open source ?**
it: **OpenDataSoft è open source?**

source: OpenDataSoft is not open source.
de: OpenDataSoft ist kein Open-Source-Angebot.
es: OpenDataSoft no es de código abierto.
fr: OpenDataSoft n'est pas Open Source.
it: OpenDataSoft non è open source.
nl: OpenDataSoft is niet open source.

source: OpenDataSoft is selling a service, not a software. However, some parts of the stack are open source.
de: OpenDataSoft bietet einen Service, nicht eine Software zum Kauf an. Einige Teile der Stapel sind jedoch als Open Source verfügbar.
es: OpenDataSoft ofrece un servicio, no un software. Sin embargo, algunas partes de la pila son de código abierto.
fr: La société OpenDataSoft vend un service clé en main, pas un logiciel. Néanmoins, une partie des composants de la plateforme est open source.
it: OpenDataSoft vende un servizio, non un software. Tuttavia, alcune parti dello stack sono open source.
nl: OpenDataSoft verkoopt een service, geen software. Wel zijn sommige onderdelen van de stapel open source.

source: OpenDataSoft's front-end is open source. It is built and packaged as a set of AngularJS directives. This project can be accessed on `GitHub <https://github.com/opendatasoft/ods-widgets>`_ and comes with a full fledged documentation.
de: Das OpenDataSoft-Front-End ist als Open Source verfügbar. Es ist als Set aus AngularJS Richtlinien aufgebaut und verpackt. Dieses Projekt ist auf `GitHub <https://github.com/opendatasoft/ods-widgets>`_ verfügbar und mit einer vollwertigen Dokumentation versehen.
es: El front end de OpenDataSoft es de código abierto. Se ha compilado y empaquetado como un conjunto de directivas AngularJS. Se puede acceder a este proyecto en `GitHub <https://github.com/opendatasoft/ods-widgets>`_, que incluye una completa documentación.
fr: Le frontal d'OpenDataSoft est open source. Il est construit et encapsulé sous la forme d'un ensemble de directives AngularJS. Ce projet est accessible sur `GitHub <https://github.com/opendatasoft/ods-widgets>`_ et inclut une documentation exhaustive.
it: L'interfaccia utente OpenDataSoft è open source: è stata realizzata e confezionata con una serie di direttive AngularJS. Il progetto è accessibile su `GitHub <https://github.com/opendatasoft/ods-widgets>`_ e dispone di una documentazione completa.
nl: De front-end van OpenDataSoft is open source. Het is gebouwd en verpakt als een reeks AngularJS-richtlijnen. U kan naar dit project gaan op `GitHub <https://github.com/opendatasoft/ods-widgets>`_ en is voorzien van een volwaardige documentatie.

source: OpenDataSoft is also already contributing to the `Elasticsearch <http://www.elasticsearch.org/>`_ project by releasing in the public space a set of plugins that we have developed and that we use internally:
de: Zudem trägt OpenDataSoft bereits jetzt zu dem Projekt `Elasticsearch <http://www.elasticsearch.org/>`_ bei, indem es eine Reihe von Plugins im öffentlichen Raum zur Verfügung stellt, die wir entwickelt haben und intern selbst nutzen:
es: Asimismo, OpenDataSoft contribuye al proyecto `Elasticsearch <http://www.elasticsearch.org/>`_ mediante la difusión pública de un conjunto de complementos que hemos desarrollado y utilizamos internamente:
fr: OpenDataSoft contribue également au projet `Elasticsearch <http://www.elasticsearch.org/>`_ en publiant plusieurs plugins que nous avons développés et que nous utilisons en interne :
it: Inoltre, OpenDataSoft contribuisce al progetto `Elasticsearch <http://www.elasticsearch.org/>`_, rilasciando pubblicamente un set di plugin che ha realizzato e che utilizza internamente:
nl: OpenDataSoft draagt ook reeds bij tot het `Elasticsearch <http://www.elasticsearch.org/>`_ project door in de publieke ruimte een reeks plugins vrij te geven die we ontwikkeld hebben en die we intern gebruiken:

source: `Hierarchical facets plugin <https://github.com/opendatasoft/elasticsearch-aggregation-pathhierarchy>`_
de: `Hierarchischer Facets-Plugin <https://github.com/opendatasoft/elasticsearch-aggregation-pathhierarchy>`_
es: `Complemento de facetas jerárquicas <https://github.com/opendatasoft/elasticsearch-aggregation-pathhierarchy>`_
fr: `Plugin facettes hiérarchiques <https://github.com/opendatasoft/elasticsearch-aggregation-pathhierarchy>`_
it: `Plugin per facet gerarchici <https://github.com/opendatasoft/elasticsearch-aggregation-pathhierarchy>`_
nl: `Hiërarchische facetten plugin <https://github.com/opendatasoft/elasticsearch-aggregation-pathhierarchy>`_

source: `Geo aggregations plugin <https://github.com/opendatasoft/elasticsearch-plugin-geoshape>`_
de: `Geo-Aggregationen-Plugin <https://github.com/opendatasoft/elasticsearch-plugin-geoshape>`_
es: `Complemento de agregaciones geográficas <https://github.com/opendatasoft/elasticsearch-plugin-geoshape>`_
fr: `Plugin agrégation géographique <https://github.com/opendatasoft/elasticsearch-plugin-geoshape>`_
it: `Plugin per aggregazioni geografiche <https://github.com/opendatasoft/elasticsearch-plugin-geoshape>`_
nl: `Geo aggregatie plugin <https://github.com/opendatasoft/elasticsearch-plugin-geoshape>`_

source: `Geo convex envelope plugin <https://github.com/opendatasoft/elasticsearch-aggregation-envelope>`_
de: `Geo konvexe Hülle Plugin <https://github.com/opendatasoft/elasticsearch-aggregation-envelope>`_
es: `Complemento de contenedor convexo geográfico <https://github.com/opendatasoft/elasticsearch-aggregation-envelope>`_
fr: `Plugin enveloppe géographique convexe <https://github.com/opendatasoft/elasticsearch-aggregation-envelope>`_
it: `Plugin per inviluppo convesso geografico <https://github.com/opendatasoft/elasticsearch-aggregation-envelope>`_
nl: `Geo convex omslag plugin <https://github.com/opendatasoft/elasticsearch-aggregation-envelope>`_

source: **Is the OpenDataSoft team managing data on behalf of its customers?**
de: **Verwaltet das OpenDataSoft-Team Daten im Auftrag seiner Kunden?**
es: **¿El equipo de OpenDataSoft administra los datos en nombre de sus clientes?**
fr: **Est-ce que l'équipe OpenDataSoft gère les données de ses clients ?**
it: **Il team OpenDataSoft gestisce i dati per conto dei suoi clienti?**
nl: **Beheert het team van OpenDataSoft data namens haar klanten?**

source: OpenDataSoft sells a turnkey solution. Users manage their datasets on their domains by themselves. Of course, the OpenDataSoft support team is more than willing to help handling complex / specific data management issues.
de: OpenDataSoft vertreibt eine schlüsselfertige Lösung. Die Benutzer verwalten ihre Datensätze auf ihren Domains selbst. Natürlich hilft das OpenDataSoft-Support-Team gerne weiter bei Verwaltungsproblemen mit komplexen / spezifischen Daten.
es: OpenDataSoft ofrece una solución llave en mano. Los usuarios administran los conjuntos de datos de sus dominios por sí mismos. Obviamente, el equipo de soporte de OpenDataSoft está a su entera disposición para ayudar a resolver las cuestiones de administración de datos complejas o específicas.
fr: OpenDataSoft vend une solution clé en main. Les utilisateurs d'OpenDataSoft gèrent leurs données eux-mêmes sur la plateforme. L'équipe d'assistance d'OpenDataSoft est bien entendu disponible pour répondre à toute question relative à la gestion des données.
it: OpenDataSoft vende una soluzione pronta per l'uso. Gli utenti gestiscono autonomamente i dataset nei propri domini. Naturalmente, il team di assistenza OpenDataSoft è sempre a disposizione per aiutare ad affrontare eventuali difficoltà nella gestione dei dati.
nl: OpenDataSoft verkoopt een turnkey oplossing. Gebruikers beheren zelf hun datasets op hun domeinen. Vanzelfsprekend is het Support Team van OpenDataSoft meer dan bereid om te helpen bij het oplossen van beheerproblemen voor complexe / specifieke data.

source: Moreover, OpenDataSoft maintains a `data network <https://data.opendatasoft.com/>`_ which federates public datasets published by OpenDataSoft customers as well as datasets published by the OpenDataSoft staff.
de: Zudem unterhält OpenDataSoft ein `Datennetzwerk <https://data.opendatasoft.com/>`_, das sowohl öffentliche Datensätze umfasst, die von OpenDataSoft-Kunden veröffentlicht wurden, als auch Datensätze, die vom OpenDataSoft-Team veröffentlicht wurden.
es: Además, OpenDataSoft mantiene una `red de datos <https://data.opendatasoft.com/>`_ que federa conjuntos de datos públicos publicados por los clientes de OpenDataSoft y conjuntos de datos publicados por el personal de OpenDataSoft.
fr: Qui plus est, OpenDataSoft gère un `réseau de données <https://data.opendatasoft.com/>`_ qui fédère les jeux de données publics des clients d'OpenDataSoft et ceux publiés par le personnel d'OpenDataSoft.
it: In aggiunta, OpenDataSoft gestisce una `rete di dati <https://data.opendatasoft.com/>`_ che contiene i dataset pubblici dei clienti e quelli pubblicati dal suo staff.
nl: Daarnaast onderhoudt OpenDataSoft een `datanetwerk <https://data.opendatasoft.com/>`_ waarin publieke datasets die gepubliceerd worden door klanten van OpenDataSoft, maar ook datasets die gepubliceerd worden door personeel van OpenDataSoft, ondergebracht worden.

source: **I'm representing a public administration. My country has already setup an Open Data initiative. Why should I have my own data portal?**
de: **Ich bin Vertreter einer öffentlichen Verwaltungsstelle. Mein Land hat bereits eine Open Data Initiative eingerichtet. Was bringt mir ein eigenes Datenportal?**
es: **Represento a una administración pública. Mi país ya ha implantado una iniciativa de datos abiertos. ¿Por qué debería tener mi propio portal de datos?**
fr: **Je représente une administration publique. Mon pays a déjà mis en place une initiative Open Data, pour quelles raisons devrais-je avoir mon propre portail Open Data ?**
it: **Sono un rappresentante della pubblica amministrazione e il mio paese ha già avviato un'iniziativa Open Data. Perché dovrei avere un portale dati di proprietà?**
nl: **Ik vertegenwoordig een overheidsadministratie. Mijn land heeft reeds een Open Data-initiatief in het leven geroepen. Waarom zou ik over mijn eigen dataportaal moeten beschikken?**

source: Open Data is about making data that has been produced by public administrations available to citizens. But most of the time, one may want to go beyond the simple delivery of raw files and:
de: Bei Open Data geht es darum, den Bürgern Daten zur Verfügung zu stellen, die von öffentlichen Verwaltungen erstellt werden. Doch meistens wird nicht nur die reine Lieferung von Rohdaten gewünscht, und:
es: Los datos abiertos se basan en poner a disposición de los ciudadanos los datos producidos por las administraciones públicas. Pero a menudo se intenta ir más allá de lo que simplemente sería transmitir archivos sin procesar y:
fr: Un des objectifs de l'Open Data est de mettre à disposition des citoyens les données produites par l'administration publique. La plateforme OpenDataSoft permet d'aller plus loin que la simple mise à disposition de données brutes :
it: L'Open Data ha lo scopo di rendere accessibili ai cittadini i dati prodotti dalla pubblica amministrazione. Il più delle volte, però, la semplice pubblicazione di file non elaborati non basta e diventa importante:
nl: Bij Open Data gaat het erom data die geproduceerd werden door overheidsadministraties beschikbaar te stellen van burgers. Maar in de meeste gevallen wil men verder gaan dan het louter leveren van ruwe bestanden en:

source: Contextualize & increase the value of data
de: Den Wert der Daten kontextualisieren & erhöhen
es: Contextualizar y aumentar el valor de los datos
fr: Contextualiser la donnée, enrichir sa valeur
it: contestualizzare i dati, aumentandone il valore;
nl: De waarde van data in een context plaatsen & verhogen

source: Make data easy-to-understand for citizens
de: Daten für die Bürger verständlicher machen
es: Facilitar la comprensión de los datos para los ciudadanos
fr: Rendre la donnée simple à comprendre pour les citoyens
it: rendere i dati più comprensibili per i cittadini;
nl: Ervoor zorgen dat data eenvoudig te begrijpen zijn voor burgers

source: Provide open services to an ecosystem of developers / reusers
de: Einem Ökosystem aus Entwicklern / Weiterverwendern Open Services bieten
es: Proporcionar servicios abiertos a un ecosistema de desarrolladores/reutilizadores
fr: Fournir des services à un écosystème de développeurs / réutilisateurs
it: offrire servizi gratuiti a un ecosistema di sviluppatori e riutilizzatori.
nl: Open diensten aanbieden aan een ecosysteem van ontwikkelaars / hergebruikers

source: To that extent, having a data management tool tailored to your needs is mandatory and keep in mind that thanks to the Open APIs provided by OpenDataSoft, your national Open Data portal will always have the possibility to reference your public datasets.
de: Insofern ist es sehr wichtig, ein auf Ihre Bedürfnisse zugeschnittenes Datenmanagement-Tool zur Verfügung zu haben. Dank der von OpenDataSoft gelieferten Open-APIs kann Ihr länderspezifisches Open Data-Portal zudem jederzeit Ihre öffentlichen Datensätze referenzieren.
es: En este sentido, es imprescindible que cuente con una herramienta de administración de datos ajustada a sus necesidades y, gracias a las interfaces API abiertas suministradas por OpenDataSoft, su portal nacional de datos abiertos siempre tendrá la posibilidad de hacer referencia a sus conjuntos de datos públicos.
fr: Pour cela, l'utilisation d'un outil de gestion de données adapté à vos besoins est indispensable. Gardez également à l'esprit que les API libres proposées par OpenDataSoft, votre portail Open Data national aura toujours la possiblité de référencer vos jeux de données publics.
it: A tale scopo, è fondamentale poter contare su uno strumento di gestione dei dati pensato su misura per le proprie esigenze. Inoltre, grazie alle API aperte fornite da OpenDataSoft, il portale Open Data nazionale potrà sempre fare riferimento ai dataset pubblici.
nl: Binnen deze context is het beschikken over een databeheertool die speciaal afgestemd is op uw noden verplicht en dient u ook in het achterhoofd te houden dat dankzij de Open API's die aangeleverd worden door OpenDataSoft, uw nationaal Open Data-portaal altijd over de mogelijkheid zal beschikken om uw publieke datasets te raadplegen.

source: **If I publish datasets on OpenDataSoft, will they automatically be available to everyone on the Web?**
de: **Wenn ich Datensätze auf OpenDataSoft veröffentliche, sind diese dann automatisch für jedermann im Netz zugänglich?**
es: **Si publico conjuntos de datos en OpenDataSoft, ¿automáticamente estarán disponibles para todos los internautas?**
fr: **Si je publie un jeu de données sur la plateforme OpenDataSoft, sera-t-il automatiquement en accès libre sur Internet ?**
it: **Se pubblico i dataset sulla piattaforma OpenDataSoft, questi diventeranno automaticamente accessibili a tutti sul Web?**
nl: **Wanneer ik datasets publiceer op OpenDataSoft, zullen deze dan automatisch beschikbaar zijn voor iedereen op het internet?**

source: The OpenDataSoft platform can be used for both public and private data management projects. A given platform can even host public and private datasets. It is also possible to define the ACL of a recordset at the dataset level.
de: Die OpenDataSoft-Plattform kann sowohl für öffentliche als auch für private Datenmanagementprojekte genutzt werden. Ein Plattform kann sogar öffentliche und private Datensätze gleichzeitig hosten. Zudem ist es auch möglich, die ACL eines Recordsets auf Datensatzebene zu definieren.
es: La plataforma OpenDataSoft se puede usar para proyectos de administración de datos públicos y privados. Incluso una misma plataforma puede alojar conjuntos de datos públicos y privados. También es posible definir la ACL de un conjunto de registros a nivel de conjunto de datos.
fr: La plateforme OpenDataSoft peut être utilisée pour gérer de manière simultanée des données publiques et privées. Le contrôle d'accès peut être géré par jeu de données.
it: La piattaforma OpenDataSoft può essere utilizzata per gestire dati in forma sia pubblica sia privata, anche all'interno di uno stesso dominio. Inoltre, puoi definire la lista di controllo degli accessi ai record anche a livello del singolo dataset.
nl: Het OpenDataSoft-platform kan gebruikt worden voor zowel publieke als private databeheerprojecten. Een welbepaald platform kan zelfs publieke en private datasets hosten. Het is ook mogelijk om de ACL van een recordset op niveau van de dataset te definiëren.

source: **What file formats are supported by OpenDataSoft?**
de: **Welche Datenformate werden von OpenDataSoft unterstützt?**
es: **¿Qué formatos de archivo admite OpenDataSoft?**
fr: **Quels sont les formats de fichiers pris en charge par OpenDataSoft ?**
it: **Che tipi di formati sono supportati da OpenDataSoft?**
nl: **Welke bestandsformaten worden ondersteund door OpenDataSoft?**

source: The OpenDataSoft platform natively supports the following file formats:
de: Die OpenDataSoft-Plattform unterstützt nativ die folgenden Formate:
es: La plataforma OpenDataSoft admite de forma nativa los formatos de archivo siguientes:
fr: Par défaut, OpenDataSoft prend en charge les formats de fichiers suivants :
it: La piattaforma OpenDataSoft supporta nativamente i seguenti formati di file:
nl: Het OpenDataSoft-platform ondersteunt standaard de volgende bestandsformaten:

source: ``Remotely stored files for any of the above formats (HTTP or FTP)``
de: ``Remote gespeicherte Dateien für jedes der oben genannten Formate (HTTP oder FTP)``
es: ``Archivos almacenados remotamente con cualquiera de los formatos anteriores (HTTP o FTP)``
fr: ``Des fichiers stockés sur des serveurs distants accessibles en HTTP ou FTP``
it: ``File archiviati in remoto con qualsiasi dei suddetti formati (accessibili via HTTP o FTP)``
nl: ``Op afstand opgeslagen bestanden voor een van de bovenstaande formaten (HTTP of FTP)``

source: Specific format parsers can also be made available by the OpenDataSoft team for specific requirements.
de: Zudem kann das OpenDataSoft-Team spezifische Parser für spezielle Anforderungen zur Verfügung stellen.
es: El equipo de OpenDataSoft también puede poner a su disposición analizadores de formatos específicos a fin de atender requisitos concretos.
fr: L'équipe d'OpenDataSoft est en mesure de fournir des parseurs de format spécifiques pour répondre à des besoins particuliers.
it: Per esigenze particolari, il team OpenDataSoft è inoltre in grado di fornire parser per formati specifici.
nl: Voor specifieke noden kunnen ook specifieke format parsers beschikbaar worden gesteld door het team van OpenDataSoft.

source: The OpenDataSoft platform is also able to connect to remote Web services. OpenDataSoft supports the following services in its standard version:
de: Weiterhin ist die OpenDataSoft-Plattform in der Lage, sich an Remote Web Services anzubinden. OpenDataSoft unterstützt in der Standardversion folgende Services:
es: La plataforma OpenDataSoft también puede conectar con servicios web remotos. OpenDataSoft admite los servicios siguientes en la versión estándar:
fr: La plateforme OpenDataSoft peut également se connecter à des services Web distants. Dans sa version de base, OpenDataSoft prend en charge les services suivants :
it: La piattaforma OpenDataSoft può inoltre connettersi a servizi Web remoti. Sono supportate le versioni standard dei seguenti servizi:
nl: Het OpenDataSoft-platform kan ook verbinding maken met internetdiensten op afstand. In haar standaardversie ondersteunt OpenDataSoft de volgende diensten:

source: ``Salesforce / Force.com`` (you'll have to ask OpenDataSoft support to activate it on your domain)
de: ``Salesforce / Force.com`` (kontaktieren Sie den OpenDataSoft-Support, um ihn auf Ihrer Domain zu aktivieren)
es: ``Salesforce/Force.com`` (deberá pedir al equipo de soporte de OpenDataSoft que lo active en su dominio)
fr: ``Salesforce / Force.com`` (activation sur demande auprès de l'assistance OpenDataSoft)
it: ``Salesforce/Force.com`` (per l'attivazione sul dominio, è necessario fare richiesta all'assistenza OpenDataSoft)
nl: ``Salesforce / Force.com`` (u dient het Support Team van OpenDataSoft te vragen om dit op uw domein te activeren)

source: Custom connectivity capabilities can be added upon request.
de: Auf Anfrage können benutzerspezifische Konnektivitätsfähigkeiten hinzugefügt werden.
es: Se pueden añadir posibilidades de conectividad personalizadas a petición.
fr: Des options de connectivité personnalisées peuvent être ajoutées sur demande.
it: Su richiesta, è possibile aggiungere opzioni di connettività personalizzate.
nl: Op verzoek kunnen gepersonaliseerde connectiviteitsmogelijkheden worden toegevoegd.

source: **What metadata standards does OpenDataSoft support?**
de: **Welche Metadaten-Standards unterstützt OpenDataSoft?**
es: **¿Qué estándares de metadatos admite OpenDataSoft?**
fr: **Quels standards de métadonnées sont pris en charge par OpenDataSoft ?**
it: **Quali standard di metadati sono supportati da OpenDataSoft?**
nl: **Welke metadatastandaarden ondersteunt OpenDataSoft?**

source: OpenDataSoft natively uses a subset of `DCAT <http://www.w3.org/TR/vocab-dcat/>`_ to describe datasets. The following metadata are available by default:
de: OpenDataSoft nutzt nativ einen Untersatz von `DCAT <http://www.w3.org/TR/vocab-dcat/>`_ zur Beschreibung von Datensätzen. Folgende Metadaten stehen standardmäßig zur Verfügung:
es: OpenDataSoft utiliza de manera nativa un subconjunto de `DCAT <http://www.w3.org/TR/vocab-dcat/>`_ para describir los conjuntos de datos. De forma predeterminada, están disponibles los metadatos siguientes:
fr: OpenDataSoft utilise en standard un sous-ensemble de `DCAT <http://www.w3.org/TR/vocab-dcat/>`_ pour décrire les jeux de données. Les métadonnées suivantes sont disponibles par défaut :
it: OpenDataSoft utilizza nativamente un subset `DCAT <http://www.w3.org/TR/vocab-dcat/>`_ per descrivere i dataset. I metadati disponibili in modo predefinito sono i seguenti:
nl: OpenDataSoft gebruikt standaard een subset van `DCAT <http://www.w3.org/TR/vocab-dcat/>`_ om datasets te omschrijven. De volgende metadata zijn standaard beschikbaar:
