Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, it, nl

source: Welcome to OpenDataSoft documentation!
de: Willkommen bei der OpenDataSoft-Dokumentation!
es: ¡Bienvenido a la documentación de OpenDataSoft!
fr: Bienvenue dans la documentation d'OpenDataSoft !
it: Benvenuto/a nella documentazione OpenDataSoft!
nl: Welkom op OpenDataSoft-documentatie!

source: `OpenDataSoft <https://www.opendatasoft.com/>`_ is a turnkey solution, designed for non-technical users to share, publish and reuse data. It is available as a commercial-off-the-shelf, cloud hosted product.
de: `OpenDataSoft <https://www.opendatasoft.com/>`_ ist eine schlüsselfertige Lösung, die für nichttechnische Benutzer zum Teilen, Veröffentlichen und Weiterverwenden von Daten entwickelt wurde. Sie ist als ein in der Cloud gehostetes Standardprodukt verfügbar.
es: `OpenDataSoft <https://www.opendatasoft.com/>`_ es una solución llave en mano concebida para que los usuarios no técnicos compartan, publiquen y reutilicen datos. Está disponible como un producto comercial alojado en la nube.
fr: `OpenDataSoft <https://www.opendatasoft.com/>`_ est une solution clé en main conçue pour que les utilisateurs non experts puissent partager, publier et réutiliser des données. Elle se présente sous la forme d'un produit commercial, prêt à l'emploi et hébergé dans un cloud.
it: `OpenDataSoft <https://www.opendatasoft.com/>`_ è una soluzione "chiavi in mano" pensata per consentire a utenti non esperti di condividere, pubblicare e riutilizzare i dati. È disponibile come prodotto commerciale ospitato su cloud.
nl: `OpenDataSoft <https://www.opendatasoft.com/>`_ is a turnkey oplossing die speciaal ontwikkeld werd voor niet-technische gebruikers om data te delen, te publiceren en te hergebruiken. Ze is beschikbaar als een in de winkel verkrijgbaar, door cloud gehost product.

source: OpenDataSoft includes a unique set of integrated features:
de: OpenDataSoft umfasst einzigartige integrierte Funktionen:
es: OpenDataSoft incluye un elenco excepcional de funciones integradas:
fr: OpenDataSoft comprend un ensemble unique de fonctionnalités intégrées, destinées à :
it: L'offerta OpenDataSoft integra un set di funzionalità integrate senza pari che ti consentiranno di:
nl: OpenDataSoft is uitgerust met een uniek pakket ge√Øntegreerde functies:

source: to collect datasets from various locations and in different formats.
de: um Datensätzen von verschiedenen Orten und in unterschiedlichen Formaten zu sammeln.
es: Para recopilar conjuntos de datos de diversas ubicaciones y en varios formatos.
fr: collecter des jeux de données à partir d'emplacements divers et dans différents formats ;
it: raccogliere dataset da provenienze e in formati diversi;
nl: om datasets van verschillende locaties en in verschillende formaten te verzamelen.

source: to transform and enrich these datasets using powerful built-in data preparation features.
de: um diese Datensätze mit leistungsstarken eingebauten Datenvorbereitungsfunktionen umzugestalten und anzureichern.
es: Para transformar y enriquecer estos conjuntos de datos mediante funciones avanzadas de preparación de datos integradas.
fr: transformer et enrichir ces jeux de données grâce à des fonctionnalités de préparation des données incluses ;
it: trasformare e arricchire i dataset grazie alla presenza di funzionalità avanzate per la preparazione dei dati;
nl: om deze datasets te transformeren en te verrijken door gebruik te maken van krachtige ingebouwde functies voor het voorbereiden van data.

source: to publish these datasets as RESTFul APIs.
de: um diese Datensätze als RESTFul-APIs zu veröffentlichen.
es: Para publicar estos conjuntos de datos como interfaces API RESTFul.
fr: publier ces jeux de données sous la forme d'API RESTFul ;
it: pubblicare dataset sotto forma di API RESTFul;
nl: om deze datasets te publiceren als RESTFul API's

source: to explore the datasets catalog, to visualize individual datasets or build multi-datasets mashups.
de: um den Datensatzkatalog zu untersuchen, die einzelnen Datensätze zu visualisieren oder Mashups aus mehreren Datensätzen zu bilden.
es: Para explorar el catálogo de conjuntos de datos, visualizar conjuntos de datos individuales o compilar mashups de varios conjuntos de datos.
fr: explorer le catalogue de jeux de données pour visualiser les jeux de données séparément ou créer des combinaisons avec plusieurs jeux de données.
it: esplorare il catalogo dei dataset per visualizzarli singolarmente o per creare combinazioni mashup.
nl: om de catalogus met datasets te doorzoeken, om individuele datasets te bekijken of mash-ups met meerdere datasets te bouwen.

source: Give a try to OpenDataSoft by subscribing to a `free trial account <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_.
de: Probieren Sie OpenDataSoft aus und abonnieren Sie ein `kostenloses Probekonto <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_.
es: Descubra las posibilidades de OpenDataSoft suscribiéndose a una `cuenta de prueba gratuita <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_.
fr: Essayez OpenDataSoft en créant un `compte d'essai <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_.
it: Scopri OpenDataSoft creando `un account di prova gratuito <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_.
nl: Probeer OpenDataSoft eens door in te schrijven op een `gratis testaccount <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_.

source: Access our `data network <https://data.opendatasoft.com>`_ if you are looking for reusable public datasets.
de: Greifen Sie auf unser `Datennetzwerk <https://data.opendatasoft.com>`_ zu, wenn Sie nach weiterverwertbaren öffentlichen Datensätzen suchen.
es: Acceda a nuestra `red de datos <https://data.opendatasoft.com>`_ si busca conjuntos de datos públicos reutilizables.
fr: Accédez à notre `réseau de données <https://data.opendatasoft.com>`_ si vous recherchez des jeux de données publics réutilisables.
it: Accedi alla nostra `rete di dati <https://data.opendatasoft.com>`_ se sei alla ricerca di dataset pubblici da riutilizzare.
nl: Ga naar ons `datanetwerk <https://data.opendatasoft.com>`_ wanneer u op zoek bent naar herbruikbare openbare datasets.

source: OpenDataSoft's network of data
de: OpenDataSoft-Datennetzwerk
es: Red de datos de OpenDataSoft
fr: Réseau de données d'OpenDataSoft
it: La rete di dati OpenDataSoft
nl: Het datanetwerk van OpenDataSoft

source: This documentation is OpenDataSoft's reference documentation. It complements inline documentation directly accessible in OpenDataSoft's back-office screens.
de: Diese Dokumentation ist das Nachschlagewerk von OpenDataSoft, das die direkt in den Bildschirmen des Back-Office von OpenDataSoft verfügbare Inline-Dokumentation ergänzt.
es: Esta es la documentación de referencia de OpenDataSoft. Complementa la documentación incorporada directamente en las pantallas del back office de OpenDataSoft.
fr: Cette documentation est la documentation de référence d'OpenDataSoft. Elle complète la documentation en ligne directement accessible dans les écrans du back office d'OpenDataSoft.
it: Questa è la documentazione di riferimento di OpenDataSoft e ha lo scopo di integrare la guida in linea direttamente disponibile dalle schermate dell'interfaccia di back-office.
nl: Deze documentatie is referentiedocumentatie van OpenDataSoft. Deze vult de inline documentatie aan die rechtstreeks beschikbaar is in de back-office schermen van OpenDataSoft.

source: You will find some of the resources used in this documentation online on our `discovery portal <https://discovery.opendatasoft.com/>`_.
de: Einige der in dieser Dokumentation verwendeten Ressourcen finden Sie online auf unserem `Entdeckungsportal <https://discovery.opendatasoft.com/>`_.
es: Encontrará algunos de los recursos empleados en esta documentación en línea en nuestro `portal Discovery <https://discovery.opendatasoft.com/>`_.
fr: Vous trouverez certaines des ressources utilisées dans cette documentation en ligne sur notre `portail discovery <https://discovery.opendatasoft.com/>`_.
it: Alcune delle risorse in essa contenute sono disponibili anche nel nostro `portale di esplorazione <https://discovery.opendatasoft.com/>`_.
nl: Sommige van de bronnen die gebruikt worden in deze documentatie zijn online terug te vinden op ons `ontdekkingsportaal <https://discovery.opendatasoft.com/>`_.

source: OpenDataSoft's discovery portal
de: OpenDataSoft-Entdeckungsportal
es: Portal Discovery de OpenDataSoft
fr: Portail discovery d'OpenDataSoft
it: Portale di esplorazione OpenDataSoft
nl: Het ontdekkingsportaal van OpenDataSoft

source: OpenDataSoft staff is always available to help. You can give us feedbacks or send us questions by contacting OpenDataSoft support, either by hitting the **Support** link in the back-office menu or by sending an email to `support@opendatasoft.com <mailto:support@opendatasoft.com>`_.
de: Das gesamte Team von OpenDataSoft hilft Ihnen ederzeit gerne weiter. Sie können uns Feedback geben oder sich mit Fragen an den OpenDataSoft-Support wenden, indem Sie entweder dem Link **Support** im Back-Office-Menü folgen oder eine E-Mail an `support@opendatasoft.com <mailto:support@opendatasoft.com>`_ senden.
es: El personal de OpenDataSoft siempre está a su disposición para brindarle ayuda. Puede enviar comentarios o preguntas poniéndose en contacto con el equipo de soporte de OpenDataSoft, a través del vínculo **Soporte** del menú del back office o por correo electrónico a `support@opendatasoft.com <mailto:support@opendatasoft.com>`_.
fr: Le personnel d'OpenDataSoft est toujours à votre disposition pour vous aider. Vous pouvez nous faire part de vos retours ou de vos questions en contactant l'assistance d'OpenDataSoft. Pour ce faire, il vous suffit de cliquer sur le lien **Assistance** dans le menu du back office ou d'envoyer un e-mail à `support@opendatasoft.com <mailto:support@opendatasoft.com>`_.
it: Il team OpenDataSoft è sempre a tua disposizione per qualsiasi problema. Se desideri inviarci un feedback o farci domande, contatta l'assistenza cliccando su **Assistenza** nel menu di back-office o inviando un'e-mail a `support@opendatasoft.com <mailto:support@opendatasoft.com>`_.
nl: Het personeel van OpenDataSoft staat altijd klaar om te helpen. U kan ons feedback geven of ons vragen stellen door contact op te nemen met het Support Team van OpenDataSoft, ofwel via de koppeling **Support** in het back-office menu of door een e-mail te sturen naar `support@opendatasoft.com <mailto:support@opendatasoft.com>`_.
