Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publish_content.po
Languages: fr

source: Writing Content Pages
fr: Les pages de contenu

source: Not only the OpenDataSoft platform allows you to browse and explore configured datasets. You can also use it to build fully customized content pages, mixing editorial content as well as data visualizations built from your domain's datasets.
fr: La plateforme OpenDataSoft ne se contente pas de vous permettre d'explorer des jeux de données préconfigurés. Elle vous permet aussi de créer des pages de contenu totalement personnalisées mélangeant contenu éditorial et visualisations des jeux de données de votre domaine.

source: Content pages can be used to:
fr: Les pages de contenu peuvent servir à :

source: Complement and organize your data portal by configuring a home page and by adding topic specific pages.
fr: Compléter et organiser votre portail de données en configurant une page d'accueil et en ajoutant des pages dédiées à des sujets spécifiques.

source: Build editorial content directly on the platform and publish it on the Web, as a direct link or through an embed.
fr: Construire et publier (en lien direct ou en embarqué au sein d'un autre site) des pages éditoriales riches.

source: Build dynamic dashboards
fr: Créer des tableau de bord dynamiques

source: Creating a new content page
fr: Création d'une nouvelle page de contenu

source: To create a new content page, go to the *Domain > Portal > Pages* section.
fr: Pour créer une nouvelle page de contenu, il vous faut aller sur *Domaine > Portail > Pages*.

source: Simply hit the **New** button. Once created, the page edition window is displayed.
fr: Cliquez ensuite sur le bouton "Nouveau". L'écran d'édition de page s'affiche alors.

source: Before being able to save a page, you need to configure the page **slug** (*page1* in the example above).
fr: Avant de pouvoir sauvegarder une page, vous devrez configurer l'**URL de la page** (*page_1* dans l'exemple ci-dessus).

source: Note that if your domain is configured for multiple user interface languages, you will have to configure your page content (title, description and page content itself) for all the configured languages.
fr: Si votre domaine est configuré de manière à supporter plusieurs langages, vous devrez configurer votre page (titre, description et contenu de la page) dans chacun de ces langages.

source: The template selector lets you select ready to use templates. You can also choose to edit your page in expert mode, which gives you a very efficient and powerful way to define your page content.
fr: Le sélecteur de templates vous permet de choisir entre plusieurs formats de pages prêt à l'emploi. Vous pouvez toutefois toujours choisir d'éditer la page en mode expert. Ce mode est beaucoup plus puissant car il permet de définir très exactement le contenu de la page et sa mise en page.

source: Note that you can switch to expert mode from any template. But once you've switched to expert mode, you cannot go back.
fr: Vous pouvez passer en mode expert depuis tous les templates. En revanche une fois en mode expert, vous ne pouvez pas revenir au mode précédent.

source: In expert mode, you can independently work on your page content (HTML5) and style (CSS). Javascript code is stripped from HTML content but as the OpenDataSoft UI framework is based on AngularJS, you can leverage AngularJS bindings directly in your page's code.
fr: Le mode expert vous permet de travailler indépendamment sur le contenu de votre page (en HTML5) et son style (CSS). Aucun code Javascript n'est permis, et la plateforme supprimera tout Javascript qu'elle trouverait dans une page. En revanche, l'interface d'OpenDataSoft étant construite sur AngularJS, vous pouvez utiliser les **bindings** AngularJS dans vos pages.

source: The preview button allows you to visualize the current content of your page, even if you didn't save it.
fr: Le bouton aperçu permet de visualiser l'état actuel de la page même si celle ci n'est pas sauvegardée.

source: About the ods-widgets library
fr: A propos de la bibliothèque ods-widgets

source: When editing your page content in expert mode, you may want to use the ods-widgets library, which is a high level abstraction allowing you to natively integrate data visualizations in your page code.
fr: Vous voudrez très certainement utiliser la bibliothèque ods-widgets dans le code de vos pages (en mode expert uniquement) car celle-ci permet d'y intégrer nativement des visualisations de données.

source: This overcomes classic IFrames limitations:
fr: Cette bibliothèque remplace avantageusement les limitations des classiques IFrames:

source: IFrames generate a high load browser side
fr: Les IFrames génèrent une forte charge dans le navigateur

source: IFrames cannot interact together
fr: Les IFrames ne peuvent intéragir les unes avec les autres

source: It can be used directly in your domain's content pages (without having to load / initialize the library as this is already done by the platform) or in third pary Web sites, as a standalone toolkit.
fr: Vous pouvez l'utiliser directement dans les pages de contenu de votre domaine (nul besoin de charger/initialiser la bibliothèque, la plateforme s'en charge) comme dans des pages externes sur des sites tiers (en la traitant comme une boite à outils indépendante).

source: Embedding content pages
fr: Embarquer des pages de contenu

source: It is possible to embed an OpenDataSoft content page as you would do with any OpenDataSoft data visualization. Just set the HTTP parameter **headless** to **true** in your page URL. For instance: `<http://mydomain.opendatasoft.com/page/mypage/?headless=true>`_.
fr: Il est possible d'embarquer une page de contenu OpenDataSoft comme vous le feriez avec n'importe quelle visualisation de données sur OpenDataSoft. Il vous faudra juste passer la paramètre HTTP ``headless`` à ``true`` dans l'URL de la page. Par exemple: ``http://mydomain.opendatasoft.com/page/mypage/?headless=true``.

source: Updating your domain's menu
fr: Mise à jour du menu sur le domaine

source: Once your page content has been fully defined, you might want to *plug* your page in your domain's menu. This can easily be done by editing the menu components in the *Domain > Portal > General settings* section.
fr: Une fois votre page de contenu finalisée, vous voudrez sans doute l'injecter dans le menu de votre domaine. Il suffit pour cela de modifier la liste des éléments du menu dans la partie *Domaine > Portail > Paramètres globaux*.

source: Special directives
fr: Directives spécifiques

source: On top of all the widgets offered by the `ods-widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ library, a few additional directives are available for use within the content pages on the platform. Contrary to the widgets, these cannot be used on third-party websites for they are tightly coupled with the platform.
fr: En plus des widgets offerts par la bibliothèque `ods-widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_, quelques directives supplémentaires qui peuvent être utilisés au sein des pages de contenu sur la plateforme. Contrairement aux widgets, elles ne peuvent en revanche pas être utilisées sur des sites tiers car elles sont intimement liées à la plateforme.

source: Contact form
fr: Formulaire de contact

source: This directive inserts a form that users can use to contact the domain's administrators. It uses reCaptcha to make sure anonymous users cannot spam the administrators.
fr: Cette directive insère dans la page un formulaire permettant aux utilisateurs de contacter les administrateurs du domaine. Ce formulaire incorpore le système reCaptcha pour empêcher les robots spameurs de l'utiliser.

source: Parameter
fr: Paramètre

source: ``page-id`` **required**
fr: ``page-id`` **obligatoire**

source: string
fr: chaîne de caractères

source: The slug of the current page so that administrators know where the request came from.
fr: Le slug de la page de contenu. Permet aux administrateurs destinataires du message de savoir d'où provient la requête.

source: boolean (default: false)
fr: booléen (valeur par défaut: false)

source: Specify whether to disable (that is prevent data input and submission) the contact form or not.
fr: Permet de désactiver le formulaire, ce qui empêche la saisie de donnée et la validation pour envoi.

source: boolean (default: autodetected)
fr: booléen (valeur par défaut: détectée automatiquement)

source: Specify whether the current user is logged in or not. If true, the recaptcha is not displayed.
fr: Permet d'indiquer si l'utilisateur est connecté à la plateforme ou non. Si cette valeur est à faux, le recaptcha ne sera pas affiché.

source: string (default: `Your name`)
fr: chaîne de caractères (valeur par défaut: `Votre nom`)

source: Specify the label displayed in front of the name field.
fr: Permet de spécifier le texte à afficher en face du champ nom.

source: string (default: `Email`)
fr: chaîne de caractères (valeur par défaut : `Email`)

source: Specify the label displayed in front of the email field.
fr: Permet de spécifier le texte à afficher en face du champ email.

source: string (default: `Message`)
fr: chaîne de caractères (valeur par défaut: `Message`)

source: Specify the label displayed in front of the message field.
fr: Permet de spécifier le texte à afficher en face du champ message.

source: Pages list
fr: Liste des pages

source: These 2 directives list all the portal's content pages. While the first one only provides an iterator, leaving to you the actual display of the list, the second one generate a list containing a link to the page alongside the page description.
fr: Ces deux directives permettent de lister les pages de contenu du portail. La première est un itérateur vous laissant le soin de définir l'aspect de la liste tandis que la seconde génère une liste contenant à chaque fois un lien vers la page accompagné de la description de celle-ci.

source: Usage
fr: Utilisation

source: Result
fr: Résultat

source: User feedback
fr: Contributions d'utilisateurs

source: If you enable user feedback on a dataset, you can use a special directive to display a link to the feedback form to users on content pages or in map tooltips.
fr: Si vous activez les contributions d'utilisateurs sur un jeu de données, vous pouvez utiliser une directive pour afficher un lien vers le formulaire de contribution depuis une page de contenu ou une infobulle de carte.

source: Enabling user feedback on a dataset
fr: Activer les contributions d'utilisateurs

source: To use it, you need to have a ``context`` and a ``record`` : in the case of a map tooltip, the ``record`` object is already provided.
fr: Pour l'utiliser, vous avez besoin d'un ``context`` et un ``record`` : dans le cas d'une infobulle de carte, l'objet ``record`` est déjà fourni.

source: Examples :
fr: Exemples :

source: In a custom HTML tooltip :
fr: Dans une infobulle HTML personnalisée :

source: In a content page :
fr: Dans une page de contenu :
