Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/setup.po
Languages: de, es, fr, it, nl

source: Getting started with Opendatasoft
de: Erste Schritte mit Opendatasoft
es: Primeros pasos con Opendatasoft
fr: Commencer à utiliser Opendatasoft
nl: Van start gaan met Opendatasoft

source: Using any web browser, go to the Opendatasoft domain of your choice.
de: Rufen Sie mit einem beliebigen Webbrowser die Opendatasoft-Domain Ihrer Wahl auf.
es: Vaya al dominio Opendatasoft de su elección utilizando cualquier explorador web.
fr: Accédez au domaine Opendatasoft de votre choix à l'aide d'un navigateur Web.
nl: Gebruik om het even welke webbrowser en ga naar het Opendatasoft-domein van uw keuze.

source: Submit your credentials (email and password you chose when creating your account) to log in to the chosen Opendatasoft domain.
de: Geben Sie Ihre Anmeldeinformationen (E-Mail-Adresse und Passwort, die Sie bei der Erstellung Ihres Kontos gewählt haben) ein, um sich bei der Opendatasoft-Domain anzumelden.
es: Introduzca sus credenciales (correo electrónico y contraseña que eligió al crear su cuenta) para iniciar sesión al dominio Opendatasoft elegido.
fr: Indiquez vos identifiants (l'email et le mot de passe que vous avez choisis lors de la création de votre compte) pour vous connecter au domaine Opendatasoft voulu.
nl: Geef uw gegevens in (e-mail en wachtwoord dat u heeft gekozen bij het aanmaken van uw account) om in te loggen op het gekozen Opendatasoft-domein.

source: When logging in for the first time: accept Opendatasoft's terms of use.
de: Wenn Sie sich zum ersten Mal anmelden: akzeptieren Sie die Nutzungsbedingungen von Opendatasoft.
es: Al iniciar sesión por primera vez, acepte los Términos de uso de Opendatasoft.
fr: Lors de votre première connexion, vous devez accepter les conditions d'utilisation d'Opendatasoft.
nl: Wanneer u voor het eerst inlogt: aanvaard de algemene gebruiksvoorwaarden van Opendatasoft.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: The address of an Opendatasoft domain generally looks like one of the following examples:
de: Die Adresse einer Opendatasoft-Domain sieht in der Regel wie eines der folgenden Beispiele aus:
es: Las direcciones de un dominio Opendatasoft generalmente tienen uno de los siguientes formatos:
fr: L'adresse d'un domaine Opendatasoft ressemble généralement à l'un des exemples suivants :
nl: Het adres van een Opendatasoft-domein ziet er over het algemeen uit als een van de volgende voorbeelden:

source: `https://mydomain.my.opendatasoft.com`, for personals
de: `https://mydomain.my.opendatasoft.com` für Privatpersonen
es: `https://mydomain.my.opendatasoft.com`, personales

source: `https://mydomain.trial.opendatasoft.com`, for free trials
de: `https://mydomain.trial.opendatasoft.com` für kostenlose Probekonten
es: `https://mydomain.trial.opendatasoft.com`, para pruebas gratuitas

source: However, it could also not contain any mention of Opendatasoft if an alias was created for the domain.
de: Falls ein Alias für die Domain angelegt wurde, wird Opendatasoft gegebenenfalls nicht in der Adresse erwähnt.
es: Sin embargo, existe la posibilidad de que no se mencione Opendatasoft si se creó un alias para el dominio.
fr: Toutefois, il peut aussi ne pas contenir de référence à Opendatasoft si un alias a été créé pour le domaine.
nl: Het is evenwel mogelijk dat Opendatasoft er niet in staat vermeld wanneer er voor het domein een alias was aangemaakt.

source: Using Opendatasoft as an authenticated user
de: Opendatasoft als authentifizierter Benutzer verwenden
es: Usar Opendatasoft como usuario autenticado
fr: Utiliser Opendatasoft en tant qu'utilisateur authentifié
nl: Opendatasoft gebruiken als geïdentificeerde gebruiker

source: Once logged in as an Opendatasoft user, you can navigate the domain's front office (end-user interface) to :doc:`explore the catalog and datasets </exploring_catalog_and_datasets/index>` and even go further by :doc:`creating maps and charts </creating_maps_charts/index>`. If you are also granted the right permissions, you can access the back office (administration interface), where it is possible to :doc:`publish data </publishing_data/index>`, :doc:`create content </creating_content/index>`, and :doc:`manage </managing_domain/index>` and :doc:`configure the domain </configuring_domain/index>`.
de: Sobald Sie als Opendatasoft-Benutzer angemeldet sind, können Sie im Frontoffice der Domain (Endbenutzeroberfläche) arbeiten, um :doc:`den Katalog und die Datensätze zu untersuchen </exploring_catalog_and_datasets/index>` oder auch :doc:`Karten und Diagramme zu erstellen </creating_maps_charts/index>`. Wenn Sie die entsprechenden Berechtigungen haben, können Sie auf das Backoffice (Verwaltungsoberfläche) zugreifen, wo Sie :doc:`Daten veröffentlichen </publishing_data/index>`, :doc:`Inhalte erstellen </creating_content/index>` und :doc:`die Domain verwalten </managing_domain/index>` und :doc:`konfigurieren können </configuring_domain/index>`.
es: Una vez iniciada la sesión como usuario de Opendatasoft, usted podrá navegar por el front office del dominio (interfaz de usuario final) para :doc:`explorar el catálogo y los conjuntos de datos </exploring_catalog_and_datasets/index>` e incluso ir más allá y :doc:`Crear mapas y gráficos </creating_maps_charts/index>`. Si además dispone de los permisos necesarios, podrá acceder al back office (interfaz de administración), donde es posible :doc:`publicar datos </publishing_data/index>`, :doc:`crear contenido </creating_content/index>`, y :doc:`gestionar </managing_domain/index>` y :doc:`configurar el dominio </configuring_domain/index>`.

source: Depending on the domain, there are 2 ways to have an Opendatasoft account:
de: Abhängig von der Domain gibt es 2 Möglichkeiten, ein Opendatasoft-Konto zu erstellen:
es: Dependiendo del dominio, existen dos maneras de obtener una cuenta Opendatasoft:
fr: En fonction du domaine, 2 méthodes s'offrent à vous pour créer un compte Opendatasoft :
nl: Afhankelijk van het domein zijn er 2 manieren om een Opendatasoft-account te hebben:

source: it may be possible to create a new account by clicking the "Signup" button that should be displayed in the top right corner (however, not all Opendatasoft domains allow users to signup),
de: ein neues Konto kann durch Klicken auf den Button "Anmeldung" erstellt werden, der oben rechts zu sehen sein sollte (es bieten jedoch nicht alle Opendatasoft-Domains diese Möglichkeit),
es: es posible crear una nueva cuenta haciendo clic en el botón "Registro" que debería aparecer en la esquina superior derecha (sin embargo, no todos los dominios Opendatasoft permiten a los usuarios registrarse),
fr: Vous avez la possibilité de créer un compte en cliquant sur le bouton "S'inscrire" qui est normalement affiché en haut à droite (néanmoins, tous les domaines Opendatasoft n'autorisent pas l'inscription des utilisateurs).
nl: Het is mogelijk om een nieuw account aan te maken door te klikken op de knop "Intekenen" die in de rechter bovenhoek zou moeten verschijnen (gebruikers kunnen evenwel niet op alle Opendatasoft-domeinen intekenen).

source: or, one can be invited to an Opendatasoft domain by an administrator of that domain; the new user then receives an email with a link to create a new account.
de: oder eine Person kann von einem Administrator einer Opendatasoft-Domain zu dieser Domain eingeladen werden; dem neuen Benutzer wird eine E-Mail mit einem Link zugesendet, über den er ein neues Konto erstellen kann.
es: o, puede recibir una invitación a un dominio Opendatasoft por parte de un administrador de dicho dominio; el nuevo usuario recibe un correo electrónico con un enlace para crear una nueva cuenta.

source: Discovering a domain without having an Opendatasoft account
de: Eine Domain ohne Opendatasoft-Konto besuchen
es: Descubrir un dominio sin disponer de una cuenta Opendatasoft
fr: Explorer un domaine sans avoir de compte Opendatasoft
nl: Een domein ontdekken zonder dat men een Opendatasoft-account heeft

source: If you do not have an Opendatasoft account, and that the Opendatasoft domain you want to access is open to unauthenticated users, you are not required to create an account. As a user without an account (also called an anonymous user), it is possible to navigate the front office. However, you will not have access to the back office.
de: Wenn Sie kein Opendatasoft-Konto haben und die Opendatasoft-Domain, auf die Sie zugreifen möchten, auch für nicht authentifizierte Benutzer zur Verfügung steht, müssen Sie kein Konto erstellen. Als Benutzer ohne Konto (auch anonymer Nutzer genannt), können Sie das Frontoffice besuchen. Sie haben jedoch keinen Zugang zum Backoffice.
es: Si no dispone de una cuenta Opendatasoft, y el dominio Opendatasoft al que desea acceder está abierto a los usuarios no autenticados, no necesita crear una cuenta. Es posible navegar por el front office como usuario sin cuenta (también llamado usuario anónimo). Sin embargo, no podrá acceder al back office.
fr: Si vous n'avez pas de compte Opendatasoft et si le domaine Opendatasoft auquel vous souhaitez accéder est ouvert aux utilisateurs non authentifiés, vous n'avez pas besoin de créer de compte. En tant qu'utilisateur sans compte (aussi appelé utilisateur non authentifié), vous pouvez parcourir l'interface de navigation, mais pas celle d'administration.
nl: Indien u geen Opendatasoft-account heeft en het Opendatasoft-account waar u heen wilt gaan toegankelijk is voor niet-geïdentificeerde gebruikers, hoeft u geen account aan te maken. Als gebruiker zonder een account (ook een anonieme gebruiker genoemd) is het mogelijk om naar de front office te gaan. Wel heeft u geen toegang tot de back office.

source: https://mydomain.my.opendatasoft.com, for personals
fr: https://mydomain.my.opendatasoft.com pour les comptes personnels
nl: https://mydomain.my.opendatasoft.com, voor persoonlijke domeinen

source: https://mydomain.trial.opendatasoft.com, for free trials
fr: https://mydomain.trial.opendatasoft.com pour les versions d'essai
nl: https://mydomain.trial.opendatasoft.com, voor gratis tests

source: Once logged in as an Opendatasoft user, you can navigate the front office of the domain (end-user interface) to :doc:`explore the catalog and datasets </exploring_catalog_and_datasets/index>` and even go further by :doc:`creating maps and charts </creating_maps_charts/index>`. If you were also granted the right permissions, you can access the back office (administration interface) where it is possible to :doc:`publish data </publishing_data/index>`, :doc:`create content </creating_content/index>`, and :doc:`manage </managing_domain/index>` and :doc:`configure the domain </configuring_domain/index>`.
fr: Quand vous être connecté en tant qu'utilisateur Opendatasoft, vous pouvez parcourir l'interface de navigation du domaine (interface de l'utilisateur final) pour :doc:`explorer le catalogue et les jeux de données </exploring_catalog_and_datasets/index>` et même aller plus loin en :doc:`créant des cartes et des graphes </creating_maps_charts/index>`. Si vous disposez des permissions adéquates, vous pouvez également accéder à l'interface d'administration où vous avez la possibilité de :doc:`publier des données </publishing_data/index>`, :doc:`créer du contenu </creating_content/index>`, :doc:`gérer </managing_domain/index>` et :doc:`configurer le domaine </configuring_domain/index>`.
nl: Eenmaal u bent ingelogd als een Opendatasoft-gebruiker, kunt u naar de front office van het domein gaan (end-user interface) om :doc:`de catalogus en datasets te exploreren </exploring_catalog_and_datasets/index>` en zelfs nog verder gaan door :doc:`kaarten en grafieken aan te maken </creating_maps_charts/index>`. Indien aan u ook de juiste toelatingen zijn toegekend, kunt u naar de back office gaan (administratie-interface) waar het mogelijk is om :doc:`gegevens te publiceren </publishing_data/index>`, :doc:`content aan te maken </creating_content/index>`, en :doc:`het domein te beheren </managing_domain/index>` en :doc:`te configureren </configuring_domain/index>`.

source: or, one can be invited to an Opendatasoft domain by an administrator of that domain ; the new user then receives an email with a link to create a new account.
fr: Ou alors, vous pouvez être invité à rejoindre un domaine Opendatasoft par un administrateur de ce domaine ; en tant que nouvel utilisateur, vous recevez un email avec un lien permettant de créer un compte.
nl: of iemand kan door een beheerder van een domein uitgenodigd worden voor dat Opendatasoft-domein; de nieuwe gebruiker ontvangt dan een e-mail met een link om een nieuw account aan te maken.

source: Setting up OpenDataSoft
it: Configurazione di OpenDataSoft

source: To start, you may want to freely browse datasets on public existing OpenDataSoft's portal (see for instance the Open Data portal of the `City of Paris (France) <https://opendata.paris.fr/>`_ and a comprehensive list of OpenDataSoft's `customers <https://www.opendatasoft.com/company/customers/>`_).
it: Per cominciare, puoi sfogliare i dataset pubblici presenti sul portale OpenDataSoft. Ad esempio, apri il portale Open Data della `Città di Parigi <https://opendata.paris.fr/>`_ e consulta la lista completa dei `clienti <https://www.opendatasoft.com/company/customers/>`_ OpenDataSoft.

source: But you can also get an access to your own OpenDataSoft's instance (called **domain** throughout the rest of this documentation).
it: Oppure puoi accedere alla tua istanza OpenDataSoft, che in questa documentazione sarà chiamata **dominio**.

source: You can get access to a `free trial domain <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_.
it: OpenDataSoft mette a disposizione un `dominio di prova gratuito <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_.

source: Free trial account creation
it: Creazione di un account di prova gratuito

source: Free trial domains are limited in terms of capabilities (number of datasets, volume of data and number of API calls).
it: I domini gratuiti hanno una capacità limitata in termini di numero di dataset, volume di dati e numero di chiamate API.

source: To get access to a premium OpenDataSoft domain, contact your OpenDataSoft's sales representative or send an email to `OpenDataSoft <mailto:contact@opendatasoft.com>`_.
it: Per ottenere un dominio premium, contatta il rappresentante commerciale OpenDataSoft o invia `un'e-mail <mailto:contact@opendatasoft.com>`_.

source: To access your OpenDataSoft domain, simply use your favorite web browser. The address to use looks like **https://mydomain.opendatasoft.com** or **https://mydomain.my.opendatasoft.com** for free trial domains.
it: Per accedere al tuo dominio OpenDataSoft, puoi utilizzare il tuo browser preferito, collegandoti all'indirizzo **https://miodominio.opendatasoft.com** o **https://miodominio.my.opendatasoft.com** per un dominio di prova gratuito.

source: When first connecting to your domain, after having submitted your credentials, you'll have to accept OpenDataSoft's terms of use.
it: Al primo accesso, dopo aver inserito le tue credenziali, ti verrà chiesto di accettare le condizioni d'uso di OpenDataSoft.

source: You shall then be redirected to OpenDataSoft's back-office main screen.
it: Verrà quindi visualizzata la schermata principale dell’interfaccia di back-office.

source: Back-office after first connection
it: L’interfaccia di back-office al primo accesso
