Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sphinx.po
Languages: de, es, fr, it, nl

source: Search docs
de: Dok. suchen
es: Buscar en la documentación
fr: Rechercher
it: Cerca documenti
nl: Documenten zoeken

source: Next
de: Weiter
es: Siguiente
fr: Suivant
it: Precedente
nl: Volgende

source: Previous
de: Zurück
es: Anterior
fr: Précédent
it: Successivo
nl: Vorige

source: Was this article helpful?
de: War dieser Artikel hilfreich?
es: ¿Este artículo le ha resultado útil?
fr: Cet article a-t-il été utile ?
it: Questo articolo è stato utile?
nl: Was dit artikel nuttig?

source: All good, thanks!
de: Alles bestens, danke!
es: ¡Todo bien, gracias!
fr: Oui, merci !
it: Sì, grazie!
nl: Alles ok, dank u!

source: Not really no
de: Nicht wirklich
es: Realmente, no
fr: Pas vraiment
it: Non molto
nl: Niet echt, nee

source: Great! Thanks for your feedback.
de: Prima! Danke für Ihr Feedback.
es: ¡Excelente! Gracias por sus comentarios.
fr: Super ! Merci pour vos commentaires.
it: Ottimo. Grazie per il tuo feedback.
nl: Fantastisch! Dank u voor uw feedback.

source: Sorry to hear that. Tell us what needs improvement.
de: Das tut uns leid. Sagen Sie uns, was verbessert werden muss.
es: Lo sentimos. Indíquenos qué debemos mejorar.
fr: Nous sommes désolés d'apprendre cela. Faites-nous savoir ce que nous pouvons améliorer.
it: Ci dispiace. Spiegaci cosa vorresti migliorare:
nl: Het spijt ons dat te horen. Zeg ons wat verbeterd moet worden.

source: Send feedback
de: Feedback senden
es: Enviar comentarios
fr: Envoyer des commentaires
it: Invia il tuo feedback
nl: Stuur feedback

source: Got it! Thanks for your feedback.
de: Angekommen! Danke für Ihr Feedback.
es: ¡Recibido! Gracias por sus comentarios.
fr: Bien reçu ! Merci pour vos commentaires.
it: Ricevuto! Grazie per il tuo feedback.
nl: Ontvangen! Dank u voor uw feedback.

source: <span class="build"> Build <a href="%(build_url)s">%(build_id)s</a>. </span>
es: <span class="build"> Compilación <a href="%(build_url)s">%(build_id)s</a>. </span>
fr: <span class="build"> Version <a href="%(build_url)s">%(build_id)s</a>. </span>
nl: <span class="build"> Gebouwd <a href="%(build_url)s">%(build_id)s</a>. </span>

source: <span class="commit"> Revision <code>%(commit)s</code>. </span>
de: <span class="commit"> Überarbeitung <code>%(commit)s</code>. </span>
es: <span class="commit"> Revisión <code>%(commit)s</code>. </span>
fr: <span class="commit"> Révision <code>%(commit)s</code>. </span>
it: <span class="commit"> Revisione <code>%(commit)s</code>. </span>
nl: <span class="commit"> Revisie <code>%(commit)s</code>. </span>

source: Last updated on %(last_updated)s.
de: Zuletzt aktualisiert am %(last_updated)s.
es: Última actualización %(last_updated)s.
fr: Dernière mise à jour le %(last_updated)s.
it: Ultimo aggiornamento il %(last_updated)s.
nl: Laatst bijgewerkt op %(last_updated)s.

source: Built with <a href="http://sphinx-doc.org/">Sphinx</a> using a <a href="https://github.com/snide/sphinx_rtd_theme">theme</a> provided by <a href="https://readthedocs.org">Read the Docs</a>
de: Erstellt mit <a href="http://sphinx-doc.org/">Sphinx</a> unter Verwendung eines <a href="https://github.com/snide/sphinx_rtd_theme">Designs</a> von <a href="https://readthedocs.org">Read the Docs</a>
es: Compilación efectuada mediante <a href="http://sphinx-doc.org/">Sphinx</a> con un <a href="https://github.com/snide/sphinx_rtd_theme">tema</a> suministrado por <a href="https://readthedocs.org">Read the Docs</a>
fr: Créé avec <a href="http://sphinx-doc.org/">Sphinx</a> en utilisant un <a href="https://github.com/snide/sphinx_rtd_theme">thème</a> fourni par <a href="https://readthedocs.org">Read the Docs</a>
it: Creato con <a href="http://sphinx-doc.org/">Sphinx</a> e basato su un <a href="https://github.com/snide/sphinx_rtd_theme">tema</a> fornito da <a href="https://readthedocs.org">Read the Docs</a>.
nl: Gebouwd met <a href="http://sphinx-doc.org/">Sphinx</a> gebruik makend van een <a href="https://github.com/snide/sphinx_rtd_theme">thema</a> dat werd aangeleverd door <a href="https://readthedocs.org">Lees de documenten</a>

source: lang
de: Spr.
es: Idioma
fr: langue
nl: taal

source: Languages
de: Sprachen
es: Idiomas
fr: Langues
it: Lingue
nl: Talen

source: On Github
de: Auf Github
es: En Github
fr: Sur Github
it: Su Github
nl: Op Github

source: View project's source
de: Projektquelle anzeigen
es: Ver código fuente del proyecto
fr: Consulter la source du projet
it: Visualizza il sorgente del progetto
nl: De born van het project bekijken

source: Make the most of your data and APIs with OpenDataSoft.
de: Machen Sie mit OpenDataSoft das Beste aus Ihren Daten und APIs.
es: Saque el máximo partido a sus datos e interfaces API con OpenDataSoft.
fr: Tirez le meilleur parti de vos données et de vos API avec OpenDataSoft.
it: Sfrutta al meglio i tuoi dati e le tue API con OpenDataSoft.
nl: Haal met OpenDataSoft het uiterste uit uw data en API's.
