Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/map2/create-a-multiple-layers-map.po
Languages: de, es

source: Create a multiple layers map
de: Erstellen Sie eine Karte mit mehreren Ebenen
es: Crear un mapa multicapa

source: Add a dataset to your map
de: Fügen Sie Ihrer Karte einen Datensatz hinzu
es: Añadir un conjunto de datos al mapa

source: In the layer editing area, click on **Add a dataset to this map**.
de: Im Bearbeitungsbereich der Ebenen klicken Sie auf **Dieser Karte einen Datensatz hinzufügen**.
es: En el área de edición de capas,‭ ‬haga clic en‭ **‬Añadir un conjunto de datos a este mapa**.

source: Choose the dataset you want to display on your map. You can select a dataset with geographical information either from your own catalog of datasets published on your domain, or from the **All available data** catalog.
de: Wählen Sie den Datensatz aus, den Sie auf Ihrer Karte anzeigen wollen. Sie können einen Datensatz mit geographischen Informationen entweder aus ihrem eigenen Katalog der auf Ihrer Domain publizierten Datensätze auswählen oder aus dem Katalog **Alle verfügbaren Daten**.
es: Elija el conjunto de datos que desee visualizar en el mapa. Puede seleccionar un conjunto de datos con información geográfica, o bien de su propio catálogo de conjuntos de datos publicados en el dominio, o bien del catálogo **‬Todos los datos disponibles‭**.

source: Click on **Select** if you want to add all data, or **Filter data** if you just want to add part of the data.
de: Klicken Sie auf **Auswählen**, wenn Sie alle Daten hinzufügen wollen, oder auf **Daten filtern**, wenn Sie nur einen Teil der Daten hinzufügen wollen.
es: Haga clic en‭ **‬Seleccionar** ‬si quiere añadir todos los datos o‭ **‬Filtrar datos** ‬si solo desea añadir una parte de ellos.

source: You can change dataset or change which part is filtered at any time. To do so, simply click on **Change filter** next to the layer’s title.
de: Sie können den Datensatz oder den gefilterten Teil jederzeit ändern. Klicken Sie dazu einfach neben dem Titel der Ebene auf **Filter ändern**.
es: Puede cambiar el conjunto de datos o cambiar qué parte se filtra en cualquier momento.‭ ‬Para ello,‭ ‬simplemente haga clic en‭ **‬Cambiar filtro** ‬junto al título de la capa.

source: You can add as many datasets as you want on your map, and all of the data they contain can be displayed on that same map, at the same time. This is when the whole concept of layers comes in play. In Map Builder, because you overlay several datasets, each dataset is called a layer. This is why Map Builder allows you to configure your layers to make sure that you can represent many different data on the same map and still make the reading of this map easy and clear.
de: Sie können auf Ihrer Karte so viele Datensätze ändern, wie Sie wollen, und alle darin enthaltenen Daten können gleichzeitig auf derselben Karte angezeigt werden. Hier kommt das Konzept der Ebenen vollständig ins Spiel. Im Kartenersteller wird jeder Datensatz als Ebene bezeichnet, da Sie verschiedene Datensätze übereinander legen. Daher erlaubt der Kartenersteller Ihnen, Ihre Ebenen so zu definieren, dass Sie ausreichend viele verschiedene Daten klar und einfach zu lesen auf der gleichen Karte darstellen können.
es: Puede añadir tantos conjuntos de datos como desee en el mapa, y todos los datos que estos contengan se podrán visualizar en ese mismo mapa de forma simultánea.‭ ‬Es ahí cuando interviene el concepto de capas.‭ ‬En el compilador de mapas,‭ ‬cuando se superponen varios conjuntos de datos,‭ ‬cada uno de ellos se denomina capa.‭ ‬El compilador de mapas permite configurar las capas para asegurarse de poder representar datos muy diferentes en el mismo mapa sin que ello impida una comprensión fácil y clara del mapa.

source: Keep in mind that the more datasets you add to your map, the heavier it will be, and the longer it will take to load.
de: Bedenken Sie, dass Ihre Karte umso speicherintensiver wird, je mehr Datensätze Sie ihr hinzufügen, und dass sie entsprechend länger lädt.
es: Tenga presente que cuantos más conjuntos de datos añada al mapa,‭ ‬más pesado será y más tardará en cargarse.

source: Edit a layer
de: Eine Ebene bearbeiten
es: Editar una capa

source: The edition of a layer (meaning, a dataset displayed on a map created with Map Builder) has 2 aspects:
de: Die Bearbeitung einer Ebene (also eines Datensatzes, der auf einer mit dem Kartenersteller kreierten Karte angezeigt wird) hat zwei Komponenten:
es: La edición de una capa‭ (‬es decir,‭ ‬un conjunto de datos visualizado en un mapa creado con el compilador de mapas‭) ‬tiene 2‭ ‬aspectos:

source: **Display**: the style, in other words, how the data is displayed on the map
de: **Anzeige**: der Stil oder anders ausgedrückt, die Art der Datendarstellung auf der Karte
es: ‭**‬Visualización**: ‬El estilo,‭ ‬o cómo se visualizan los datos en el mapa

source: **Information**: the information and caption that go with the dataset to describe it better
de: **Information**: Die Information und Beschriftung, um den Datensatz näher zu beschreiben
es: ‭**‬Información‭**‬:‭ ‬La información y la leyenda que corresponden al conjunto de datos para describirlo mejor

source: Edit style
de: Bearbeitungsstil
es: Editar el estilo

source: Click on the **Display** tab. The menu with all style configurations drops down.
de: Klicken Sie auf das Register **Anzeige**. Das Menü mit allen Stil-Konfigurationen klappt auf.
es: Haga clic en la ficha **‬Visualización**.‭ ‬Se despliega el menú con todas las configuraciones de estilo.

source: Choose a visualization mode and configure your layer as you like.
de: Wählen Sie einen Visualisierungsmodus und konfigurieren Sie Ihre Ebene nach Wunsch.
es: Elija un modo de visualización y configure la capa como desee.

source: The style configurations entirely depend on the visualization mode you choose to apply to your layer. There are 5 different modes:
de: Die Stil-Konfigurationen hängen vollständig vom Visualisierungsmodus ab, die Sie auf Ihre Ebene anwenden. Es gibt 5 verschiedene Modi:
es: Las configuraciones de estilo dependen por completo del modo de visualización que decida aplicar a la capa.‭ ‬Existen 5‭ ‬modos:

source: The style configurations displayed for each visualization mode also depend on your dataset. Depending on the dataset you added to your Map Builder map, you may not see all the configurations explained in this documentation.
de: Die Stil-Konfigurationen, die für jede Visualisierung angezeigt werden, hängen auch von Ihrem Datensatz ab. Je nachdem, welchen Datensatz Sie zu der Karte Ihres Kartenerstellers hinzugefügt haben, sehen Sie eventuell nicht alle in dieser Dokumentation erklärten Konfigurationen.
es: Las configuraciones de estilo que se visualizan en cada uno de los modos de visualización también dependen del conjunto de datos.‭ ‬En función del conjunto de datos añadido al mapa del compilador de mapas, es posible que no vea todas las configuraciones que se describen en esta documentación.

source: Dots and shapes
de: Punkte und Formen
es: Puntos y formas

source: The Dots and shapes visualization mode simply displays your data as markers (dots or icons) or as shapes. It is the most common visualization mode.
de: Der Visualisierungsmodus Punkte und Formen zeigt Ihre Daten einfach als Markierungen an (Punkte oder Symbole) oder als Formen. Es ist der gebräuchlichste Visualisierungsmodus.
es: El modo de visualización Puntos y formas simplemente visualiza los datos como marcadores (‬puntos o iconos) o formas.‭ ‬Es el modo de visualización más frecuente.

source: **Style configuration**
de: **Stil-Konfiguration**
es: ‭**‬Configuración de estilo**

source: **Description**
de: **Beschreibung**
es: **Descripción**

source: **Marker display**
de: **Markierungsanzeige**
es: **Visualización de marcador**

source: *What your data will look like on the map*
de: *Wie Ihre Daten auf der Karte angezeigt werden*
es: *Aspecto de los datos en el mapa‭*

source: **Dot**: simple plain circle. Dots are recommended for high density datasets.
de: **Punkt**: einfacher einfarbiger Kreis. Punkte werden für sehr dichte Datensätze empfohlen.
es: **Punto**: Círculo liso simple.‭ ‬Los puntos están recomendados para conjuntos de datos de alta densidad.

source: **Icon**: themed icon (available in the OpenDataSoft library).
de: **Icon**: themenbezogene Icons (verfügbar in der OpenDataSoft-Bibliothek).
es: **Icono**:‭ ‬Icono temático (‬disponible en la biblioteca de OpenDataSoft)‬.

source: **Map marker (with an optional icon)**: standard drop-shaped map marker, with an optional themed icon (available in the OpenDataSoft library) inside.
de: **Kartenmarkierung (mit einem optionalen Icon)**: tropfenförmige Standard-Kartenmarkierung, optional mit einem integrierten themenbezogenen Icon (verfügbar in der OpenDataSoft-Bibliothek).
es: ‭**Marcador de mapa (con un icono opcional)**: Un marcador de mapa en forma de lágrima estándar, con un icono temático opcional (‬disponible en la biblioteca de OpenDataSoft) ‬en el interior.

source: If you choose the **Icon** or the **Map marker (with an optional icon)** mode:
de: Wenn Sie als Modus **Icon** oder **Kartenmarkierung (mit einem optionalen Icon)** wählen:
es: Si elige el modo **Icono** o **Marcador de mapa (con un icono opcional)**:

source: In the **Shapes style** section below the **Market display** section, click on the **Icon** menu.
de: Klicken Sie auf das Menü **Icon**, im Bereich **Formstil**, unterhalb der Sektion **Marktanzeige**.
es: En la sección **Estilo de formas** ‬debajo de la sección **Visualización de marcador**,‭ ‬haga clic en el menú‭ **Icono**.

source: Choose the icon which will represent your data the best.
de: Wählen Sie das Icon, das Ihre Daten am besten repräsentiert.
es: Elija el icono que mejor representará los datos.

source: Click on the **Select icon** button.
de: Klicken Sie auf den Button **Icon auswählen**.
es: Haga clic en el botón **Seleccionar icono**.

source: **Shapes style**
de: **Formstil**
es: **Estilo de formas**

source: *Customize your markers and shapes*
de: *Passen Sie Ihre Markierungen und Formen an*
es: *Personalizar los marcadores y formas‭*

source: **Icon**: choose an icon for both the **Icon** and **Map marker (with an optional icon)** modes (see procedure above).
de: **Icon**: wählen Sie jeweils ein Icon für den Modus **Icon** und **Kartenmarkierung (mit einem optionalen Icon)** (Vorgehensweise siehe oben).
es: **Icono**: Elija un icono para los modos **Icono** ‬y **Marcador de mapa (con un icono opcional)** ‬(‬consulte el procedimiento anterior)‬.

source: **Size**: make your dots/icons larger or smaller.
de: **Größe**: Vergrößern/verkleinern Sie Ihre Punkte/Icons.
es: **Tamaño**:‭ ‬Amplíe o reduzca los puntos/iconos.

source: **Point opacity**: if your markers are dots or icons - add transparency to these markers.
de: **Punkt-Opazität**: wenn Ihre Markierungen Punkte oder Icons sind - diesen Markierungen Transparenz geben.
es: **‬Opacidad de punto**:‭ ‬Si los marcadores son puntos o iconos, añada transparencia a estos marcadores.

source: **Shape opacity**: if your data are represented as shapes instead of markers (dots or icons) - increase or decrease their transparency.
de: **Form-Opazität**: wenn Ihre Daten nicht als Markierungen (Punkte oder Icons), sondern als Formen dargestellt werden - ihre Transparenz erhöhen oder verringern.
es: **‬Opacidad de forma**:‭ ‬Si los datos están representados como formas en lugar de marcadores‭ (‬puntos o iconos), aumente o disminuya su transparencia.

source: **Line thickness**: if your data are represented as lines - increase or decrease their thickness.
de: **Liniendicke**: wenn Ihre Daten als Linien dargestellt werden - ihre Dicke erhöhen oder verringern.
es: **Grosor de línea**:‭ ‬Si los datos están representados como líneas‭, aumente o disminuya su grosor.

source: For all the options above, simply drag the dot along the slider or directly change the numbers displayed on the right of each slider.
de: Für alle oben beschriebenen Optionen bewegen Sie einfach den Punkt entlang dem Schieber oder bearbeiten Sie direkt die Zahlen rechts von jedem Schieber.
es: Para todas las opciones anteriores,‭ ‬simplemente arrastre el punto a lo largo del control deslizante o directamente cambie los números que se visualizan a la derecha de los controles deslizantes.

source: **Color**: change the color of your markers, shapes and lines.
de: **Farbe**: Ändern Sie die Farbe Ihrer Markierungen, Formen und Linien.
es: **‬Color‭**: Cambie el color de los marcadores,‭ ‬formas y líneas.

source: To change the color:
de: Um die Farbe zu ändern:
es: Para cambiar el color:

source: Click on the color menu.
de: Klicken Sie auf das Farbmenü.
es: Haga clic en el menú de color.

source: Choose the color you want from the Nice colors or with the Color picker.
de: Wählen Sie die gewünschte Farbe aus den Farbvorschlägen oder mit dem Farbwähler.
es: Elija el color que desee en Colores bonitos o con el Selector de color.

source: Click on the **Select color** button.
de: Klicken Sie auf den Button **Farbe wählen**.
es: Haga clic en el botón **‬Seleccionar color**.

source: **Shapes border**
de: **Formumrandung**
es: **Borde de formas**

source: *Customize the border of your markers and shapes*
de: *Passen Sie die Umrandung Ihrer Markierungen und Formen an*
es: *Personalizar el borde de los marcadores y formas‭*

source: Borders are only available for shapes, dots, icons and map markers do not have borders.
de: Umrandungen sind nur für Formen verfügbar, Punkte, Icons und Kartenmarkierungen haben keine Umrandungen.
es: Los bordes solo están disponibles para los puntos y formas; ‬los iconos y marcadores de mapa no tienen bordes.

source: **Pattern**: choose the pattern of the border, whether you want it to be a simple line, or a dashed or dotted line.
de: **Muster**: Wählen Sie das Muster für die Umrandung, sei es für eine einfache Linie, eine gestrichelte oder gepunktete Linie.
es: ‭**‬Patrón‭**‬: Elija el patrón del borde,‭ ‬si desea que sea una línea simple o una línea de puntos o guiones.

source: For the **Pattern** option, simply click on the provided menu and choose the one you want.
de: Für die **Muster**-Option, wählen Sie aus dem angebotenen Menü einfach die gewünschte aus.
es: Para la opción **‬Patrón‭**,‭ ‬haga clic en el menú suministrado y elija el que desee.

source: **Thickness**: make the border of your shapes thicker or thinner.
de: **Dicke**: machen Sie den Rahmen Ihrer Formen dicker oder dünner.
es: ‭**‬Grosor‭**‬:‭ ‬Aumente o disminuya el grosor del borde de las formas.

source: **Opacity**: increase or decrease the transparency of the border.
de: **Opazität**: Erhöhen oder verringern Sie die Transparenz der Umrahmung.
es: ‭**‬Opacidad**‬:‭ ‬Aumente o disminuya la transparencia del borde.

source: For the options above, simply drag the dot along the slider or directly change the numbers displayed on the right of each line.
de: Für die oben beschriebenen Optionen bewegen Sie einfach den Punkt entlang dem Schieber oder bearbeiten Sie direkt die Zahlen rechts von jeder Linie.
es: Para las opciones anteriores,‭ ‬simplemente arrastre el punto a lo largo del control deslizante o directamente cambie los números que se visualizan a la derecha de las líneas.

source: **Color**: change the color of the border.
de: **Farbe**: Ändern Sie die Farbe Ihrer Rahmen.
es: ‭**‬Color‭**‬:‭ ‬Cambie el color del borde.

source: Choose the color you want from the *Nice colors* or with the *Color picker*.
de: Wählen Sie die gewünschte Farbe aus den *Farbvorschlägen* oder mit dem *Farbwähler*.
es: Elija el color que desee en *Colores bonitos* o con el *Selector de color*.

source: Cluster
es: Clúster

source: The Cluster visualization mode groups your data into clusters instead of displaying them separately and individually. Clusters are grouped according to a chosen type of calculation: linear or logarithmic.
de: Der Cluster-Visualisierungsmodus gruppiert Ihre Daten in Cluster, anstatt sie separat und individuell anzuzeigen. Cluster werden entsprechend dem gewählten Berechnungstyp gruppiert: linear oder logarithmisch.
es: El modo de visualización Clúster agrupa los datos en clústeres en lugar de visualizarlos por separado, de manera individual.‭ ‬Los clústeres se agrupan en función de un tipo de cálculo seleccionado:‭ ‬lineal o logarítmico.

source: **Cluster style**
de: **Cluster-Stil**
es: ‭**‬Estilo de clúster**

source: *What your cluster will look like on the map*
de: *Wie Ihr Cluster auf der Karte angezeigt wird*
es: *Aspecto del clúster en el mapa‭*

source: **Min size**: choose the size of the smallest clusters.
de: *Mindestgröße**: wählen Sie die Größe der kleinsten Cluster.
es: **Tamaño mín.**: Elija el tamaño de los clústeres más pequeños.

source: **Max size**: choose the size of the biggest clusters.
de: *Maximalgröße**: wählen Sie die Größe der größten Cluster.
es: **Tamaño máx.**: Elija el tamaño de los clústeres más grandes.

source: **Opacity**: increase or decrease the transparency of your clusters.
de: **Opazität**: Erhöhen oder verringern Sie die Transparenz Ihrer Cluster.
es: ‭**‬Opacidad**‬:‭ ‬Aumente o disminuya la transparencia de los clústeres.

source: **Cluster border**
de: **Cluster-Rahmen**
es: ‭**‬Borde de clúster**

source: *Customize the border of your clusters*
de: *Passen Sie die Umrandung Ihrer Cluster an*
es: *Personalizar el borde de los clústeres‭*

source: **Thickness**: make the border of your clusters more or less thick.
de: **Dicke**: machen Sie den Rahmen Ihrer Cluster dicker oder dünner.
es: **Grosor**:‭ ‬Aumente o disminuya el grosor del borde de los clústeres.

source: **Opacity**: add transparency to the border.
de: **Opazität**: fügen Sie den Rahmen Transparenz hinzu.
es: ‭**‬Opacidad**‬:‭ ‬Añada transparencia al borde.

source: For the options above, simply drag the dot along the slider or directly change the numbers displayed on the right of each slider.
de: Für die oben beschriebenen Optionen bewegen Sie einfach den Punkt entlang dem Schieber oder bearbeiten Sie direkt die Zahlen rechts von jedem Schieber.
es: Para las opciones anteriores,‭ ‬simplemente arrastre el punto a lo largo del control deslizante o directamente cambie los números que se visualizan a la derecha de los controles deslizantes.

source: **Aggregation operations**
de: **Aggregationsoperationen**
es: ‭**‬Operaciones de agregación**

source: *Choose the base operation for your clusters*
de: *Wählen Sie die Basisoperation für Ihre Cluster*
es: *Elegir la operación de base para los clústeres‭*

source: Choose, out of the available operations, which one you want your clusters to be based on. The result value will be displayed inside the cluster.
de: Wählen Sie aus den verfügbaren Operationen, auf welcher Ihre Cluster basieren sollen. Der Wert des Ergebnisses wird innerhalb des Clusters angezeigt.
es: De entre las operaciones disponibles, elija en cuál desea que se basen los clústeres.‭ ‬El valor del resultado se visualizará dentro del clúster.

source: **Count**: how many markers are in the area.
de: **Zählung**: Anzahl der Markierungen im Gebiet.
es: ‭**‬Recuento**‬:‭ ‬El número de marcadores que hay en el área.

source: **Average**: the average of a selected field from the dataset.
de: **Durchschnitt**: der Durchschnitt eines ausgewählten Feldes des Datensatzes.
es: ‭**‬Promedio**‬:‭ ‬El promedio de un campo seleccionado del conjunto de datos.

source: **Sum**: the total of a selected field from the dataset.
de: **Summe**: die Summe eines ausgewählten Feldes des Datensatzes.
es: ‭**‬Suma**‬:‭ ‬El total de un campo seleccionado del conjunto de datos.

source: **Minimum**: the minimum of a selected field from the dataset.
de: **Minimum**: das Minimum eines ausgewählten Feldes des Datensatzes.
es: ‭**‬Mínimo**‬:‭ ‬El mínimo de un campo seleccionado del conjunto de datos.

source: **Maximum**: the maximum of a selected field from the dataset.
de: **Maximum**: das Maximum eines ausgewählten Feldes des Datensatzes.
es: ‭**‬Máximo**‬:‭ ‬El máximo de un campo seleccionado del conjunto de datos.

source: **Standard deviation**: the standard deviation of a selected field from the dataset, to indicate whether the values are close to the average or not.
de: **Standardabweichung**: die Standardabweichung eines ausgewählten Feldes des Datensatzes, um anzuzeigen, ob die Werte nahe am Durchschnitt liegen oder nicht.
es: ‭**‬Desviación estándar**‬:‭ ‬La desviación estándar de un campo seleccionado del conjunto de datos, para indicar si los valores se acercan al promedio o no.

source: **Computing**
de: **Berechnung**
es: **Cálculo**

source: *Choose how the clusters size is calculated*
de: *Wählen Sie aus, wie die Clustergröße berechnet wird*
es: *Elegir cómo se calcula el tamaño de los clústeres*

source: **Linear**: for your values ranges to be the same size, evenly spread from the minimum to the maximum (e.g. 1, 2, 3, 4).
de: **Linear**: für gleichmäßig zwischen Minimum und Maximum verteilte Werte (z. B. 1, 2, 3, 4).
es: **Lineal**: Para que los rangos de valores tengan el mismo tamaño, distribuidos uniformemente del mínimo al máximo (p. ej. 1, 2, 3, 4).

source: **Logarithmic**: for your values to vary in size and spread from a very large spectrum (e.g. 1, 10, 100).
de: **Logarithmisch**: für Werte, deren Größe und Verteilung in einem großen Spektrum variieren (z. B. 1, 10, 100).
es: **Logarítmico**: Para que los valores varíen de tamaño y se distribuyan en un espectro muy amplio (p. ej. 1, 10, 100).

source: Choropleth
de: Choroplethen
es: Gráfico cloropético

source: The Choropleth visualization mode displays data as markers (dots or icons) or as shapes. It also enhances the visualization with colors. The markers and/or shapes are colored according to a color scheme, defined by a values range based on a chosen variable. The Choropleth mode allows the creation of a thematic layer.
de: Die Choroplethen-Visualisierungsmethode zeigt Daten als Markierungen (Punkte oder Icons) oder als Formen an. Sie verstärkt auch die farbliche Visualisierung. Die Markierungen und/oder Formen sind nach einem Farbschema gefärbt, das von einem Wertebereich basierend auf einer bestimmten Variable definiert wird. Der Choroplethen-Modus ermöglicht die Erstellung einer thematischen Ebene.
es: El modo de visualización Gráfico cloropético visualiza los datos como marcadores‭ (‬puntos o iconos) ‬o formas.‭ ‬También mejora la visualización con colores.‭ ‬El color de los marcadores y/o formas según una combinación de colores está definido por un rango de valores basado en una variable seleccionada. El modo Gráfico cloropético permite crear una capa temática.

source: *Customize your dots and shapes*
de: *Passen Sie Ihre Punkte und Formen an*
es: ‭*‬Personalizar los puntos y formas‭*

source: **Palette**: define on which field and operation your choropleth layer will be based on, and the color of your markers, shapes and/or lines.
de: **Palette**: definieren Sie, auf welchem Feld und welcher Operation Ihre Choroplethenebene basieren soll, sowie die Farbe Ihrer Markierungen, Formen und/oder Linien.
es: **Paleta**: Defina en qué campo y operación se basará la capa cloropética, así como el color de los marcadores,‭ ‬formas y/o líneas.

source: Choose whether you want to base the color of your shape on the **Value of a field** or on the **Aggregation on a field**.
de: Wählen Sie aus, ob die Farbe Ihrer Form auf dem **Wert eines Feldes** oder der **Aggregation auf einem Feld** basieren soll.
es: Elija si desea basar el color de la forma en el **Valor de un campo‭** o en la **Agregación en un campo**.
