Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/map2/create-a-multiple-layers-map.po
Languages: de, es

source: Depending on the choice you just made for your shape’s color, choose the field which value you want to use, or decide which aggregation operation you want to apply on your chosen field.
de: Je nach der Entscheidung, die Sie gerade für die Farbe Ihrer Form getroffen haben, wählen Sie das zu verwendende Feld aus oder entscheiden Sie, welche Aggregationsoperation Sie auf das ausgewählte Feld anwenden wollen.
es: Según la opción que haya seleccionado para el color de la forma,‭ ‬elija el campo cuyo valor desee utilizar o decida qué operación de agregación desea aplicar en el campo seleccionado.

source: Define the **Values range**.
de: Definieren Sie den **Wertebereich**.
es: Defina el **Rango de valores**.

source: Define the number of **Tiers**, meaning in how many categories your values range will be divided.
de: Definieren Sie die Anzahl der **Stufen**, also die Zahl der Kategorien, in die Ihr Wertebereich aufgeteilt wird.
es: Defina el número de‭ **Niveles‭**, es decir, en cuántas categorías se dividirá el rango de valores.

source: Choose a **computing mode**: **linear** (for your values ranges to be the same size, evenly spread from the minimum to the maximum), **logarithmic** (for your values to vary in size and spread from a very large spectrum) or **custom**.
de: Wählen Sie einen **Berechnungsmodus**: **linear** (für gleichmäßig zwischen Minimum und Maximum verteilte Werte), **logarithmisch (für Werte, deren Größe und Verteilung in einem großen Spektrum variieren) oder **benutzerdefiniert**.
es: Elija un **Modo de cálculo**:‭ **Lineal‭** (‬para que los rangos de valores tengan el mismo tamaño,‭ ‬distribuidos uniformemente del mínimo al máximo)‬,‭ **Logarítmico‭** (‬para que los valores varíen de tamaño y se distribuyan en un espectro muy amplio‭) ‬o **Personalizado**.

source: Choose the **colors range** by clicking the colors menu and selecting your colors.
de: Wählen Sie die **Farbpalette** aus, indem Sie auf das Farbmenü klicken und die Farben selektieren.
es: Elija la **Gama de colores** ‬haciendo clic en el menú de colores y seleccionando los colores.

source: Choose a **gradient type** (RGB, Lab, HSL or Lch), meaning a way to calculate the color gradient between the 2 colors you just chose.
de: Wählen Sie einen**Farbverlaufstyp** aus (RGB, Lab, HSL oder Lch), also eine Methode, um den Verlauf zwischen den beiden Farben, die Sie gerade ausgewählt haben, zu berechnen.
es: Elija un **Tipo de degradado** (RGB, Lab, HSL o Lch), es decir, una manera de calcular el degradado entre los 2 colores seleccionados.

source: *Customize the border of your shapes*
de: *Die Rahmen Ihrer Formen anpassen*
es: *‬Personalizar el borde de las formas‭*

source: Borders are only available for dots and shapes, icons and map markers do not have borders.
de: Umrandungen sind nur für Formen verfügbar, Icons und Kartenmarkierungen haben keine Umrandungen.
es: Los bordes solo están disponibles para los puntos y formas; ‬los iconos y marcadores de mapa no tienen bordes.

source: Color by category
de: Farbe nach Kategorie
es: Color por categoría

source: The Color by category visualization mode displays data as markers (dots or icons) or as shapes. It also enhances the visualization with colors. The markers and/or shapes are colored according to a color scheme based on defined categories - which can be numerical or not, just defined by a certain word. The Color by category mode allows the creation of a categorized layer.
de: Die Visualisierungsmethode Farbe nach Kategorie zeigt Daten als Markierungen (Punkte oder Icons) oder als Formen an. Sie verstärkt auch die farbliche Visualisierung. Die Markierungen und/oder Formen sind nach einem Farbschema gefärbt, das auf definierten Kategorien basiert - diese können numerisch oder durch ein bestimmtes Wort definiert sein. Der Modus Farbe pro Kategorie ermöglicht die Erstellung einer kategorisierten Ebene.
es: El modo de visualización Color por categoría visualiza los datos como marcadores‭ (‬puntos o iconos) ‬o formas.‭ ‬También mejora la visualización con colores.‭ ‬El color de los marcadores y/o formas según una combinación de colores está definido por categorías que pueden ser numéricas o no, definidas solo por una palabra determinada. El modo Color por categoría permite crear una capa categorizada.

source: **Palette**: choose whether you want:
de: **Palette**: Wählen Sie aus, was Sie wollen:
es: **Paleta**: Elija si desea:

source: to create a **Custom palette based on a field’s value**
de: Um eine **Benutzerdefinierte Palette basierend auf einem Feldwert** zu erstellen
es: Crear una **‬Paleta personalizada basada en valores de un campo**

source: Click the Brush icon to access the custom palette interface.
de: Klicken Sie auf das Pinsel-Icon, um auf die benutzerdefinierte Palette zuzugreifen.
es: Haga clic en el icono de pincel para acceder a la interfaz de paleta personalizada.

source: Choose the field you want to categories to be based on.
de: Wählen Sie das Feld aus, auf dem die Kategorien basieren sollen.
es: Elija el campo en que desee que se basen las categorías.

source: Choose whether or not you want to enable the creation of an additional category.
de: Wählen Sie aus, ob Sie die Erstellung einer zusätzlichen Kategorie zulassen wollen oder nicht.
es: Elija si desea o no habilitar la creación de una categoría adicional.

source: Choose a color for each category.
de: Wählen Sie eine Farbe für jede Kategorie.
es: Elija un color para cada una de las categorías.

source: Click the **Apply** button.
de: Klicken Sie auf den Button **Anwenden**.
es: Haga clic en el botón **‬Aplicar**.

source: a palette **Generated with colors contained in a field** (in case your dataset already contains a field which provides color information: an hexadecimal color code for instance).
de: eine Palette **generiert aus den in einem Feld enthaltenen Farben** (sofern Ihr Datensatz bereits ein Feld mit Farbinformationen enthält, zum Beispiel einen hexadezimalen Farbcode).
es: Una paleta‭ de tipo **‬Generado con colores incluidos en un campo** (‬si el conjunto de datos ya contiene un campo que facilita información de color:‭ ‬por ejemplo, un código de color hexadecimal).

source: In that case, simply choose the right field and the colors will automatically appear on the corresponding markers and/or dots of your map.
de: In diesem Fall wählen Sie einfach das betreffende Feld aus und die Farben werden automatischen für die entsprechenden Markierungen und/oder Punkte auf Ihrer Karte übernommen.
es: En ese caso, tan solo debe elegir el campo apropiado y automáticamente aparecerán los colores en los marcadores y/o puntos del mapa correspondientes.

source: Heatmap
es: Mapa de situación

source: The Heatmap visualization mode is not about markers or shapes. Instead, this mode groups data and displays them as a span of colors to show the differences of intensity of one variable but at different spots in the map.
de: Der Visualisierungsmodus als Heatmap hat nichts mit Markierungen oder Formen zu tun; dieser Modus gruppiert Daten und zeigt sie als Farbbereiche an, um Unterschiede der Intensität einer Variable an unterschiedlichen Punkten der Karte anzuzeigen.
es: El modo de visualización Mapa de situación no emplea marcadores o formas.‭ ‬Este modo agrupa los datos y los visualiza como una extensión de colores a fin de mostrar las diferencias de intensidad de una variable pero en diferentes lugares del mapa.

source: *Choose on what operation your heatmap is based*
de: *Wählen Sie aus, auf welcher Operation Ihre Heatmap basiert*
es: *Elegir en qué operación se basa el mapa de situación*

source: Choose, out of the available operations depending on your dataset, which one you want your heatmap to be based on.
de: Wählen Sie aus den auf Ihrem Datensatz beruhenden Operationen jene aus, auf der die Heatmap basieren soll.
es: De entre las operaciones disponibles en función del conjunto de datos,‭ ‬elija en cuál desea que se base el mapa de situación.

source: *Choose how is calculated the progression of your heatmap*
de: *Wählen Sie aus, wie die Sequenzierung Ihrer Heatmap berechnet werden soll*
es: ‭*‬Elegir cómo se calcula la progresión del mapa de situación*

source: **Colors**
de: **Farben**
es: **Colores‭**

source: *Choose the color palette of your heatmap*
de: *Wählen Sie die Farbpalette für Ihre Heatmap aus*
es: *Elegir la paleta de colores del mapa de situación*

source: Click on the **Edit palette** button.
de: Klicken Sie auf den Button **Palette bearbeiten**
es: Haga clic en el botón **‬Editar paleta‭**.

source: Choose your 5 colors.
de: Wählen Sie Ihre 5 Farben aus.
es: Elija 5 colores.

source: Click on the **Apply** button.
de: Klicken Sie auf den Button **Anwenden**.
es: Haga clic en el botón **‬Aplicar**.

source: Add and edit information
de: Informationen hinzufügen und bearbeiten
es: Añadir y editar información

source: Click the **Information** tab.
de: Klicken Sie auf den Tab **Informationen**.
es: Haga clic en la ficha **‬Información**.

source: Title and description
de: Titel und Beschreibung
es: Título y descripción

source: Rename your layer in the **Title** area, to make it clearer for the map viewers.
de: Benennen Sie Ihre Ebene im Bereich **Titel** um, damit sie für Ihre Kartenbenutzer klarer definiert ist.
es: Cambie el nombre de la capa en el área **‬Título**, para que sea más claro para quienes visualicen el mapa.

source: Add a **Description** in the provided area.
de: Fügen Sie im entsprechenden Bereich eine **Beschreibung** hinzu.
es: Añada una **‬Descripción** ‬en el área facilitada.

source: If you do not add your own description, it is the default one that will be displayed.
de: Wenn Sie keine eigene Beschreibung hinzufügen, wird die standardmäßige angezeigt.
es: Si no añade su propia descripción, se visualizará la predeterminada.

source: Icon
es: Icono

source: You can add an icon to your layer, which will be displayed next to the layer’s title.
de: Sie können Ihrer Ebene ein Icon hinzufügen, das neben dem Titel der Ebene angezeigt wird.
es: Puede añadir un icono a la capa,‭ ‬que se visualizará junto al título de la capa.

source: Click on the **Icon** drop-down menu to choose the icon that represents your layer the best.
de: Klicken Sie auf das Dropdown-Menü **Icon**, um dasjenige auszuwählen, das Ihre Ebene am besten repräsentiert.
es: Haga clic en el menú desplegable **‬Icono** ‬para elegir el icono que mejor represente la capa.

source: Click on the **Color** menu to add a color to the layer’s icon.
de: Klicken Sie auf das Menü **Farbe**, um dem Icon der Ebene eine Farbe hinzuzufügen.
es: Haga clic en el menú **‬Color‭** ‬para añadir un color al icono de la capa.

source: Add and edit a caption
de: Beschriftung hinzufügen und bearbeiten
es: Añadir y editar una leyenda

source: Captions are not mandatory however they are recommended because they add more information to your dataset, which means more clarity to the reading of your map.
de: Beschriftungen sind nicht obligatorisch, werden aber empfohlen, da sie Ihrem Datensatz zusätzliche Informationen hinzufügen, was für mehr Klarheit für die Betrachter der Karte sorgt.
es: Las leyendas no son obligatorias, aunque sí son recomendables dado que añaden más información al conjunto de datos,‭ ‬lo que facilita la comprensión del mapa.

source: Click on the **Caption** tab.
de: Klicken Sie auf den Tab **Beschriftung**.
es: Haga clic en la ficha **‬Leyenda**.

source: If it’s not already the case, tick the **Display caption for this dataset** option.
de: Kreuzen Sie **Beschriftung für diesen Datensatz anzeigen** an, falls es noch nicht der Fall ist.
es: Si no está seleccionada, marque la opción **‬Mostrar leyenda de este conjunto de datos**.

source: Captions are activated by default. If you do not want to display a caption for your dataset, simply untick the **Display caption for this dataset** option.
de: Standardmäßig sind Beschriftungen aktiviert. Falls Sie für einen Datensatz die Beschriftung nicht anzeigen wollen, wählen Sie die Option **Beschriftung für diesen Datensatz anzeigen** einfach ab.
es: Las leyendas están activas de forma predeterminada.‭ ‬Si no desea que se visualice una leyenda para el conjunto de datos,‭ ‬tan solo debe desmarcar la opción **‬Mostrar leyenda de este conjunto de datos**.

source: In the provided area, write a **Title** for your layer’s caption.
de: Notieren Sie an der vorgesehenen Stelle einen **Titel** für die Beschriftung der Ebene.
es: En el área facilitada,‭ ‬escriba un **‬Título** ‬para la leyenda de la capa.

source: Delete a layer
de: Eine Ebene löschen
es: Suprimir una capa

source: Click on the |icon-trash| icon.
de: Klicken Sie auf das Icon |icon-trash|.
es: Haga clic en el icono |icon-trash|.

source: Click on the red **Remove dataset from the map** button.
de: Klicken Sie auf den roten Button **Datensatz von der Karte entfernen**.
es: Haga clic en el botón **‬Eliminar conjunto de datos del mapa** rojo.
