Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/explore/geographic_search.po
Languages: fr

source: Geographic search for datasets
fr: Rechercher des jeux de données sur critères géographiques

source: Datasets are often closely related to a geographic area, be it a country, a city, a district, etc. OpenDataSoft allows you to associate a geographic area to a dataset so that your users can filter the catalog by delimiting an area on a map.
fr: Les jeux de données sont fréquemment liés à un territoire, qu'il s'agisse d'un pays, d'une ville, d'un quartier, etc... OpenDataSoft vous permet d'associer une zone géographique à un jeu de données, ce qui permet par la suite à vos utilisateur de filtrer les jeux de données de votre catalogue sur des critères géographiques, en dessinant la zone qui les intéresse sur une carte..

source: Specifying a geographic area on a dataset
fr: Spécifier la zone géographique de vos jeux de données.

source: You can specify a geographic area in 3 different ways.
fr: Vous pouvez spécifier une zone géographique pour un jeu de données de 3 manières :

source: If your data contain geographic points, the platform can compute the geographic envelope (the convex-hull) of all records,
fr: Si votre jeu de données contient des points géographique, la plateforme peut calculer automatique l'enveloppe géographique de l'ensemble de ces points,

source: You can draw the area on a map,
fr: Vous pouvez dessiner la zone sur une carte,

source: If you already have the shape of the geographic area available in GeoJSON, you can simply paste the shape.
fr: Et si vous disposez de la zone géographique sous format GeoJSON, vous pouvez tout simplement la copier/coller.

source: The options for defining the geographic area
fr: Les options de définition de zone géographique.

source: You'll be able to define the geographic area in the *information* tab of dataset's publish page, alongside all the other metadata for the dataset.
fr: Vous pourrez définir cette zone géographique avec toutes les autres métadonnées, dans l'onglet *informations* de la page de publication de chacun de vos jeux de données.

source: Searching for datasets through their related geographic area
fr: Rechercher un jeu de données sur critères géographiques

source: You'll have to activate the *Display map on catalog page for geographic search* option within your portal's *explore* settings.
fr: Vous devrez activer l'option *Afficher sur la page de catalogue une carte permettant la recherche géographique de jeux de données* dans les paramètres de votre portail (section *Explorer*).

source: Once you have activated the feature on your portal and have defined geographic areas on at least one dataset, you will see a map show up below the search box in the filters' column.
fr: Une fois la fonctionnalité activée, et dès que vous aurez définit une zone géographique sur au moins l'un de vos jeu de données, une carte apparaitra sous le champ de recherche textuelle dans la colonne de filtres sur la page de catalogue.

source: The mini-map used for filtering on the catalog page.
fr: La mini-carte permettant le filtrage sur la page catalogue.

source: You can now draw a square area on the mini-map. This will filter the catalog and only show datasets which have a geographic area intersecting the drawn area. As a result, datasets without any geographic area set won't be listed.
fr: Vous pouvez maintenant délimiter sur cette carte une zone qui filtrera les jeux de données. Seuls les jeux de données dont la zone géographique chevauche celle que vous avez dessinée apparaitront.
