Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/explore/getting_started.po
Languages: fr

source: Visualizing Datasets
fr: Explorer et Visualiser des Jeux de Données

source: OpenDataSoft lets you explore datasets content with a rich search based experience. It also makes it possible to visualize datasets content on charts and maps.
fr: OpenDataSoft vous permet d'explorer le contenu des jeux de données grâce à une expérience de recherche riche. Il est aussi possible de visualiser les données sur des graphiques ou des cartes.

source: Displaying dataset content on a map
fr: Cartographier le contenu d'un jeu de données

source: This can be achieved simply by switching to the *map tab* in the dataset explore console. For that tab to be available, your dataset must contain a *geo point* or a *geo shape* field.
fr: Il est possible de cartographier les données simplement en passant à *l'onglet Carte* sur la console explore du jeu de données. Pour que l'onglet soit disponible il faut que le jeu de données contienne un champ avec le type *geo point* ou *geo shape*.

source: OpenDataSoft is compliant with Esri software!
fr: OpenDataSoft est compatible avec la suite logicielle Esri !

source: Esri is the worldwide leader in Geographic Information Systems (GIS).
fr: Esri est le leader mondial dans le domaine des SIG (Système d'Information Géographique).

source: Any OpenDataSoft customer can easily publish their Esri data and display geolocated information on Esri basemaps directly with the OpenDataSoft platform.
fr: Les clients OpenDataSoft peuvent facilement via la plateforme publier leurs données issues d'Esri et afficher des données géolocalisées sur un fond de carte Esri.

source: Displaying dataset content on a chart
fr: Analyser le contenu d'un jeu de données avec des graphiques

source: This can be achieved by switching to the *analysis tab* in the dataset explore console. For that tab to be available, your dataset must contain facets or date(time) fields.
fr: Il est possible de visualiser les données sur un graphique en passant à *l'onglet Analyse* sur la console explore du jeu de données. Pour que l'onglet soit disponible il faut que le jeu de données contienne une (ou plusieurs) facette(s) ou un champ avec le type *date(time)*.

source: Building advanced geo mashups
fr: Construire des cartes complexes

source: **Cartograph** lets you build advanced geo mashups, combining various datasets on the same map and finely tuning their representation. Cartograph can either be accessed from the main menu links (if they have been configured by the domain administrator) or from its direct URL: *http://mydomain.opendatasoft.com/map*.
fr: Le **Cartographe** permet de construire des cartes plus complexes en combinant plusieurs jeux de données sur la même carte et en personnalisant leurs représentations. On peut accéder au Cartographe depuis le menu principal (sauf s'il a été configuré différement par l'administrateur du domaine) ou depuis l'URL directe : *http://mondomaine.opendatasoft.com/map*.

source: Building advanced charts
fr: Construire des graphiques complexes

source: **ChartBuilder** lets you build advanced charts, combining on the same chart various datasets. ChartBuilder only supports time series representation for now. It can be accessed either from the menu links (if they have been configured by the domain administrator) or from its direct URL: *http://mydomain.opendatasoft.com/chart*.
fr: L'outil **Graphe** permet de construire des graphiques plus complexes en combinant plusieurs jeux de données sur le même graphique. Pour le moment l'outil ne supporte que les séries temporelles. On peut accéder à l'outil Graphe depuis le menu principal (sauf s'il a été configuré différement par l'administrateur du domaine) ou depuis l'URL directe : *http://mondomaine.opendatasoft.com/chart*.

source: Reusing a visualization
fr: Réutiliser une visualisation

source: Any visualization built with OpenDataSoft can easily be reused as is.
fr: Toutes les visualisations faites avec OpenDataSoft peuvent être facilement réutilisées telles quelles.

source: The above widget, which is made available within any of the data visualization authoring tools, let's you share a visualization in various ways:
fr: Le widget ci-dessus, qui est disponible avec chaque outil de visualisation de données, vous permet de partager une visualisation de différente façons :

source: As a *Share* link, to share a direct access to the visualization
fr: Un lien *Partager*, pour partager un accès direct à la visualisation

source: As an *Embed* code, to embed the visualization in an iframe on a remote web site
fr: Un lien *Intégrer*, pour intégrer la visualisation dans un iframe sur un autre site

source: As a *Widget* code, to integrate the visualization as a widget in a content page using the OpenDataSoft ods-widgets framework
fr: Un bout de code *Widget*, pour intégrer la visualisation sous forme de widget dans une page de contenu en utilisant le framework d'OpenDataSoft ods-widget

source: Saving a visualization
fr: Sauvegarder une visualisation

source: Cartograph and ChartBuilder based data visualizations can be saved. The save option is only available to users with an account on the domain.
fr: Les visualisations créées grâce au Cartographe et à l'outil Graphe peuvent être sauvegardées. L'option de sauvegarde n'est accessible qu'aux utilisateurs ayant un compte sur le domaine.

source: Saved visualizations can be accessed from the user profile (top menu link).
fr: On peut accéder aux visualisations sauvées depuis le profil utilisateur (lien dans le menu en haut).
