Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/commenting_via_disqus.po
Languages: de, es, fr, nl

source: Commenting via Disqus
de: Kommentieren über Disqus
es: Comentar por medio de Disqus
fr: Commenter via Disqus
nl: Becommentariëren via Disqus

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Since Disqus is an optional feature, it is not activated on every Opendatasoft portal. The activation of Disqus depends entirely on the portal administrators.
de: Disqus ist eine optionale Funktion. Deshalb ist sie nicht auf jedem Opendatasoft-Portal aktiviert. Für die Aktivierung von Disqus sind allein die Administratoren des jeweiligen Portals verantwortlich.
es: Como Disqus es una función opcional, no está activada en todos los portales Opendatasoft. La activación de Disqus depende totalmente de los administradores del portal.
fr: La fonctionnalité Disqus étant optionnelle, elle n'est pas activée sur tous les portails Opendatasoft. Le choix de l'activer ou non revient aux administrateurs du portail.
nl: Aangezien Disqus een optionele functie is, is ze niet geactiveerd op elk Opendatasoft-portaal. Het activeren van Disqus hangt volledig af van de portaalbeheerders.

source: Disqus is a service that can be integrated into an Opendatasoft portal. It allows users to post comments in order to share ideas, opinions or to ask questions about a dataset. It is also possible to answer another user's comment.
de: Disqus ist ein Dienst, der in ein Opendatasoft-Portal integriert werden kann. Er ermöglicht Nutzern, Kommentare zu posten, um Ideen, Meinungen oder Fragen zu einem Datensatz auszutauschen. Außerdem kann auf die Kommentare anderer Benutzer reagiert werden.
fr: Disqus est un service pouvant être intégré dans un portail Opendatasoft. Son objectif est de permettre aux utilisateurs de publier des commentaires pour partager des idées, des avis ou encore poser des questions sur un jeu de données. Il permet également de répondre aux commentaires d'un autre utilisateur.

source: To comment on a dataset, or reply to someone's comment:
de: Um einen Datensatz zu kommentieren oder auf einen Kommentar zu antworten:
fr: Pour laisser un commentaire sur un jeu de données ou répondre aux commentaires d'un autre utilisateur :

source: Go to the Comments tab of the chosen dataset.
de: Öffnen Sie die Registerkarte "Kommentare" des entsprechenden Datensatzes.
es: Vaya a la ficha Comentarios del conjunto de datos seleccionado.
fr: Accédez à l'onglet Commentaires du jeu de données choisi.
nl: Ga naar de tab Commentaren van de gekozen dataset.

source: (optional) If you are not authenticated on Disqus yet, choose an authentication option (through Disqus, Facebook, Google etc. or by creating a whole new Disqus account).
de: (optional) Wenn Sie noch nicht bei Disqus authentifiziert sind, wählen Sie eine Authentifizierungsoption (über Disqus, Facebook, Google usw. oder durch Erstellen eines neuen Disqus-Kontos).
fr: (optionnel) Si vous n'êtes pas encore authentifié sur Disqus, sélectionnez une option d'authentification (via Disqus, Facebook, Google, etc. ou en créant un nouveau compte Disqus).

source: Either write a message in the "Start a discussion" texbox, or click on "Reply" under an existing comment to "Join the discussion".
de: Schreiben Sie eine Nachricht in das Textfeld "Eine Diskussion beginnen" oder klicken Sie unter einem vorhandenen Kommentar auf "Antworten", um der Diskussion beizutreten.
fr: Saisissez un message dans la zone de texte "Commencer une discussion" ou cliquez sur "Répondre" sous un commentaire existant pour rejoindre la discussion.

source: Once the comment is fully written, click on the "Post as [Username]" button below the comment textbox.
de: Sobald Sie den Kommentar komplett geschrieben haben, klicken Sie auf den Button "Als [Benutzername] posten" unter dem Textfeld.
es: Cuando haya terminar de escribir el comentario, haga clic en el botón "Publicar como [nombre de usuario]" debajo del cuadro de texto de comentario.
fr: Une fois le commentaire rédigé, cliquez sur le bouton "Publier en tant que [Nom d'utilisateur]" sous la zone de texte du commentaire.
nl: Eenmaal de commentaar volledig is geschreven, klikt u op knop "Plaatsen als [Gebruikersnaam]" onderaan het commentaartekstvak.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Disqus also allows sharing of comments or whole discussions through social networks.
de: Disqus ermöglicht auch den Austausch von Kommentaren oder ganzen Diskussionen über soziale Netzwerke.
fr: Disqus permet aussi de partager des commentaires ou des discussions entières via les réseaux sociaux.

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: Disqus comments are moderated by the portal administrators, that can be recognized by the "MOD" inscription next to their Disqus username. They have the right and possibility to delete comments, as well as to ban users.
de: Disqus-Kommentare werden von den Administratoren des Portals moderiert. Diese sind an der Kennzeichnung "MOD" neben ihrem Disqus-Benutzernamen zu erkennen. Sie haben das Recht und die Möglichkeit, Kommentare zu löschen und Benutzer zu sperren.
fr: Les administrateurs du portail modèrent les commentaires sur Disqus. L'inscription "MOD" en regard de leur nom d'utilisateur Disqus permet de les identifier. Ils ont le droit et la possibilité de supprimer des commentaires, mais également de bannir des utilisateurs.

source: Disqus is a service that can be integrated into an Opendatasoft portal. It allows users to post comments in order to share ideas, opinions, or to ask questions about a dataset. It is also possible to answer another user's comment.
es: Disqus es un servicio que se puede integrar en un portal Opendatasoft. Permite a los usuarios publicar comentarios para compartir ideas y opiniones o formular preguntas en relación con un conjunto de datos. También permite responder a los comentarios de otros usuarios.
nl: Disqus is een service die in een Opendatasoft-portaal kan worden geïntegreerd. Hiermee kunnen gebruikers commentaren plaatsen om ideeën of meningen te delen of om vragen te stellen over een dataset. Het is ook mogelijk om commentaren van andere gebruikers te beantwoorden.

source: To comment on a dataset or reply to someone's comment:
es: Para comentar un conjunto de datos o responder al comentario de alguien:
nl: Om commentaar te geven op een dataset of om op de commentaar van iemand anders te reageren:

source: (optional) If you are not authenticated on Disqus yet, choose an authentication option (through Disqus, Facebook, Google, etc., or by creating a whole new Disqus account).
es: (Opcional) Si aún no se ha autenticado en Disqus, elija una opción de autenticación (mediante Disqus, Facebook, Google etc. o creando una cuenta Disqus totalmente nueva).
nl: (optioneel) Indien u nog niet op Disqus geïdentificeerd bent, kies een identificatieoptie (via Disqus, Facebook, Google, enz. of door het aanmaken van een volledig nieuw Disqus-account).

source: Either write a message in the "Start a discussion" textbox, or click on "Reply" under an existing comment to "Join the discussion".
es: Escriba un mensaje en el cuadro de texto "Iniciar una discusión" o haga clic en "Responder" bajo un comentario existente para "Unirse a la discusión".
nl: Ofwel schrijft u een bericht in het tekstvak "Een gesprek starten" ofwel klikt u op "Antwoorden" op een bestaande commentaar om "Mee te doen met het gesprek".

source: Disqus also allows the sharing of comments or whole discussions through social networks.
es: Disqus también permite compartir comentarios o discusiones enteras en las redes sociales.
nl: Disqus laat ook toe om commentaren of volledige gesprekken te delen via sociale netwerken.

source: Disqus comments are moderated by the portal administrators, which can be recognized by the "MOD" inscription next to their Disqus username. They have the right and possibility to delete comments, as well as to ban users.
es: Los comentarios de Disqus están moderados por los administradores del portal, identificados con la inscripción "MOD" junto al nombre de usuario de Disqus. Estos tienen la facultad y la posibilidad de suprimir comentarios y bloquear a usuarios.
nl: Commentaren in Disqus worden gemodereerd door de portaalbeheerders die herkenbaar zijn aan de vermelding "MOD" naast hun Disqus-gebruikersnaam. Ze hebben het recht en de mogelijkheid om commentaren te verwijderen, alsook om gebruikers te bannen.
