Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/discovering_submitting_reuses.po
Languages: de, es, fr, nl

source: Discovering & submitting data reuses
de: Daten-Weiterverwendungen entdecken und einreichen
es: Descubrir y enviar reutilizaciones de datos
fr: Découvrir des réutilisations de données et en envoyer
nl: Hergebruiken van data ontdekken & indienen

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Since reuses are an optional feature, they are not activated on every Opendatasoft portal. The activation of reuses depends entirely on the portal administrators.
de: Weiterverwendungen sind eine optionale Funktion. Deshalb sind sie nicht auf jedem Opendatasoft-Portal aktiviert. Für die Aktivierung der Weiterverwendungen sind allein die Administratoren des jeweiligen Portals verantwortlich.
es: Como las reutilizaciones son una función opcional, no están activadas en todos los portales Opendatasoft. La activación de las reutilizaciones depende totalmente de los administradores del portal.
fr: Les réutilisations étant optionnelles, elles ne sont pas activées sur tous les portails Opendatasoft. Le choix d'activer ou non les réutilisations revient aux administrateurs du portail.
nl: Aangezien hergebruiken een optionele functie is, kunnen ze niet op elk Opendatasoft-portaal worden geactiveerd. Het activeren van hergebruiken hangt volledig af van de portaalbeheerders.

source: Data reuses are creations based on data from datasets published on an open data portal. They can take many forms: from the map created with the Map Builder (or a chart with the Chart Builder) to the smartphone application, there are many possibilities of data reuses. As a user of an Opendatasoft portal, it is possible to either discover the reuses that others have made or to submit your very own reuse for it to be displayed on the related portal.
fr: Les réutilisations de données sont des créations reposant sur des jeux de données publiés sur un portail Open Data. Elles peuvent revêtir diverses formes : de la carte créée avec l'Éditeur de cartes (ou un graphe créé avec l'Éditeur de graphes) à l'application pour smartphone. En tant qu'utilisateur d'un portail Opendatasoft, il est possible de découvrir les réutilisations créées par d'autres utilisateurs ou d'envoyer votre propre réutilisation pour l'afficher sur le portail associé.
nl: Hergebruiken van data zijn creaties die gebaseerd zijn op data uit datasets die gepubliceerd zijn op een open dataportaal. Ze kunnen verschillende vormen aannemen: van de kaart die aangemaakt werd met de Map Builder (of een grafiek met de Chart Builder), tot de smartphone applicatie zijn er verschillende mogelijkheden om data te hergebruiken. Als gebruiker van een Opendatasoft-portaal is het mogelijk om ofwel de hergebruiken te ontdekken die anderen hebben gedaan, of om uw volledig eigen hergebruik in te dienen zodat het wordt weergegeven op het aanverwante portaal.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Data reuses need to be :doc:`enabled by administrators </configuring_domain/04_sharing_reusing_communicating/engaging>` to be available.
fr: Les réutilisations de données doivent être :doc:`activées par les administrateurs </configuring_domain/04_sharing_reusing_communicating/engaging>` pour être disponibles.
nl: Hergebruiken van data moeten :doc:`door de beheerders worden geactiveerd </configuring_domain/04_sharing_reusing_communicating/engaging>` om beschikbaar te zijn.

source: Discovering existing reuses
de: Vorhandene Weiterverwendungen entdecken
es: Descubrir reutilizaciones existentes
fr: Découvrir des réutilisations existantes
nl: Bestaande hergebruiken ontdekken

source: Existing reuses of a dataset that have been approved by the portal administrators are listed in the Reuses area of the Information tab.
fr: Les réutilisations existantes d'un jeu de données, qui ont été approuvées par les administrateurs du portail, sont répertoriées dans la section Réutilisations de l'onglet Informations.
nl: Bestaande hergebruiken van een dataset die werden goedgekeurd door de portaalbeheerders staan opgelijst in de Hergebruik-ruimte van het tabblad Informatie.

source: In the list of reuses, each reuse is displayed in a rectangle containing information about that reuse:
de: In der Liste der Weiterverwendungen wird jede Weiterverwendung in einem Rechteck mit Informationen zu dieser Weiterverwendung angezeigt:
es: En la lista de reutilizaciones, cada una de las reutilizaciones se visualiza en un rectángulo que contiene información acerca de la misma:
fr: Dans la liste des réutilisations, chacune d'entre elles est affichée dans un rectangle comprenant les informations suivantes :
nl: In de lijst met hergebruiken wordt elk hergebruik weergegeven in een rechthoek waarin informatie over dat hergebruik staat:

source: Image preview of the reuse,
de: Vorschaubild der Weiterverwendung,
es: Imagen de vista previa de la reutilización
fr: aperçu de l'image de la réutilisation,
nl: Voorbeeldweergave via een afbeelding van het hergebruik,

source: Title of the reuse,
de: Titel der Weiterverwendung,
es: Título de la reutilización
fr: titre de la réutilisation,
nl: Titel van het hergebruik,

source: Description of the reuse,
de: Beschreibung der Weiterverwendung,
es: Descripción de la reutilización
fr: description de la réutilisation,
nl: Beschrijving van het hergebruik,

source: Name of the author,
de: Name des Autors,
es: Nombre del autor
fr: nom du créateur,
nl: Naam van de auteur,

source: Date when the reuse was added.
de: Datum, an dem die Weiterverwendung hinzugefügt wurde.
es: Fecha de adición de la reutilización
fr: date d'ajout de la réutilisation.
nl: Datum waarop het hergebruik werd toegevoegd.

source: To discover a chosen dataset reuse, click on its rectangle.
de: Klicken Sie auf das entsprechende Rechteck, um die Weiterverwendung eines bestimmten Datensatz zu entdecken.
es: Para descubrir una reutilización de conjunto de datos determinada, haga clic en su rectángulo.
fr: Pour découvrir une réutilisation de jeu de données choisie, cliquez sur le rectangle associé.
nl: Voor meer informatie over een gekozen hergebruik van een dataset, klik op de rechthoek ervan.

source: Submitting own reuses
de: Eigene Weiterverwendungen einreichen
es: Enviar reutilizaciones propias
fr: Envoyer ses propres réutilisations
nl: Eigen hergebruiken indienen

source: For the data reuses to be displayed in the Reuses area of the Information tab of a dataset, the users who make these reuses must submit them to the portal administrators.
de: Damit Daten-Weiterverwendungen in dem entsprechenden Bereich der Registerkarte Informationen des Datensatzes angezeigt werden, muss der Urheber der Weiterverwendung diese zunächst an die Portal-Administratoren übermitteln.
es: Para que las reutilizaciones de datos aparezcan en el área Reutilizaciones de la ficha Información de un conjunto de datos, los usuarios que realizan estas reutilizaciones deben enviarlas a los administradores del portal.
fr: Pour que les réutilisations de données soient affichées dans la zone Réutilisations de l'onglet Informations d'un jeu de données, les créateurs de ces réutilisations doivent les envoyer aux administrateurs du portail.
nl: Opdat hergebruiken van data worden weergegeven in de Hergebruik-ruimte van het tabblad Informatie van een dataset, moeten de gebruikers die deze hergebruiken maken, deze doorsturen naar de portaalbeheerders.

source: On some Opendatasoft portals, anonymous users are allowed to submit their reuses, but on other portals, only authenticated users are allowed to do so. This depends entirely on the portal administrators and how they choose to manage the reuse feature.
de: Auf einigen Opendatasoft-Portalen dürfen anonyme Nutzer ihre Weiterverwendungen einreichen, auf anderen Portalen ist dies authentifizierten Benutzern vorbehalten. Dies hängt ganz von den Administratoren des Portals ab und wie sie sich für die Verwaltung der Weiterverwendungs-Funktion entscheiden.
es: En algunos portales Opendatasoft, los usuarios anónimos pueden enviar sus reutilizaciones; sin embargo, en otros portales, solo pueden hacerlo los usuarios autenticados. Esto depende totalmente de los administradores del portal y de su elección acerca de cómo gestionar la función de reutilizaciones.
fr: Sur certains portails Opendatasoft, les utilisateurs anonymes peuvent envoyer leurs réutilisations, tandis que sur d'autres portails seuls les utilisateurs authentifiés peuvent le faire. Cela dépend entièrement des administrateurs du portail et de la façon dont ils choisissent de gérer les réutilisations.
nl: Op sommige Opendatasoft-portalen kunnen anonieme gebruikers hun hergebruiken doorsturen, maar op andere portalen zijn het enkel ge√Ødentificeerde gebruikers die dit kunnen doen. Dit hangt volledig af van de portaalbeheerders en hoe ze kiezen om de hergebruikfunctie te beheren.

source: To submit a reuse, follow the procedure below:
de: Gehen Sie wie folgt vor, um eine Weiterverwendung einzureichen:
es: Para enviar una reutilización, siga este procedimiento:
fr: Pour envoyer une réutilisation, suivez la procédure ci-dessous :
nl: Om een hergebruik door te sturen, gebruikt u de onderstaande procedure:

source: In the Reuses area of the Information tab of the dataset used for the reuse, click on "Submit a reuse".
de: Klicken Sie im Bereich Weiterverwendungen in der Registerkarte Informationen des entsprechenden Datensatzes auf: "Eine Weiterverwendung einreichen".
es: En el área Reutilizaciones de la ficha Información del conjunto de datos utilizado para la reutilización, haga clic en "Enviar una reutilización".
fr: Dans la zone Réutilisations de l'onglet Informations du jeu de données utilisé pour la réutilisation, cliquez sur "Envoyer une réutilisation".
nl: Klik in de Hergebruik-ruimte van het tabblad Informatie van de dataset die gebruikt wordt voor het hergebruik op "Een hergebruik doorsturen".

source: Fill in the form:
de: Füllen Sie das Formular aus:
es: Rellene el formulario:
fr: Renseignez le formulaire :
nl: Vul het formulier in:

source: Last name *(only for anonymous users)*
de: Nachname *(nur für anonyme Nutzer)*
es: Apellido *(solo para los usuarios anónimos)*
fr: Nom de famille *(uniquement pour les utilisateurs anonymes)*
nl: Familienaam *(enkel voor anonieme gebruikers)*

source: First name *(only for anonymous users)*
de: Vorname *(nur für anonyme Nutzer)*
es: Nombre *(solo para los usuarios anónimos)*
fr: Prénom *(uniquement pour les utilisateurs anonymes)*
nl: Voornaam *(enkel voor anonieme gebruikers)*

source: Email *(only for anonymous users)*
de: E-Mail-Adresse *(nur für anonyme Nutzer)*
es: Correo electrónico *(solo para los usuarios anónimos)*
fr: Email *(uniquement pour les utilisateurs anonymes)*
nl: E-mail *(enkel voor anonieme gebruikers)*

source: Reuse title: give a title to the reuse
de: Titel der Weiterverwendung: geben Sie der Weiterverwendung einen Titel
es: Título de reutilización: dé un título a la reutilización.
fr: Titre de la réutilisation : donnez un titre à la réutilisation
nl: Titel van het hergebruik: geef een titel aan het hergebruik

source: Description: describe what kind of reuse it is, what it is about etc.
de: Beschreibung: beschreiben Sie die Art der Weiterverwendung, worum es geht usw.
es: Descripción: describa qué tipo de reutilización es, de qué trata, etc.
fr: Description : décrivez le type de réutilisation, son sujet, etc.
nl: Beschrijving: beschrijf welk soort hergebruik het is, waar het over gaat, enz.

source: URL: indicate the URL where the reuse is located
de: URL: geben Sie die URL an, unter der sich die Weiterverwendung befindet.
es: URL: indique la dirección URL en que se encuentra la reutilización.
fr: URL : indiquez l'URL de la réutilisation
nl: URL: vermeld de URL waar het hergebruik zich bevindt

source: Thumbnail: upload an image preview of the reuse
fr: Vignette : chargez un aperçu de l'image de la réutilisation
nl: Thumbnail: upload een voorbeeldweergave onder de vorm van een afbeelding van het hergebruik

source: Click on the Submit button.
de: Klicken Sie auf den Button "Einreichen".
es: Haga clic en el botón Enviar.
fr: Cliquez sur le bouton Envoyer.
nl: Klik op de knop "Indienen".

source: Once submitted, the reuse is sent to the portal administrators, who will be notified about it and can approve it. Once approved, the reuse is added to the reuses list of the Information tab.
de: Nachdem die Weiterverwendung eingereicht wurde, wird sie an die Administratoren des Portals übermittelt, die sie dann genehmigen können. Nach erfolgter Genehmigung wird die Weiterverwendung in der Registerkarte Informationen der Auflistung der Weiterverwendung hinzugefügt.
es: Una vez enviada, la reutilización se remite a los administradores del portal, que recibirán una notificación de la misma y podrán aprobarla. Cuando se apruebe, la reutilización se añadirá a la lista de reutilizaciones de la ficha Información.
fr: Une fois envoyée, la réutilisation est transmise aux administrateurs du portail, qui seront notifiés et pourront l'approuver. Une fois approuvée, elle est ajoutée à la liste des réutilisations de l'onglet Informations.
nl: Eenmaal het hergebruik is ingediend, wordt het naar de portaalbeheerders gestuurd. Zij zullen in er in kennis van worden gesteld en het kunnen goedkeuren. Eenmaal het is goedgekeurd wordt het hergebruik toegevoegd aan de lijst met hergebruiken in het tabblad Informatie.

source: The portal administrators have the possibility to modify the title, description, URL, and thumbnail of the reuse. They cannot, however, modify the submitted last name or first name.
fr: Les administrateurs du portail peuvent modifier le titre, la description, l'URL et la vignette de la réutilisation. Néanmoins, ils ne peuvent pas modifier le prénom ni le nom de famille envoyés.
nl: De portaalbeheerders hebben de mogelijkheid om de titel, de beschrijving, de URL en de thumbnail van het hergebruik te wijzigen. Wel kunnen ze de ingediende voor- of familienaam niet wijzigen.

source: Data reuses are creations based on data from datasets published on an open data portal. They can take many forms: from the map created with the Map Builder (or a chart with the Chart Builder), to the smartphone application, there are many possibilities of data reuses. As a user of an Opendatasoft portal, it is possible to either discover the reuses that others have made, or to submit your very own reuse for it to be displayed on the related portal.
de: Daten-Weiterverwendungen sind Neuerstellungen auf der Grundlage von Daten aus Datensätzen, die auf einem offenen Datenportal veröffentlicht wurden. Sie können unterschiedliche Formen haben: von einer Karte, die mit dem Kartenersteller erstellt wurde (oder ein Diagramm, das mit dem Diagrammersteller erstellt wurde), bis hin zu einer Smartphone-App gibt es unterschiedliche Möglichkeiten. Nutzer eines Opendatasoft-Portals können die Weiterverwendungen anderer Nutzer entdecken oder eigene Weiterverwendungen einreichen, damit sie auf dem entsprechenden Portal angezeigt werden.
es: Las reutilizaciones de datos son creaciones basadas en datos de conjuntos de datos publicados en un portal de datos abiertos. Pueden adoptar muchas formas: desde el mapa creado con el Compilador de mapas (o un gráfico con el Compilador de gráficos) hasta la aplicación para Smartphone, hay numerosas posibilidades de reutilizaciones de datos. Como usuario de un portal Opendatasoft, puede descubrir las reutilizaciones efectuadas por otros o enviar su propia reutilización para que aparezca en el portal relacionado.

source: Existing reuses of a dataset, that have been approved by the portal administators, are listed in the Reuses area of the Information tab.
de: Vorhandene Weiterverwendungen, die von den Administratoren des Portals genehmigt wurden, werden im Bereich Weiterverwendungen in der Registerkarte Informationen aufgelistet.
es: Las reutilizaciones existentes de un conjunto de datos, aprobadas por los administradores del portal, figuran en el área Reutilizaciones de la ficha Información.

source: Thumbnail: upload a image preview of the reuse
de: Thumbnail: laden Sie ein Vorschaubild der Weiterverwendung hoch
es: Miniatura: cargue una imagen de vista previa de la reutilización.

source: The portal administrators have the possibility to modify the title, description, URL and thumbnail of the reuse. They cannot, however, modify the submitted last name or first name
de: Die Portal-Administratoren haben die Möglichkeit, Titel, Beschreibung, URL und Thumbnail der Weiterverwendung zu ändern. Den eingereichten Nachnamen oder Vornamen können Sie jedoch nicht ändern.
es: Los administradores del portal tienen la posibilidad de modificar el título, la descripción, la dirección URL y la miniatura de la reutilización. No obstante, no pueden modificar la información de nombre o apellido enviada.
