Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/exporting_data.po
Languages: de, es, fr, nl

source: Exporting data
de: Exportieren von Daten
es: Exportar datos
fr: Exporter des données
nl: Data exporteren

source: Opendatasoft datasets can be downloaded in various formats. Flat file formats are always available for any dataset. More specific formats can be available, depending on whether the dataset contains geographical coordinates or not.
de: Opendatasoft-Datensätze können in unterschiedlichen Formaten heruntergeladen werden. Flat-File-Formate sind immer für jeden Datensatz verfügbar. Weitere spezifischere Formate können verfügbar sein, dies hängt jedoch davon ab ob der Datensatz geografische Koordinaten enthält oder nicht.
es: Los conjuntos de datos de Opendatasoft se pueden descargar en varios formatos. Los formatos de archivo plano siempre están disponibles para cualquier conjunto de datos. Puede haber disponibles formatos más específicos, dependiendo de si el conjunto de datos contiene coordenadas geográficas o no.
fr: Les jeux de données Opendatasoft peuvent être téléchargés dans divers formats. Les formats de fichiers plats sont toujours disponibles, et ce pour tous les jeux de données. D'autres formats plus spécifiques peuvent être proposés, selon que le jeu de données contient des coordonnées géographiques ou non.
nl: Opendatasoft-datasets kunnen in verschillende formaten worden gedownload. Voor elke dataset zijn er altijd vlakke bestandsformaten beschikbaar. Er kunnen meer specifieke formaten beschikbaar zijn afhankelijk van het feit of de datasets al dan niet geografische coördinaten bevatten.

source: Go to the **Export** tab of the dataset.
de: Öffnen Sie die Registerkarte **Export** des Datensatzes.
es: Vaya a la ficha **Exportar** del conjunto de datos.
fr: Accédez à l'onglet **Exporter** du jeu de données.
nl: Ga naar het tabblad **Export** van de dataset.

source: Choose the file format to download.
de: Wählen Sie das Dateiformat für den Download.
es: Elija el formato de archivo que desee descargar.
fr: Choisissez le format du fichier à télécharger.
nl: Kies het bestandsformaat dat moet worden gedownload.

source: Perform one of the following actions:
de: Führen Sie eine der folgenden Aktionen aus:
es: Lleve a cabo una de las acciones siguientes:
fr: Effectuez l'une des actions suivantes :
nl: Voer een van de volgende handelingen uit:

source: Click **Whole dataset** next to the desired format.
de: Klicken Sie auf **Ganzer Datensatz** neben dem gewünschten Format.
es: Haga clic en **Todo el conjunto de datos** junto al formato deseado.
fr: Cliquez sur **Jeu de données entier** en regard du format souhaité.
nl: Klik op **Volledige dataset** naast het gewenste formaat.

source: If the dataset is filtered and you want to export the filtered data only, click **Only the selected records** next to the desired format.
de: Wenn der Datensatz gefiltert ist und Sie nur die gefilterten Daten exportieren möchten, klicken Sie neben dem gewünschten Format auf **Nur ausgewählte Einträge**.
es: Si el conjunto de datos está filtrado y desea exportar solo los datos filtrados, haga clic en **Solo los registros seleccionados** junto al formato deseado.
fr: Si le jeu de données est filtré et que vous souhaitez exporter les données filtrées uniquement, cliquez sur **Seulement les enregistrements sélectionnés**, en regard du format souhaité.
nl: Wanneer de dataset is gefilterd en u enkel de gefilterde data wilt exporteren, klik dan op **Enkel de geselecteerde records** naast het gewenste formaat.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: You can use the parameter :code:`use_labels_for_header=true` in the exports links to use the labels instead of the technical identifiers of the fields as a header (not available in the Opendatasoft Search API v2).
de: Sie können den Parameter :code:`use_labels_for_header=true` in den Export-Verknüpfungen verwenden, um Beschriftungen anstelle von technischen Kennungen der Felder als Kopfzeile zu verwenden (nicht verfügbar in der Opendatasoft Search API v2).
es: Puede usar el parámetro :code:`use_labels_for_header=true` en los vínculos de las exportaciones para usar las etiquetas en lugar de los identificadores técnicos de los campos como cabecera (no disponible en la API de búsqueda de Opendatasoft v2).
fr: Le paramètre :code:`use_labels_for_header=true` dans les liens des exports vous permet d'utiliser les labels en tant qu'en-têtes plutôt que les identifiants techniques des champs (indisponible dans l'API Opendatasoft Search v2).
nl: U kunt de parameter :code:`use_labels_for_header=true` in de exportlink gebruiken om de labels te gebruiken in plaats van de technische identifiers van de velden als een header (niet beschikbaar in de Opendatasoft Search API v2).

source: You can also export datasets in other formats using the `Opendatasoft Search API v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-records>`_.
de: Mithilfe der `Opendatasoft Search API v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-records>`_ kann der Datensatz in anderen Formaten exportiert werden.
es: También puede exportar conjuntos de datos en otros formatos mediante la `API de búsqueda de Opendatasoft v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-records>`_.
fr: Avec `l'API Opendatasoft Search v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-records>`_, vous pouvez également exporter les jeux de données dans d'autres formats.
nl: U kunt ook datasets in andere formaten exporteren door gebruik te maken van de `Opendatasoft Search API v2 <https://help.opendatasoft.com/apis/ods-search-v2/#exporting-records>`_.

source: Available export formats
de: Verfügbare Exportformate
es: Formatos de exportación disponibles
fr: Formats d'export disponibles
nl: Beschikbare exportformaten

source: In the Export tab of a dataset, the following formats can be available:
de: In der Registerkarte Export eines Datensatzes können die folgenden Formate verfügbar sein:
es: En la ficha Exportar de un conjunto de datos, puede haber disponibles los formatos siguientes:
fr: Dans l'onglet Exporter d'un jeu de données, les formats suivants peuvent être disponibles :
nl: In de tab Exporteren van de dataset kunnen de volgende formaten beschikbaar worden gesteld:

source: Flat file formats
de: Flat-File-Formate
es: Formatos de archivo plano
fr: Formats de fichiers plats
nl: Vlakke bestandsformaten

source: Format
es: Formato
nl: Formaat

source: Notes
de: Hinweise
es: Notas
fr: Remarques
nl: Opmerkingen

source: CSV uses semicolon (;) as a separator.
de: CSV verwendet ein Semikolon (;) als Trennzeichen.
es: CSV utiliza punto y coma (;) como separador.
fr: Le format CSV utilise le point-virgule (;) en tant que séparateur.
nl: CSV gebruikt een puntkomma (;) als een scheidingsteken.

source: Geographic file formats
de: Geografische Dateiformate
es: Formatos de archivo geográfico
fr: Formats de fichiers géographiques
nl: Geografische bestandsformaten

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: The geographical coordinates of a dataset are expressed in WGS84 by default. When made available by the data producer, you can select additional geographical projections from the drop-down displayed above the export formats.
de: Die geografischen Koordinaten eines Datensatzes werden standardmäßig in WGS84 ausgedrückt. Wenn vom Datenproduzenten zur Verfügung gestellt, können Sie zusätzliche geografische Projektionen aus der Dropdown-Liste oberhalb der Exportformate auswählen.
es: Las coordenadas geográficas de un conjunto de datos se expresan por defecto en WGS84. Si el productor de datos las establece como disponibles, puede seleccionar proyecciones geográficas adicionales en el menú desplegable sobre los formatos de exportación.
fr: Les coordonnées géographiques d'un jeu de données sont exprimées au format WGS84 par défaut. Lorsqu'elles sont fournies par le producteur de données, vous pouvez sélectionner des projections géographiques supplémentaires depuis la liste déroulante affichée au-dessus des formats d'exports.
nl: De geografische coördinaten van een dataset worden standaard uitgedrukt in WGS84. Wanneer deze beschikbaar zijn gesteld door de dataproducent, kunt u bijkomende geografische projecties selecteren uit het afrolmenu dat boven de exportformaten is weergegeven.

source: There are 2 limitations in Shapefile exports:
de: Es gibt 2 Einschränkungen für Shapefile-Exporte:
es: Existen 2 limitaciones para las exportaciones de archivos Shapefile:
fr: Il existe 2 limitations concernant les exports Shapefile :
nl: Er zijn 2 beperkingen in Shapefile-exports:

source: The export cannot contain more than 50,000 records.
de: Es können maximal 50.000 Einträge exportiert werden.
es: La exportación no puede contener más de 50.000 registros.
fr: L'export ne peut pas contenir plus de 50 000 enregistrements.
nl: De export mag niet meer dan 50.000 records bevatten.

source: The export cannot contain more than one geographical shape type (point, polygon, linestring, etc.).
de: Der Export kann nicht mehrere verschiedene geographische Formen (z. B. Punkt, Polygon, Linestring usw..) beinhalten.
es: La exportación no puede contener más de un solo tipo de forma geográfica (punto, polígono, cadena de línea, etc.).
fr: L'export ne peut pas contenir plus d'un type de forme géographique (point, polygone, linestring, etc.).
nl: De export mag niet meer dan één geografisch vormtype bevatten (punt, polygon, linestring, enz.).

source: If the dataset contains one ``geoshape`` field with multiple shape types, only the first type of the first non-empty record will be kept in the export.
de: Wenn der Datensatz ein ``Geoshape``-Feld mit mehreren Formtypen enthält, wird nur der erste Typ des ersten nicht leeren Datensatzes im Export beibehalten.
es: Si el conjunto de datos contiene un campo ``geoshape`` con varios tipos de formas, solamente se conservará en la exportación el primer tipo del primer registro que no esté vacío.
fr: Si le jeu de données contient un champ ``geoshape`` avec plusieurs types de formes, seul le premier type du premier enregistrement non vide sera conservé dans l'export.
nl: Wanneer de dataset één veld ``geoshape`` bevat met meerdere vormtypes, zal enkel het eerste type van het eerste record dat niet leeg is, worden behouden in de export.

source: If the dataset contains multiple geographical fields (``geoshape`` or ``geo_point_2d``), only the first shape type of the first non-empty record will be kept in the export.
de: Wenn der Datensatz mehrere geographische Felder (``geoshape`` oder ``geo_point_2d``) enthält, wird nur der erste Formtyp des ersten nicht leeren Datensatzes im Export beibehalten.
es: Si el conjunto de datos contiene varios campos geográficos (``geoshape`` o ``geo_point_2d``), solamente se conservará en la exportación el primer tipo de forma del primer registro que no esté vacío.
fr: Si le jeu de données contient plusieurs champs géographiques (``geoshape`` ou ``geo_point_2d``), seul le premier type de forme du premier enregistrement non vide sera conservé dans l'export.
nl: Wanneer de dataset meerdere geografische velden bevat (``geoshape`` of ``geo_point_2d``), zal enkel het eerste vormtype van het eerste record dat niet leeg is, worden behouden in de export.

source: Specialized formats
de: Spezielle Formate
es: Formatos especializados
fr: Formats spécialisés
nl: Gespecialiseerde formaten

source: The export is available only if the :ref:`calendar visualization <visualizing-data-calendar>` has been enabled for the dataset.
de: Der Export ist nur verfügbar, wenn die :ref:`Kalendervisualisierung <visualizing-data-calendar>` für den Datensatz aktiviert wurde.
es: La exportación solo está disponible si se ha activado la :ref:`visualización Calendario <visualizing-data-calendar>` para el conjunto de datos.
fr: L'export est disponible uniquement si la :ref:`visualisation Calendrier<visualizing-data-calendar>` a été activée pour le jeu de données.
nl: De export is enkel beschikbaar wanneer de :ref:`kalenderweergave<visualizing-data-calendar>` werd geactiveerd voor de dataset.

source: Exporting and downloading images
de: Bilder exportieren und herunterladen
es: Exportar y descargar imágenes
fr: Export et téléchargement d'images
nl: Afbeeldingen exporteren en downloaden

source: Images imported into the platform can only be downloaded or exported one by one. There is no way to download all the images of a dataset at the same time.
de: Bilder, die in die Plattform importiert wurden, können nur einzeln heruntergeladen oder exportiert werden. Es gibt keine Möglichkeit, alle Bilder eines Datensatzes gleichzeitig herunterzuladen.
es: Las imágenes importadas en la plataforma solo se pueden descargar o exportar una a una. No existe la posibilidad de descargar todas las imágenes de un conjunto de datos de manera simultánea.
fr: Les images importées dans la plateforme peuvent uniquement être téléchargées ou exportées individuellement. Aucune option permettant de télécharger simultanément toutes les images d'un jeu de données n'est disponible.
nl: Afbeeldingen die in het platform zijn geïmporteerd, kunnen enkel één voor één worden gedownload of geëxporteerd. Het is niet mogelijk om alle afbeeldingen van een dataset op hetzelfde ogenblik te downloaden.

source: Downloading an image
de: Ein Bild herunterladen
es: Descargar una imagen
fr: Téléchargement d'une image
nl: Een afbeelding downloaden

source: In the front office, go to the **Images** visualization tab of the dataset containing the image(s) to download.
de: Öffnen Sie im Front Office den Tab zur Visualisierung der **Bilder** des Datensatzes, der das/die herunterzuladenden Bild(er) enthält.
es: En el front office, vaya a la ficha de visualización **Imágenes** del conjunto de datos que contiene las imágenes que se descargarán.
fr: Dans la plateforme, accédez à l'onglet de visualisation **Images** du jeu de données contenant les images à télécharger.
nl: Ga in de front office naar de visualisatietab **Afbeeldingen** van de dataset die de afbeeldingen bevat die moeten worden gedownload.

source: Click the image to download.
de: Klicken Sie auf das Bild, das Sie herunterladen möchten.
es: Haga clic en la imagen para descargar.
fr: Cliquez sur l'image à télécharger.
nl: Klik op de afbeelding om te downloaden.

source: At the bottom of the image's metadata, click **Download image**.
de: Klicken Sie unten in den Metadaten des Bildes auf **Bild herunterladen**.
es: En la parte inferior de los metadatos de la imagen, haga clic en **Descargar imagen**.
fr: En bas des métadonnées de l'image, cliquez sur **Télécharger l'image**.
nl: Klik onderaan de metadata van de afbeelding op **Afbeelding downloaden**.

source: Exporting dataset to retrieve image URL
de: Datensatz exportieren, um die Bild-URL abzurufen
es: Exportar un conjunto de datos para recuperar una dirección URL de imagen
fr: Export d'un jeu de données pour récupérer l'URL d'image
nl: Dataset exporteren om URL van de afbeelding terug te vinden

source: In the front office, go to the **Export** tab of the dataset containing the images to export.
de: Öffnen Sie im Front Office den Tab **Export** des Datensatzes, der das/die zu exportierenden Bilder enthält.
es: En el front office, vaya a la ficha **Exportar** del conjunto de datos que contiene las imágenes que se exportarán.
fr: Dans l'interface de navigation, accédez à l'onglet **Exporter** du jeu de données contenant les images à exporter.
nl: Ga in de front office naar het tabblad **Export** van de dataset dat de afbeeldingen bevat die moeten worden geëxporteerd.

source: Export the whole dataset or only the selected records if the dataset is filtered.
de: Exportieren Sie den gesamten Datensatz oder nur die ausgewählten Einträge, falls der Datensatz gefiltert ist.
es: Exporte el conjunto de datos completo o solo los registros seleccionados si el conjunto de datos está filtrado.
fr: Exportez l'intégralité du jeu de données ou seulement les enregistrements sélectionnés si le jeu de données est filtré.
nl: Exporteer de volledige dataset of enkel de geselecteerde records wanneer de dataset is gefilterd.

source: Open the exported dataset in the spreadsheet software of your choice.
de: Öffnen Sie den exportierten Datensatz in der gewünschten Tabellenkalkulationssoftware.
es: Abra el conjunto de datos exportado en el software de hojas de cálculo que desee.
fr: Ouvrez le jeu de données exporté dans le tableur de votre choix.
nl: Open de geëxporteerde dataset in de spreadsheet software van uw keuze.

source: Find the field containing the URLs of the image and retrieve them.
de: Suchen Sie das Feld, das die URLs des Bildes enthält und erfassen Sie sie.
es: Busque el campo que contiene las direcciones URL de la imagen y recupérelas.
fr: Recherchez le champ contenant les URL de l'image et récupérez-les.
nl: Vind het veld terug dat de URL's van de afbeelding bevat en haal deze op.
