Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/following_dataset_updates.po
Languages: de, es, fr, nl

source: Following dataset updates
de: Datensatzaktualisierungen folgen
es: Seguir actualizaciones de conjuntos de datos
fr: Suivre les mises à jour des jeux de données
nl: Datasetupdates volgen

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: Only authenticated users can follow a dataset.
de: Nur authentifizierte Benutzer können einem Datensatz folgen.
es: Solo los usuarios autenticados pueden seguir un conjunto de datos.
fr: Seuls les utilisateurs authentifiés peuvent suivre un jeu de données.
nl: Enkel geïdentificeerde gebruikers kunnen een dataset volgen.

source: If you have an Opendatasoft account, log in. Once logged in, the Follow button becomes clickable.
de: Melden Sie sich an, wenn Sie ein Opendatasoft-Konto haben. Sobald Sie angemeldet sind, können Sie auf den Button "Folgen" klicken.
es: Si tiene una cuenta Opendatasoft, inicie la sesión. Una vez iniciada la sesión, el botón Seguir pasa a ser interactivo.
fr: Si vous avez un compte Opendatasoft, connectez-vous. Une fois que vous êtes connecté, le bouton "Suivre les mises à jour" peut être utilisé.
nl: Log in wanneer u een Opendatasoft-account heeft. Eenmaal u bent ingelogd kan de knop Volgen worden aangeklikt.

source: If you do not have an Opendatasoft account, and if the portal allows anonymous users to create an Opendatasoft account, sign up to the portal. Once signed up and logged in, the Follow button becomes clickable.
de: Wenn Sie kein Opendatasoft-Konto haben und das Portal anonymen Nutzern die Erstellung eines Opendatasoft-Kontos erlaubt, können Sie sich beim Portal registrieren. Sobald Sie registriert und angemeldet sind, können Sie auf den Button "Folgen" klicken.
es: Si no tiene una cuenta Opendatasoft y el portal permite a los usuarios anónimos crear una cuenta Opendatasoft, regístrese en el portal. Tras completar el registro e iniciar la sesión, el botón Seguir pasa a ser interactivo.
fr: Si vous n'avez pas de compte Opendatasoft et que le portail autorise les utilisateurs anonymes à créer un compte Opendatasoft, inscrivez-vous sur le portail. Une fois que vous êtes inscrit et connecté, le bouton "Suivre les mises à jour "peut être utilisé.
nl: Indien u geen Opendatasoft-account heeft en indien het portaal anonieme gebruikers toelaat om een Opendatasoft-account aan te maken, teken dan in op het portaal. Eenmaal u bent ingetekend en ingelogd, kan de knop Volgen worden aangeklikt.

source: If you do not have an Opendatasoft account, and if the portal doesn't allow anonymous users to sign up, the Follow button will not be displayed in the Information tab of any dataset, and you won't have the possibility to follow a dataset.
de: Wenn Sie kein Opendatasoft-Konto haben und das Portal anonymen Nutzern die Erstellung eines Opendatasoft-Kontos nicht erlaubt, wird der Button "Folgen" nicht in der Registerkarte "Informationen" eines Datensatzes angezeigt und Sie können dem entsprechenden Datensatz nicht folgen.
fr: Si vous n'avez pas de compte Opendatasoft et que le portail n'autorise pas les utilisateurs anonymes à s'inscrire, le bouton "Suivre les mises à jour" ne sera pas affiché dans l'onglet Informations des jeux de données, et vous n'aurez donc pas la possibilité de les suivre.

source: Users have the possibility to follow datasets they are particularly interested in, to be informed whenever the dataset is modified. The "follow dataset" feature is especially convenient for those whose creation (mobile application, website, academic paper, etc.) relies on the data contained in a dataset.
de: Benutzer können Datensätzen folgen, die sie besonders interessieren, um bei jeder Änderung des Datensatzes informiert zu werden. Die Funktion "Datensatz folgen" eignet sich besonderes für solche Nutzer, deren Arbeiten (mobile Anwendung, Website, wissenschaftliche Arbeit usw.) auf den in einem Datensatz enthaltenen Daten basieren.
fr: Les utilisateurs ont la possibilité de suivre les jeux de données qui les intéressent pour être informés en cas de modifications apportées à ces derniers. La fonctionnalité de suivi de jeux de données est particulièrement utile pour les utilisateurs dont la création (application mobile, site Web, travail universitaire, etc.) se base sur les données d'un jeu de données.

source: To follow a dataset:
de: Um einem Datensatz zu folgen:
es: Para seguir un conjunto de datos:
fr: Pour suivre un jeu de données :
nl: Om een dataset te volgen:

source: Go to the Information tab of the chosen dataset.
de: Öffnen Sie die Registerkarte Informationen des gewünschten Datensatzes.
es: Vaya a la ficha Información del conjunto de datos seleccionado.
fr: Accédez à l'onglet Informations du jeu de données choisi.
nl: Ga naar de tab Informatie van de gekozen dataset.

source: Click on the Follow button under the dataset metadata.
de: Klicken Sie unter den Metadaten des Datensatzes auf den Button "Folgen".
es: Haga clic en el botón Seguir bajo los metadatos del conjunto de datos.
fr: Cliquez sur le bouton "Suivre les mises à jour" sous les métadonnées du jeu de données.
nl: Klik op de knop "Volgen" onder de metadata van de dataset.

source: If you do not have an Opendatasoft account, and if the portal doesn't allow anonymous users to sign up, the Follow button will not be displayed in the Information tab of any dataset, and you won't have the possiblity to follow a dataset.
es: Si no tiene una cuenta Opendatasoft y el portal no permite a los usuarios anónimos registrarse, el botón Seguir no aparecerá en la ficha Información de ninguno de los conjuntos de datos, y usted no podrá seguir un conjunto de datos.
nl: Indien u geen Opendatasoft-account heeft en het portaal anonieme gebruikers niet toelaat in te tekenen, zal de knop Volgen niet worden weergegeven in de tab Informatie van een dataset en zult u een dataset niet kunnen volgen.

source: Users have the possibility to follow datasets they are particularly interested in, to be informed whenever the dataset is modified. The "follow dataset" feature is especially convenient for those whose creation (mobile application, website, academic paper etc.) relies on the data contained in a dataset.
es: Los usuarios tienen la posibilidad de seguir los conjuntos de datos que les resulten de especial interés para estar al corriente de las modificaciones que experimente el conjunto de datos. La función "Seguir conjunto de datos" es especialmente práctica para aquellos casos en que la creación (aplicación móvil, sitio web, documento académico, etc.) se basa en los datos contenidos en un conjunto de datos.
nl: Gebruikers hebben de mogelijkheid om datasets waarin ze bijzonder geïnteresseerd zijn te volgen om op de hoogte te blijven wanneer de dataset wordt gewijzigd. De functie "dataset volgen" is vooral handig voor diegene wiens creatie (mobiele applicatie, website, academische paper, enz.) vertrouwt op de data die de dataset bevat.
