Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/getting_involved.po
Languages: de, es, fr, nl

source: Getting involved: sharing, reusing & reacting
de: Mitmachen: teilen, weiterverwenden und reagieren
es: Participar: compartir, reutilizar y reaccionar
fr: S'impliquer : partager, réutiliser et réagir
nl: Erbij betrokken raken: delen, hergebruiken & reageren

source: As a data consumer, multiple options are available to get more involved in the open data environment: whether you come across some datasets that you are particularly interested in and want to share with the world, or whether you have specific skills you believe could be put to use to create something with the published data.
de: Als Datennutzer haben Sie unterschiedliche Möglichkeiten, um sich stärker in die Open-Data-Umgebung einzubringen: möglicherweise stoßen Sie auf Datensätze, die Sie besonders interessieren und die Sie mit anderen teilen möchten; oder Sie verfügen über bestimmte Fähigkeiten, um etwas aus den veröffentlichten Daten zu erschaffen.

source: This section of the documentation will focus on all available options to share, reuse & react from an Opendatasoft portal:
de: Dieser Abschnitt der Dokumentation beleuchtet alle verfügbaren Optionen zum Teilen, Weiterverwenden und Reagieren innerhalb eines Opendatasoft-Portals:
fr: Dans cette partie de la documentation, nous allons vous présenter l'ensemble des options disponibles pour partager, réutiliser et réagir dans un portail Opendatasoft :
nl: Dit onderdeel van de documentatie zal zich toespitsen op alle beschikbare opties om een Opendatasoft-portaal te delen, te hergebruiken & erop te reageren:

source: Reuses, to either discover the data-based creations of others or to submit your very own creations.
de: Weiterverwendungen, um entweder die datenbasierten Arbeiten anderer zu entdecken oder um Ihre eigenen Arbeiten bereitzustellen.

source: Sharing your favorite visualizations or embedding them in any kind of HTML page or website.
de: Teilen Sie Ihre bevorzugten Visualisierungen oder betten Sie sie in jede denkbare HTML-Seite oder Website ein.

source: Exporting data that you want to keep in various formats.
de: Exportieren Sie Daten, die Sie behalten möchten, in verschiedenen Formaten.

source: Using APIs to go even further with data.
de: Nutzen Sie APIs, um noch mehr aus Ihren Daten herauszuholen.
es: Uso de interfaces API para progresar aún más con los datos.
fr: L'utilisation d'API pour aller encore plus loin avec les données.
nl: API's gebruiken om zelfs nog verder te gaan met data.

source: Commenting and discussing with other users about datasets.
de: Kommentieren und diskutieren Sie mit anderen über die Datensätze.
es: Comentario y discusión con otros usuarios sobre los conjuntos de datos.
fr: Les commentaires et discussions avec d'autres utilisateurs sur les jeux de données.
nl: Datasets becommentariëren of bespreken met andere gebruikers.

source: Following favorite datasets to make sure to be notified of each new modification.
de: Folgen Sie Ihren bevorzugten Datensätzen, um über jede Änderung informiert werden.
es: Seguimiento de los conjuntos de datos preferidos para recibir una notificación cada vez que se modifican.
fr: Le suivi de vos jeux de données préférés pour être alerté chaque fois qu'une nouvelle modification est effectuée.
nl: Favoriete datasets volgen om er zeker van te zijn dat men in kennis wordt gesteld van elke nieuwe wijziging.

source: Using social networks to share favorite dataset visualizations.
de: Nutzen Sie soziale Netzwerke, um bestimmte Datensatz-Visualisierungen zu teilen.
es: Uso de las redes sociales para compartir las visualizaciones de los conjuntos de datos preferidos.
fr: L'utilisation des réseaux sociaux pour partager vos visualisations de jeux de données favorites.
nl: Sociale netwerken gebruiken om favoriete datasetweergaves te delen.

source: Submitting feedbacks to help portal administrators improve their data.
de: Geben Sie Feedbacks, um Portal-Administratoren bei der Verbesserung ihrer Daten zu unterstützen.
es: Envío de comentarios para ayudar a los administradores del portal a mejorar sus datos.
fr: L'envoi de commentaires pour aider les administrateurs du portail à améliorer leurs données.
nl: Feedbacks doorsturen om portaalbeheerders te helpen om hun data te verbeteren;

source: As a data consumer, multiple options are available to get more involved in the open data environment: whether you come accross some datasets that you are particularly interested in and want to share with the world, or whether you have specific skills you believe could be put to use to create something with the published data.
es: Como consumidor de datos, dispone de diversas opciones para participar más en el entorno de datos abiertos, ya sea porque descubre unos conjuntos de datos que le resultan especialmente interesantes y desea compartirlos con el mundo, ya sea porque tiene unas aptitudes concretas que cree que pueden servir para crear algo interesante con los datos publicados.
fr: En tant qu'utilisateur de données, diverses options s'offrent à vous pour vous impliquer davantage dans l'environnement de données ouvertes. Vous pourriez, par exemple, trouver des jeux de données extrêmement intéressants et les partager avec le monde entier, ou encore mettre en pratique certaines de vos compétences pour créer quelque chose de nouveau avec les données publiées.
nl: Als dataconsument zijn er meerdere opties beschikbaar om meer betrokken te worden in de open dataomgeving: of u nu bepaalde datasets tegenkomt waarin u bijzonder geïnteresseerd bent en die u met de wereld wilt delen, of u specifieke vaardigheden heeft die gebruikt zouden kunnen worden om iets te creëren met de gepubliceerde data;

source: This section of the documentation will focus on all available options to share, reuse & react from an OpenDataSoft portal:
es: Esta sección de la documentación se centrará en todas las opciones para compartir, reutilizar y reaccionar que están disponibles en un portal OpenDataSoft:

source: Reuses, to either discover the data-based creations of others, or to submit your very own creations.
es: Reutilizaciones, para descubrir las creaciones basadas en datos de otros usuarios o para enviar sus propias creaciones.
fr: Les réutilisations, qui permettent de découvrir les créations basées sur des données des autres utilisateurs ou de soumettre vos propres créations.
nl: Hergebruiken om ofwel de op data gebaseerde creaties van anderen te ontdekken of om uw volledig eigen creaties door te sturen.

source: Sharing your favorite visualizations, or embedding them in any kind of HTML page or website.
es: Posibilidad de compartir sus visualizaciones preferidas o incrustarlas en cualquier tipo de página HTML o sitio web.
fr: Le partage de vos visualisations préférées, ou leur intégration dans tous les types de sites Web ou pages HTML.
nl: Uw favoriete weergaves delen of deze embedden in elk type HTML-pagina of website.

source: Exporting data that your want to keep, in various formats.
es: Exportación de datos que desea conservar, en diversos formatos.
fr: L'exportation des données que vous souhaitez conserver, dans différents formats.
nl: Data die u wilt bijhouden exporteren in verschillende formaten.
