Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/sharing_embedding_data_visualizations.po
Languages: de, es, fr, nl

source: Sharing & embedding data visualizations
de: Eine Datenvisualisierung teilen und einbetten
es: Compartir e incrustar visualizaciones de datos
fr: Partager et intégrer des visualisations de données
nl: Dataweergaves delen & embedden

source: Below each visualization are displayed 3 tabs: Share, Embed and Widget. These tabs contain links or pieces of code that allow to share or embed the visualization either elsewhere on the portal or on another website.
de: Unter jeder Visualisierung werden 3 Registerkarten angezeigt: Teilen, Einbettung und Widget. Diese Registerkarten enthalten Links oder Codeteile, mit denen die Visualisierung entweder an anderer Stelle im Portal oder auf einer anderen Website geteilt oder eingebettet werden kann.
es: Bajo cada una de las visualizaciones figuran 3 fichas: Compartir, Incrustar y Widget. Estas fichas contienen vínculos o fragmentos de código que permiten compartir o incrustar la visualización en cualquier otra parte del portal o cualquier otro sitio web.
fr: 3 onglets sont affichés sous chaque visualisation : Partager, Intégrer et Widget. Ces onglets contiennent des liens ou des extraits de code qui permettent de partager ou d'intégrer la visualisation ailleurs sur le portail ou sur un autre site Web.
nl: Onder elke weergave staan 3 tabs: Share, Embed en Widget. Deze tabs bevatten links of stukjes code die toelaten de weergave ofwel elders op het portaal of op een andere website te delen of te embedden.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: All links and codes that can be copied, to either share or embed the visualization, are dynamic. It means that if the visualization is filtered beforehand, the link/code changes to take into account these filters.
de: Alle Links und Codes, die kopiert werden können, um die Visualisierung zu teilen oder einzubetten, sind dynamisch. Wenn die Visualisierung also im Vorfeld gefiltert wird, ändert sich der Link/Code entsprechend dieser Filter.
es: Todos los vínculos y fragmentos de código que se pueden copiar, para compartir o incrustar la visualización, son dinámicos. Esto significa que si previamente se filtra la visualización, el vínculo/fragmento de código cambia para tener en cuenta esos filtros.
fr: Tous les liens et codes pouvant être copiés, pour partager ou intégrer la visualisation, sont dynamiques. Cela signifie que si la visualisation est filtrée au préalable, le lien/code est modifié pour prendre en compte ces filtres.
nl: Alle links en codes kunnen worden gekopieerd om de weergave ofwel te delen of te embedden. Dit betekent dat wanneer de weergave op voorhand is gefilterd, de link/code wijzigt om rekening te houden met deze filters.

source: Sharing a data visualization
de: Eine Datenvisualisierung teilen
es: Compartir una visualización de datos
fr: Partager une visualisation de données
nl: Een datawaargave delen

source: The Share tab below a visualization contains a URL to share a direct access to the visualization.
de: Die Registerkarte "Teilen" unter einer Visualisierung enthält eine URL, um einen direkten Zugriff auf die Visualisierung zu teilen.
es: La ficha Compartir que figura bajo una visualización contiene una dirección URL para compartir un acceso directo a la visualización.
fr: L'onglet Partager se trouvant sous une visualisation contient une URL pour partager un accès direct à la visualisation.
nl: De tab Share onder een weergave bevat een URL om een rechtstreekse toegang tot de weergave te delen.

source: Click on the copy button |icon-copypaste| to copy the URL.
de: Klicken Sie auf den Button Kopieren |icon-copypaste|, um die URL zu kopieren.
es: Haga clic en el botón de copiar |icon-copypaste| para copiar la dirección URL.
fr: Cliquez sur le bouton de copie |icon-copypaste| pour copier l'URL.
nl: Klik op de kopieerknop |icon-copypaste| om de URL te kopiëren.

source: Embedding a data visualization
de: Eine Datenvisualisierung einbetten
es: Incrustar una visualización de datos
fr: Intégrer une visualisation de données
nl: Een dataweergave embedden

source: Data visualizations can either be embedded via an iframe or as a widget. Both are pieces of code that allow anyone to integrate an element directly on a webpage.
de: Datenvisualisierungen können entweder über ein Iframe oder als Widget eingebettet werden. Bei beiden handelt es sich um Codeteile, mit denen ein Element direkt auf einer Webseite integriert werden kann.
es: Las visualizaciones de datos se pueden incrustar mediante un iframe o como widget. Ambos son fragmentos de código que permiten a cualquier usuario integrar un elemento directamente en una página web.
fr: Les visualisations de données peuvent être intégrées via un iframe ou en tant que widget. Il s'agit d'extraits de code permettant aux utilisateurs d'intégrer directement un élément à une page Web.
nl: Dataweergaves kunnen ofwel embed worden via een iframe of als een widget. Beide zijn stukjes code die iedereen moeten toelaten om een element rechtstreeks op een internetpagina te integreren.

source: An iframe is a way to easily and safely integrate Opendatasoft content in an isolated frame, independent from the rest of the page. For integrating Opendatasoft content outside the Opendatasoft environment, iframes are the best way to go. In terms of interaction and customization, some work would probably be needed. `Widgets <https://help.opendatasoft.com/widgets/#/api/>`_ could also be integrated into a page outside the Opendatasoft environment, but heavy work would be required. They are however ideal for integrating content inside the Opendatasoft environment. Widgets can also interact with other widgets, which for instance allow the creation of dynamic dashboards using Opendatasoft.
de: Ein Iframe bietet die Möglichkeit, Opendatasoft-Inhalte einfach und sicher in einen isolierten Bereich zu integrieren, unabhängig vom Rest der Seite. Iframes eignen sich ideal, wenn Sie Opendatasoft-Inhalte außerhalb der Opendatasoft-Umgebung integrieren möchten. Wahrscheinlich sind anschließend einige Interaktions- und Anpassungsmaßnahmen erforderlich. Auch `Widgets <https://help.opendatasoft.com/widgets/#/api/>`_ könnten in eine Seite außerhalb der Opendatasoft-Umgebung integriert werden, aber es wäre viel Arbeit erforderlich. Sie sind jedoch ideal für die Integration von Inhalten innerhalb der Opendatasoft-Umgebung. Widgets können auch mit anderen Widgets interagieren, wodurch beispielsweise die Erstellung dynamischer Dashboards mit Opendatasoft ermöglicht wird.
nl: Een iframe is een manier om op een eenvoudige en veilige manier Opendatasoft-content te integreren in een geïsoleerd frame, los van de rest van de pagina. Om Opendatasoft-content buiten de Opendatasoft-omgeving te integreren, zijn iframes de beste manier om te werk te gaan. Op het vlak van interactie en personalisatie zal er waarschijnlijk wel wat werk nodig zijn. `Widgets <https://help.opendatasoft.com/widgets/#/api/>`_ zouden ook geïntegreerd kunnen worden in een pagina buiten de Opendatasoft-omgeving, maar hiervoor zou zwaar werk vereist zijn. Ze zijn evenwel ideaal voor het integreren van content in de Opendatasoft-omgeving. Widgets kunnen ook interageren met andere widgets, waardoor bijvoorbeeld dynamische dashboards kunnen worden aangemaakt met behulp van Opendatasoft.

source: Embedding an iframe
de: Ein Iframe einbetten
es: Incrustar un iframe
fr: Intégrer un iframe
nl: Een iframe embedden

source: The Embed tab below a visualization contains the iframe code of that visualization.
de: Die Registerkarte "Einbettung" unter einer Visualisierung enthält den Iframe-Code dieser Visualisierung.
es: La ficha Incrustar bajo una visualización contiene el código del iframe de esa visualización.
fr: L'onglet Intégrer se trouvant sous une visualisation contient le code de l'iframe de la visualisation.
nl: De tab Embed onderaan een weegave bevat een iframe code van die weergave.

source: Choose the size of the iframe, from the drop-down list.
de: Wählen Sie die Größe des Iframe aus der Dropdown-Liste.
es: Elija el tamaño del iframe en la lista desplegable.
fr: Dans la liste déroulante, choisissez la taille de l'iframe.
nl: Kies de grootte van het iframe in de keuzelijst.

source: Choose whether or not to display the dataset information card above the iframe.
de: Wählen Sie, ob die Informationskarte für den Datensatz über dem Iframe angezeigt werden soll.
es: Elija si desea o no visualizar la tarjeta de información de conjunto de datos sobre el iframe.
fr: Choisissez si vous voulez afficher la fiche d'information du jeu de données au-dessus de l'iframe.
nl: Kies om de informatiekaart over de dataset al dan niet weer te geven boven de iframe.

source: Choose whether or not to lock the map's zoom and position (*for map visualizations only*).
de: Wählen Sie, ob Sie der Zoom und die Position der Karte gesperrt werden sollen (*nur für Kartenvisualisierungen*).
es: Elija si desea o no bloquear el zoom y la posición del mapa (*solo para visualizaciones de mapas*).
fr: Choisissez si vous voulez verrouiller la position et le zoom de la carte (*pour les visualisations de carte uniquement*).
nl: Kies om de zoom en positie van de map al dan niet te blokkeren (*enkel voor kaartweergaves*).

source: Choose whether or not to enable zooming in and out with the mouse wheel (*for map visualizations only*).
de: Wählen Sie, ob Sie das Zoomen mit dem Mausrad aktivieren möchten (*nur für Kartenvisualisierungen*).
es: Elija si desea o no activar el zoom para acercarse y alejarse con la rueda del ratón (*solo para visualizaciones de mapas*).
fr: Choisissez si vous voulez activer le zoomage et le dézoomage avec la molette de la souris (*pour les visualisations de carte uniquement*).
nl: Kies om in- en uitzoomen met het muiswiel al dan niet te activeren (*enkel voor kaartweergaves*).

source: Click |icon-copypaste| to copy the iframe code.
de: Klicken Sie auf |icon-copypaste|, um den Iframe-Code zu kopieren.
es: Haga clic en |icon-copypaste| para copiar el código del iframe.
fr: Cliquez sur l'icône |icon-copypaste| pour copier le code de l'iframe.
nl: Klik op de kopieerknop |icon-copypaste| om de iframe code te kopiëren.

source: Embedding a widget
de: Ein Widget einbetten
es: Incrustar un widget
fr: Intégrer un widget
nl: Een widget embedden

source: The Widget tab below a visualization contains the widget code of that visualization.
de: Die Registerkarte "Widget" unter einer Visualisierung enthält den Widget-Code dieser Visualisierung.
es: La ficha Widget bajo una visualización contiene el código del widget de esa visualización.
fr: L'onglet Widget se trouvant sous une visualisation contient le code du widget de cette visualisation.
nl: De tab Widget onder een weergave bevat de widget code van die weergave.

source: Click |icon-copypaste| to copy the widget code.
de: Klicken Sie auf |icon-copypaste|, um den Widget-Code zu kopieren.
es: Haga clic en |icon-copypaste| para copiar el código del widget.
fr: Cliquez sur l'icône |icon-copypaste| pour copier le code du widget.
nl: Klik op de kopieerknop |icon-copypaste| om de widget code te kopiëren.

source: An iframe is a way to easily and safely integrate OpenDataSoft content in an isolated frame, independent from the rest of the page. For integrating OpenDataSoft content outside the OpenDataSoft environment, iframes are the best way to go. In terms of interaction and customization, some work would probably be needed. `Widgets <https://help.opendatasoft.com/widgets/#/api/>`_ could also be integrated into a page outside the OpenDataSoft environment, but heavy work would be required. They are however ideal for integrating content inside the OpenDataSoft environment. Widgets can also interact with other widgets, which for instance allow the creation of dynamic dashboards using OpenDataSoft.
es: Un iframe es una manera fácil y segura de integrar contenido de OpenDataSoft en un marco aislado, independiente del resto de la página. Para integrar contenido de OpenDataSoft fuera del entorno de OpenDataSoft, los iframes son la mejor forma de hacerlo. Probablemente serían necesarias algunas tareas de interacción y personalización. También podrían integrarse `widgets <https://help.opendatasoft.com/widgets/#/api/>`_ en una página fuera del entorno de OpenDataSoft, aunque eso requeriría mucho trabajo. Sin embargo, son perfectos para integrar contenido dentro del entorno de OpenDataSoft. Los widgets también pueden interactuar entre sí, lo que permite por ejemplo la creación de paneles dinámicos mediante OpenDataSoft.
fr: Un iframe est un moyen d'intégrer facilement et en toute sécurité du contenu OpenDataSoft dans un cadre isolé, indépendant du reste de la page. Pour intégrer du contenu OpenDataSoft en dehors de l'environnement OpenDataSoft, les iframes sont la solution idéale. Notez que des opérations d'interaction et de personnalisation seront probablement nécessaires. Des `widgets <https://help.opendatasoft.com/widgets/#/api/>`_ peuvent aussi être intégrés dans une page en dehors de l'environnement OpenDataSoft, mais de nombreux ajustements devront être réalisés. Néanmoins, ils restent la solution idéale pour intégrer du contenu dans l'environnement OpenDataSoft. En outre, les widgets peuvent interagir avec d'autres widgets pour permettre la création de tableaux de bord dynamiques avec OpenDataSoft, par exemple.
