Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/sharing_through_social_networks.po
Languages: de, es, nl

source: Sharing through social networks
de: Teilen in sozialen Netzwerken
es: Compartir a través de las redes sociales
nl: Delen via sociale netwerken

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Since shortcuts to social networks are an optional feature, they are not activated on every Opendatasoft portal. The activation of shortcuts to social networks depends entirely on the portal administrators.
de: Verknüpfungen zu sozialen Netzwerken sind eine optionale Funktion. Deshalb sind sie nicht auf jedem Opendatasoft-Portal aktiviert. Für die Aktivierung der Verknüpfungen zu sozialen Netzwerken sind allein die Administratoren des jeweiligen Portals verantwortlich.
es: Como los atajos a las redes sociales son una función opcional, no están activados en todos los portales Opendatasoft. La activación de los atajos a las redes sociales depende totalmente de los administradores del portal.
nl: Aangezien shortcuts naar sociale netwerken een optionele functie zijn, zijn ze niet op elk Opendatasoft-portaal geactiveerd. Het activeren van shortcuts naar sociale netwerken hangt volledig af van de portaalbeheerders.

source: Shortcuts to social networks are displayed above datasets, as well as a shortcut to the creation of an email, to be able to quickly share a dataset and, more specifically, the visualization currently displayed on the webpage.
de: Verknüpfungen zu sozialen Netzwerken werden über den Datensätzen angezeigt, ebenso wie eine Verknüpfung zur Erstellung einer E-Mail. Auf diese Weise kann der Datensatz und insbesondere die aktuell auf der Webseite angezeigte Visualisierung schnell geteilt werden.
es: Los atajos a las redes sociales se muestran encima de los conjuntos de datos, junto con un atajo para la creación de un correo electrónico, a fin de poder compartir de manera rápida un conjunto de datos y, más concretamente, la visualización de ese momento en la página web.
nl: Shortcuts naar sociale netwerken staan weergegeven boven datasets, alsook een shortcut om een e-mail aan te maken, om zo snel een dataset te kunnen delen en meer specifiek de weergave die momenteel getoond wordt op de internetpagina.

source: The social networks available are:
de: Folgende soziale Netzwerke sind verfügbar:
es: Las redes sociales disponibles son:
nl: De beschikbare sociale netwerken zijn:

source: Twitter, which is represented by the |icon-twitter| button
de: Twitter, dargestellt durch den Button |icon-twitter|
es: Twitter, representada con el botón |icon-twitter|
nl: Twitter, dat weergegeven wordt door de knop |icon-twitter|

source: Facebook, which is represented by the |icon-facebook| button
de: Facebook, dargestellt durch den Button |icon-facebook|
es: Facebook, representada con el botón |icon-facebook|
nl: Facebook, dat weergegeven wordt door de knop |icon-facebook|

source: Linkedin, which is represented by the |icon-linkedin| button
de: Linkedin, dargestellt durch den Button |icon-linkedin|
es: Linkedin, representada con el botón |icon-linkedin|
nl: Linkedin, dat weergegeven wordt door de knop |icon-linkedin|

source: Click on any of the social networks buttons to share the dataset and its visualizations with the chosen social network. Authentication, if not already done, is required.
de: Klicken Sie auf eines der sozialen Netzwerke, um den Datensatz und seine Visualisierungen in dem ausgewählten sozialen Netzwerk zu teilen. Eine Authentifizierung, falls nicht bereits erfolgt, ist erforderlich.
es: Haga clic en cualquiera de los botones de redes sociales para compartir el conjunto de datos y sus visualizaciones con la red social seleccionada. Se requiere la autenticación, si no se ha hecho ya.
nl: Klik op een van de sociale netwerkknoppen om de dataset en de weergaves te delen met het gekozen sociaal netwerk. Identificatie is vereist, indien dit nog niet gebeurd is.

source: To create an email that will contain a link to the dataset and its visualizations, click the |icon-mail| button.
de: Um eine E-Mail zu erstellen, die einen Link zum Datensatz und seinen Visualisierungen enthält, klicken Sie auf den Button |icon-mail|.
es: Para crear un correo electrónico que contenga un vínculo al conjunto de datos y sus visualizaciones, haga clic en el botón |icon-mail|.
nl: Om een e-mail aan te maken met een link naar een dataset en de weergaves ervan, klikt u op de knop |icon-mail|.
