Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/submitting_feedback.po
Languages: de, es, fr, nl

source: Submitting feedback
de: Feedback einreichen
es: Enviar comentarios
fr: Envoyer des commentaires
nl: Feedback doorsturen

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Since feedbacks are an optional feature, they are not activated on every Opendatasoft portal. The activation of feedbacks depends entirely on the portal administrators.
de: Feedbacks sind eine optionale Funktion. Deshalb sind sie nicht auf jedem Opendatasoft-Portal aktiviert. Für die Aktivierung der Feedbacks sind allein die Administratoren des jeweiligen Portals verantwortlich.
fr: La fonctionnalité d'envoi de commentaires étant optionnelle, elle n'est pas activée sur tous les portails Opendatasoft. Le choix de l'inclure ou non revient aux administrateurs du portail.
nl: Aangezien feedbacks een optionele functie zijn, zijn ze niet op elk Opendatasoft-portaal geactiveerd. De activering van feedbacks hangt volledig af van de portaalbeheerders.

source: Feedbacks are suggestions of improvement that users can send to portal administrators, through the Table visualization tab of a published dataset. The feedbacks can either be on an existing record, or to request the addition of a new record in the dataset.
de: Bei Feedbacks handelt es sich um Verbesserungsvorschläge, die Benutzer über die Registerkarte "Tabellenvisualisierung" eines veröffentlichten Datensatzes an die Administratoren eines Portals senden können. Die Feedbacks können sich auf einen vorhandenen Eintrag beziehen oder das Hinzufügen eines neuen Eintrags im Datensatz beantragen.
fr: Les commentaires correspondent à des suggestions d'améliorations que les utilisateurs peuvent envoyer aux administrateurs du portail via l'onglet de visualisation Tableau. Des commentaires peuvent être laissés sur un enregistrement existant ou bien pour demander l'ajout d'un enregistrement au jeu de données.
nl: Feedbacks zijn verbeteringssuggesties die gebruikers naar portaalbeheerders kunnen sturen via de tab Tabelweergave van een gepubliceerde dataset. De feedbacks kunnen ofwel zijn op een bestaand record of om het toevoegen van een nieuw record in de dataset te vragen.

source: To suggest improvements on an existing record:
de: Um Verbesserungsvorschläge für einen vorhandenen Eintrag zu machen:
es: Para sugerir mejoras en un registro existente:
fr: Pour suggérer des améliorations sur un enregistrement existant :
nl: Om verbeteringen voor te stellen op een bestaand record:

source: Go to the Table tab of the chosen dataset.
de: Öffnen Sie die Registerkarte "Tabelle" des entsprechenden Datensatzes.
es: Vaya a la ficha Tabla del conjunto de datos seleccionado.
fr: Accédez à l'onglet Tableau du jeu de données choisi.
nl: Ga naar de tab Tabel van de gekozen dataset.

source: Click on |icon-feedback| on the left of the record that could be improved/modified. A "Send feedback" window opens.
de: Klicken Sie auf |icon-feedback| links neben dem Eintrag, der verbessert/geändert werden soll. Es öffnet sich das Fenster "Feedback senden".
es: Haga clic en |icon-feedback| a la izquierda del registro que se puede mejorar/modificar. Se abre una ventana "Enviar comentarios".
fr: Cliquez sur l'icône |icon-feedback| à gauche de l'enregistrement à modifier/améliorer ; une fenêtre "Envoyer des commentaires" s'affiche.
nl: Klik op |icon-feedback| aan de linkerkant van het record dat zou kunnen worden verbeterd/gewijzigd. Er wordt een venster "Stuur feedback" geopend.

source: In the "Your comments" textbox, write your comments on the dataset record.
de: Geben Sie im Textfeld "Ihre Kommentare" Ihre Anmerkung hinsichtlich des Datensatzeintrags an.
es: En el cuadro de texto "Sus comentarios", escriba sus comentarios sobre el registro del conjunto de datos.
fr: Inscrivez vos commentaires sur l'enregistrement du jeu de données dans la zone de texte "Vos commentaires".
nl: Noteer uw commentaren over het record van de dataset in het tekstvak "Uw commentaren".

source: (optional) Click on "Suggest new values" to suggest specific values to replace the current ones.
de: (optional) Klicken Sie auf "Neue Werte vorschlagen", um bestimmte Werte vorzuschlagen und die aktuellen zu ersetzen.
es: (Opcional) Haga clic en "Sugerir valores nuevos" para sugerir unos valores concretos en lugar de los actuales.
fr: (optionnel) Si vous souhaitez suggérer d'autres valeurs pour remplacer les valeurs actuelles, cliquez sur "Suggérer de nouvelles valeurs".
nl: (optioneel) Klik op "Nieuwe waarden voorstellen" om specifieke waarden voor te stellen om de huidige te vervangen.

source: At the bottom of the window, click on the Send your feedback button.
de: Klicken Sie unten im Fenster auf den Button "Feedback senden".
es: En la parte inferior de la ventana, haga clic en el botón Enviar sus comentarios.
fr: Cliquez sur le bouton Envoyez vos commentaires, en bas de la fenêtre.
nl: Klik onderaan het venster op de knop "Stuur uw feedback".

source: To request the addition of a new record:
de: Um das Hinzufügen eines neuen Eintrags zu beantragen:
es: Para solicitar la adición de un registro nuevo:
fr: Pour demander l'ajout d'un enregistrement :
nl: Om het toevoegen van een nieuw record te vragen:

source: At the bottom of the Table visualization, click on |icon-feedback| Suggest a new record.
de: Klicken Sie unten in der Tabellenvisualisierung auf |icon-feedback| Einen neuen Eintrag vorschlagen.
es: En la parte inferior de la visualización Tabla, haga clic en |icon-feedback| Sugerir un registro nuevo.
fr: En bas de la visualisation Tableau, cliquez sur l'icône |icon-feedback| Suggérer un nouvel enregistrement.
nl: Klik onderaan de Tabelweergave op |icon-feedback| Een nieuw record voorstellen.

source: In the "Your comments" textbox, write your comments about the requested dataset.
de: Geben Sie im Textfeld "Ihre Kommentare" Ihre Anmerkung hinsichtlich des vorgeschlagenen Eintrags an.
es: En el cuadro de texto "Sus comentarios", escriba sus comentarios sobre el conjunto de datos solicitado.
fr: Inscrivez vos commentaires sur l'enregistrement demandé dans la zone de texte "Vos commentaires".
nl: Noteer uw commentaren over de gevraagde dataset in het tekstvak "Uw commentaren".

source: (optional) Click on "Suggest new values" to suggest specific values for the requested record.
de: (optional) Klicken Sie auf "Neue Werte vorschlagen", um bestimmte Werte für den entsprechenden Eintrag vorzuschlagen.
es: (Opcional) Haga clic en "Sugerir valores nuevos" para sugerir unos valores concretos para el registro solicitado.
fr: (optionnel) Si vous souhaitez suggérer des valeurs pour l'enregistrement demandé, cliquez sur "Suggérer de nouvelles valeurs".
nl: (optioneel) Klik op "Nieuwe waarden voorstellen" om specifieke waarden voor het gevraagde record voor te stellen.

source: Since feedback is an optional feature, it is not activated on every Opendatasoft portal. The activation of the feedback feature depends entirely on the portal administrators.
es: Como los comentarios son una función opcional, no están activados en todos los portales Opendatasoft. La activación de la función de comentarios depende totalmente de los administradores del portal.

source: A feedback is a suggestion of improvement that users can send to portal administrators, through the Table visualization tab of a published dataset. A feedback can either be on an existing record, or to request the addition of a new record in the dataset.
es: Un comentario es una sugerencia de mejora que los usuarios pueden enviar a los administradores del portal, mediante la ficha de visualización Tabla de un conjunto de datos publicado. Un comentario puede versar sobre un registro existente o solicitar la adición de un registro nuevo en el conjunto de datos.
