Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/04_getting_involved/using_api.po
Languages: de, nl

source: Using the API
de: Verwenden der API
nl: De API gebruiken

source: An API (Application Programming Interface) is an interface for programs to communicate and exchange data.
de: Eine API (Application Programming Interface bzw. Programmierschnittstelle) ist eine Schnittstelle für Programme zur Kommunikation und zum Datenaustausch.
nl: Een API (Application Programming Interface) is een interface voor programma's om data te communiceren en uit te wisselen.

source: Note
de: Hinweis
nl: Opmerking

source: To know more about what APIs are and why and how they are used, you can read the article "`You don\'t need analogies to understand APIs <https://kitchen.opendatasoft.com/you-dont-need-analogies-to-understand-apis-14da4513f970>`_" written by one of our Opendatasoft developers.
de: Um mehr darüber zu erfahren, was APIs sind und warum und wie sie verwendet werden, können Sie den folgenden Artikel lesen, der von einem unserer Opendatasoft-Entwickler geschrieben wurde: "`You don\'t need analogies to understand APIs <https://kitchen.opendatasoft.com/you-dont-need-analogies-to-understand-apis-14da4513f970>`_".

source: Opendatasoft provides access to 6 APIs:
de: Opendatasoft bietet Zugriff auf 6 APIs:

source: `ODS Search API v1 <https://help.opendatasoft.com/apis/ods-search-v1/>`_ and `ODS Search API v2 <https://help.opendatasoft.com/apis/ods-search-v2/>`_: Opendatasoft's own APIs, used internally by the platform and the `ODS widgets <https://help.opendatasoft.com/widgets/>`_
de: `ODS Search API v1 <https://help.opendatasoft.com/apis/ods-search-v1/>`_ und `ODS Search API v2 <https://help.opendatasoft.com/apis/ods-search-v2/>`_: Die eigenen APIs von Opendatasoft, die intern von der Plattform verwendet werden sowie `ODS Widgets <https://help.opendatasoft.com/widgets/>`_

source: `Triple Pattern Fragments API <https://help.opendatasoft.com/apis/tpf/>`_: ODS API for triple pattern querying over datasets from Opendatasoft portals
de: `Triple Pattern Fragments API <https://help.opendatasoft.com/apis/tpf/>`_: ODS API für Triple-Pattern-Abfrage der Datensätze auf Opendatasoft-Portalen

source: `OData <https://help.opendatasoft.com/apis/odata/>`_, `WFS <https://help.opendatasoft.com/apis/wfs/>`_, and `CSW <https://help.opendatasoft.com/apis/csw/>`_: 3 standard protocols supported and provided by Opendatasoft
de: `OData <https://help.opendatasoft.com/apis/odata/>`_, `WFS <https://help.opendatasoft.com/apis/wfs/>`_, znd `CSW <https://help.opendatasoft.com/apis/csw/>`_: 3 Standardprotokolle, die von Opendatasoft unterstützt und bereitgestellt werden

source: All these APIs provide access to any data pushed to the platform, no matter their source or format, as long as the security rules defined by the data owner allow that access.
de: All diese APIs bieten Zugriff auf alle Daten, die auf die Plattform übertragen werden, unabhängig von ihrer Quelle oder ihrem Format. Einzige Voraussetzung ist, dass die vom Dateneigner definierten Sicherheitsregeln diesen Zugriff erlauben.
nl: Al deze API's bieden toegang tot data die naar het platform wordt geduwd, ongeacht de bron of het formaat, zolang de veiligheidsregels, zoals die door de eigenaar van de data zijn gedefinieerd, die toegang mogelijk maken.

source: These APIs can be used, for example, to search for datasets and data, to compute analysis, or to perform geographic aggregations. Still developer-oriented, but for more concrete examples of what can be done with APIs: applications as data reuses. Some of Opendatasoft customers have indeed seen their datasets being reused through their API to create applications. For example, "`Qui dit miam ! <https://quiditmiam.fr/>`_" and "Y'A D Frites!" are 2 applications that display the school canteen menu of French cities, Toulouse, Rennes, and Saint-Malo.
de: Diese APIs können beispielsweise dazu verwendet werden, um nach Datensätzen und Daten zu suchen, Analysen zu berechnen oder geografische Aggregationen durchzuführen. Ebenfalls entwicklerorientiert, jedoch konkretere Beispiele für den Einsatz von APIs sind Anwendungen als Daten-Weiterverwendungen. So wurden die Datensätze einiger Opendatasoft-Kunden über ihre API weiterverwendet, um neue Anwendungen zu entwickeln. So sind z.B. "`Qui dit miam ! <https://quiditmiam.fr/>`_" und "Y'A D Frites!" 2 Anwendungen, die die Menüs der Schulkantinen der französischen Städte Toulouse, Rennes und Saint-Malo anzeigen.

source: Important
de: Wichtig
nl: Belangrijk

source: Before using any of the available APIs, it is very important to be familiar with the nature of this data. Everything within the platform is built according to a tree structure (there are more types of data within the platform, but they are only relevant in very specific contexts). Opendatasoft can thus be seen as such:
de: Vor der Verwendung einer der verfügbaren APIs ist es sehr wichtig, mit der Art dieser Daten vertraut zu sein. Alles auf der Plattform ist nach einer Baumstruktur aufgebaut (es gibt mehre Datentypen auf der Plattform, aber sie sind nur in sehr spezifischen Kontexten relevant). Opendatasoft kann also folgendermaßen verstanden werden:

source: The Opendatasoft platform is a network of Opendatasoft portals.
de: Die Opendatasoft-Plattform ist ein Netzwerk aus mehreren Opendatasoft-Portalen.

source: A portal provides a catalog of all of its datasets.
de: Ein Portal stellt einen Katalog aller seiner Datensätze bereit.
nl: Een portaal biedt een catalogus van al zijn datasets.

source: Each dataset is defined by a dictionary of metadata, a data schema (specifying fields names and types), and a collection of records.
de: Jeder Datensatz wird durch ein Metadaten-Wörterbuch, ein Datenschema (das Feldnamen und -typen angibt) und eine Sammlung an Einträgen definiert.

source: Each record provides values for each of the dataset's fields.
de: Jeder Eintrag bietet Werte für jedes einzelne Datensatzfeld.
nl: Elk record biedt waarden voor elk van de velden van de dataset.

source: This ODS Search API is used internally by the Opendatasoft platform and widgets. To develop an application, we recommend using this API.
de: Die ODS Search API wird intern von der Opendatasoft-Plattform und den Widgets genutzt. Wir empfehlen diese API zur Entwicklung einer Anwendung.

source: There are currently 2 versions of the ODS Search API: the `v1 <https://help.opendatasoft.com/apis/ods-search-v1/>`_ and the `v2 <https://help.opendatasoft.com/apis/ods-search-v2/>`_, which is still under development. Listed below, the main differences between the 2 versions.
de: Derzeit gibt es 2 Versionen der ODS Search API: `v1 <https://help.opendatasoft.com/apis/ods-search-v1/>`_ und `v2 <https://help.opendatasoft.com/apis/ods-search-v2/>`_, die sich noch in der Entwicklung befindet. Nachfolgend sind die wichtigsten Unterschiede zwischen beiden Versionen aufgeführt.

source: The ODS Search API v2 introduces a better implementation of REST principles. Each API entry-point provides links to navigate between linked resources (HATEOAS) easily.
de: Die ODS Search API v2 bietet eine bessere Implementierung für REST-Prinzipien. Jeder API-Einstiegspunkt bietet Links zum einfachen Navigieren zwischen verlinkten Ressourcen (HATEOAS).

source: Key changes in the v2:
de: Wichtige Änderungen in v2:
nl: Belangrijkste wijzigingen in de v2:

source: A richer query language (ODSQL) is available, with new functions and arithmetic expressions.
de: Eine reichhaltigere Abfragesprache (ODSQL) mit neuen Funktionen und arithmetischen Ausdrücken

source: Special filters (such as geofilter and facet filters) are now directly integrated to ODSQL, in the ``where`` parameter (i.e ``geofilter.distance='42,1,100'`` is replaced by ``where=distance(geo_field,geom'Point(42 1)',100)``).
de: Spezielle Filter (wie Geofilter oder Facet-Filter) sind direkt in der ODSQL integriert, und zwar im "Where"-Parameter (so wird z.B. "geofilter.distance='42,1,100'" ersetzt durch "where=distance(geo_field,geom'Point(42 1)',100)").

source: The aggregation API (former analyze API) now shares the same structure and ODSQL language as the Search API. It is available on both the catalog (to aggregate datasets) and the dataset (to aggregate records) APIs.
de: Die Aggregations-API (früher Analyse-API) hat die gleiche Struktur und ODSQL-Sprache wie die Search API. Sie ist im Katalog (zur Aggregation von Datensätzen) und den Datensatz-APIs (zur Aggregation von Einträgen) verfügbar.

source: Exporters have their own entry-point under ``/api/catalog/exports`` and ``/api/catalog/datasets/<dataset_id>/exports``.
de: Die Exporter haben ihren eigenen Einstiegspunkt unter `/api/catalog/exports`` und ``/api/catalog/datasets/<dataset_id>/exports``.

source: Navigation search (former facet search) and standard search are completely separated.
de: Die Navigationssuche (früher Facet-Suche) und die Standardsuche sind komplett getrennt.

source: The `Triple Pattern Fragments (TPF) API <https://help.opendatasoft.com/apis/tpf/>`_ enables dataset querying in Resource Description Framework (RDF) format. This work is still in progress and is part of a Ph.D. that aims to improve Opendatasoft datasets quality using semantic web technologies.
de: Die `Triple Pattern Fragments (TPF) API <https://help.opendatasoft.com/apis/tpf/>`_ ermöglicht die Abfrage von Datensätzen im Resource Description Framework (RDF) Format. Die Arbeit an diesem Projekt läuft noch und ist Teil einer Dissertation, die das Ziel verfolgt, die Qualität der Datensätze von Opendatasoft unter Einsatz von semantischen Web-Technologien zu verbessern.

source: OData, WFS, and CSW
de: OData, WFS und CSW

source: OData, WFS, and CSW refer to other standards implemented by the platform. We recommend to users who are not familiar with these 3 APIs to stick to the ODS Search API since it provides the most comprehensive access to the data.
de: OData, WFS und CSW beziehen sich auf weitere Standards, die von der Plattform implementiert werden. Nutzer, die nicht mit diesen Standards nicht vertraut sind, sollten bei der ODS Search API bleiben, da sie den umfassendsten Zugang zu den Daten bietet.

source: `OData <https://help.opendatasoft.com/apis/odata/>`_ is a standard for REST APIs that provides a common language to be used across APIs to perform requests. The trade-off for this norm's generic approach is its higher complexity compared to traditional custom REST APIs. Opendatasoft has implemented this norm for the simple operations (searching for datasets and records); for the more complex ones (analysis, aggregations, geographic computations, etc.), use our Search APIs (v1 and v2).
de: `OData <https://help.opendatasoft.com/apis/odata/>`_ ist ein Standard für REST-APIs, der eine gemeinsame, API-übergreifende Sprache zur Durchführung von Anfragen bietet. Der generische Ansatz dieser Norm hat zugleich eine höhere Komplexität im Vergleich zu herkömmlichen REST-APIs. Opendatasoft hat diese Norm für einfache Vorgänge (Suche nach Datensätzen und Einträgen) implementiert; für komplexere Vorgänge (wie Analysen, Aggregationen, geografische Berechnungen,...) sollten Sie unsere ODS Search APIs (v1 und v2) verwenden.

source: `WFS <https://help.opendatasoft.com/apis/wfs/>`_ and `CSW <https://help.opendatasoft.com/apis/csw/>`_ are standards focusing on geographic data. They are especially relevant, for example, to interface the platform with other GIS software.
de: `WFS <https://help.opendatasoft.com/apis/wfs/>`_ und `CSW <https://help.opendatasoft.com/apis/csw/>`_ sind Standards, die sich auf geografische Daten konzentrieren. Sie sind daher besonders wichtig, falls Sie die Plattform mit weiterer GIS-Software koppeln möchten.

source: To know more about what APIs are and why and how they are used, you can read the article "`You don’t need analogies to understand APIs <https://kitchen.opendatasoft.com/you-dont-need-analogies-to-understand-apis-14da4513f970>`_" written by one of our OpenDataSoft developers.
nl: Om meer te weten te komen over wat API's zijn en waarom en hoe ze worden gebruikt, kunt u het artikel "`You don’t need analogies to understand APIs <https://kitchen.opendatasoft.com/you-dont-need-analogies-to-understand-apis-14da4513f970>`_" lezen dat geschreven is door een van onze OpenDataSoft-ontwikkelaars.

source: OpenDataSoft provides access to 6 APIs, that can be put into 3 categories:
nl: OpenDataSoft verschaft toegang tot 6 API's, die in 3 categorieën kunnen worden ondergebracht:

source: `ODS Search API v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ and `ODS Search API v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_: OpenDataSoft's own APIs, used internally by the platform and the `ODS widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_
nl: `ODS Search API v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ en `ODS Search API v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_: de eigen API's van OpenDataSoft die intern door het platform worden gebruikt, en de `ODS widgets <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_

source: `Triple Pattern Fragments API <https://docs.opendatasoft.com/api/explore/tpf.html>`_: ODS API for triple pattern querying over datasets from OpenDataSoft portals
nl: `Triple Pattern Fragments API <https://docs.opendatasoft.com/api/explore/tpf.html>`_: ODS API voor drievoudige patronen die zoeken naar datasets uit OpenDataSoft-portalen

source: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_, `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ and `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_, 3 standard protocols supported and provided by OpenDataSoft
nl: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_, `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ en`CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_, 3 standaard protocollen die ondersteund en verschaft worden door OpenDataSoft

source: These APIs can be used, for example, to search for datasets and data, to compute analysis or to perform geographic aggregations. Still developer-oriented, but for more concrete examples of what can be done with APIs: applications as data reuses. Some of OpenDataSoft customers have indeed seen their datasets being reused through their API, to create applications (i.e. `Qui dit miam ! <http://quiditmiam.fr/>`_ and `Y'A D Frites! <https://www.opendatasoft.fr/2016/10/17/y-a-d-frites-application-avec-de-lopen-data-dedans/>`_ 2 applications that display the school canteen menu of French cities, Toulouse, Rennes and Saint-Malo).
nl: Deze API's kunnen bijvoorbeeld gebruikt worden om te zoeken naar datasets en data om analyses te berekenen of om geografische optellingen uit te voeren. Deze zijn nog altijd ontwikkelaargericht, maar voor meer concrete voorbeelden van wat gedaan worden met API's: applicaties als hergebruiken van data. Sommige van de klanten van OpenDataSoft hebben inderdaad gezien dat hun datasets via hun API worden hergebruikt om applicaties aan te maken (bijv. `Qui dit miam ! <http://quiditmiam.fr/>`_ 2 applicaties die het menu in de schoolkantine van Franse steden, Toulouse, Rennes en Saint-Malo weergeven).

source: Before using any of the available APIs, it is very important to be familiar with the nature of this data. Everything within the platform is built according to a tree structure (there are of course more types of data within the platform, but they are only relevant in very specific contexts). OpenDataSoft can thus be seen as such:
nl: Alvorens een van de beschikbare API's te gebruiken, is het belangrijk om vertrouwd te zijn met de aard van deze data. Alles binnen het platform is opgebouwd volgens een boomstructuur (er zijn natuurlijke meerdere soorten data binnen het platform, maar deze zijn enkel relevant in zeer specifieke contexten). Bijgevolg kan OpenDataSoft gezien worden als volgt:

source: The OpenDataSoft platform is a network of OpenDataSoft portals.
nl: Het OpenDataSoft-platform is een netwerk van OpenDataSoft-portalen.

source: Each dataset is defined by a dictionary of metadata, a data schema (specifying fields names and types) and a collection of records.
nl: Elke dataset wordt gedefinieerd door een woordenboek van metadata, een dataschema (waarin veldnamen en -types worden gespecificeerd) en een verzameling van records.

source: This ODS Search API is used internally by the OpenDataSoft platform and widgets. To develop an application, we recommand using this API.
nl: Deze ODS Search-API wordt intern gebruikt door het OpenDataSoft-platform en widgets. Om een applicatie te ontwikkelen, raden we aan om deze API te gebruiken.

source: There are currently 2 versions of the ODS Search API: the `v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ and the `v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_ which is still under development. Listed below, the main differences between the 2 versions.
nl: Er bestaan momenteel 2 versies van de ODS Search API: de `v1 <https://docs.opendatasoft.com/api/explore/v1.html>`_ en de `v2 <https://docs.opendatasoft.com/api/explore/v2.html>`_ die nog steeds in ontwikkeling is. Hieronder vindt u een overzicht van de belangrijkste verschillen tussen de 2 versies.

source: The ODS Search API v2 introduces a better implementation of REST principles. Each API entry-point provides links to easily navigate between linked resources (HATEOAS).
nl: De ODS Search API v2 introduceert een betere implementatie van REST-principes. Elk API-instappunt biedt koppelingen om gemakkelijk te kunnen navigeren tussen gekoppelde bronnen (HATEOAS).

source: a more complete query language (ODSQL) is available, with new functions and arithmetic expressions
nl: er is een meer volledige zoektaal (ODSQL) beschikbaar met nieuwe functies en wiskundige uitdrukkingen

source: special filters (such as geofilter and facet filters) are now directly integrated to ODSQL, in the ``where`` parameter (i.e ``geofilter.distance='42,1,100'`` is replaced by ``where=distance(geo_field,geom'Point(42 1)',100)``)
nl: speciale filters (zoals een geofilter en facet filters) zijn nu rechtstreeks geïntegreerd in ODSQL. In de parameter "waar" (d.i. ``geofilter.distance='42,1,100'`` wordt vervangen door ``where=distance(geo_field,geom'Point(42 1)',100)``)

source: the aggregation API (former analyze API) now shares the same structure and ODSQL language as the Search API, and is available on both the catalog (to aggregate datasets) and the dataset (to aggregate records) APIs
nl: de samenvoeg-API (vroeger analyseer-API) deelt nu dezelfde structuur en ODSQL-taal als de Search API en is voor beide catalogi beschikbaar (om datasets samen te voegen) en de dataset-API's (om records samen te voegen)

source: exporters have their own entry-point under ``/api/catalog/exports`` and ``/api/catalog/datasets/<dataset_id>/exports``
nl: exporteurs hebben hun eigen instappunt onder ``/api/catalog/exports`` en ``/api/catalog/datasets/<dataset_id>/exports``

source: navigation search (former facet search) and standard search are completely splitted
nl: Navigation Search (vroeger Facet Search) en Standaard Search zijn volledig van elkaar gesplitst

source: The `Triple Pattern Fragments (TPF) API <https://docs.opendatasoft.com/api/explore/tpf.html>`_ enables dataset querying in Resource Description Framework (RDF) format. This work is still in progress and is part of a PhD that aims to improve OpenDataSoft datasets quality using semantic web technologies.
nl: De `Triple Pattern Fragments (TPF) API <https://docs.opendatasoft.com/api/explore/tpf.html>`_ biedt de mogelijkheid om datasets te zoeken in Resource Description Framework (RDF) formaat. Dit werk is nog steeds bezig en is onderdeel van een Phd die erop gericht is om de kwaliteit van OpenDataSet-datasets te verbeteren door gebruik te maken van semantische internettechnologieën.

source: OData, WFS and CSW
nl: OData, WFS en CSW

source: OData, WFS and CSW refer to other standards implemented by the platform. We recommand to users who are not familiar with these 3 APIs to stick to the ODS Search API since it provides the most comprehensive access to the data.
nl: OData, WFS en CSW verwijzen naar andere normen die gehanteerd worden door het platform. We raden gebruikers, die niet met deze 3 API's vertrouwd zijn, om de ODS Search API te blijven gebruiken aangezien deze de meest volledige toegang tot de data biedt.

source: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_: standard for REST APIs that provides a common language to be used across APIs to perform requests. The trade-off for this norm's generic approach is its higher complexity compared to traditional custom REST APIs. OpenDataSoft has implemented this norm for the simple operations (searching for datasets and records) ; for the more complex ones (analysis, aggregations, geographic computations etc.) our ODS Search APIs (v1 and v2) must be used.
nl: `OData <https://docs.opendatasoft.com/api/explore/odata.html>`_: standaard voor REST API's die een gemeenschappelijke taal bieden die in alle API's gebruikt kan worden om zoekopdrachten uit te voeren. De trade-off voor de generische aanpak van deze norm is zijn grotere complexiteit in vergelijking met traditionele gewone REST API's. OpenDataSoft heeft deze norm gehanteerd voor de eenvoudige operaties (zoeken naar datasets en records); voor de meer complexe operaties (analyse, samenvoegingen, geografische berekeningen, enz.) moet onze ODS Search APIs (v1 en v2) worden gebruikt.

source: `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ and `CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_: standards focusing on geographic data. They are especially relevant for example to interface the platform with other GIS software.
nl: `WFS <https://docs.opendatasoft.com/api/explore/wfs.html>`_ en`CSW <https://docs.opendatasoft.com/api/explore/csw.html>`_: normen die gefocust zijn op geografische data. Deze zijn vooral relevant voor bijvoorbeeld de interface met het platform met andere GIS-software.
