Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/theme.po
Languages: de, es, fr, nl

source: Customizing theme and portal icon
de: Anpassen von Thema und Portal-Icon
es: Personalizar el tema y el icono del portal
fr: Personnaliser le thème et l'icône du portail
nl: Het pictogram van het thema en van het portaal personaliseren

source: The theme customization is not available on freemium domains (created through the `Try it for free <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ page on `OpenDataSoft's website <https://www.opendatasoft.com>`_). If your domain is a freemium domain and would like to get this theme feature, `email us! <sales@opendatasoft.com>`_
de: Die Theme-Anpassung ist nicht für Freemium-Domains verfügbar (erstellt mit Hilfe der Seite 'Kostenlos ausprobieren <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ auf der OpenDataSoft-Website <https://www.opendatasoft.com>`_). Falls Ihre Domain eine Freemium-Domain ist und Sie diese Themenfunktion haben möchten, mailen Sie uns einfach! <sales@opendatasoft.com>`_
es: La personalización de temas no está disponible en dominios freemium (creados a través de la página `Try it for free <https://www.opendatasoft.com/discover-opendatasoft-demo/>`_ del `sitio web de OpenDataSoft <https://www.opendatasoft.com>`_). Si su dominio es freemium y desea obtener esta función de temas, `¡escríbanos un correo electrónico! <sales@opendatasoft.com>`_
fr: La personnalisation du thème du portail n'est pas disponible sur les domaines freemium (domaines créés via la page `Essayez ODS <https://www.opendatasoft.com/fr/decouvrez-opendatasoft-demo/>`_ du `site d'OpenDataSoft <https://www.opendatasoft.com/fr/>`_). Si votre domaine est un domaine freemium mais que vous voudriez tout de même avoir la fonctionnalité de personnalisation de thème activée, `écrivez nous ! <sales@opendatasoft.com>`_
nl: Het personaliseren van thema's is niet beschikbaar voor freemium domeinen (aangemaakt via de pagina "Probeer gratis <https://www.opendatasoft.com/discover-opendatasoft-demo/> op de website van OpenDataSoft <https://www.opendatasoft.com>). Wanneer uw domein een freemium domein is en u zou deze themafunctie toch graag willen, stuur ons dan een e-mail! <sales@opendatasoft.com>

source: OpenDataSoft's theme management interface can be found in the domain back-office. In order to access it, you'll have to click the ``Look & feel`` section in the navigation bar and then on the ``theme`` link.
de: Die OpenDataSoft-Themenmanagement-Schnittstelle befindet sich im Back-Office der Domain. Um auf sie zuzugreifen, müssen Sie auf den ``Look & feel``-Abschnitt in der Navigationsleiste klicken und dann auf den Link ``Thema``.
es: La interfaz de administración de temas de OpenDataSoft se encuentra en el back office del dominio. Para acceder a ella, haga clic en la sección ``Apariencia`` de la barra de navegación y, a continuación, en el vínculo ``Tema``.
fr: L'interface de gestion de thèmes d'OpenDataSoft se trouve dans le back office du domaine. Pour y accéder, cliquez sur la section ``Apparence`` de la barre de navigation, puis sur le lien ``thème``.
nl: De interface van OpenDataSoft voor het beheren van thema's kan worden teruggevonden in de back-office van het domein. Om hier toegang toe te hebben, dient u te klikken op de sectie "Look & feel" in de navigatiebalk en vervolgens op de koppeling "thema".

source: In order to access the theme page, you'll need to be able to edit domain properties. See :doc:`Managing the Security of your Domain </managing_security/index>` for more details.
de: Um auf die Thema-Seite zu gelangen, müssen Sie in der Lage sein, die Domain-Eigenschaften zu bearbeiten. Weitere Details siehe Dokument: :doc:`Sicherheitsmanagement Ihrer Domain </managing_security/index>`.
es: Para acceder a la página del tema, deberá poder editar las propiedades del dominio. Consulte :doc:`Administrar la seguridad del dominio </managing_security/index>` para obtener más detalles.
fr: Pour accéder à la page des thèmes, vous devrez être autorisé à changer les propriétés du domaine. Voir :doc:`Gérer la sécurité de votre domaine </managing_security/index>` pour plus de détails.
nl: Om toegang te krijgen tot de themapagina, moet u de domeineigenschappen kunnen bewerken. Zie :doc:`De veiligheid van uw domein beheren </managing_security/index>` voor meer details.

source: Using the various forms available in this page, you'll be able to customize every aspect of your portal, from basic colors to making major changes in its layout.
de: Durch die Nutzung der verschiedenen Formulare auf dieser Seite können Sie jeden Aspekt Ihres Portals anpassen, von den Grundfarben bis hin zu weitreichenden Layout-Änderungen.
es: Con los diversos formularios disponibles en esta página, podrá personalizar todos los aspectos del portal, desde una opción básica como definir los colores hasta efectuar cambios relevantes en el diseño.
fr: À l'aide des différents formulaires de cette page, vous pourrez personnaliser tous les aspects de votre portail : changez simplement les couleurs ou modifiez totalement la disposition de celui-ci.
nl: Wanneer u de verschillende vormen gebruikt die beschikbaar zijn op deze pagina, zal u elk aspect van uw portaal kunnen personaliseren, van de basiskleuren tot het aanbrengen van grote wijzigingen aan de lay-out ervan.

source: Versioning
de: Versionierung
es: Control de versiones
fr: Création de versions différentes
nl: Versiebeheer

source: Before diving into the many ways to customize the portal's theme, it is very important to stress that everything you will do on this page is versioned. This is to say that your work has a version number assigned to it and you can at any moment create a new version. You'll always be working on the latest version (think of it as your working draft), but can make any version live (that is, apply it to your portal). Were you to make the latest version live, a new one would be created and would become your new working draft. Only the latest version can be edited; all previous ones are read-only.
de: Bevor Sie die zahlreichen Anpassungsmöglichkeiten des Portalthemas erkunden, sollte betont werden, dass alles, was Sie auf dieser Seite tun, versioniert wird. Das bedeutet, dass jedem Ihrer Arbeitsschritte eine Versionsnummer zugeordnet wird und Sie jederzeit eine neue Version erstellen können. Sie arbeiten dabei immer an der neuesten Version (sehen Sie sie als Ihren Arbeitsentwurf an), können jedoch jede beliebige Version live schalten (d. h. auf Ihr Portal anwenden). Sobald Sie die neueste Version live schalten, wird eine weitere erstellt, die wiederum zu Ihrem Arbeitsentwurf wird. Es kann jeweils nur die neueste Version bearbeitet werden, alle älteren sind schreibgeschützt.
es: Antes de adentrarnos en las muchas maneras de personalizar el tema del portal, es muy importante recalcar que todo lo que haga en esta página recibirá una asignación de versión. Es decir, se asignará un número de versión a su tarea, y en cualquier momento podrá crear una versión nueva. Siempre estará trabajando con la versión más reciente (entiéndase como un borrador de trabajo), pero podrá activar cualquier versión (o sea, aplicarla en el portal). Cuando active la última versión, se creará una nueva que pasará a ser el nuevo borrador de trabajo. Solo se puede editar la última versión; todas las anteriores son de solo lectura.
fr: Avant de s'intéresser aux nombreuses manières de personnaliser le thème du portail, il est primordial de comprendre que tout ce que vous ferez sur cette page générera une nouvelle version. En d'autres termes, un numéro de version est attribué à votre travail et vous pouvez en créer une version à tout moment. Vous travaillerez toujours sur la dernière version (considérez-la comme un brouillon), mais vous pouvez décider de mettre en ligne n'importe quelle version (c'est-à-dire, l'appliquer à votre portail). Si vous mettez la dernière version en ligne, une autre version sera créée et deviendra votre nouveau brouillon. Seule la dernière version peut être modifiée, toutes les autres versions sont en lecture seule.
nl: Alvorens dieper in te gaan op de verschillende manieren waarop u het thema van het portaal kan personaliseren, is het zeer belangrijk te benadrukken dat al wat u op deze pagina doet aan versiebeheer onderworpen is. Met andere woorden, aan uw werk wordt een versienummer toegekend en u kan op elk moment een nieuwe versie aanmaken. U werkt altijd aan de meest recente versie (beschouw het als de ontwerpversie van uw werk), maar kan elke versie live maken (m.a.w. deze toepassing op uw portaal). Indien u de meest recente versie live maakt, wordt een nieuwe aangemaakt en dit wordt dan uw nieuwe ontwerpversie van uw werk. Alleen de meest recente versie kan worden bewerkt. Alle vorige versies zijn alleen-lezen.

source: While working on the latest version, you can preview your changes by clicking the ``Preview`` button. This will open a new window containing your portal with the current version of the theme applied to it.
de: Während Sie an der neuesten Version arbeiten, können Sie Ihre Änderungen in der Vorschau ansehen, indem Sie auf die Schaltfläche "Vorschau" klicken. Daraufhin öffnet sich ein neues Fenster, das Ihr Portal mit der aktuellen Version des angewandten Portal-Themas zeigt.
es: Al trabajar con la última versión, puede obtener una vista previa de los cambios haciendo clic en el botón ``Vista previa``. Así se abrirá una ventana nueva que contiene el portal con la versión actual del tema aplicada.
fr: Pendant que vous travaillez sur la dernière version, vous pouvez afficher des aperçus de vos modifications en cliquant sur le bouton ``Aperçu``. Cela ouvrira une nouvelle fenêtre contenant votre portail avec la version actuelle du thème appliquée.
nl: Terwijl u aan de meest recente versie werkt, kan u de voorbeeldweergave zien van uw wijzigingen door op de knop "Voorbeeldweergave" te klikken. Hiermee wordt een nieuw venster geopend dat uw portaal bevat met de huidige versie van het thema dat erop is toegepast.

source: Only users able to edit the domain properties can preview the latest theme version. If you were to share the URL of the preview with other users, they won't see any difference in the live version.
de: Die Vorschau der neuesten Themenversion kann nur von Benutzern aufgerufen werden, die die Domain-Eigenschaften bearbeiten können. Wenn Sie die URL der Vorschau mit anderen Benutzern teilen, sehen diese keinen Unterschied in der Live-Version.
es: Solo los usuarios que puedan editar las propiedades del dominio podrán obtener una vista previa de la última versión del tema. Si comparte la dirección URL de la vista previa con otros usuarios, estos no verán ninguna diferencia en la versión activa.
fr: Seuls les utilisateurs habilités à modifier les propriétés du domaine peuvent créer des aperçus de la dernière version du thème. Même si vous partagez l'URL de l'aperçu avec d'autres utilisateurs, ils ne verront que la version qui est en ligne.
nl: Alleen gebruikers die de domeineigenschappen kunnen bewerken, kunnen een voorbeeldweergave zien van de meest recente versie van het thema. Indien u de URL van de voorbeeldweergave wil delen met andere gebruikers, zullen ze geen enkel verschil met de live versie zien.

source: You can preview the latest version of the theme at any moment and on any given page on the portal's front-office by adding the ``stage_theme=true`` parameter to the URL.
de: Sie können die neueste Themenversion jederzeit und auf jeder Seite des Front-Office des Portals in der Vorschau ansehen, indem Sie der URL den ``stage_theme=true`` Parameter hinzufügen.
es: Puede obtener una vista previa de la última versión del tema en cualquier momento y en cualquier página del front office del portal añadiendo el parámetro ``stage_theme=true`` a la dirección URL.
fr: Vous pouvez générer un aperçu de la dernière version du thème à tout moment et quelle que soit la page du bak office du portail en ajoutant le paramètre ``stage_theme=true`` à l'URL.
nl: U kan op elk moment en op elke welbepaalde pagina op de front-office van het portaal een voorbeeldweergave bekomen van de meest recente versie van het thema door het toevoegen van de parameter ``stage_theme=true`` aan de URL.

source: The version selector will tell you explicitly if you're working on the latest version or rather viewing a previous one, as well as which version is live.
de: Der Versionsselektor zeigt Ihnen genau an, ob Sie an der neuesten Version arbeiten oder eine ältere ansehen bzw. welche Version live geschaltet ist.
es: El selector de versión le indicará explícitamente si está trabajando con la última versión o está visualizando una anterior, y qué versión está activa.
fr: Le sélecteur de versions vous indiquera de manière explicite si vous travaillez sur la dernière version ou si vous visualisez une version précédente, et la version qui est en ligne.
nl: De versiekiezer zal u expliciet zeggen of u aan de meest recente versie werkt of eerder een vorige versie bekijkt, alsook welke versie live is.

source: Customization options
de: Anpassungsoptionen
es: Opciones de personalización
fr: Options de personnalisation
nl: Personalisatieopties

source: Layout options
de: Layout-Optionen
es: Opciones de diseño
fr: Options de disposition
nl: Lay-outopties

source: The portal layout relies on a 12-column grid system largely inherited from the `Bootstrap CSS framework <http://getbootstrap.com/css/#grid>`_ and as such has a few internal variables used throughout its CSS. This tab allows you to set the value of some of these variables.
de: Das Portal-Layout beruht auf einem 12-Spalten-Rastersystem, das in großen Teilen aus dem 'Bootstrap CSS Framework <http://getbootstrap.com/css/#grid>`_ übernommen wurde und an und für sich wenige interne Variablen besitzt, die über sein ganzes CSS hinweg verwendet werden. Mithilfe dieses Tabs können Sie den Wert von einigen dieser Variablen einstellen.
es: El diseño del portal utiliza un sistema de cuadrícula de 12 columnas ampliamente heredado del `marco CSS de Bootstrap <http://getbootstrap.com/css/#grid>`_ y como tal tiene algunas variables internas que se utilizan en código CSS. Esta ficha permite establecer el valor de algunas de estas variables.
fr: La disposition du portail repose sur une grille à 12 colonnes s'inspirant grandement du `framework Bootstrap CSS <http://getbootstrap.com/css/#grid>`_ et inclut donc quelques variables internes utilisées via ses CSS. Cet onglet vous permet de définir la valeur de certaines de ces variables.
nl: De lay-out van het portaal berust op een rastersysteem dat uit 12 kolommen bestaat en dat geërfd werd van het `Bootstrap CSS kader <http://getbootstrap.com/css/#grid>`_ en heeft als dusdanig een aantal interne variabelen die in haar CSS worden gebruikt. Dit tabblad laat u toe om de waarden van enkele van deze variabelen in te stellen.

source: The variables that can currently be overridden are the *gutter width* and the *responsive breakpoints*.
de: Die jetzt überschreibbaren Variablen sind die *Spaltenabstände* und die *responsiven Breakpoints*.
es: Las variables que actualmente se pueden sobrescribir son: *Ancho de margen interno* y *Puntos de interrupción con respuesta*.
fr: Les variables pouvant actuellement être écrasées sont la *largeur des espacements* et les *points de rupture responsive*.
nl: De variabelen die momenteel genegeerd kunnen worden, zijn de "spatiebreedte" en de "responsieve breekpunten".

source: The *gutter width* is the space between columns, rows and adjacent boxes.
de: Bei den *Spaltenabständen* handelt es sich um die Abstände zwischen Spalten, Zeilen und benachbarten Boxen.
es: *Ancho de margen interno* es el espacio entre columnas, filas y cuadros adyacentes.
fr: La *largeur des espacements* correspond à l'espace qui sépare les colonnes, les lignes et les cadres adjacents.
nl: De "spatiebreedte" is de ruimte tussen kolommen, rijen en aanpalende vakjes.

source: The *responsive breakpoints* are the screen widths (in pixels) at which the layout will change to better accommodate the available space. There are 4 modes available: extra-small , small , medium and large, which means that there are 3 breakpoints: extra-small to small, small to medium and medium to large. The modes are also commonly referred to as *mobile*, *tablet*, *desktop* and *large desktop*.
de: Bei den *responsiven Breakpoints* handelt es sich um die jeweiligen Bildschirmbreiten (in Pixeln), ab denen sich das Layout verändert, um sich besser an das zur Verfügung stehende Platzangebot anzupassen. Es stehen 4 Modi zur Verfügung: extra-klein, klein, mittel und groß, d. h. es sind 3 Breakpoints möglich: von extra-klein zu klein, vom klein zu mittel und von mittel zu groß. Diese Modi entsprechen allgemein auch den Kategorien *Mobiles Endgerät*, *Tablet*, *Desktop* und *großer Desktop*.
es: *Puntos de interrupción con respuesta* indica los anchos de pantalla (en píxeles) en que el diseño cambiará para organizar mejor el espacio disponible. Hay 4 modos (muy pequeño, pequeño, mediano y grande), lo que significa que hay 3 puntos de interrupción: de muy pequeño a pequeño, de pequeño a mediano, y de mediano a grande. Los modos también se conocen como *móvil*, *tableta*, *escritorio* y *escritorio grande*.
fr: Les *points de rupture responsive* sont les largeurs d'écran (en pixels) qui déclenchent un changement de disposition pour mieux correspondre à l'espace disponible. Quatre modes sont disponibles : très petit, petit, moyen et grand. Cela veut donc dire qu'il y a trois points de rupture : de très petit à petit, de petit à moyen et de moyen à grand. Ces modes sont également appelés *téléphone*, *tablette*, *moniteur* et *grand moniteur*.
nl: De "responsieve breekpunten" is de breedte van het scherm (in pixels) op basis waarvan de lay-out een aanpassing zal doorvoeren om de beschikbare ruimte beter te benutten. Er zijn 4 beschikbare modi: extra smal, smal, middelgroot en groot. Dit betekent dat er 3 breekpunten zijn: extra smal tot smal, small tot middelgroot en middelgroot tot groot. Naar de modi wordt ook gebruikelijk verwezen als "mobiel", "tablet", "desktop" en "grote desktop".

source: Bear in mind though that *mobile mode* doesn't mean that the user is actually using a mobile device, but rather that the browser on the device only offers a small display area.
de: Denken Sie jedoch daran, dass der *mobile Modus* nicht bedeutet, dass der Benutzer momentan ein mobiles Gerät verwendet, sondern dass der Browser auf dem Gerät nur ein kleines Anzeigefeld bietet.
es: No obstante, tenga presente que el *modo móvil* no significa que el usuario realmente utilice un dispositivo móvil, sino que el explorador del dispositivo ofrece una área de visualización pequeña.
fr: Gardez à l'esprit que le *mode téléphone* ne signifie pas que l'utilisateur utilise un téléphone, mais que l'espace d'affichage disponible dans le navigateur de l'appareil est restreint.
nl: Denk er wel aan dat "mobiele modus" niet betekent dat de gebruiker effectief een mobiel toestel gebruikt, maar wel dat de browser op het toestel enkel een kleine weergaveruimte biedt.

source: In order to reset any of the variable to its default value, just click on the clear button next to it.
de: Zum Zurücksetzen einer Variable auf ihren Standardwert klicken Sie einfach auf die Löschen-Schaltfläche neben ihr.
es: Para restablecer el valor predeterminado de alguna variable, basta con hacer clic en el botón de borrar que aparece a su lado.
fr: Pour réinitialiser une variable, il vous suffit de cliquer sur le bouton effacer qui se trouve à côté.
nl: Om welke variabele dan ook opnieuw in te stellen naar de standaardwaarde ervan, hoeft u enkel op de knop "wissen" ernaast klikken.

source: Colors
de: Farben
es: Colores
fr: Couleurs
nl: Kleuren

source: As with layout options, the OpenDataSoft platform relies on a handful of color variables for the style of the portal elements. You can use the color inputs on this tab to set some of theme. This way with just a few clicks you can brand your portal to your colors.
de: Wie bei den Layout-Optionen beruht die OpenDataSoft-Plattform auf mehreren Farbvarianten für den Stil der Portalelemente. Sie können die Farbeingaben an diesem Tab verwenden, um einige von ihnen einzustellen. So können Sie mit nur wenigen Klicks Ihr Portal in den eigenen Farben gestalten.
es: Al igual con las opciones de diseño, la plataforma OpenDataSoft utiliza diversas variables de color para el estilo de los elementos del portal. Puede usar las entradas de color de esta ficha para establecer parte del tema. De este modo, con unos simples clics, puede personalizar la marca del portal de acuerdo con sus colores.
fr: Comme pour les options de disposition, la plateforme OpenDataSoft utilise quelques variables de couleur pour le style des éléments du portail. Vous pouvez utiliser les entrées de couleur de cet onglet pour en définir certaines et ainsi personnaliser votre portail aux couleurs de votre marque en quelques clics.
nl: Net zoals bij de lay-outopties, berust het OpenDataSoft-platform op een handvol kleurvariabelen voor de stijl van de portaalelementen. U kan de kleurinput op dit tabblad gebruiken om sommige van de thema's in te stellen. Hiermee kan u met slechts enkele muisklikken uw portaal voorzien van uw eigen kleuren.

source: These variables will override the default theme's colors. The custom style rules you can write in the stylesheet tab will however have precedence over these colors. Which means that your color choices may not be visible if you wrote more specific CSS rules.
de: Diese Variablen überschreiben die Standard-Themenfarben. Die benutzerdefinierten Stilregeln, die Sie in das Stylesheet schreiben können, haben diesen Farben gegenüber jedoch Vorrang. Das bedeutet, dass Ihre gewählten Farben möglicherweise nicht sichtbar sind, wenn Sie spezifischere CSS-Regeln festgelegt haben.
es: Estas variables sobrescribirán los colores del tema predeterminado. Sin embargo, las reglas de estilo personalizadas que usted puede escribir en la ficha de hoja de estilos tendrán prioridad frente a estos colores. Esto significa que sus opciones de color tal vez no estén visibles si ha escrito reglas CSS más específicas.
fr: Ces variables écraseront les couleurs du thème par défaut, mais les règles de style personnalisées que vous pouvez indiquer dans l'onglet feuille de style resteront prioritaires sur celles-ci. Vos choix de couleurs peuvent donc rester invisibles si vous avez spécifié des règles CSS plus précises.
nl: Deze variabelen heffen de kleuren van het standaardthema op. De aanpasbare stijlregels die in het tabblad "stijlblad" kan noteren, zullen evenwel voorrang hebben op deze kleuren. Dit betekent dat uw kleurkeuzes mogelijk niet zichtbaar zijn indien u meer specifieke CSS-regels hebt genoteerd.

source: Stylesheet
es: Hoja de estilos
fr: Feuille de style
nl: Stijlblad
