Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/theme.po
Languages: de, es, fr, nl

source: For federated datasets only, the original title of the dataset on its source domain
de: Der Original-Titel des Datensatzes an seiner Quelldomain, nur für verbundene Datensätze
es: Solo para los juegos de datos federados, título original del juego de datos en su dominio de origen.
fr: Pour les jeux de données fédérés uniquement, le titre d'origine du jeu de données sur son domaine source
nl: Enkel voor samengevoegde datasets, de oorspronkelijke titel van de dataset op het brondomein ervan

source: For federated datasets only, the original identifier of the dataset on its source domain
de: Der Originalbezeichner des Datensatzes an seiner Quell-Domain, nur für verbundene Datensätze
es: Solo para los juegos de datos federados, identificador original del juego de datos en su dominio de origen.
fr: Pour les jeux de données fédérés uniquement, l'identifiant d'origine du jeu de données sur son domaine source
nl: Enkel voor samengevoegde datasets, de oorspronkelijke identifier van de dataset op het brondomein ervan

source: Number of data downloads for this dataset
de: Anzahl der Daten-Downloads für diesen Datensatz
es: Número de descargas de datos para este juego de datos.
fr: Nombre de téléchargements de données pour ce jeu de données
nl: Aantal downloads van data voor deze dataset

source: Offline development
de: Offline-Entwicklung
es: Desarrollo sin conexión en línea
fr: Développement hors connexion
nl: Offline ontwikkeling

source: We've seen in the previous section that you can write detailed CSS rules that will override the portal's default theme. However, writing it all in the browser can become tedious, especially for seasoned developers used to powerful text editors. Since it only accepts pure CSS, you will have to manually ensure that your rules are correctly vendor-prefixed and won't be able to use the features frontend developers are accustomed to with pre-processors such as variables and nesting.
de: Im letzten Abschnitt haben wir gesehen, dass Sie detaillierte CSS-Regeln schreiben können, die das Standard-Thema des Portals überschreiben können. Es kann jedoch mühsam sein, sie alle in den Browser zu schreiben, insbesondere für Gelegenheitsentwickler, die leistungsstarke Text-Editoren gewohnt sind. Da nur reines CSS akzeptiert wird, müssen Sie von Hand sicherstellen, dass Ihre Regeln korrekt mit den Anbieter-Präfixen versehen sind und keine der gewöhnlichen Funktionen für Frontend-Entwickler nutzen (etwa Preprozessoren wie Variablen oder Verschachtelungen) .
es: En la sección anterior hemos visto que puede escribir reglas CSS detalladas que sobrescribirán el tema predeterminado del portal. Sin embargo, la tarea de escribir en el explorador puede resultar tediosa, sobre todo para los desarrolladores veteranos habituados a potentes editores de texto. Dado que solo se admite CSS puro, tendrá que verificar manualmente que las reglas lleven antepuesto un prefijo de proveedor adecuado y no podrá usar las funciones que los desarrolladores del front end emplean habitualmente con los preprocesadores, como variables y anidamientos.
fr: Nous avons vu dans la section précédente que vous pouvez écrire des règles CSS détaillées qui remplaceront le thème par défaut du portail. Néanmoins, tout rédiger dans le navigateur peut se révéler pénible, en particulier pour les développeurs aguerris habitués à utiliser des éditeurs de texte sophistiqués. Étant donné que la plateforme accepte uniquement du code CSS pur, vous devrez vous assurer manuellement que vos règles comportent les préfixes fournisseur corrects et qu'elles ne permettront pas l'utilisation de fonctionnalités que les développeurs d'applications client sont habitués à employer avec des pré-processeurs, telles que les variables et l'imbrication.
nl: In de vorige sectie hebben we gezien dat u gedetailleerde CSS-regels kan schrijven waarmee het standaard thema van het portaal wordt opgeheven. Het schrijven ervan in de browser kan echter saai worden, vooral voor doorgewinterde ontwikkelaars die krachtige teksteditors gewend zijn. Aangezien het enkel zuivere CSS aanvaardt, zal u er handmatig moeten voor zorgen dat uw regels met een correcte prefix voor de vender zijn voorzien en zal u de functies, die frontend ontwikkelaars gewoon zijn, niet kunnen gebruiken voor pre-processoren, zoals variabelen en nesting.

source: For all these reasons, we've created an API enabling users with the theme API key to locally write their style rules using all the tools they want, and to just push the resulting CSS code to the platform. We've packaged a client to this API along with common tools (less preprocessor and autoprefixer) in the `OpenDataSoft Portal Development Kit <https://github.com/opendatasoft/ods-portal-devkit>`_.
de: Aus all diesen Gründen haben wir ein API erstellt, das es Benutzern ermöglicht, anhand des Themen-API-Schlüssels ihre Stilregeln lokal zu schreiben, dabei jedes beliebige Tool zu verwenden und den daraus resultierenden CSS-Code auf die Plattform zu pushen. Wir haben diesem API einen Client beigefügt sowie die üblichen Tools (ohne Preprozessor und Autoprefixer) im `OpenDataSoft Portal-Entwicklungskit <https://github.com/opendatasoft/ods-portal-devkit>`_.
es: Por todo ello, hemos creado una API que permite a los usuarios con la clave de API del tema escribir localmente sus reglas de estilo utilizando todas las herramientas que deseen y simplemente insertar el código CSS final en la plataforma. Hemos empaquetado un cliente para esta API junto con las herramientas frecuentes (preprocesador y autoprefijador de less) en el `OpenDataSoft Portal Development Kit <https://github.com/opendatasoft/ods-portal-devkit>`_.
fr: C'est précisément pour cela que nous avons créé une API qui permet aux utilisateurs possédant une clé d'API de thème de rédiger localement leurs propres règles de style avec les outils de leur choix. Il leur suffit ensuite de pousser le code CSS résultant sur la plateforme. Nous avons regroupé un client pour cette API, ainsi que des outils courants (moins de pré-processeurs et de préfixeurs automatiques) dans le `kit de développement du portail OpenDataSoft <https://github.com/opendatasoft/ods-portal-devkit>`_.
nl: Omwille van al deze redenen, hebben we een API gecreëerd die gebruikers in staat stelt om met de API-sleutel van het thema hun stijlregels lokaal te schrijven waarbij ze alle tools kunnen gebruiken die ze willen en enkel de hieruit voortvloeiende CSS-code naar het platform kunnen duwen. We hebben een klant voorzien van deze API, samen met vaak gebruikte tools (zonder de preprocesser en autoprefixer) in de Ontwikkelingskit van OpenDataSoft <https://github.com/opendatasoft/ods-portal-devkit>`_.

source: This ODS Portal DevKit is an open source project distributed for free on Github, feel free to download it and taylor it to your development workflow.
de: Dieses ODV-Portal Entw.kit ist ein Open-Source-Projekt, das kostenlos auf Github erhältlich ist. Sie können es einfach herunterladen und an Ihren Entwicklungs-Workflow anpassen.
es: El ODS Portal DevKit es un proyecto de código abierto distribuido gratuitamente en Github; descárgueselo y adáptelo con plena libertad a su flujo de trabajo de desarrollo.
fr: Le kit de développement du portail ODS est un projet open source distribué gratuitement sur Github, n'hésitez pas à le télécharger et à l'adapter à votre processus de développement.
nl: Deze ODS Portal DevKit is een open source project dat gratis verdeeld wordt op Github. Het staat u vrij deze te downloaden en deze aan te passen aan uw ontwikkelings-workflow.

source: Theme API key
de: Themen-API-Schlüssel
es: Clave de API del tema
fr: Clé d'API de thème
nl: API-sleutel van een thema

source: You can find the theme API key on the portal theme customization page. Just expand the *API key for offline development* section and copy the key.
de: Sie finden den Themen-API-Schlüssel auf der Portal-Themenanpassungsseite. Dazu einfach den Abschnitt *API-Schlüssel für die Offline-Entwicklung* ausklappen und den Schlüssel kopieren.
es: Puede encontrar la clave de API del tema en la página de personalización de temas del portal. Simplemente expanda la sección *Clave de API para desarrollo sin conexión en línea* y copie la clave.
fr: Vous trouverez la clé d'API de thème sur la page de personnalisation du thème du portail. Pour obtenir la clé, développez la section *Clé d'API pour le développement hors connexion* et copiez-la.
nl: U kan de API-sleutel van een thema terugvinden op de personaliseringspagina van het thema van het portaal. Vergroot enkel de sectie *API-sleutel voor offline ontwikkeling* en kopieer de sleutel.

source: By generating a new key, you'll also be revoking previous ones. As a result, developers using an old key won't be able to push their work to the platform. Just remember to forward the new key to each developer working on your portal's theme to ensure that development goes uninterrupted.
de: Durch das Generieren eines neuen Schlüssels verfallen die alten Schlüssel. Dadurch können Entwickler, die einen alten Schlüssel verwenden, ihre Arbeit nicht auf die Plattform pushen. Denken Sie also daran, jedem Entwickler, der an Ihrem Portalthema arbeitet, den neuen Schlüssel weiterzugeben, um sicherzugehen, dass die Entwicklung ohne Unterbrechung fortgesetzt werden kann.
es: Al generar una clave nueva, las anteriores quedan revocadas. Por consiguiente, los desarrolladores que utilicen una clave antigua no podrán insertar su trabajo en la plataforma. No olvide reenviar la clave nueva a cada uno de los desarrolladores que trabajan con el tema del portal para cerciorarse de que el desarrollo no se vea interrumpido.
fr: En générant une nouvelle clé, vous révoquerez les clés précédemment générées. Par conséquent, les développeurs utilisant une ancienne clé ne pourront plus pousser leur travail sur la plateforme. N'oubliez donc pas de transmettre la nouvelle clé à chaque développeur travaillant sur le thème de votre portail afin d'assurer une continuité optimale du développement.
nl: Wanneer u een nieuwe sleutel genereert, worden vorige sleutels herroepen. Als gevolg hiervan zullen ontwikkelaars, die een oude sleutel gebruiken, hun werk niet naar het platform kunnen duwen. Denk er alleen aan om de nieuwe sleutel door te sturen naar elke ontwikkelaar die aan het thema van uw portaal werkt om ervoor te zorgen dat de ontwikkeling ononderbroken verloopt.
