Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/customizing_look_and_feel/theme.po
Languages: de, es, fr, nl

source: If changing colors is not enough and you'd like make deeper changes, you'll have to write your own CSS. Luckily this tab enables you to input your own style rules. These will be applied on top of OpenDataSoft's default rules and have precedence over them.
de: Falls Ihnen die die Farbanpassung nicht reicht und Sie weiterreichende Änderungen vornehmen möchten, müssen Sie Ihr eigenes CSS schreiben. Mit diesem Tab können Sie ganz einfach Ihre eigenen Stilregeln eingeben. Sie kommen an oberster Stelle vor den OpenDataSoft-Standardregeln und haben Vorrang vor ihnen.
es: Si no le basta con cambiar los colores y desea efectuar cambios más significativos, tendrá que escribir su propio código CSS. Por suerte, esta ficha le permite especificar sus propias reglas de estilo. Estas se aplicarán sobre las reglas predeterminadas de OpenDataSoft y tendrán prioridad frente a ellas.
fr: Si la personnalisation des couleurs ne vous suffit pas et que vous souhaitez faire des changements plus poussés, vous devrez écrire vos propres CSS. Vous pouvez justement indiquer vos propres règles de style dans cet onglet. Ces règles s'appliqueront en sus des règles par défaut d'OpenDataSoft et prévalent sur celles-ci.
nl: Wanneer het wijzigen van de kleuren niet voldoende is en u graag ingrijpendere wijzigingen wil doorvoeren, moet u uw eigen CSS schrijven. Gelukkig stelt dit tabblad u in staat uw eigen stijlregels in te voeren. Deze zullen worden toegepast bovenop de standaard regels van OpenDataSoft en er voorrang op hebben.

source: If your customization uses specific images and fonts, you can upload them to the platform using the :doc:`assets management page <assets>`. You'll then be able to copy the assets URLs and paste them in your CSS code.
de: Falls Ihre benutzerspezifische Anpassung spezifische Bilder und Schriftarten enthält, können Sie diese auf die Plattform hochladen, indem Sie :doc:`assets management page <assets>` verwenden. Sie können nun die Anlagen-URLs kopieren und in Ihren CSS-Code einfügen.
es: Si la personalización utiliza imágenes y fuentes específicos, puede cargarlos en la plataforma por medio de la :doc:`página de administración de activos <assets>`. Después podrá copiar las direcciones URL de activos y pegarlas en su código CSS.
fr: Si vous souhaitez utiliser des images et des polices spéciales, vous pouvez les télécharger sur la plateforme via la :doc:`page de gestion des ressources <assets>`. Vous pourrez ensuite copier les URL de ces ressources et les coller dans votre code CSS.
nl: Indien bij uw personalisering specifieke afbeeldingen en lettertypes worden gebruikt, kan u deze uploaden naar het platform via het :doc:`pagina voor het beheer van eigenschappen <assets>`. Daarna kan u de URL's van de eigenschappen kopiëren en deze in uw CSS-code plakken.

source: To change the style of an element, you only have to find the element's class and change the desired CSS property. It won't have any side-effects (limited to this single class name) and is guaranteed to work (since the hierarchy tree is mostly flat).
de: Zum Ändern eines Elementstils müssen Sie lediglich die Elementklasse herausfinden und die gewünschte CSS-Eigenschaft ändern. Dies hat keine unerwünschten Nebeneffekte (im Rahmen dieses einzelnen Klassennamens) und funktioniert garantiert (da der Hierarchiebaum meist flach ist).
es: Para cambiar el estilo de un elemento, solo tiene que encontrar la clase del elemento y cambiar la propiedad CSS deseada. No hay efectos colaterales (salvo este nombre de clase único), y su funcionamiento está garantizado (dado que el árbol de jerarquía es prácticamente plano).
fr: Pour changer le style d'un élément, il vous suffit de trouver la classe de celui-ci et de modifier la propriété CSS souhaitée. Cette opération n'aura aucune autre répercussion (elle agit uniquement sur ce nom de classe) et fonctionne à tous les coups (car l'arborescence est majoritairement plate).
nl: Om de stijl van een element te wijzigen, hoeft u enkel de categorie van het element terugvinden en de gewenste CSS-eigenschap wijzigen. Dit heeft geen nevenwerkingen (beperkt tot enkel deze categorienaam) en werkt gegarandeerd (aangezien de hiërarchische treemap overwegend vlak is).

source: This is possible because all of OpenDataSoft's CSS code is written following the `BEM methodology <http://getbem.com/introduction/>`_ and prefixed with `ods-` so that they won't conflict with your own styles and can easily be overridden. You'll find a great introduction to this methodology on the ever-useful `CSS Tricks website <https://css-tricks.com/bem-101/>`_.
de: Dies ist möglich, weil der gesamte CSS Code von OpenDataSoft nach der 'BEM-Methodik' geschrieben <http://getbem.com/introduction/>`_ und mit dem Präfix `ods-` versehen ist, so dass sie nicht mit Ihren eigenen Styles in Konflikt geraten und ganz einfach überschrieben werden können. Eine umfassende Einführung zu dieser Methodik finden Sie auf der CSS-Tricks-Website <https://css-tricks.com/bem-101/>`_.
es: Esto es posible dado que todo el código CSS de OpenDataSoft está escrito según la `metodología BEM <http://getbem.com/introduction/>`_ y lleva antepuesto el prefijo `ods-` para que no entren en conflicto con sus propios estilos y puedan sobrescribirse fácilmente. Encontrará una excelente introducción de esta metodología en el siempre útil `sitio web CSS Tricks <https://css-tricks.com/bem-101/>`_.
fr: Tout cela est possible car l'intégralité du code CSS d'OpenDataSoft est écrit en suivant la `méthodologie BEM <http://getbem.com/introduction/>`_ et porte le préfixe `ods-` pour éviter les conflits avec vos styles et faciliter les remplacements. Une excellente introduction à cette méthode est disponible sur le `site Web très utile de CSS Tricks <https://css-tricks.com/bem-101/>`_.
nl: Dit is mogelijk omdat alle CSS-codes van OpenDataSoft geschreven worden volgens de `BEM-methodologie <http://getbem.com/introduction/>`_ en voorzien worden van een prefix `ods-` zodat ze niet conflicteren met uw eigen stijlen en gemakkelijk kunnen worden overheerst. U vindt een schitterende inleiding over deze methodologie op de altijd nuttige `CSS Tricks website <https://css-tricks.com/bem-101/>`_.

source: In short, class names are written as *block, element, modifier* (hence the BEM) `.ods-block[--blockmodifier][__element][--elementmodifier]`. The hierarchy tree is at most 2 selectors deep. Also, the relevant style is as close to the element as possible.
de: Mit einem Wort, Klassennamen werden als *Block, Element, Modifier* geschrieben (daher die Bezeichnung BEM) `.ods-block[--blockmodifier][__element][--elementmodifier]`. Der Hierarchiebaum ist maximal 2 Selektoren tief. Zudem ist der relevante Stil so nahe am Element wie möglich.
es: En resumen, los nombres de clases se escriben como *bloque, elemento, modificador* (de ahí, BEM) `.ods-bloque[--modificadorbloque][__elemento][--modificadorelemento]`. El árbol de jerarquía tiene como máximo 2 selectores de profundidad. Además, el estilo pertinente está lo más cerca posible del elemento.
fr: Pour faire simple, les noms des classes se présentent sous la forme *block, element, modifier* (donc BEM) `.ods-block[--blockmodifier][__element][--elementmodifier]`. L'arborescence ne comporte que deux sélecteurs au maximum et les styles sont au plus proche des éléments concernés.
nl: Kortom, categorienamen kunnen geschreven worden als *block, element, modifier* (vandaar dee BEM) `.ods-block[--blockmodifier][__element][--elementmodifier]`. De hiërarchische treemap is maximaal 2 selectors diep. Ook staat de relevante stijl zo dicht mogelijk bij het element.

source: Header and footer
de: Kopf- und Fußzeile
es: Encabezado y pie de página
fr: En-tête et pied de page
nl: Header en footer

source: While both header and footer can already be branded using the domain's customization section and color selection panel, organizations usually want to further customize the layout and content of these areas.
de: Sowohl die Kopfzeile als auch die Fußzeile können im Abschnitt Domain-Anpassung und Farbauswahl individuell gestaltet werden. Doch Firmen möchten meist auch das Layout und den Inhalt dieser Bereiche genauer anpassen.
es: Aunque es posible personalizar la marca tanto del encabezado como del pie de página a través del panel de selección del color y la sección de personalización del dominio, las organizaciones normalmente desean personalizar aún más el diseño y el contenido de estas áreas.
fr: L'en-tête et le pied de page peuvent déjà être personnalisés via la section personnalisation et au volet de sélection des couleurs du domaine, mais les entreprises désirent souvent s'approprier davantage la disposition et le contenu de ces zones.
nl: Hoewel zowel de header als de footer reeds gepersonaliseerd kunnen worden via de personaliseringssectie van het domein en het kleurenselectiepaneel, willen organisaties meestal de lay-out en de inhoud van deze gebieden nog verder personaliseren.

source: Both header and footer are wrapped within independent AngularJS applications, which means you can use `ng-if`, `ng-class`, `ng-show`, `ng-hide` and all of Angular's standard directives to make the areas more dynamic. One common request is to collapse the header into a *click-to-expand* side menu below a certain viewport width. For this purpose we provide the `ods-responsive-menu` directive. See :doc:`this dedicated page <responsive>` for more information.
de: Kopf- und Fußzeile sind in unabhängige AngularJS-Anwendungen eingebunden, d. h. Sie können `ng-if`, `ng-class`, `ng-show`, `ng-hide` sowie sämtliche Standardrichtlinien für Angular verwenden, um die Bereiche dynamischer zu gestalten. Eine der gängigen Anfragen ist die minimierte Anzeige der Kopfzeile in einem aufklappbaren Seitenmenü unterhalb einer bestimmten Breite des Anzeigebereichs. Zu diesem Zweck bieten wir die `ods-responsive-menu` Richtlinie. Weitere Informationen siehe :doc:`diese spezielle Seite <responsive>`.
es: El encabezado y el pie de página están envueltos dentro de aplicaciones AngularJS independientes, lo que significa que puede usar `ng-if`, `ng-class`, `ng-show`, `ng-hide` y todas las directivas Angular estándar para hacer que las áreas sean más dinámicas. Una solicitud frecuente es contraer el encabezado en un menú lateral de *hacer clic para expandir* por debajo de un ancho de ventanilla determinado. Con esta finalidad le proporcionamos la directiva `ods-responsive-menu`. Consulte :doc:`esta página específica <responsive>` para obtener más información.
fr: L'en-tête et le pied de page sont enveloppés dans des applications AngularJS indépendantes, ce qui signifie que vous pouvez utiliser `ng-if`, `ng-class`, `ng-show`, `ng-hide` et toutes les directives habituelles d'AngularJS pour rendre ces zones plus dynamiques. Une demande courante est de réduire l'en-tête dans un menu latéral de type *cliquer pour développer* en dessous d'une certaine largeur de viewport. Nous proposons la directive `ods-responsive-menu` pour répondre à ce besoin. Voir :doc:`cette page dédiée <responsive>` pour plus d'informations.
nl: Zowel de header als de footer zijn opgevouwen binnen zelfstandig werkende AngularJS-applicaties. Dit betekent dat u `ng-if`, `ng-class`, `ng-show`, `ng-hide` en alle standaardrichtlijnen van Angular kan gebruiken om deze gebieden dynamischer te maken. Eén vaak voorkomende aanvraag is om de header te verkleinen in een "click-to-expand" zijmenu onder een bepaalde viewportbreedte. Hiervoor voorzien we de `ods-responsive-menu` richtlijn. Zie :doc:`deze speciale pagina <responsive>` voor meer informatie.

source: We also provide placeholders that will be replaced with the content specified in the domain customization options such as menu items, language selectors and logos. The full list is displayed right above the code area.
de: Wir bieten zudem Platzhalter, die durch den in den Domain-Anpassungsoptionen spezifizierten Content ersetzt werden, wie etwa Menüpunkte, Sprachen-Selektoren und Logos. Die vollständige Liste wird direkt über dem Code-Bereich angezeigt.
es: También suministramos marcadores de posición que serán sustituidos por el contenido especificado en las opciones de personalización del dominio como elementos de menú, selectores de idioma y logotipos. La lista completa se visualiza justo encima del área de código.
fr: En outre, nous proposons des espaces réservés qui seront remplacés par le contenu choisi dans les options de personnalisation du domaine, comme les éléments du menu, les sélecteurs de langues et les logos. La liste complète est affichée juste au-dessus de la zone de code.
nl: We voorzien ook namen die vervangen zullen worden door de inhoud die gespecificeerd staat in de personaliseringsopties voor het domein, zoals menu-items, taalkiezers en logo's. De volledige lijst staat rechts boven de coderuimte weergegeven.

source: While you can take advantage of Angular within the header and footer, standard JS is still forbidden for security reasons.
de: Sie können Angular für die Kopf- und Fußzeile nutzen, das Standard JS ist jedoch aus Sicherheitsgründen noch nicht zulässig.
es: Si bien puede utilizar Angular en el encabezado y el pie de página, el código JS estándar sigue prohibido por motivos de seguridad.
fr: Même s'il est possible d'utiliser Angular dans l'en-tête et le pied de page, le JS standard reste interdit pour des raisons de sécurité.
nl: Hoewel u Angular kan gebruiken binnen de header en de footer, is standaard JS nog altijd verboden omwille van veiligheidsredenen.

source: Catalog card
de: Katalog-Karte
es: Tarjeta de catálogo
fr: Fiche de catalogue
nl: Cataloguskaart

source: On the catalog page of your domain, each dataset is represented by a single *catalog card*. These cards feature a few standard elements but you may want to radically change the way it looks, add new links or implement new behaviours.
de: Auf der Katalogseite Ihrer Domain wird jeder Datensatz durch eine eigene *Katalog-Karte* dargestellt. Diese Karten zeigen ein paar Standardelemente. Sie möchten jedoch eventuell ihr Aussehen komplett verändern, neue Links hinzufügen oder neue Verhalten implementieren.
es: En la página de catálogo del dominio, cada uno de los juegos de datos se representa por medio de una *tarjeta de catálogo*. Estas tarjetas presentan una serie de elementos estándar, pero puede que desee cambiar completamente su apariencia, añadir vínculos nuevos o implementar nuevos comportamientos.
fr: Sur la page de catalogue de votre domaine, chaque jeu de données est représenté par une *fiche de catalogue*. Ces fiches présentent quelques éléments standard, mais vous pouvez totalement changer leur apparence, ajouter des liens ou implémenter de nouveaux comportements.
nl: Op de cataloguspagina van uw domein, wordt elke dataset weergegeven door een enkele *cataloguskaart*. Deze kaart is voorzien van een aantal standaard elementen maar mogelijk wil u de manier waarop deze eruit ziet radicaal wijzigen, nieuwe koppelingen toevoegen of nieuwe gedragingen implementeren.

source: Here are a few examples of catalog cards:
de: Hier ein paar Beispiele für Katalog-Karten:
es: A continuación se muestran algunos ejemplos de tarjetas de catálogo:
fr: Voici quelques exemples de fiches de catalogue :
nl: Hier volgen enkele voorbeelden van cataloguskaarten:

source: We provide handy directives to easily retrieve and include any information relative to a dataset. These directives also come with a standard style that you can override using the *Stylesheet* tab.
de: Wir bieten praktische Richtlinien, um Informationen zu einem Datensatz einfach abrufen und einbinden zu können. Diese Richtlinien werden zusammen mit einem Standardstil angeboten, der mit dem *Stylesheet*-Tab überschrieben werden kann.
es: Proporcionamos prácticas directivas para recuperar e incluir fácilmente cualquier información acerca de un juego de datos. Estas directivas también se facilitan con un estilo estándar que podrá sobrescribir en la ficha *Hoja de estilos*.
fr: Nous fournissons des directives pratiques pour récupérer et inclure facilement des informations sur un jeu de données. Ces directives sont accompagnées d'un style standard que vous pouvez écraser via l'onglet *Feuille de style*.
nl: We voorzien handige richtlijnen om gemakkelijk informatie over een dataset terug te vinden en te integreren. Deze richtlijnen gaan ook gepaard met een standaard stijl die u kan opheffen door gebruik te maken van het tabblad "Stijlblad".

source: The directives are:
de: Die Richtlinien lauten folgendermaßen:
es: Las directivas son:
fr: Les directives sont les suivantes :
nl: De richtlijnen zijn:

source: `ods-catalog-card` must wrap the whole catalog card for the other directives to work.
de: `ods-catalog-card` muss die ganze Katalog-Karte umbrechen, damit die übrigen Richtlinien funktionieren.
es: `ods-catalog-card` debe envolver la tarjeta de catálogo completa para que las demás directivas funcionen.
fr: `ods-catalog-card` doit envelopper toute la fiche de catalogue pour que les autres directives fonctionnent.
nl: `ods-catalog-card` moet de volledige cataloguskaart omvatten opdat de andere richtlijnen kunnen werken.

source: `ods-catalog-card-theme-icon` will retrieve the dataset's theme and include the relevant icon.
de: `ods-catalog-card-theme-icon` ruft das Thema des Datensatzes auf und bindet das relevante Icon ein.
es: `ods-catalog-card-theme-icon` recuperará el tema del juego de datos e incluirá el icono correspondiente.
fr: `ods-catalog-card-theme-icon` récupère le thème du jeu de données et inclut l'icône pertinente.
nl: `ods-catalog-card-theme-icon` zoekt het thema van de dataset op en integreert het relevante pictogram.

source: `ods-catalog-card-body` provides useful style and behaviour handling edge cases (datasets without records, API proxy...).
de: `ods-catalog-card-body` bietet nützliche Randfälle für den Umgang mit Stil und Verhalten (Datensätze ohne Einträge, API Proxy...).
es: `ods-catalog-card-body` proporciona casos extremos de gran utilidad relacionados con el estilo y el comportamiento (juegos de datos sin registros, proxy de API...).
fr: `ods-catalog-card-body` offre des solutions pour mettre en forme et gérer les situations complexes (jeux de données sans enregistrements, proxy d'API, etc.).
nl: `ods-catalog-card-body` voorziet nuttige stijl- en gedragsregels (datasets zonder records, API-volmacht...).

source: `ods-catalog-card-title`, `ods-catalog-card-description` and `ods-catalog-card-keywords` are self-explanatory.
de: `ods-catalog-card-title`, `ods-catalog-card-description` und `ods-catalog-card-keywords` sind selbsterklärende Richtlinien.
es: `ods-catalog-card-title`, `ods-catalog-card-description` y `ods-catalog-card-keywords` son autoexplicativas.
fr: `ods-catalog-card-title`, `ods-catalog-card-description` et `ods-catalog-card-keywords` sont explicites.
nl: `ods-catalog-card-title`, `ods-catalog-card-description` en `ods-catalog-card-keywords` spreken voor zich.

source: `ods-catalog-card-metadata-item` takes an `item-key` and an `item-title` attributes, retrieve a metadata property matching the `item-key` from the dataset and includes in in the page using `item-title` as its label. It should be wrapped by a `.ods-catalog-card__metadata` element for better styling but with no obligation.
de: `ods-catalog-card-metadata-item` übernimmt ein `item-key` und ein `item-title` Attribut, ruft eine Metadaten-Eigenschaft ab, die mit dem `item-key` aus dem Datensatz übereinstimmt und bindet sie in die Seite ein, die den item-title` als Kennzeichen verwendet. Es sollte für einen optimalen Stil von einem `.ods-catalog-card__metadata` Element eingebunden werden, dies ist jedoch nicht verpflichtend.
es: `ods-catalog-card-metadata-item` toma un atributo `item-key` y un atributo `item-title` para recuperar una propiedad de metadatos coincidente con `item-key` del juego de datos e incluirla en la página utilizando `item-title` como etiqueta. Por una cuestión de estilo, se recomienda envolverla con un elemento `.ods-catalog-card__metadata` aunque no es obligatorio.
fr: `ods-catalog-card-metadata-item` prend des attributs `item-key` et `item-title`, récupère une propriété de métadonnées correspondant à `item-key` dans le jeu de données et l'inclut dans la page en utilisant `item-title` comme label. Pour améliorer le style, vous pouvez l'envelopper dans un élément `.ods-catalog-card__metadata`, mais ce n'est pas obligatoire.
nl: `ods-catalog-card-metadata-item` neemt een `item-key` en een `item-title` attribuut, zoekt een metadataeigenschap die overeenstemt met het `item-key` uit de dataset en integreert deze in de pagina met `item-title` als het label ervan. Het dient omwikkeld te worden door middel van een `.ods-catalog-card__metadata` element voor een betere styling maar zonder enige verplichting.

source: Metadata item keys
de: Metadaten Element-Key
es: Claves de elementos de metadatos
fr: Clés d'objet de métadonnées
nl: Metadata itemsleutels

source: Item key
de: Element-Key
es: Clave de elemento
fr: Clé d'objet
nl: Itemsleutel

source: Item title
de: Element-Titel
es: Título de elemento
fr: Titre de l'objet
nl: Titel van het item

source: license
de: Lizenz
es: licencia
nl: licentie

source: License (will be rendered as a link if possible)
de: Lizenz (wird als Link wiedergegeben, falls möglich)
es: Licencia (se presentará como vínculo si es posible).
fr: Licence (affichée sous forme de lien si possible)
nl: Licentie (zal indien mogelijk aangeleverd worden als een koppeling)

source: language
de: Sprache
nl: taal

source: Content language
de: Content-Sprache
es: Idioma del contenido.
fr: Langue du contenu
nl: Taal van de inhoud

source: modified
de: geändert
nl: gewijzigd

source: Date of last modification
de: Datum der letzten Änderung
es: Fecha de la última modificación.
fr: Date de dernière modification
nl: Datum van laatste wijziging

source: publisher
de: Veröffentlicher
nl: uitgever

source: Publisher's name
de: Veröffentlicher
es: Nombre del publicador.
fr: Nom du producteur
nl: Naam van de uitgever

source: references
de: Referenzen
nl: referenties

source: Link to the original source of the data
de: Link zur Original-Datenquelle
es: Vínculo con el origen de los datos original.
fr: Lien vers la source originale des données
nl: Koppeling naar de oorspronkelijke born van de data

source: Link to the ODI certificate
de: Link zum ODI-Zertifikat
es: Vínculo con el certificado ODI.
fr: Lien vers le certificat ODI
nl: Koppeling naar het ODI-certificaat

source: Number of records in the dataset (regardless of filters)
de: Anzahl Einträge im Datensatz (unabhängig von Filtern)
es: Número de registros del juego de datos (al margen de los filtros).
fr: Nombre d'enregistrements dans le jeu de données (indépendamment des filtres)
nl: Aantal records in de dataset (ongeacht filters)

source: attributions
de: Zuordnungen
nl: attributen

source: Names of the data owner
de: Namen der Dateneigentümer
es: Nombres del propietario de los datos.
fr: Noms des propriétaires des données
nl: Namen van de eigenaar van de data

source: For federated datasets only, the name of the domain the dataset comes from
de: Nur für verbundene Datensätze, der Domain-Name stammt aus
es: Solo para los juegos de datos federados, nombre del dominio del cual procede el juego de datos.
fr: Pour les jeux de données fédérés uniquement, le nom du domaine duquel provient le jeu de données
nl: Enkel voor samengevoegde datasets, de naam van het domein waar de dataset van afkomstig is
