Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/07_configuring_visualizations/06_configuring_custom_view/custom.po
Languages: de, es, fr, it, nl

source: Configuring the custom view
de: Konfigurieren der benutzerdefinierten Ansicht
es: Configurar la vista personalizada
fr: Configurer la vue personnalisée
it: Configurazione della visualizzazione personalizzata
nl: De aanpasbare weergave configureren

source: Standard views allow your users to dive further into your datasets, but they are tools. They do not provide additional context and do not highlight what you think are the key facts to take away. And while the *description* metadata adds a bit of context, it is limited to pure text.
de: Standardansichten ermöglichen Ihren Benutzern, tiefer in Ihre Datensätze vorzudringen. Sie sind jedoch Tools. Sie bieten keinen zusätzlichen Kontext und heben auch nicht die vermuteten und zu sammelnden wichtigen Fakten hervor. Anders als die Metadaten *Beschreibung* sind sie auf reinen Text (ohne Kontext) beschränkt.
es: Las vistas estándar permiten a los usuarios examinar con más detalle los juegos de datos, pero son herramientas. No proporcionan contexto adicional ni resaltan los que, en su opinión, son los hechos clave que debe retener. Además, si bien los metadatos de *descripción* aportan un poco de contexto, se limitan a puro texto.
fr: Les vues standards permettent à vos utilisateurs d'explorer en profondeur vos jeux de données mais ce ne sont que des outils. Ils ne fournissent pas de contexte à cette exploration de données et ne mettent pas en valeur ce que vous considérez comme les éléments clés à retenir de tel ou tel jeu de données. La métadonnée *description* permet de définir le contexte général mais est limitée à du texte.
it: Le visualizzazioni standard permettono all'utente di esaminare nel dettaglio i dataset, ma restano dei semplici strumenti. Non forniscono ulteriore contesto e non evidenziano quelli che tu consideri gli elementi chiave. Se, d'altro canto, i metadati della *descrizione* aggiungono un certo contesto, questi si limitano però al solo testo.
nl: Standaard weergaves laten uw gebruikers toe dieper te duiken in uw datasets maar het zijn tools. Ze verschaffen geen bijkomende context en beklemtonen niet wat u denkt dat de belangrijkste feiten zijn om weg te nemen. En hoewel de *omschrijving* metadata een beetje context toevoegen, is dit beperkt tot zuivere tekst.

source: The custom view is an additional tab that lives alongside the other tabs on the dataset's page. It is an empty space that you can use as you wish. An HTML and CSS editor enables you to write a dashboard as simple or as complex as you may want (for more information about writing beautiful dashboard, see the :doc:`dedicated documentation </creating_content/index>`) and you can even customize the title and icon of this additional tab.
de: Die benutzerdefinierte Ansicht ist eine zusätzliche Registerkarte neben den anderen Registerkarten der Datensatzseite. Es ist ein leerer Bereich, den Sie nach Belieben nutzen können. Mithilfe eines HTML- und CSS-Editors können Sie ein so einfaches oder so komplexes Dashboard erstellen, wie Sie möchten (weitere Infos zum Erstellen schöner Dashboards siehe die :doc:`entsprechende Dokumentation </creating_content/index>`). Zudem können Sie den Titel und das Symbol dieser zusätzlichen Registerkarte anpassen.
es: La vista personalizada es una ficha adicional que se encuentra junto a las demás fichas de la página del conjunto de datos. Es un espacio vacío que puede usar a discreción. Un editor de código HTML y CSS permite escribir un panel con el nivel de simplicidad o complejidad deseado (para obtener más información sobre cómo escribir un panel de formato bonito, consulte la :doc:`documentación específica </creating_content/index>`), e incluso puede personalizar el título y el icono de esta ficha adicional.
fr: La vue personnalisée est un onglet supplémentaire s'insérant au milieu des autres sur la page d'un jeu de données. Il s'agit d'un espace vide que vous pouvez utiliser comme bon vous semble. Un éditeur HTML et CSS vous permet d'écrire un tableau de bord aussi simple ou complexe que vous le voulez (pour plus d'informations sur comment écrire un tableau de bord, voir :doc:`la documentation dédiée </creating_content/index>`). Vous pouvez même personnaliser le titre et l'icône de cet onglet.
nl: De gepersonaliseerde weergave is een extra tabblad dat bestaat naast de andere tabbladen op de pagina van een dataset. Het is een eenvoudige ruimte die u kunt gebruiken indien u dit wenst. Een HTML- en CSS-editor laten u toe om een dashboard zo complex of zo eenvoudig als u wenst, te schrijven (voor meer informatie over het schrijven van mooie dashboards, zie de :doc:`speciaal daaraan gewijde documentatie </creating_content/index>`) en u kunt zelfs de titel en het pictogram van dit extra tabblad personaliseren.

source: The custom view editor
de: Der Editor der benutzerdefinierten Ansicht
es: Editor de vistas personalizadas
fr: L'éditeur de vue personnalisée
it: Editor della visualizzazione personalizzata
nl: De aanpasbare weergave-editor

source: Tab icon and title
de: Symbol und Titel des Registers
es: Título e icono de la ficha
fr: Icône et titre de l'onglet
it: Icona e titolo della scheda
nl: Pictogram en titel van het tabblad

source: The custom title and icon will show up within your catalog page on the related dataset's card, and you'll be able to search for datasets having a custom view set up with the *View* filter (select the *Custom view* option).
de: Benutzerdefinierte Titel und Symbole werden auf Ihrer Katalogseite auf der Karte des verbundenen Datensatzes angezeigt. Sie können auch mithilfe einer über den Filter *Ansicht* eingerichteten benutzerdefinierten Ansicht nach Datensätzen suchen (wählen Sie dazu die Option *Benutzerdefinierte Ansicht*).
es: El título y el icono personalizados aparecerán en la página de catálogo en la tarjeta del juego de datos en cuestión, y podrá buscar los juegos de datos que tengan una vista personalizada configurada con el filtro *Vista* (seleccione la opción *Vista personalizada*).
fr: Le titre et l'icône personnalisée apparaitront dans la page de catalogue, sur la carte du jeu de données concerné. Vous pourrez par ailleurs rechercher les jeux de données présentant une vue personnalisée grâce au filtre *Vue* (en sélectionnant l'option *Vue personnalisée*).
it: Una volta personalizzati, il titolo e l'icona compariranno nella scheda informativa del dataset, disponibile sulla pagina del catalogo. In questo modo, facendo clic su *Visualizzazione personalizzata* nel filtro *Visualizza*, potrai ottenere l’elenco dei dataset che possiedono una visualizzazione personalizzata.
nl: De aanpasbare titel en pictogram zal verschijnen binnen uw cataloguspagina op de kaart van de desbetreffende dataset en u zal kunnen zoeken naar datasets met een aanpasbare weergave die zijn ingesteld met de *Weergave* filter (selecteer de optie *Aanpasbare weergave*).

source: Icons are taken from the `Font awesome 4.7 icon set <https://fontawesome.com/v4.7.0/icons/>`_ and must be specified through their name (omitting the ``fa-`` prefix). For example, to use the `bar chart <https://fontawesome.com/v4.7.0/icon/bar-chart>`_ icon, whose name is ``fa-bar-chart``, you should input ``bar-chart`` in the icon field. You can also leave this field empty, in which case it will default to the `tachometer icon <https://fontawesome.com/v4.7.0/icon/tachometer>`_.
de: Symbole stammen von `Font awesome 4.7 <https://fontawesome.com/v4.7.0/icons/>`_ und müssen anhand ihres Namens spezifiziert werden (Präfix ``fa-`` weglassen). Um zum Beispiel das `Balkendiagrammsymbol <https://fontawesome.com/v4.7.0/icon/bar-chart>`_ namens ``fa-bar-chart`` zu verwenden, müssen Sie im Symbolfeld ``bar-chart`` eingeben. Sie können das Feld auch leer lassen. In dem Fall wird standardmäßig auf das `Tachometersymbol <https://fontawesome.com/v4.7.0/icon/tachometer>`_ zurückgegriffen.
es: Los iconos se obtienen del `conjunto de iconos Font Awesome 4.7 <https://fontawesome.com/v4.7.0/icons/>`_ y deben especificarse por su nombre (sin el prefijo ``fa-``). Por ejemplo, para utilizar el icono de `gráfico de barras <https://fontawesome.com/v4.7.0/icon/bar-chart>`_, denominado ``fa-bar-chart``, debe introducir ``bar-chart`` en el campo de icono. También puede dejar el campo vacío; en ese caso, se utilizará de forma predeterminada el `icono de tacómetro <https://fontawesome.com/v4.7.0/icon/tachometer>`_.
fr: Les icônes sont tirées de l'ensemble `Font Awesome 4.7 <https://fontawesome.com/v4.7.0/icons/>`_ et doivent être appelées par leur nom (sans le préfixe ``fa-``). Par exemple, pour utiliser l'icône `graphique en barre <https://fontawesome.com/v4.7.0/icon/bar-chart>`_, dont le nom est ``fa-bar-chart``, vous devez indiquer ``bar-chart`` dans le champ d'icône. Si vous laissez ce champ vide, la valeur par défaut utilisée sera l'`icône tachymètre <https://fontawesome.com/v4.7.0/icon/tachometer>`_.
nl: Iconen zijn afkomstig van de `Font awesome 4.7 icon set <https://fontawesome.com/v4.7.0/icons/>`_ en moeten gespecificeerd worden door middel van hun naam (de ``fa-`` prefix weglaten). Bijvoorbeeld: om het icoon van de `staafgrafiek <https://fontawesome.com/v4.7.0/icon/bar-chart>`_ te gebruiken, die als naam ``fa-bar-chart`` heeft, moet u ``bar-chart`` invoeren in het icoonveld. U kunt dit veld ook leeg laten. In dat geval zal het standaard de `tachometer icon <https://fontawesome.com/v4.7.0/icon/tachometer>`_ zijn.

source: Tab content
de: Register-Inhalt
es: Contenido de la ficha
fr: Contenu de l'onglet
it: Contenuto della scheda
nl: Content van het tabblad

source: The HTML and CSS code you'll be writing for the tab content isn't isolated from the rest of the page. It is integrated within an already rich interface and can take advantage of the existing dataset context to interact with the filters.
de: Die HTML- und CSS-Codes, die Sie für das Register Inhalt schreiben, sind vom Rest der Seite nicht isoliert. Sie werden in eine bereits reichhaltige Schnittstelle integriert und können den bestehenden Datensatzkontext zur Interaktion mit den Filtern nutzen.
es: El código HTML y CSS que escriba para el contenido de la ficha no estará aislado del resto de la página. Se integrará en una interfaz ya de por sí bien nutrida y puede aprovechar el contexto de juego de datos existente para interactuar con los filtros.
fr: Le code HTML et CSS que vous rédigerez pour le contenu de l'onglet n'est pas isolé du reste de la page. Il est intégré à une interface riche et peut tirer parti du contexte des jeux de données existants pour interagir avec les filtres.
it: Il codice HTML e CSS da scrivere per il contenuto della scheda non è isolato dal resto della pagina, ma è integrato nella già ricca interfaccia e può sfruttare il contesto dei dataset esistenti per interagire con i filtri.
nl: De HTML- en CSS-code die u schrijft voor de content van het tabblad is niet geïsoleerd van de rest van de pagina. Deze wordt geïntegreerd in een reeds rijke interface en kan voordeel halen uit de bestaande datasetcontext om te interageren met de filters.

source: In order to illustrate the different possibilities, we'll use a dataset listing all `new power plant installations in 2015 in france <https://rte.opendatasoft.com/explore/dataset/registre_parc_prod_rpt/>`_ alongside their respective power capacity, breaking them down by nature (nuclear, wind, solar...) and region.
de: Zur Veranschaulichung der verschiedenen Möglichkeiten werden wir einen Datensatz heranziehen, der alle `neuen Kraftwerkanlagen in Frankreich für das Jahr 2015 <https://rte.opendatasoft.com/explore/dataset/registre_parc_prod_rpt/>`_ mit den jeweiligen Energiekapazitäten, einer Aufteilung nach der Art (Kern-, Wind-, Solarenergie…) und der Region auflistet.
es: A fin de ilustrar las diversas posibilidades, usaremos un listado de juegos de datos con todas las `instalaciones de centrales eléctricas nuevas en 2015 en Francia <https://rte.opendatasoft.com/explore/dataset/registre_parc_prod_rpt/>`_ junto con su capacidad eléctrica respectiva, desglosados por tipo (nuclear, eólica, solar...) y región.
fr: Afin d'illustrer les différentes possibilités, nous utiliserons un jeu de données qui répertorie `toutes les nouvelles installations de production électrique en 2015 en France <https://rte.opendatasoft.com/explore/dataset/registre_parc_prod_rpt/>`_ , ainsi que leur capacité de production respective, et qui les trie par nature (nucléaire, éolien, solaire, etc.) et par région.
it: Per illustrare le diverse possibilità, utilizzeremo un dataset contenente l’elenco di tutte le `centrali elettriche installate nel 2015 in Francia <https://rte.opendatasoft.com/explore/dataset/registre_parc_prod_rpt/>`_, classificate per capacità energetica, tipologia (nucleare, eolica, solare...) e regione.
nl: Om de verschillende mogelijkheden te illustreren, gebruiken we een dataset waarin alle `nieuwe elektriciteitsinstallaties in 2015 in Frankrijk zijn opgenomen <https://rte.opendatasoft.com/explore/dataset/registre_parc_prod_rpt/>`_ samen met hun respectieve stroomcapaciteit, onderverdeeld per type (nucleair, wind, zonne-energie, ...) en regio.

source: To illustrate the relative importance of the various sources of energy within these new installations, we'll build a treemap with the analyse tab and set this visualization in the custom tab.
de: Zur Darstellung der relativen Bedeutung der verschiedenen Energiequellen innerhalb dieser Neuanlagen erstellen wir mit dem Register Analyse eine Treemap und richten diese Visualisierung im Register Benutzerdefiniert ein.
es: Para mostrar la importancia relativa de las diversas fuentes de energía en estas instalaciones nuevas, crearemos un gráfico de rectángulos con la ficha de análisis y estableceremos esta visualización en la ficha personalizada.
fr: Pour illustrer la part représentée par chacune de ces différentes sources d'énergie dans ces nouvelles installations, nous allons élaborer une treemap avec l'onglet analyse et définir cette visualisation dans l'onglet personnalisé.
it: Per delineare il peso di ciascuna fonte di energia nel complesso di queste installazioni, creeremo un treemap nella scheda Analizza e lo rappresenteremo nella scheda di visualizzazione personalizzata.
nl: Om de relatieve belangrijkheid van de verschillende energiebronnen binnen deze nieuwe installaties te illustreren, bouwen we een treemap-kaart met het analysetabblad en stellen we deze weergave in het aanpasbare tabblad in.

source: The treemap we want to see.
de: Die Treemap, die wir sehen möchten.
es: El gráfico de rectángulos que queremos ver.
fr: La treemap que nous souhaitons afficher.
it: Treemap da visualizzare
nl: De treemap-kaart die we willen zien.

source: The share panel at the bottom of the analyze tab gives us the following widget code for this treemap.
de: Unten im Register Analyse finden wir im Bereich Teilen den folgenden Widgetcode für diese Treemap.
es: El panel de compartir de la parte inferior de la ficha de análisis nos da el código de widget siguiente para este gráfico de rectángulos.
fr: Le panneau partager situé en bas de l'onglet analyse fournit le bout de code de widget suivant pour cette treemap.
it: Il codice widget di questo treemap è disponibile in fondo alla scheda Analizza, nel pannello Condividi:
nl: Het deel-paneel onder het analysetabblad geeft ons de volgende widgetcode voor deze treemap-kaart.

source: We can of course copy/paste this code into the custom view's HTML code editor and it will give us the requested treemap. However, since we're creating an independant dataset context (named `registreparcprodrpt` in this case), this treemap will be independant from the rest of the dataset's page, and especially independant from the active filters.
de: Diesen Code können wir natürlich in den HTML-Codeeditor der benutzerdefinierten Ansicht kopieren/einfügen, der uns so die gewünschte Treemap liefert. Da wir jedoch einen unabhängigen Datensatzkontext erstellen (in unserem Fall namens `registreparcprodrpt`), wird diese Treemap unabhängig vom Rest der Datensatzseite und insbesondere von den aktiven Filtern sein.
es: Obviamente, podemos copiar/pegar este código en el editor de código HTML de la vista personalizada y nos proporcionará el gráfico de rectángulos solicitado. Sin embargo, como estamos creando un contexto de juego de datos independiente (en este caso, denominado `registreparcprodrpt`), este gráfico de rectángulos será independiente del resto de la página del juego de datos y especialmente de los filtros activos.
fr: Nous pouvons bien entendu copier/coller ce code dans l'éditeur de code HTML de la vue personnalisée pour obtenir la treemap souhaitée. Toutefois, étant donné que nous créons un contexte de jeu de données indépendant (nommé `registreparcprodrpt` dans le cas présent), cette treemap sera indépendante du reste de la page du jeu de données, et notamment indépendante des filtres actifs.
it: Naturalmente, è possibile copiare e incollare il codice nell'editor HTML della scheda di visualizzazione personalizzata e ottenere così il treemap desiderato. Tuttavia, in questo modo creeremo un contesto indipendente all’interno del dataset (qui denominato `registreparcprodrpt`), rendendo il treemap un elemento autonomo della pagina, indifferente ai filtri che vi sono attivi.
nl: We kunnen natuurlijk deze code kopiëren/plakken in de HTML-code-editor van de aanpasbare weergave en dit zal de gevraagde treemap-kaart als resultaat geven. Maar aangezien we een zelfstandige datasetcontext aanmaken (in dit geval met de naam "registreparcprodrpt"), staat deze treemap los van de rest van de pagina van de dataset en vooral van de actieve filters.

source: This means that we can't take advantage of the existing *producer* filter to refine the treemap and see what technology such and such company is more investing in.
de: Das heißt, dass wir den bestehenden Filter *Produzent* nicht zum Verfeinern der Treemap nutzen und nicht sehen können, welches Unternehmen mehr in welche Technologie investiert.
es: Esto significa que no podemos aprovechar el filtro *producer* ya existente con objeto de refinar el gráfico de rectángulos para ver en qué tecnología invierte más tal y tal empresa.
fr: Cela signifie que nous ne pouvons pas tirer parti du filtre *producteur* existant pour affiner la treemap et voir dans quelle technologie telle ou telle entreprise investit davantage.
it: Ciò significa che non sarà possibile utilizzare il filtro *Produttore* per affinare il treemap e visualizzare quindi le tecnologie su cui stanno investendo le diverse aziende.
nl: Dit betekent dat we voordeel kunnen halen uit de bestaande filter *producent* om de treemap te verfijnen en te zien in welke technologie die en die onderneming meer investeert.

source: The treemap in the custom view is not affected by the active filter
de: Der aktive Filter hat keine Auswirkungen auf die Treemap in der benutzerdefinierten Ansicht
es: El filtro activo no afecta al gráfico de rectángulos de la vista personalizada.
fr: La treemap de la vue personnalisée n'est pas affectée par le filtre actif
it: Il treemap nella visualizzazione personalizzata non è influenzato dal filtro attivo
nl: De treemap in de aanpasbare weergave wordt niet beïnvloed door de actieve filter.

source: In order to work with the existing dataset context, we just have to plug the ``ods-chart`` widget not on a custom context defined within the custom view but directly on the global context set for the page, which is named ``ctx``, as such.
de: Um mit dem bestehenden Datensatzkontext zu arbeiten, müssen wir das Widget ``ods-chart`` nicht in einen innerhalb der benutzerdefinierten Ansicht benutzerdefinierten Kontext einbinden, sondern direkt in den für die Seite eingerichteten globalen Kontext namens `ctx``.
es: Para trabajar con el contexto de juego de datos existente, simplemente tenemos que conectar el widget ``ods-chart`` no con un contexto personalizado definido dentro de la vista personalizada sino directamente con el contexto global establecido para la página, denominado ``ctx``.
fr: Afin de travailler avec le contexte du jeu de données existant, il nous suffit d'injecter le widget ``ods-chart`` non pas dans un contexte personnalisé défini dans la vue personnalisée, mais directement dans le contexte général défini pour la page, nommé ``ctx``, en tant que tel.
it: Per lavorare in sinergia con il contesto di dati del dataset, il widget ``ods-chart`` non deve essere collegato a un contesto specifico della visualizzazione personalizzata, ma direttamente a quello globale definito per la pagina, in questo caso denominato ``ctx``.
nl: Om met de bestaande datasetcontext te kunnen werken, moeten we gewoon de ``ods-chart`` widget pluggen, maar niet op een aanpasbare context die gedefinieerd is in de aanpasbare weergave, maar rechtstreeks op de globale context die is ingesteld voor de pagina en de naam ``ctx`` draagt.

source: This time, the treemap will be actualized depending on the current filters, which allows for more in-depth exploring.
de: Diesmal wird die Treemap von den aktuellen Filtern aktualisiert, was ein tiefgründigeres Untersuchen ermöglicht.
es: En esta ocasión, el gráfico de rectángulos se actualizará en función de los filtros actuales, lo que hace posible una exploración más exhaustiva.
fr: Cette fois, la treemap sera actualisée en fonction des filtres actuels, ce qui permet une exploration plus en profondeur.
it: Questa volta, il treemap verrà aggiornato in base ai filtri correnti e permetterà un esame più approfondito.
nl: Dit keer zal de treemap geactualiseerd worden afhankelijk van de huidige filters, die een meer grondige exploratie mogelijk maken.

source: The treemap in the custom view is now taking into account active filters
de: Aktive Filter werden nunmehr von der Treemap in der benutzerdefinierten Ansicht berücksichtigt
es: Ahora el gráfico de rectángulos de la vista personalizada tiene en cuenta los filtros activos.
fr: La treemap dans la vue personnalisée tient désormais compte des filtres actifs.
it: Il treemap nella visualizzazione personalizzata tiene ora in considerazione i filtri attivi
nl: De treemap in de aanpasbare weergave houdt nu rekening met actieve filters.
