Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/07_configuring_visualizations/06_configuring_custom_view/custom.po
Languages: de, es, fr, it, nl

source: Depending on your analysis, you may want to have both static and dynamic visualizations within your custom view, and nothing prevents you from doing so. You'll just have to plug the dynamic ones onto the ``ctx`` context and define new ``ods-dataset-context`` for static ones.
de: Je nach Analyse möchten Sie eventuell statische und dynamische Visualisierungen in Ihrer benutzerdefinierten Ansicht haben, woran Sie nichts hindert. Dazu müssen Sie die dynamischen lediglich in den Kontext ``ctx`` einbinden und für die statischen einen neuen ``ods-dataset-context`` definieren.
es: Según su análisis, tal vez desee tener visualizaciones estáticas y dinámicas en la vista personalizada, y nada se lo impide. Solo tendrá que conectar las dinámicas con el contexto ``ctx`` y definir el nuevo ``ods-dataset-context`` para las estáticas.
fr: En fonction de votre analyse, il peut être souhaitable de disposer de visualisations statiques et dynamiques dans votre vue personnalisée, et rien ne vous empêche de le faire. Il vous suffit d'injecter les visualisations dynamiques sur le contexte ``ctx`` et de définir un nouveau contexte ``ods-dataset-context`` pour les visualisations statiques.
it: In base al tipo di analisi, nella scheda personalizzata potresti aver bisogno di far coesistere delle visualizzazioni statiche con altre dinamiche. Per far ciò è necessario collegare le visualizzazioni dinamiche al contesto ``ctx`` e definire un nuovo ``ods-dataset-context`` per quelle statiche.
nl: Afhankelijk van uw analyse, kan u zowel statische als dynamische weergaves hebben in uw aanpasbare weergave en niets weerhoudt u ervan om dit te doen. U moet alleen de dynamische weergaves pluggen op de ``ctx`` context en nieuwe ``ods-dataset-context`` definiëren voor de statische weergaves.
