Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publish_datasets/harvesters/csw.po
Languages: fr

source: CSW harvester
fr: Moissonneur CSW

source: Retrieve datasets from a Catalog Service for the Web (CSW portal).
fr: Récupérer les jeux de données d'un portail CSW (Catalog Service for the Web).

source: The CSW server must provide the following capabilities:
fr: Le serveur CSW doit fournir les fonctionnalités suivantes :

source: CSW version: 2.0.2
fr: Version CSW : 2.0.2

source: This harvester is not available by default. If you need to use it, please contact OpenDataSoft support team.
fr: Ce moissonneur n'est pas disponible par défaut. Si vous souhaitez l'utiliser, veuillez contacter le support OpenDataSoft.

source: Parameters
fr: Paramètres

source: Name
fr: Nom

source: Example
fr: Exemple

source: Csw url (cswurl)
fr: URL CSW (cswurl)

source: The base URL of the CSW geoportal
fr: L'URL de base du géo-portail CSW

source: Theme thesaurus (theme_thesaurus)
fr: Thésaurus de thèmes (theme_thesaurus)

source: The name of the thesaurus used to fill the themes metadata
fr: Nom du thésaurus utilisé pour remplir la métadonnée "thème"

source: Constraint language to CQL_TEXT (constraint_language)
fr: Contraindre le langage à CQL_TEXT (constraint_language)

source: Set this option to True if the portal requires to constraint the language to CQL_TEXT
fr: Si oui, les requêtes envoyées au portail CSW contraindront le langage à CQL_TEXT

source: User (username)
fr: Utilisateur (username)

source: The username if the CSW service needs authentication
fr: Le nom d'utilisateur, si le service CSW nécessite une authentification

source: Password (password)
fr: Mot de passe (password)

source: The password if the CSW service needs authentication
fr: Le mot de passe, si le service CSW nécessite une authentification
