Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/07_configuring_visualizations/05_configuring_calendar_view/calendar.po
Languages: it, nl

source: Configuring the Calendar visualization
nl: De Kalenderweergave configureren

source: Prerequisite
nl: Voorvereiste

source: For the Calendar visualization to be available, the dataset must contain at least one :ref:`date or datetime field<choosingtype>`, and a text field containing the title of the calendar event.
nl: Opdat de kalenderweergave beschikbaar is, moet de dataset minstens één :ref:`datum- of datumtijdveld<choosingtype>` bevatten alsook een tekstveld waarin de titel van het kalenderevenement staat.

source: In the edition interface of a dataset, the Visualizations > Calendar tab allows to configure the Calendar visualization displayed in the front office once the dataset is published on the portal.
nl: In de bewerkingsinterface van een dataset kan u via de tab Weergaven > Kalender de kalenderweergave die wordt weergegeven in de front office configureren eenmaal de dataset op het portaal is gepubliceerd.

source: The Calendar visualization, when available, is optional. It can be enabled or disabled using the tick box displayed right under the visualizations tabs.
nl: De Kalenderweergave, wanneer deze beschikbaar is, is optioneel. Deze kan worden geactiveerd of gedeactiveerd via het aanvinkvakje dat rechts onder de weergavetabs staat.

source: When the Calendar visualization is enabled, the published dataset can be exported in iCalendar format from the Export tab of the front office.
nl: Wanneer de Kalanderweergave is geactiveerd, kan de gepubliceerde dataset geëxporteerd worden in iCalendar-formaat vanuit het tabblad Export van de front office.

source: To configure the Calendar visualization, follow the indications from the tables below.
nl: Volg de instructies uit onderstaande tabellen om de Kalenderweergave te configureren.

source: Option name
nl: Naam van de optie

source: Description
nl: Omschrijving

source: Usage
nl: Gebruik

source: Event title
nl: Titel van het evenement

source: Title of the event, used as a tooltip title.
nl: Titel van het evenement die gebruikt wordt als titel van een tooltip.

source: Click on the "Event title" list box.
nl: Klik op het lijstvak "Titel van het evenement".

source: Choose a field from the dataset, which contains the events titles.
nl: Kies een veld uit de dataset die de titels van de evenementen bevat.

source: Event start
nl: Begin evenement

source: Start date of the event.
nl: Begindatum van het evenement.

source: Click on the "Event start" list box.
nl: Klik op het lijstvak "Begin evenement".

source: Choose a field from the dataset, which contains the start dates of the events.
nl: Kies een veld uit de dataset dat de begindata van de evenementen bevat.

source: Event end
nl: Einde van het evenement

source: End date of the event.
nl: Einddatum van het evenement.

source: Click on the "Event end" list box.
nl: Klik op het lijstvak "Einde van het evenement".

source: Choose a field from the dataset, which contains the end dates of the events.
nl: Kies een veld uit de dataset dat de einddata van de evenementen bevat.

source: Event color
nl: Kleur van het evenement

source: Color of the event on the Calendar visualization.
nl: Kleur van het evenement op de Kalenderweergave

source: Click on the color menu.
nl: Klik op het menu met de kleuren.

source: Choose a color from the Nice colors or with the Color picker.
nl: Kies een kleur uit de Leuke kleuren of met de kleur picker.

source: Click on the Select color button.
nl: Klik op de knop Kleur selecteren.

source: Available views
nl: Beschikbare weergaven

source: 3 possible views on which to display events of the Calendar view:
nl: 3 mogelijke weergaven waarop evenementen op de Kalenderweergave worden weergegeven:

source: Month, to display a monthly calendar
nl: Maand, om een maandelijkse kalender weer te geven

source: Week, to display a weekly calendar
nl: Week om een wekelijkse kalender weer te geven

source: Day, to display a daily calendar
nl: Dag om een dagelijkse kalender weer te geven

source: Tick a box to display a chosen view. Untick a box to hide a chosen view.
nl: Klik op een vakje om een gekozen weergave weer te geven. Vink een vakje uit om een gekozen weergave te verbergen.

source: Default view
nl: Standaard weergave

source: Default view when landing on the Calendar visualization tab.
nl: Standaard weergave wanneer u naar de tab Kalenderweergave gaat.

source: Click on the "Default view" list box.
nl: Klik op het lijstvak "Standaard weergave".

source: Choose a default view.
nl: Kies een standaard weergave.

source: Tooltip types
nl: Soorten tooltips

source: 2 tooltip types:
nl: 2 soorten tooltips:

source: Standard tooltip (default): allows the choice of a title and of the fields displayed in the tooltip.
nl: Standaard tooltip (default): deze laat toe een titel van de velden die in de tooltip worden weergegeven te kiezen.

source: Custom HTML tooltip: allows a further customization of the tooltip, using HTML.
nl: Custom HTML tooltip: hiermee kunt u de tooltip verder instellen via HTML.

source: Click on the "Tooltip types" list box.
nl: Klik op het lijstvak "Soorten tooltips".

source: Choose a tooltip type.
nl: Kies een soort tooltip.

source: **Standard tooltip options**
nl: **Standaard tooltip opties**

source: Displayed fields
nl: Weergegeven velden

source: Fields from the dataset which values will be displayed in the tooltip. In the list, the fields with a grey background are those that will be displayed in the tooltip, whereas those without a colored background will be hidden from the tooltip.
nl: Velden uit de dataset waarvan de waarden in de tooltip zullen worden weergegeven. In de lijst zijn de velden met een grijze achtergrond diegene die in de tooltip zullen worden weergegeven, terwijl die zonder een gekleurde achtergrond verborgen zullen zijn voor de tooltip.

source: To add a field in the tooltip:
nl: Om een veld in de tooltip toe te voegen:

source: Find the field among the list.
nl: Zoek het veld in de lijst.

source: Click on the |icon-plus| icon at the right of the field.
nl: Klik op het pictogram |icon-plus| rechts van het veld.

source: To hide a field from the tooltip:
nl: Om een veld uit de tooltip te verbergen:

source: Click on the |icon-cross| icon at the right of the field.
nl: Klik op het pictogram |icon-cross| rechts van het veld.

source: To reorder the fields:
nl: Om de velden in een andere volgorde te plaatsen:

source: Click on a field among the list.
nl: Klik op een veld uit de lijst.

source: Drag and drop the field above or below another one.
nl: Plaats en sleep het veld boven of onder een ander veld.

source: **Custom HTML tooltip options**
nl: **Custom HTML tooltip opties**

source: HTML area to write the content of the tooltip. 3 buttons above the text area allow to reindent a selection, reindent the whole HTML text, and/or to wrap the lines.
nl: HTML-ruimte om de inhoud van de tooltip te noteren. Met 3 knoppen boven de tekstzone kunt u een selectie opnieuw laten inspringen, de volledige HTML-tekst opnieuw laten inspringen en/of de lijnen inwikkelen.

source: Write the content of the tooltip in HTML.
nl: De inhoud van de tooltip in HTML schrijven.

source: Configuring the calendar
it: Configurazione del calendario

source: The OpenDataSoft platform lets you easily create calendar views from your published datasets.
it: La piattaforma OpenDataSoft permette di creare facilmente delle visualizzazioni su calendario a partire dai dataset pubblicati.

source: A calendar built from a dataset containing all events from OpenAgenda
it: Calendario creato in base a un dataset contenente tutti gli eventi di OpenAgenda

source: Datasets requirements
it: Requisiti riguardanti i dataset

source: For the calendar view, each record of your dataset is a different event. These events must contain a start time, an end time and a title. Which means your dataset must have two datetime fields and a text field for the calendar view to be available.
it: Nella visualizzazione su calendario, ogni record del dataset viene considerato un evento. Ogni evento deve includere un orario di inizio, un orario di fine e un titolo. Ciò significa che per essere visualizzato su un calendario il dataset deve includere due campi data/ora e un campo di testo.

source: 2 fields set as datetime
it: 2 campi configurati nel formato data/ora

source: Records without titles will be displayed on the calendar as titleless events, but missing either the start or end time will cause the view to simply ignore the record.
it: Se il record è privo di titolo verrà visualizzato nel calendario come un evento senza titolo, ma se non possiede l'orario di inizio o di fine verrà ignorato.

source: Full day events
it: Eventi a giornata intera

source: Though very simple, the "two datetime fields and a text field" requirement forces you to setup full day events as events ~ starting at 12AM on the given day and finishing a second before midnight on the same day (00:00:00 to 23:59:59).
it: Benché molto semplice, la necessità di inserire due campi data/ora e un campo di testo richiede che per un evento durato tutto il giorno l’ora di inizio venga impostata a mezzanotte e quella di fine a un secondo dal termine della giornata (dalle 00:00:00 alle 23:59:59).

source: Configuration
it: Configurazione

source: Enabling the calendar view
it: Attivazione della visualizzazione Calendario

source: Once you have configured two of your dataset's fields as datetimes and another field as text, you'll see the calendar tab become available.
it: Dopo aver impostato due campi del dataset come data/ora e un altro come testo, la scheda Calendario diventa disponibile.

source: Calendar tab unavailable
it: Scheda Calendario non disponibile

source: Calendar tab available
it: Scheda Calendario disponibile

source: It doesn't mean that your dataset is fully configured though. The view is available but not enabled by default. You'll have to manually enable it.
it: Ciò non significa, tuttavia, che la configurazione del dataset sia completa. La visualizzazione è disponibile, ma per impostazione predefinita non è attivata. È quindi necessario attivarla manualmente.

source: This checkbox will enable the calendar view
it: Selezionando questa casella di spunta si attiva la visualizzazione Calendario

source: Setting up events' fields
it: Configurazione dei campi dell'evento

source: Once the calendar is enabled, you'll need to make sure the events' fields are well configured. You'll see that the first text field has been selected for the title, the first datetime for the start time and the second datetime for the end time. You may have multiple other text/datetime fields in your dataset, select here which one determine the events' properties.
it: Dopo aver attivato il calendario, accertati che i campi degli eventi siano configurati in modo appropriato. Noterai che il primo campo di testo selezionato è quello del titolo, il primo campo data/ora è l'orario di inizio e il secondo campo data/ora è l'orario di fine. Nel caso in cui il dataset contenga altri campi di testo o di data/ora, dovrai selezionare quelli che determineranno le proprietà dell'evento.

source: This is also where you'll be able to select the events' color.
it: Qui è inoltre possibile selezionare il colore da attribuire all'evento.

source: Default configuration for my calendar. The event's fields are pre-selected but not correct.
it: Configurazione predefinita del calendario. I campi degli eventi sono preselezionati, ma non sono corretti.

source: Corrected settings
it: Impostazioni corrette

source: Setting up the tooltip
it: Configurazione dei tooltip

source: In the calendar view, a click on a event will bring forward a tooltip containing more information about the events.
it: Nella visualizzazione Calendario, cliccando su un evento viene visualizzato un tooltip con ulteriori informazioni.

source: Sharing
it: Condivisione

source: Once your dataset is correctly setup and published, you can of course share this calendar with anyone having the rights to view the calendar.
it: Dopo aver configurato e pubblicato correttamente il dataset, puoi naturalmente condividere il calendario con chiunque disponga dei permessi di visualizzazione.

source: To do so, you can always copy/paste the url from your browser's address bar, but you can also use any of the 3 options offered below the calendar itself.
it: Per far ciò, puoi copiare e incollare l'URL dalla barra degli indirizzi del tuo browser, oppure utilizzare una delle 3 opzioni riportate sotto il calendario stesso.

source: Share the url
it: Condividi l'URL

source: The 3 sharing options, with first and foremost the url
it: Le tre opzioni di condivisione, prima di tutto mediante l'URL

source: Code snippet to embed the view inside any other website
it: Crea un embed della visualizzazione in un altro sito Web tramite uno snippet di codice.

source: Embed this code into any other page to display your calendar there
it: Integra questo codice in un'altra pagina per visualizzare il tuo calendario

source: Code snippet to include in any of your dashboard or page on the platform.
it: Includi uno snippet di codice nel tuo dashboard o in una pagina della piattaforma.

source: Copy this code to one your dashboard on the platform
it: Copia questo codice nel dashboard della piattaforma
