Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/03_searching_the_data/search.po
Languages: de, it

source: Searching in the data
de: Suchen in Daten
it: Ricerca nei dati

source: Search for records
de: Suche nach Einträgen
it: Ricerca di record

source: Query
de: Anfrage

source: Example (based on ods-api-monitoring dataset)
de: Beispiel (basierend auf Datensatz ods-api-Überwachung)
it: Esempio (basato sul dataset ods-api-monitoring)

source: containing a value
de: mit einem Wert
it: contenente un valore

source: value
de: Wert
it: valore

source: returns every record containing the string explore
de: gibt alle Einträge mit der Zeichenfolge explore zurück
it: restituisce tutti i record che contengono la stringa "explore"

source: containing a value in a specific field
de: mit einem Wert in einem bestimmten Feld
it: contenente un valore in un campo specifico

source: returns every record containing the string explore in the column named action
de: gibt alle Einträge mit der Zeichenfolge explore in der Spalte namens action zurück
it: restituisce tutti i record che contengono la stringa "explore" nella colonna "action"

source: containing several values
de: mit mehreren Werten
it: contenente più di un valore

source: value1 AND value2
de: Wert1 UND Wert2

source: returns every record containing both explore and search
de: gibt alle Einträge mit den Zeichenfolgen explore sowie search zurück
it: restituisce tutti i record che contengono entrambe le stringhe "explore" e "search"

source: containing at least one of the values
de: mit mindestens einem der Werte
it: contenente almeno uno dei valori

source: value1 OR value2
de: Wert1 ODER Wert2

source: returns every record containing either explore or search
de: gibt alle Einträge mit entweder der Zeichenfolge explore oder search zurück
it: restituisce tutti i record che contengono la stringa "explore" o la stringa "search"

source: not containing a value
de: ohne einen Wert
it: non contenente un determinato valore

source: NOT value
de: OHNE Wert

source: returns every record which does not contain the string anonymous
de: gibt alle Einträge ohne die Zeichenfolge anonymous zurück
it: restituisce tutti i record che non contengono la stringa "anonymous"

source: containing an exact value in a field
de: mit einem genauen Wert in einem Feld
it: contenente un valore specifico in un campo

source: returns every record containing the exact string anonymous in the column named user_id
de: gibt alle Einträge mit der genauen Zeichenfolge anonymous in der Spalte namens user_id zurück
it: restituisce tutti i record che contengono in modo esatto la stringa "anonymous" nella colonna "user_id"

source: if a field is empty
de: wenn ein Feld leer ist
it: se un campo è vuoto

source: returns every record which has no value in the column named referer
de: gibt alle Einträge ohne einen Wert in der Spalte namens referer zurück
it: restituisce tutti i record che non contengono valori nella colonna "referer"

source: where a date's field is anterior to a value
de: wo ein Datumsfeld vor einem Wert liegt
it: in cui il campo della data è anteriore a un determinato valore

source: returns every record with a timestamp prior and equal to September 2016
de: gibt alle Einträge mit einem Zeitstempel vor oder gleich September 2016 zurück
it: restituisce tutti i record che contengono una marca temporale anteriore o identica a "settembre 2016"

source: where a date's field is the current date minus a period
de: wo ein Datumsfeld das aktuelle Datum minus einem Zeitraum ist
it: in cui il campo della data precede di un certo intervallo la data corrente

source: returns every record with a timestamp equal to current day minus 7 days
de: gibt alle Einträge mit einem dem aktuellen Tag minus 7 Tage entsprechenden Zeitstempel zurück
it: restituisce tutti i record con una marca temporale antecedente di 7 giorni alla data corrente

source: containing a geo field located in a specific area
de: mit einem in einem bestimmten Gebiet liegenden Geofeld
it: contenente un campo geografico ubicato in un'area specifica

source: for a circular area:
de: für eine kreisförmige Fläche:

source: for a polygon or square area:
de: für eine mehreckige oder quadratische Fläche:

source: returns every record located at 1 km from the center of Paris
de: gibt alle 1 km vom Pariser Stadtzentrum entfernt liegenden Einträge zurück
it: restituisce tutti i record ubicati a 1 km dal centro di Parigi

source: returns every record located into the polygon
de: gibt alle im Vieleck liegenden Einträge zurück

source: Query Language and Geo Filtering
de: Abfragesprache und Geofilter
it: Linguaggio query e filtro geografico

source: Query language
de: Abfragesprache
it: Linguaggio query

source: The OpenDataSoft query language makes it possible to express complex boolean conditions as a filtering context.
de: Die OpenDataSoft-Abfragesprache ermöglicht den Ausdruck komplexer Boolescher Bedingungen als Filterkontext.
it: Il linguaggio query OpenDataSoft permette di esprimere delle complesse condizioni booleane come contesto di filtro.

source: Full-text search
de: Volltextsuche
it: Ricerca full-text

source: The query language accepts full text queries.
de: Die Abfragesprache akzeptiert Volltextsuchen.
it: Il linguaggio query accetta le query full-text.

source: If a given word or compounds is surrounded with double quotes, only exact matches are returned (modulo an accent and case insensitive match).
de: Wenn ein bestimmtes Wort oder Element mit Anführungszeichen versehen ist, werden nur genaue Entsprechungen zurückgegeben (Modulo Entsprechung ohne Berücksichtigung von Akzent und Groß-/Kleinschreibung).
it: Se una o più parole sono racchiuse tra virgolette doppie, vengono restituite solo le corrispondenze esatte (la ricerca non fa differenza tra maiuscole e minuscole).

source: ``film`` returns results that contain film, films, filmography...
de: ``film`` gibt Ergebnisse zurück, die film, films, filmography etc. enthalten.
it: ``film`` restituisce i risultati contenenti film, filmati, filmografia...

source: ``"film"`` only returns the ones containing exactly film.
de: ``"film"`` gibt nur diejenigen zurück, die genau film enthalten.
it: ``"film"`` restituisce solo i risultati contenenti la parola esatta "film".

source: Boolean expressions
de: Boolesche Ausdrücke
it: Espressioni booleane

source: The query language supports the following boolean operators ``AND``, ``OR`` and ``NOT``.
de: Die Abfragesprache unterstützt die Booleschen Operatoren ``AND``, ``OR`` und ``NOT``.
it: Il linguaggio query supporta gli operatori booleani ``AND``, ``OR`` e ``NOT``.

source: Parenthesis can be used to group together expressions and alter the default priority model:
de: Um Ausdrücke zusammenzufassen und das Standard-Prioritätenmodell zu ändern, können Klammern gesetzt werden:
it: Le parentesi permettono di raggruppare le espressioni e di modificare il modello di priorità predefinita:

source: Samples
de: Muster
it: Esempi:

source: Field queries
de: Feld-Abfragen
it: Query dei campi

source: One of the major feature of the query language is to allow per field filtering. You can use field names as a prefix to your queries to filter the results based on a specific field's value.
de: Eine der wichtigsten Funktionen der Abfragesprache ist die Möglichkeit der Feld-Filterung. Sie können Feldnamen als Präfix für Ihre Abfragen nutzen, um die Ergebnisse auf der Grundlage eines speziellen Feldwerts zu filtern.
it: Una delle funzionalità principali del linguaggio query è il filtro basato sui campi. È infatti possibile utilizzare i nomi dei campi come prefisso per l'esecuzione delle query, in modo da filtrare i risultati in base al valore di un campo specifico.

source: **For dataset search in the catalog**, the list of available fields corresponds exactly to available metadata. By default:
de: **Für Datensatz-Such** entspricht die Liste der verfügbaren Felder genau den verfügbaren Metadaten. Standard:
it: **Per le ricerca dei dataset**, l'elenco dei campi disponibili corrisponde esattamente ai metadati disponibili. Per impostazione predefinita:

source: Field Name
de: Feldname
it: Nome del campo

source: Description
de: Beschreibung
it: Descrizione

source: The dataset publisher
de: Der Datensatz-Veröffentlicher
it: Entità di pubblicazione del dataset

source: title
de: Titel

source: The dataset title
de: Der Datensatz-Titel
it: Titolo del dataset

source: description
de: Beschreibung

source: The dataset description
de: Die Datensatz-Beschreibung
it: Descrizione del dataset

source: The dataset license
de: Die Datensatz-Lizenz
it: Licenza del dataset

source: The number of records in the dataset
de: Die Anzahl der Einträge im Datensatz
it: Numero dei record del dataset

source: The last modification date of the dataset
de: Das Datum der letzten Änderung des Datensatzes
it: Data dell'ultima modifica apportata al dataset

source: language
de: Sprache

source: The language of the dataset (iso code)
de: Die Sprache des Datensatzes (ISO-Code)
it: Lingua del dataset (codice ISO)

source: theme
de: Thema

source: The theme of the dataset
de: Das Thema des Datensatzes
it: Tema del dataset

source: references
de: Referenzen

source: The references for the dataset
de: Die Referenzen für den Datensatz
it: Riferimenti del dataset

source: The domain administrator might define a richer metadata template, thus giving acces to a richer set of filtering fields.
de: Der Domain-Administrator kann eine umfangreichere Metadaten-Vorlage definieren und damit Zugriff auf ein umfangreicheres Angebot an Filter-Feldern bieten.
it: L'amministratore del dominio può definire un modello di metadati più ricco, permettendo l'accesso a una serie più ampia di campi di filtro.

source: **For record search in a dataset**, the list of available fields depend on the schema of the dataset. To fetch the list of available fields for a given dataset, you may use the search dataset or lookup dataset APIs.
de: **Für Eintragsuche** hängt die Liste der verfügbaren Felder von dem Schema des Datensatzes ab. Um die Liste der verfügbaren Felder für einen bestimmten Datensatz zu erhalten, können Sie die Suche Datensatz bzw. den Nachschlag Datensatz APIs verwenden.
it: **Per le ricerca dei record**, l'elenco dei campi disponibili dipende dallo schema del dataset. Per ottenere l'elenco dei campi disponibili in un determinato dataset, puoi utilizzare le API di ricerca dei dataset o di singoli dataset.

source: Multiple operator fields can be used between the field name and the query:
de: Mehrere Operator-Felder können zwischen dem Feldnamen und der Abfrage verwendet werden:
it: Tra il nome del campo e la query è possibile utilizzare campi con operatori multipli:

source: ``:``, ``-``, ``==``: Return results whose field exactly matches the given value (granted the fields are of text or numeric type)
de: ``:``, ``=``, ``==``: gibt Ergebnisse zurück, deren Feld genau mit dem vorgegebenen Wert übereinstimmt (erlaubte Felder sind Text- oder Zahlentypen)
it: ``:``, ``=``, ``==``: restituisce i risultati che contengono campi dai valori identici a quello fornito (purché i campi siano di tipo testo o numerico)

source: ``>``, ``<``, ``>=``, ``<=``: Return results whose field values are larger, smaller, larger or equal, smaller or equal to the given value (granted the field is of date or numeric type).
de: ``>``, ``<``, ``>=``, ``<=``: Geben Ergebnisse zurück, deren Feldwerte größer, kleiner, größer oder gleich, kleiner oder gleich als der vorgegebene Wert sind (vorausgesetzt das Feld ist vom Datums- oder Zahlentyp).
it: ``>``, ``<``, ``>=``, ``<=``: restituisce i risultati nei quali il valore del campo è maggiore, minore, maggiore o uguale oppure minore o uguale al valore fornito (purché il campo sia di tipo data o numerico).

source: ``[start_date TO end_date]``: Queries Records whose date is between ``start_date`` and ``end_date``.
de: ``[start_date TO end_date]``: Abfrageeinträge, deren Datum zwischen ``start_date`` und ``end_date`` liegt.
it: ``[start_date TO end_date]``: esegue la query sui record che hanno una data compresa tra ``start_date`` e ``end_date``.

source: Date formats can be specified in different formats: simple (``YYYY[[/mm]/dd]``) or ISO 8601 (``YYYY-mm-DDTHH:MM:SS``)
de: Datumsformate können in verschiedenen Formaten angegeben werden: einfach (``YYYY[[/mm]/dd]``) oder ISO 8601 (``YYYY-mm-DDTHH:MM:SS``)
it: La data può essere specificata in diversi formati: semplice (``YYYY[[/mm]/dd]``) o ISO 8601 (``YYYY-mm-DDTHH:MM:SS``).

source: Examples:
de: Beispiele:
it: Esempi:

source: Query language functions
de: Funktionen der Abfragesprachen
it: Funzioni del linguaggio query

source: Advanced functions can be used in the query language. Function names need to be prefixed with a sharp (``#``) sign.
de: In der Abfragesprache können erweiterte Funktionen genutzt werden. Funktionsnamen muss das Doppelkreuz (``#``) vorgesetzt werden.
it: Il linguaggio query dispone di funzioni avanzate. I nomi delle funzioni devono essere preceduti dal carattere cancelletto (``#``).

source: Function name
de: Funktionsname
it: Nome della funzione

source: Returns the current date. This function may be called as a query value for a field. When called without an argument, it will evaluate to the current datetime: ``birthdate >= #now()`` returns all Records containing a birth date greater or equal to the current datetime. This function can also accept parameters, see below for the ``#now`` function available parameters.
de: Gibt das aktuelle Datum zurück. Diese Funktion kann als Abfragewert für ein Feld aufgerufen werden. Wenn sie ohne Argument aufgerufen wird, rechnet sie bis zur aktuellen DateTime: ``birthdate >= #now()`` gibt sämtliche Einträge zurück, die ein Geburtsdatum, das nach oder an der gleichen DateTime liegt. Diese Funktion kann auch Parameter akzeptieren, siehe unten zu den verfügbaren Parametern der ``#now`` Funktion.
it: Restituisce la data corrente. Questa funzione può essere chiamata come valore di query per un campo. Quando è chiamata senza argomento, valuta la data/ora corrente: ``datanascita >= #now()`` restituisce tutti i record contenenti una data di nascita successiva o uguale alla data/ora corrente. La funzione accetta anche dei parametri, che vengono illustrati più in basso.

source: This function may be called specifying a field name as a parameter. It returns the hits for which no value is defined for the specified field. For example ``#null(birthdate)``
de: Diese Funktion kann aufgerufen werden, um einen Feldnamen als Parameter anzugeben. Sie gibt die Ergebnisse zurück, für die kein Wert für das angegebene Feld definiert wurde. Zum Beispiel ``#null(birthdate)``
it: Questa funzione può essere chiamata specificando il nome di un campo come parametro e restituisce i casi nei quali non è stato definito alcun valore per il campo specificato. Ad esempio, ``#null(datanascita)``.

source: This function makes it possible to search for records with a field exactly matching a given value. For example, ``#exact(firstname, "Marie")`` will return records with a field ``firstname`` containing exactly "Marie" and nothing else.
de: Diese Funktion ermöglicht die Suche nach Einträgen mit Hilfe eines Feldes, das genau dem vorgegebenen Wert entspricht. Beispielsweise gibt ``#exact(firstname, "Marie")`` nur diejenigen Einträge zurück, deren Feld "firstname" genau den Namen "Marie" und nichts anderes enthält.
it: Questa funzione permette di ricercare i record contenenti un campo dal valore identico a quello dato. Ad esempio, ``#exact(nomeproprio, "Maria")`` restituirà i record che presentano solo ed esclusivamente il nome "Maria" nel campo ``nomeproprio``.

source: This function makes it possible to search for records with a field matching a value in the querying user's SAML attributes. For example, ``#attr(firstname, user_first_name)``, performed by a user who has a SAML attribute ``user_first_name`` with a value of "Marie", will return records with a field ``firstname`` containing "Marie".
de: Diese Funktion ermöglicht die Suche nach Einträgen mithilfe eines Feldes, das einem Wert in den SAML-Attributen des abfragenden Benutzers entspricht . Wird beispielsweise ``#attr(firstname, user_first_name)`` von einem Benutzer mit einem SAML-Attribut ``user_first_name`` mit dem Wert "Marie" ausgeführt, werden Einträge mit einem ``firstname``-Feld ausgegeben, das "Marie". enthält.
it: Questa funzione permette di ricercare i record contenenti un campo corrispondente al valore degli attributi SAML dell'utente che esegue la query. Ad esempio, ``#attr(firstname, user_first_name)``, eseguita da un utente il cui attributo SAML ``user_first_name`` sia "Marie", restituirà i record in cui il campo ``firstname`` contiene "Marie".

source: **Available parameters for the ``#now`` function**:
de: **Verfügbare Parameter für die ``#now`` Funktion**:
it: **Parametri disponibili per la funzione``#now``**:

source: years, months, weeks, days, hours, minutes, seconds, microseconds: These parameters add time to the current date.
de: Jahre, Monate, Wochen, Tage, Stunden, Minuten, Sekunden, Mikrosekunden: Diese Parameter ergänzen das aktuelle Datum um die Uhrzeit.
it: years, months, weeks, days, hours, minutes, seconds, microseconds: questi parametri aggiungono il tempo alla data corrente.

source: For example: ``#now(years=-1, hours=-1)`` returns the current date minus a year and an hour
de: Beispiel: ``#now(years=-1, hours=-1)`` gibt das aktuelle Datum minus 1 Jahr und 1 Stunde zurück
it: Ad esempio: ``#now(years=-1, hours=-1)`` restituisce la data corrente meno un anno e un'ora.

source: year, month, day, hour, minute, second, microsecond: can also be used to specify an absolute date.
de: Jahr, Monat, Tag, Stunde, Minute, Sekunde, Mikrosekunde: Diese Parameter können auch zur Angabe eines absoluten Datums verwendet werden.
it: year, month, day, hour, minute, second, microsecond: possono essere utilizzati anche per specificare una data assoluta.

source: For example: ``#now(year=2001)`` returns the current time, day and month for year 2001
de: Beispiel: ``#now(year=2001)`` gibt die aktuelle Uhrzeit, den Tag und den Monat für das Jahr 2001 zurück
it: Ad esempio: ``#now(year=2001)`` restituisce l'ora, il giorno e il mese correnti per l'anno 2001.

source: weekday: Specifies a day of the week. This parameter accepts either an integer between 0 and 6 (where 0 is Monday and 6 is Sunday) or the first two letters of the day (in English) followed by the cardinal of the first week on which to start the query.
de: weekday: Gibt einen Wochentag an. Dieser Parameter akzeptiert entweder eine Ganzzahl zwischen 0 und 6 (wobei Montag 0 und Sonntag 6 ist) oder die ersten beiden Buchstaben des entsprechenden Tages (auf Englisch), gefolgt von der Kardinalzahl der ersten Woche, an der die Suche beginnen soll.
it: weekday: specifica il giorno della settimana. Questo parametro accetta numeri interi compresi tra 0 e 6 (dove 0 è lunedì e 6 è domenica), oppure le prime due lettere del giorno in inglese seguite dal numero cardinale della prima settimana in cui iniziare la query.

source: ``#now(weeks=-2, weekday=1)`` returns the Tuesday before last.
de: ``#now(weeks=-2, weekday=1)`` gibt den Dienstag vor dem letzten an.
it: ``#now(weeks=-2, weekday=1)`` restituisce il penultimo martedì appena trascorso.

source: ``#now(weekday=MO(2))`` returns Monday after next.
de: ``#now(weekday=MO(2))`` gibt den Montag nach dem folgenden an.
it: ``#now(weekday=MO(2))`` restituisce il lunedì dopo il prossimo.

source: Geo Filtering
de: Geofilterung
it: Filtro di geografico

source: Records search accept geofilter parameters to filter in records which are located in a specific geographical area.
de: Eintragsuch akzeptieren Geofilter-Parameter zum Filtern von Einträgen, die sich in einem bestimmten geografischen Gebiet befinden.
it: Le ricerca dei record accettano i parametri di filtro geografico per filtrare i record situati in determinate aree geografiche.

source: The following parameters may be used.
de: Folgende Parameter können verwendet werden:
it: È possibile utilizzare i seguenti parametri.

source: Limits the result set to a geographical area defined by a circle (coordinates of the center of the circle expressed in WGS84 and distance expressed in meters): latitude,longitude,distance: ``geofilter.distance=48.8520930694,2.34738897685,1000``
de: Begrenzt das Ergebnis auf ein bestimmtes geografisches Gebiet, das durch einen Kreis definiert ist (Koordinaten der Kreismitte in WGS84 angegeben, Entfernung in Metern): ``Breitengrad, Längengrad, Entfernung``: ``geofilter.distance=48.8520930694,2.34738897685,1000``
it: Limita il set di risultati a un'area geografica definita da un cerchio (le coordinate del centro del cerchio sono espresse in formato WGS84 e la distanza è espressa in metri): latitudine,longitudine,distanza: ``geofilter.distance=48.8520930694,2.34738897685,1000``.

source: Note
de: Hinweis

source: This query parameter is equivalent to the ``#distance`` function described at the beginning of this documentation.
de: Dieser Anfrageparameter entspricht der am Anfang dieser Dokumentation beschriebenen Funktion ``#distance``.

source: Limits the result set to a geographical area defined by a polygon (coordinates of the points expressed in WGS84 as in (lat1,lon1),(lat2,lon2),(lat3,lon3): ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
de: Begrenzt das Ergebnis auf ein bestimmtes geografisches Gebiet, das durch ein Vieleck definiert ist (Koordinaten der Ecken in WGS84 angegeben: (lat1,lon1),(lat2,lon2),(lat3,lon3): ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``

source: ``film OR trees``
it: ``film OR alberi``

source: ``(film OR trees) AND paris``
it: ``(film OR alberi) AND roma``

source: Parameter Name
it: Nome parametro

source: Limits the result set to a geographical area defined by a polygon (coordinates of the points expressed in WGS84 as in ((lat1,lon1),(lat2,lon2),(lat3,lon3)): ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``
it: Limita il set di risultati a un'area geografica definita da un poligono (le coordinate dei punti sono espresse in formato WGS84 come in ((lat1,lon1),(lat2,lon2),(lat3,lon3)): ``geofilter.polygon=(48.883086,2.379072),(48.879022,2.379930),(48.883651,2.386968)``.
