Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/09_managing_dataset_security/security.po
Languages: de, es, fr, it, nl

source: Managing security
de: Verwalten der Sicherheit
es: Administrar la seguridad
fr: Gérer la sécurité
it: Gestione della sicurezza
nl: Veiligheid beheren

source: You can manage access, visibility on data and edition permissions on a per dataset basis, on each dataset publishing interface. Of course the first condition for a user to able to access a dataset is to have access to the domain as a whole.
de: Den Zugriff, die Sichtbarkeit von Daten und die Bearbeitungsberechtigungen können Sie für jeden Datensatz über jede Schnittstelle zur Datensatzveröffentlichung verwalten. Die Grundvoraussetzung für den Zugriff eines Benutzers auf einen Datensatz ist natürlich der Zugriff auf die gesamte Domain.
es: Puede administrar el acceso, la visibilidad de los datos y los permisos de edición para cada uno de los juegos de datos, en la interfaz de publicación de cada uno de ellos. Por supuesto, la primera condición para que un usuario pueda acceder a un juego de datos es tener acceso al dominio en su conjunto.
fr: Vous pouvez gérer individuellement les accès, la visibilité des données et les permissions d'édition de chaque jeu de données, depuis leur interface de publication. Bien entendu, la première condition pour qu'un utilisateur puisse accéder à un jeu de données est qu'il puisse avoir accès au domaine de manière générale.
it: Su ogni interfaccia di pubblicazione è possibile gestire l’accesso, la visibilità dei dati e i permessi di modifica per ogni singolo dataset. Naturalmente, affinché un utente possa accedere a un dataset è necessario prima di tutto che disponga dell'accesso al dominio.

source: Dataset exploration permissions
de: Datensatzuntersuchungsberechtigungen
es: Permisos de exploración de juegos de datos
fr: Permissions d'exploration du jeu de données
it: Autorizzazioni alla consultazione dei dataset
nl: Exploratietoelatingen voor datasets

source: Dataset access rights
de: Datensatzzugriffsrechte
es: Derechos de acceso a juegos de datos
fr: Droits d'accès du jeu de données
it: Diritti di accesso ai dataset
nl: Toegangsrechten voor datasets

source: If you want anyone with access to your domain to be able to explore the dataset, you must uncheck the `Access restricted to allowed users and groups` option.
de: Wenn Sie möchten, dass jeder, der Zugriff auf die Domain hat, den Datensatz untersuchen kann, müssen Sie die Option `Zugriff auf zulässige Benutzer und Gruppen beschränkt` deaktivieren.
es: Si desea que cualquier usuario con acceso al dominio pueda explorar el juego de datos, debe desmarcar la opción `Acceso restringido a usuarios y grupos permitidos`.
fr: Si vous souhaitez que tout utilisateur ayant accès à votre domaine soit autorisé à explorer le jeu de données, vous devez décocher l'option `Accès limité aux utilisateurs et aux groupes autorisés`.
it: Se desideri permettere di esplorare i dataset a tutti gli utenti che hanno accesso al tuo dominio, devi deselezionare l'opzione `Accesso riservato agli utenti e ai gruppi autorizzati`.
nl: Wanneer u niet wil dat iemand, die toegang heeft tot uw domein, de dataset kan exploreren, moet u de optie "Toegang beperkt tot toegelaten gebruikers en groepen" uitvinken.

source: In this case, you can apply general filters for all people that access your dataset (see below for filter configuration). That filters will apply to all people that do not fall into the users and groups explicitly listed for this dataset. If a user is matched in the specific list of users, the general filters **will not apply**.
de: In dem Fall können Sie allgemeine Filter für alle anwenden, die auf Ihren Datensatz zugreifen (Filterkonfiguration siehe weiter unten). Diese Filter gelten für alle, die nicht unter die explizit für diesen Datensatz aufgelisteten Benutzer oder Gruppen fallen. Die allgemeinen Filter **gelten nicht** bei Übereinstimmung eines Benutzers mit der spezifischen Benutzerliste.
es: En este caso, puede aplicar filtros generales para todas las personas que acceden al juego de datos (vea a continuación la configuración de filtros). Estos filtros se aplicarán a todas las personas que no se correspondan con los usuarios y grupos incluidos explícitamente en la lista de este juego de datos. Si un usuario está incluido en la lista específica de usuarios, los filtros generales **no se aplicarán**.
fr: Dans ce cas, vous pouvez appliquer des filtres généraux à toutes les personnes qui accèdent à votre jeu de données (la configuration des filtres est expliquée plus bas). Ces filtres s'appliqueront à toutes les personnes autres que les utilisateurs et les groupes explicitement répertoriés pour le jeu de données. Si un utilisateur se trouve dans la liste répertoriant spécifiquement les utilisateurs, les filtres généraux **ne sont pas appliqués**.
it: In questo caso, potrai impostare alcuni filtri validi in generale per gli utenti che accedono al dataset, configurandoli in base alle indicazioni riportate più sotto. I filtri saranno attivi per tutti coloro che non rientrano tra gli utenti e i membri dei gruppi già esplicitamente autorizzati all’accesso. Se un utente appartiene a uno di questi elenchi specifici, i filtri generali **non verranno applicati**.
nl: In dit geval past u algemene filters toe voor alle mensen die toegang hebben tot uw dataset (zie hieronder voor de configuratie van filters). Die filters zullen worden toegepast op alle mensen die niet expliciet behoren tot de lijst met gebruikers en groepen die toegang hebben tot deze dataset. Wanneer een gebruiker in de specifieke lijst met gebruikers staat, zullen de algemene filters **niet van toepassing zijn**.

source: You may also want to restrict the availability of the dataset to a defined list of persons, explicitly listed for this dataset. In this case, you want to check the `Access restricted to allowed users and groups` and add the users and groups that can access to the list accessible below in the interface.
de: Eventuell möchten Sie auch die Verfügbarkeit des Datensatzes auf eine bestimmte Personenliste beschränken, die explizit für diesen Datensatz festgelegt wurde. In dem Fall müssen Sie die Option `Zugriff auf zulässige Benutzer und Gruppen beschränkt` aktivieren und die Benutzer bzw. Gruppen, denen der Zugriff gewährt wird, zur unten in der Schnittstelle verfügbaren Liste hinzufügen.
es: Asimismo, puede que desee restringir la disponibilidad del juego de datos a una lista definida de personas explícitamente para este juego de datos. En este caso, puede interesarle seleccionar `Acceso restringido a usuarios y grupos permitidos` y añadir los usuarios y grupos con acceso a la lista bajo la interfaz.
fr: Vous pouvez également souhaiter limiter la disponibilité du jeu de données à une liste de personnes spécifiques, définie spécialement pour ce jeu de données. Pour cela, vous devez cocher la case `Accès limité aux utilisateurs et aux groupes autorisés` et ajouter les utilisateurs et les groupes autorisés à accéder au jeu de données dans la liste qui s'affiche alors en dessous dans l'interface.
it: Puoi anche limitare la disponibilità del dataset a un elenco di persone esplicitamente indicate. In questo caso, devi selezionare l'opzione `Accesso riservato agli utenti e ai gruppi autorizzati` e inserire gli utenti e i gruppi autorizzati nell'elenco presente più in basso nell’interfaccia.

source: Data visibility filters
de: Datensichtbarkeitsfilter
es: Filtros de visibilidad de datos
fr: Filtres de visibilité des données
it: Filtri per la visibilità dei dati
nl: Zichtbaarheidsfilters voor data

source: For each category of person (anyone, listed user, user in a listed group) that can see the dataset, you can set rules to restrict the data they really see.
de: Für jede Kategorie von Personen (jeder, aufgelisteter Benutzer, Benutzer in einer aufgelisteten Gruppe), die den Datensatz sehen können, können Sie Regeln zur Einschränkung der tatsächlich von Ihnen gesehenen Daten festlegen.
es: Para cada categoría de persona (cualquier usuario, un usuario de la lista o un usuario de un grupo de la lista) que puede ver el juego de datos, puede establecer reglas a fin de restringir los datos que realmente ven.
fr: Pour chaque catégorie de personnes (tout le monde, utilisateur répertorié, utilisateur d'un groupe répertorié) pouvant consulter le jeu de données, vous pouvez définir des règles pour restreindre les données réellement consultables.
it: Per tutti coloro che hanno accesso al dataset, compresi gli utenti o i membri di gruppi inseriti nell’elenco di autorizzati, è possibile impostare regole che limitino la visibilità.
nl: Voor elke categorie personen (iedereen, in de lijst opgenomen gebruiker, gebruiker in een in de lijst opgenomen groep) die de dataset kunnen zien, kan u regels instellen om de data die ze daadwerkelijk zien, te beperken.

source: You have three different options available that you can combine. First you can decide wether the data is accessible at all, using the option `data is visible`. If you uncheck this input, the user will only be able to access the information (metadata) part of the dataset, including the list of fields. If you restrict the visibility of the data, you should explain to your user how they can access the data, either by contacting the domain administrators or going to an external billing system or any other case you can think about.
de: Zur Verfügung stehen Ihnen drei verschiedene, kombinierbare Optionen. Zunächst können Sie mithilfe der Option `Daten sind sichtbar` festlegen, ob die Daten überhaupt zugänglich sind. Bei Deaktivierung dieser Option kann ein Benutzer nur auf den Informationsbereich (Metadaten) des Datensatzes zugreifen, Felderliste eingeschlossen. Schränken Sie die Sichtbarkeit der Daten ein, sollten Sie Ihrem Benutzer erklären, wie er auf die Daten zugreifen kann: entweder durch Kontaktieren der Domainadministratoren, Inanspruchnahme eines externen Abrechnungssystems oder jeden anderen denkbaren Fall.
es: Dispone de 3 opciones distintas para combinarlas. En primer lugar, puede decidir si los datos son accesibles o no, con la opción `Los datos son visibles`. Si desmarca esta entrada, el usuario solo podrá acceder a la parte de información (metadatos) del juego de datos, incluida la lista de campos. Si restringe la visibilidad de los datos, debería explicar al usuario cómo puede acceder a los datos, o bien poniéndose en contacto con los administradores del dominio, o bien accediendo a un sistema de facturación externo, o bien cualquier otra posibilidad.
fr: Vous disposez de trois options que vous pouvez combiner. Vous pouvez tout d'abord décider si les données sont accessibles ou non, à l'aide de l'option `données visibles`. Si vous décochez cette option, l'utilisateur aura uniquement accès aux informations (métadonnées) du jeu de données, y compris la liste des champs. Si vous limitez la visibilité des données, il est recommandé d'expliquer aux utilisateurs comment ils peuvent y accéder, soit en contactant les administrateurs du domaine, soit en vous rendant sur un système de facturation externe, ou en suivant toute autre méthode de votre choix.
it: Puoi combinare tre diverse opzioni. Innanzitutto hai la possibilità di rendere i dati accessibili a tutti, attivando l'opzione `I dati sono visibili`. Se deselezioni questa casella, l'utente potrà accedere solo alle informazioni sul dataset (metadati), tra cui l'elenco dei campi. Se limiti la visibilità dei dati, dovresti illustrare agli utenti le modalità di accesso che hai definito (contattare gli amministratori del dominio, collegarsi a un sistema di pagamento esterno, ecc.).

source: If you keep the data visible, the other two filters will apply. They allow you to define what fields and records that will be visible.
de: Lassen Sie die Daten sichtbar, kommen die beiden anderen Filter zur Anwendung. Mit ihnen können Sie definieren, welche Felder und Einträge sichtbar sein werden.
es: Si mantiene la visibilidad de los datos, los 2 filtros adicionales permiten definir qué campos y registros serán visibles.
fr: Si vous décidez de laisser les données visibles, les deux autres filtres seront appliqués. Ils vous permettent de définir quels champs et quels enregistrements seront visibles.
it: Se mantieni visibili i dati, potrai applicare gli altri due filtri, che ti permettono di definire quali campi e quali record rendere consultabili.
nl: Wanneer u de data zichtbaar houdt, zullen de andere twee filters van toepassing zijn. Ze stellen u in staat te bepalen welke velden en records zichtbaar zullen zijn.

source: With the list of fields, you can keep columns private to some users, for example for columns that are used for internal data management on an open data dataset.
de: Über die Felderliste können Sie Spalten einigen Benutzern vorbehalten, beispielsweise Spalten, die der internen Datenverwaltung eines offenen Datensatzes dienen.
es: Con la lista de campos, puede hacer que haya columnas privadas para algunos usuarios, Por ejemplo, sería el caso de las columnas utilizadas para la administración de datos internos en un juego de datos de un portal de datos abiertos.
fr: Dans la liste des champs, vous pouvez rendre les colonnes visibles pour certains utilisateurs uniquement, par exemple pour les colonnes utilisées dans la gestion des données internes d'un jeu de données Open Data.
it: Nell’elenco dei campi puoi includere le colonne che desideri nascondere ad alcuni utenti, ad esempio quelle utilizzate per la gestione interna nei dataset open data.
nl: Met de lijst met velden kan u kolommen priv√© houden voor sommige gebruikers, bijvoorbeeld kolommen die gebruikt worden voor intern databeheer of een open data dataset.

source: The query filter permits you to restrict the rows visible for users. It uses the same query language as the search on dataset. This filter will be applied before the user crafted queries and are not visible by the end-user that consumes the data.
de: Mit dem Anfragefilter können Sie die für Benutzer sichtbaren Zeilen einschränken. Er verwendet die gleiche Anfragesprache wie die Suche in einem Datensatz. Dieser Filter wird angewendet, bevor der Benutzer Anfragen stellt; er ist für den Endbenutzer der Daten nicht sichtbar.
es: El filtro de consulta permite restringir las filas visibles para los usuarios. Emplea el mismo lenguaje de consulta que la búsqueda en el juego de datos. Este filtro se aplicará antes de que el usuario realice las consultas y no será visible para el usuario final que consuma los datos.
fr: Le filtre de requête vous permet de limiter les lignes visibles par les utilisateurs. Il utilise le même langage de requête que la recherche sur un jeu de données. Ce filtre sera appliqué avant les requêtes saisies par l'utilisateur et n'est pas visible par l'utilisateur final qui consomme les données.
it: Il filtro di query permette di ridurre le righe visibili agli utenti e si basa sullo stesso linguaggio query utilizzato per le ricerche. Questo filtro viene applicato prima delle query impostate dagli utenti e non è visibile da chi usufruisce i dati.
nl: De zoekfilter laat u toe om de rijen die zichtbaar zijn voor gebruikers te beperken. Deze gebruikt dezelfde zoektaal als de zoekopdracht op dataset. Deze filter wordt toegepast voordat de gebruiker zoekopdrachten heeft uitgewerkt en zijn niet zichtbaar voor de eindgebruiker die de data consumeert.

source: Management rights on the dataset
de: Verwaltungsrechte für einen Datensatz
es: Derechos de administración de juegos de datos
fr: Droits de gestion sur le jeu de données
it: Diritti di gestione del dataset
nl: Beheerrechten op de dataset

source: The dataset management (edition and publishing) is only accessible to user that are listed, either explicitly or through groups, in the security configuration of the dataset and that are given the edit or publish rights. Domain administrators also have the rights to edit all datasets.
de: Auf die Datensatzverwaltung (Bearbeitung und Veröffentlichung) können nur Benutzer zugreifen, die entweder explizit oder durch Gruppen in der Sicherheitskonfiguration eines Datensatzes aufgelistet sind und über Bearbeitungs- oder Veröffentlichungsrechte verfügen. Domainadministratoren verfügen ebenfalls über die Rechte zur Bearbeitung aller Datensätze.
es: Las tareas de administración del juego de datos (edición y publicación) solo están accesibles para los usuarios que figuran en la lista, explícitamente o mediante grupos, de la configuración de seguridad del juego de datos y a los cuales se ha concedido los derechos de edición o publicación. Los administradores del dominio también tienen los derechos para editar todos los juegos de datos.
fr: La gestion du jeu de données (édition et publication) est uniquement accessible aux utilisateurs répertoriés, explicitement ou de par leur présence dans un groupe, dans la configuration de la sécurité du jeu de données, et à ceux disposant des droits d'édition ou de publication. Les administrateurs du domaine ont également le droit d'éditer tous les jeux de données.
it: La modifica e la pubblicazione del dataset è consentita solo agli utenti elencati (singolarmente o tramite i gruppi) nella configurazione di sicurezza del dataset stesso, a condizione che questi dispongano dei diritti di modifica o di pubblicazione. Gli amministratori del dominio hanno inoltre i diritti di modifica su tutti i dataset.

source: You can manage access, visibility on data, and edition permissions on a per dataset basis, on each dataset publishing interface. The first condition for a user to access a dataset is to have access to the domain as a whole.
nl: U kan de toegang, zichtbaarheid van data en toelatingen om te bewerken per dataset beheren op de publicatie-interface van elke dataset. De eerste voorwaarde voor een gebruiker om toegang te krijgen tot een dataset is dat hij toegang heeft tot het domein als een geheel.

source: You may also want to restrict the availability of the dataset to a defined list of persons explicitly listed for this dataset. In this case, you want to check the Access restricted to allowed users and groups and add the users and groups that can access the list accessible below in the interface.
nl: Mogelijk wil u ook de beschikbaarheid van de dataset beperken tot een welbepaalde lijst met personen, die expliciet opgemaakt is voor deze dataset. In dit geval kan u de optie "Toegang beperkt tot toegelaten gebruikers en groepen" aanvinken en gebruikers en groepen toevoegen die toegang krijgen tot de lijst die onderaan in de interface beschikbaar is.

source: You have three different options available that you can combine. First, you can decide whether the data is accessible or not using the Data is visible check box. If you clear this check box, the user will only be able to access the information (metadata) part of the dataset, including the list of fields. If you restrict the visibility of the data, you should explain to your user how they can access the data, either by contacting the domain administrators or going to an external billing system or any other case you can think about.
nl: Er zijn drie verschillende opties beschikbaar die u kan combineren. Allereerst kan u beslissen of de data toegankelijk zijn door gebruik te maken van de optie "data zijn zichtbaar". Wanneer u deze input uitvinkt, zal de gebruiker enkel toegang krijgen tot het informatiedeel (metadata) van de dataset, inclusief de lijst met velden. Wanneer u de zichtbaarheid van de data beperkt, zou u aan uw gebruiker moeten uitleggen hoe hij toegang kan hebben tot de data, ofwel door de domeinbeheerder te contacteren of door naar een extern facturatiesysteem te gaan of elk ander geval waaraan u kan denken.

source: The dataset management (edition and publishing) is only accessible to the users listed, either explicitly or through groups, in the security configuration of the dataset and that are given the edit or publish rights. Domain administrators also have the right to edit all datasets. Domain administrators also have the rights to edit all datasets.
nl: Het datasetbeheer (bewerken en publiceren) is enkel toegankelijk voor gebruikers die in de lijst zijn opgenomen, ofwel expliciet ofwel via groepen, in de veiligheidsconfiguratie van de dataset en aan wie bewerk- of publicatierechten zijn gegeven. Domeinbeheerders beschikken ook over de rechten om alle datasets te bewerken.
