Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/02_creating_advanced_charts/analyze.po
Languages: de, es, fr, it, nl

source: Let's add another dataset! Look for "Commodity Prices" to find `Commodity Prices since 1980 <https://public.opendatasoft.com/explore/dataset/commodity-prices-since-1980>`_ dataset from the OpenDataSoft public collection.
de: Fügen wir einen weiteren Datensatz hinzu! Suchen Sie mithilfe des Suchbegriffs "Rohstoffpreise" nach dem Datensatz `Rohstoffpreise seit 1980 <https://public.opendatasoft.com/explore/dataset/commodity-prices-since-1980>`_ in der öffentlichen OpenDataSoft-Sammlung.
es: ¡Vamos a añadir otro conjunto de datos! Busque "Commodity Prices" para encontrar el conjunto de datos `Commodity Prices since 1980 <https://public.opendatasoft.com/explore/dataset/commodity-prices-since-1980>`_ en la colección pública de OpenDataSoft.
fr: Ajoutons un autre jeu de données ! Recherchez "Commodity Prices" (Prix des denrées) pour trouver le jeu de données `Commodity Prices since 1980 <https://public.opendatasoft.com/explore/dataset/commodity-prices-since-1980>`_ correspondant dans la base publique d'OpenDataSoft.
it: A questo punto, aggiungiamo un altro dataset. Cerca "Commodity Prices" per trovare il dataset `Commodity Prices since 1980 <https://public.opendatasoft.com/explore/dataset/commodity-prices-since-1980>`_ nella collezione pubblica di OpenDataSoft.
nl: Laten we een andere dataset toevoegen!. Zoek naar "Grondstoffenprijzen" om de dataset `Grondstoffenprijzen sinds 1980 <https://public.opendatasoft.com/explore/dataset/commodity-prices-since-1980>`_ uit de publieke verzameling van OpenDataSoft.

source: This time, add the filter "`date>1987`" so that the X-axis will match with the first layer. Then import the ~20 000 records.
de: Fügen Sie diesmal den Filter "`Datum>1987`" hinzu, damit die X-Achse mit der ersten Schicht übereinstimmt. Importieren Sie dann die ~20 000 Datensätze.
es: En esta ocasión, añada el filtro "`date>1987`" para que el eje X coincida con la primera capa. A continuación, importe los cerca de 20.000 registros.
fr: Cette fois, ajoutez un filtre "`date>1987`" pour que les abscisses correspondent à la première couche. Importez ensuite les quelque 20 000 enregistrements.
it: Questa volta, aggiungi il filtro "`date>1987`", in modo che l'asse X corrisponda al primo layer. Esegui quindi l'importazione dei ~20.000 record.
nl: Voeg dit keer de filter "`datum>1987`" toe zodat de X-as overeenstemt met de eerste laag. Importeer vervolgens de ~20 000 records.

source: The default visualization is a line with the average commodity price.
de: Die Standardvisualisierung ist eine Linie mit dem durchschnittlichen Rohstoffpreis.
es: La visualización predeterminada es una línea con el precio promedio del artículo de consumo (`Commodity Average Price` ).
fr: La visualisation par défaut est une ligne avec les prix moyens des denrées.
it: La visualizzazione predefinita consiste in una linea che indica il prezzo medio del prodotto.
nl: De standaard weergave is een lijn met de gemiddelde grondstoffenprijs.

source: You should see your query filter just under the dataset name: "`query: date>1987`".
de: Ihren Anfragefilter unmittelbar unter dem Datensatznamen sollten Sie folgendermaßen einstellen: "`Anfrage: Datum>1987`".
es: Debería observar el filtro de consulta justo debajo del nombre de conjunto de datos: "`query: date>1987`".
fr: Vous devriez voir votre filtre de requête juste en dessous du nom du jeu de données : "`query: date>1987`".
it: Il filtro della query è riportato sotto il nome del dataset: "`query: date>1987`".
nl: U zou de filter voor uw zoekopdracht moeten zien net onder de naam van de dataset: "`zoekopdracht: datum>1987`".

source: You can click on the pencil icon |edit-pencil| of a layer to change the selected dataset or refine the query.
de: Sie können auf das Freihandwerkzeugsymbol |edit-pencil| einer Schicht klicken, um den ausgewählten Datensatz zu ändern oder eine Anfrage zu verfeinern.
es: Puede hacer clic en el icono de lápiz |edit-pencil| de una capa para cambiar el conjunto de datos seleccionado o refinar la consulta.
fr: Pour changer le jeu de données sélectionné ou affiner votre requête, vous pouvez cliquer sur l'icône de crayon |edit-pencil| d'une couche.
it: Per cambiare il dataset selezionato o affinare la query, clicca sulle icone a forma di matita |edit-pencil| dei layer.
nl: U kan op het potloodpictogram |edit-pencil| van een laag klikken om de geselecteerde dataset te wijzigen of om de zoekopdracht te verfijnen.

source: Under Configuration > Label, set "`Commodity Average Price`" as the alternate serie title (more accurate than the default title)
de: Legen Sie unter Konfiguration > Beschriftung als alternativen Verbindungslinientitel "`Rohstoffdurchschnittspreis`" fest (akkurater als der Standardtitel).
es: Bajo Configuración > Etiqueta, establezca "`Commodity Average Price`" como título de la serie alternativo (más preciso que el título predeterminado).
fr: Sous Configuration > Label, définissez "`Prix moyen des denrées`" comme titre alternatif de la série (plus représentatif que celui par défaut).
it: In Configurazione > Etichetta, imposta "`Commodity Average Price`" come Titolo di serie alternativo, più accurato rispetto al titolo predefinito.
nl: Stel onder Configuratie > Label "`Gemiddelde grondstoffenprijs`" in als alternatieve reekstitel (nauwkeuriger dan de standaard titel)

source: This should look like this (you may have different colors): |second-layer|
de: Das Ergebnis sollte folgendermaßen aussehen (Sie können andere Farben haben): |second-layer|
es: Debería tener el aspecto siguiente (los colores pueden variar): |second-layer|
fr: Voici le résultat que vous devez obtenir (les couleurs peuvent différer) : |second-layer|
it: Il grafico si presenterà come segue, anche se i colori selezionati potrebbero essere diversi: |second-layer|
nl: Dit zou er zo moeten uitzien (de kleuren kunnen verschillend zijn): |second-layer|

source: **Third Layer**
de: **Zweite Schicht**
es: **Tercera capa**
fr: **Troisième couche**
it: **Terzo layer**
nl: **Derde laag**

source: For the final layer, we are going to use `Global Financial Development` from WorldBank to see if there are some correlation between those.
de: Für die letzte Schicht werden wir `Globale Finanzentwicklung` von WorldBank verwenden, um zu sehen, ob es einige Korrelationen zwischen ihnen gibt.
es: Para la última capa, vamos a usar `Global Financial Development` de WorldBank para ver si hay alguna correlación entre estos.
fr: Pour la dernière couche, nous allons utiliser le jeu de données `Global Financial Development` (Développement financier mondial) de la Banque mondiale pour voir s'il y a un rapport direct entre toutes ces données.
it: Per il layer finale, utilizzeremo il dataset `Global Financial Development` della Banca Mondiale per vedere se esistono correlazioni.
nl: Voor de laatste laag gaan we `Global Financial Development` van de Wereldbank gebruiken om te zien of er een correlatie tussen bestaat.

source: There are more than a million records: for the chart to make sense, we will limit the records to the USA. Like the previous layer, we will also keep only records after year 1987.
de: Es gibt über eine Million Datensätze: Damit das Diagramm Sinn ergibt, werden wir die Datensätze auf die USA beschränken. Wie in der vorherigen Schicht werden wir auch nur Datensätze nach 1987 berücksichtigen.
es: Hay más de un millón de registros: para que el gráfico sea relevante, limitaremos los registros a Estados Unidos. Como en la capa anterior, también conservaremos únicamente los registros posteriores al año 1987.
fr: Étant donné qu'il y a plus d'un million d'enregistrements, nous allons nous limiter aux États-Unis pour que le graphe soit cohérent. Comme pour la couche précédente, nous n'allons garder que les enregistrements ultérieurs à 1987.
it: Poiché contiene più di un milione di record, per ottenere un grafico che abbia senso limiteremo i dati ai record degli Stati Uniti. Come per il layer precedente, considereremo solo i record successivi all'anno 1987.
nl: Er zijn meer dan één miljoen records: opdat de grafiek zin heeft, zullen we ons beperken tot de records uit de VS. Net zoals de vorige laag gaan we ook enkel de records bijhouden van na het jaar 1987.

source: These conditions translate to this query: "country_code: USA and year>1987`"
de: Diese Bedingungen ergeben diese Anfrage: "Land_Code: USA und Jahr>1987`"
es: Estas condiciones se convierten en esta consulta: "country_code: USA y year>1987`".
fr: Ces conditions se traduisent dans la requête suivante : "country_code: USA and year>1987"
it: Queste condizioni verranno espresse dalla seguente query: "country_code: USA and year>1987`"
nl: Deze voorwaarden vertalen zich in deze zoekopdracht: "country_code: USA and year>1987`"

source: As for the second layer, configure a more explicit label name for the legend: "Global Financial Development"
de: Konfigureren Sie wie bei der zweiten Schicht eine explizitere Legendenbeschriftung: "Globale Finanzentwicklung"
es: Como en la segunda capa, configure un nombre de etiqueta más explícito para la leyenda: "Global Financial Development".
fr: Comme pour la deuxième couche, définissez un titre plus explicite pour la légende : "Développement financier mondial".
it: Come per il secondo layer, configuriamo un nome più esplicito per l'etichetta della legenda: "Global Financial Development".
nl: Configureer nu, net zoals voor de tweede laag, een meer expliciete labelnaam voor de legende: "Global Financial Development"

source: **Last details**
de: **Letzte Details**
es: **Últimos detalles**
fr: **Finalisation**
it: **Ultimi dettagli**
nl: **Laatste details**

source: Let's finish with a few last details to polish the Chart appearance
de: Verleihen wir der Diagrammdarstellung nun noch durch einige Details den letzten Schliff.
es: Vamos a terminar con varios detalles finales para pulir la apariencia del gráfico.
fr: Pour finir, occupons-nous de quelques détails pour améliorer l'apparence du graphe.
it: Terminiamo con alcuni dettagli per perfezionare l'aspetto del grafico.
nl: Laten we afsluiten met enkele laatste details om het voorkomen van de grafiek op te poetsen.

source: Set ``Global Precision`` to `Year` instead of `Month` so that the legend reflects the data precision.
de: Stellen Sie ``Globale Präzision`` auf `Jahr` anstatt `Monat` ein, damit die Legende die Datenpräzision widerspiegelt.
es: Establezca ``Precisión global`` en el valor `Año` en lugar de `Mes` para que la leyenda refleje la precisión de los datos.
fr: Définissez ``Échelle globale`` sur `Année` à la place de `Mois` pour que la légende serve mieux la précision des données.
it: Imposta la ``Precisione Globale`` su `Anno` anziché su `Mese`, in modo che la legenda abbia la stessa precisione dei dati.Imposta la ``Precisione Globale`` su `Anno` anziché su `Mese`, in modo che la precisione della legenda sia allo stessi livello di quella dei dati.
nl: Stel ``Globale nauwkeurigheid`` in op `Jaar` in plaats van op `Maand` zodat de legende de nauwkeurigheid van de data weerspiegelt.

source: Delete `WTI Spot Price` serie (click on the X cross) and set the X-axis to a Year precision instead of Month
de: Löschen Sie die Verbindungslinie `WTI-Spotpreis` (Klick auf das Kreuz X) und stellen Sie die Präzision für die X-Achse auf Jahr statt Monat ein.
es: Suprima la serie `WTI Spot Price` (haga clic en la cruz X) y establezca el eje X en una precisión anual en lugar de mensual.
fr: Supprimez la série `Prix WTI Spot Price` (Cours du prix du baril WTI) en cliquant sur la croix et définissez les abscisses sur une échelle par an et non par mois.
it: Elimina la serie `WTI Spot Price` (clicca sul simbolo della croce X) e imposta la precisione dell'asse X su Anno anziché Mese.
nl: Verwijder de reeks `WTI Spot Price` (klik op het X-kruisje) en stel de X-as in op een nauwkeurigheid Jaar in plaats van Maand

source: Choose ``Spline`` instead of ``Line`` in the Global Financi`al Development curve to smoothen the curve a bit.
de: Wählen Sie ``Spline`` anstatt ``Linie`` in der globalen Finanzentwicklungskurve aus, um sie ein wenig zu glätten.
es: Seleccione ``Spline`` en lugar de ``Línea`` en la visualización de `Global Financial Development` para suavizar un poco la curva.
fr: Choisissez ``Courbe`` à la place de ``Ligne`` pour la représentation de la série Développement financier mondial afin d'adoucir légèrement la courbe.
it: Scegli ``Spline`` anziché ``Riga`` nella curva Global Financial Development per renderla più uniforme.
nl: Kies `Kromme`` in plaats van ``Lijn`` in de curve Global Financial Development om de curve iets af te vlakken.

source: Now you can type a name in ``Chart title`` and click ``Save this chart`` to save create a short URL that you can embed or share!
de: Jetzt können Sie in ``Diagrammtitel`` einen Namen eingeben und auf ``Diagramm speichern`` klicken, um eine Kurz-URL zu erstellen, die eingebettet oder geteilt werden kann!
es: Ahora puede escribir un nombre en ``Título de gráfico`` y hacer clic en ``Guardar este gráfico`` para guardarlo y crear una dirección URL corta que podrá incrustar o compartir.
fr: Vous pouvez désormais entrer un nom dans ``Titre du graphe`` et cliquer sur ``Enregistrer ce graphe`` pour créer une URL courte que vous pouvez intégrer ou partager.
it: A questo punto, inserisci un nome in ``Titolo del grafico`` e clicca su ``Salva questo grafico``. Verrà così creato un breve URL che potrai utilizzare come embed o condividere.
nl: Nu kan u een naam invoeren in ``Type grafiek`` en klikken op ``Sla deze grafiek op``. Maak een korte URL aan die u kan invoegen of delen!

source: Here are the resulting parameters:
de: Daraus ergeben sich folgende Parameter:
es: Estos son los parámetros obtenidos:
fr: Voici les paramètres générés :
it: Ecco i parametri risultanti:
nl: Dit zijn de eruit voortvloeiende parameters:

source: And the final result of the chart:
de: Und das Endergebnis des Diagramms:
es: Y el resultado final del gráfico:
fr: Et voici la version finale du graphe :
it: E la versione finale del grafico ottenuto:
nl: En het eindresultaat van de grafiek:

source: Other charts examples
de: Weitere Beispieldiagramme
es: Otros ejemplos de gráficos
fr: Autres exemples de graphes
it: Altri esempi di grafici
nl: Voorbeelden van andere grafieken

source: **Column Chart**
de: **Säulendiagramm**
es: **Gráfico de columnas**
fr: **Diagramme en bâtons**
it: **Grafico a colonne**
nl: **Kolomgrafiek**

source: **Polar Chart**
de: **Polardiagramm**
es: **Gráfico polar**
fr: **Diagramme polaire**
it: **Diagramma polare**
nl: **Poolgrafiek**
