Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/02_creating_advanced_charts/analyze.po
Languages: de, es, fr, it, nl

source: Analyzing with the Chart Builder
de: Analysieren mit dem Diagrammersteller
es: Analizar con el compilador de gráficos
fr: Analyser avec l'éditeur de graphes
it: Come usare il generatore di grafici per l'analisi
nl: Analyseren met de Chart Builder

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: Read how to :doc:`configure visualizations </publishing_data/07_configuring_visualizations/03_configuring_analyze_view/analyze>` for a dataset beforehand.
de: Lesen Sie vorher die Dokumentation zum :doc:`Konfigurieren von Visualisierungen </publishing_data/07_configuring_visualizations/03_configuring_analyze_view/analyze>` für einen Datensatz.
es: Consulte cómo :doc:`configurar visualizaciones </publishing_data/07_configuring_visualizations/03_configuring_analyze_view/analyze>` para un conjunto de datos previamente.
fr: Lisez d'abord comment :doc:`configurer les visualisations </publishing_data/07_configuring_visualizations/03_configuring_analyze_view/analyze>` pour un jeu de données.
nl: Lees hoe u voor een dataset vooraf :doc:`weergaves kunt configureren </publishing_data/07_configuring_visualizations/03_configuring_analyze_view/analyze>` .

source: With the Chart Builder tool, you can visualize multiple datasets on a single customized chart. You can save your chart and easily share it, embed it, or use it as a widget.
de: Mit dem Tool Diagrammersteller können Sie mehrere Datensätze in einem einzigen benutzerdefinierten Diagramm visualisieren. Dieses Diagramm können Sie speichern und einfach teilen, einbetten oder als Widget verwenden.
es: Con la herramienta Compilador de gráficos, puede visualizar varios conjuntos de datos en un solo gráfico personalizado. Puede guardar el gráfico y compartirlo fácilmente, incrustarlo o utilizarlo como un widget.
fr: L'éditeur de graphes vous permet de visualiser plusieurs jeux de données sur un même graphe personnalisé. Vous pouvez sauvegarder votre graphe et le partager facilement, l'intégrer ou l'utiliser comme un widget.
it: Il Generatore di grafici permette di visualizzare più dataset su un unico grafico personalizzato, che può essere poi salvato, condiviso, integrato o utilizzato come widget.
nl: Met de Chart Builder tool kan u meerdere datasets op één enkele aanpasbare grafiek weergeven. U kan uw grafiek opslaan en deze gemakkelijk delen, invoegen of gebruiken als widget.

source: It is usually made available by the domain administrator in the top menu link under the codename `Charts`. The Map Builder can also be accessed using its URL: ``http://<DOMAIN ADDRESS>/chart``.
de: Normalerweise wird das Tool vom Administrator einer Domain im oberen Menü-Link unter dem Codenamen `Diagramme` bereitgestellt. Auf den Diagrammersteller kann auch über seine URL: ``http://<DOMAIN ADDRESS>/chart`` zugegriffen werden.
es: Normalmente, el administrador del dominio lo establece como disponible en el vínculo de menú superior con el nombre en código `Gráficos`. También se puede acceder al compilador de gráficos con su dirección URL: ``http://<DIRECCIÓN_DOMINIO>/chart``.
fr: En règle générale, cette fonction est intégrée par l'administrateur du domaine dans le lien du menu supérieur sous la catégorie `Graphes`. L'éditeur de graphes est également accessible via son URL : ``http://<ADRESSE DU DOMAINE>/chart``.
it: Questo strumento è solitamente messo a disposizione dall'amministratore del dominio all'interno del menu principale, sotto il nome di `Grafici`. Per accedervi è anche possibile utilizzare il seguente URL: ``http://<INDIRIZZO DEL DOMINIO>/chart``.
nl: Deze wordt meestal door de domeinbeheerder beschikbaar gesteld in de menukoppeling bovenaan onder de codenaam `Grafieken`. De Map Builder is ook toegankelijk via de URL: ``http://<DOMAIN ADDRESS>/chart``.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: You can also build charts with `Analyze` tab on a dataset page, but these are limited to the current dataset. With the Chart Builder you have much more possibilities, combining different sources from your domain and from the OpenDataSoft network.
de: Diagramme können Sie auch auf einer Datensatzseite über das Register `Analysieren` erstellen. Sie sind jedoch auf den aktuellen Datensatz begrenzt. Mit dem Diagrammersteller verfügen Sie über viel mehr Möglichkeiten, um verschiedene Quellen von Ihrer Domain sowie vom OpenDataSoft-Netzwerk zu kombinieren.
es: También puede compilar gráficos con la `ficha de análisis` en una página de conjunto de datos, pero estarán restringidos al conjunto de datos actual. Con el compilador de gráficos tiene muchas más posibilidades, gracias a la combinación de varios orígenes del dominio y de la red OpenDataSoft.
fr: Vous pouvez également générer des graphes via l'onglet `Analyse` sur la page du jeu de données, mais seul le jeu de données affiché sera traité. Avec l'éditeur de graphes, vous avez plus de liberté grâce à la possibilité de combiner plusieurs sources de votre domaine et du réseau OpenDataSoft.
it: È anche possibile creare i grafici nella scheda `Analizza` della pagina di un dataset, ma in tal caso essi saranno limitati al dataset corrente. Con il Generatore di grafici sono invece disponibili più opzioni, tra cui la possibilità di combinare varie origini del dominio e della rete OpenDataSoft.
nl: U kan ook grafieken maken met het tabblad `Analyseer` op een pagina van de dataset, maar deze zijn beperkt tot de huidige dataset. Met de Chart Builder beschikt over veel meer mogelijkheden en kan u verschillende bronnen uit uw domein en uit het OpenDataSoft-netwerk combineren.

source: First layer
de: Erste Schicht
es: Primera capa
fr: Première couche
it: Primo layer
nl: Eerste laag

source: Click on ``Add a dataset to this layer`` to start importing data to your chart.
de: Klicken Sie auf ``Datensatz zur Schicht hinzufügen``, um den Import in Ihr Diagramm zu starten.
es: Haga clic en ``Añadir un conjunto de datos a esta capa`` para empezar a importar datos en el gráfico.
fr: Cliquez sur ``Ajouter un jeu de données à cette couche`` pour importer des données dans votre graphe.
it: Clicca su ``Aggiungere un dataset a questo layer`` per iniziare l'importazione dei dati nel grafico.
nl: Klik op ``Voeg een dataset toe aan deze laag`` om het importeren van data naar uw grafiek op te starten.

source: The list of available datasets is displayed: you can search or browse by category to find your datasets. As usual you can preview and filter a dataset before importing it.
de: Die Liste der verfügbaren Datensätze wird angezeigt: Ihre Datensätze finden Sie anhand einer Suche bzw. Durchsuchen nach Kategorien. Wie immer können Sie einen Datensatz filtern und eine Vorschau anzeigen lassen, bevor Sie ihn importieren.
es: Se visualiza la lista de los conjuntos de datos disponibles: puede buscar o explorar por categoría para encontrar sus conjuntos de datos. Como siempre, puede obtener una vista previa y filtrar un conjunto de datos antes de importarlo.
fr: La liste des jeux de données disponibles est affichée et vous pouvez la filtrer par catégorie pour trouver votre jeu de données. Comme d'habitude, avant de l'importer, vous pouvez avoir un aperçu du jeu de données et le filtrer.
it: Viene visualizzato l'elenco dei dataset disponibili, che puoi esplorare effettuando una ricerca o sfogliando per categoria. Come sempre, prima di importare i dataset è possibile visualizzarne l'anteprima o filtrarli.
nl: De lijst van beschikbare datasets wordt weergegeven: u kan zoeken of doorbladeren per categorie om uw datasets terug te vinden. Zoals gewoonlijk kan u een voorbeeldweergave krijgen en een dataset filteren alvorens deze te importeren.

source: As an example, let's take the public dataset "`Entreprises immatriculées en 2015`" from `Data Infogreffe` domain. You can ``Filter data`` to refine the data, but in our case let's just ``✓ Select`` the dataset.
de: Nehmen wir als Beispiel den öffentlichen Datensatz "`Entreprises immatriculées en 2015`" von der Domain `Data Infogreffe`. Sie können ``Daten filtern``, um sie zu verfeinern, aber lassen Sie uns in unserem Fall einfach den Datensatz einfach ``✓ Auswählen``.
es: A modo de ejemplo, vamos a tomar el conjunto de datos público "`Entreprises immatriculées en 2015`" del dominio `Data Infogreffe`. Puede elegir ``Filtrar datos`` para refinar los datos, pero en nuestro caso simplemente vamos a ``✓ Seleccionar`` el conjunto de datos.
fr: Prenons par exemple le jeu de données public "`Entreprises immatriculées en 2015`" du domaine `Data Infogreffe`. Vous pouvez ``Filtrer les données`` pour les affiner, mais dans notre cas nous allons simplement ``✓ Sélectionner`` le jeu de données.
it: Consideriamo ad esempio il dataset "`Entreprises immatriculées en 2015`" del dominio `Data Infogreffe`. È possibile affinare i dati scegliendo l'opzione ``Filtro dati``, ma in questo caso selezioniamo semplicemente il dataset cliccando su ``✓ Seleziona``.
nl: Neem bijvoorbeeld de publieke dataset "Ondernemingen geregistreerd in 2015" uit het domein `Data Infogreffe`. U kan klikken op ``Filter data`` om de data te verfijnen, maar laten we in ons geval gewoon de dataset``✓ Selecteren``.

source: In the configuration, you can choose the appropriate type of graph. Select ``Column chart``
de: In der Konfiguration können Sie den entsprechenden Diagrammtyp wählen. Nehmen Sie ``Säulendiagramm``.
es: En la configuración, puede elegir el tipo de gráfico adecuado. Seleccione ``Gráfico de columnas``.
fr: Dans la configuration, vous pouvez choisir le type de graphe approprié. Sélectionnez ``Diagramme en bâtons``.
it: Nella configurazione, è possibile scegliere il tipo di grafico desiderato. Scegliamo ``Grafico a colonne``.
nl: In de configuratie kan u het juiste type van grafiek kiezen. Selecteer ``Kolomgrafiek``

source: By default Y-axis is set to *Count*, and the plot is a *Line*. You can choose the type of graph best suited to your data. Try selecting *Column chart* instead of *Line*.
de: Standardmäßig ist für die Y-Achse *Zähler* eingestellt und die grafische Darstellung ist eine *Linie*. Sie können den für Ihre Daten am besten geeigneten Diagrammtyp auswählen. Versuchen Sie es mit der Auswahl *Säulendiagramm* anstelle von *Linie*.
es: De forma predeterminada, el eje Y se establece en *Recuento* y el trazo es *Línea*. Puede elegir el tipo de gráfico que más se adapte a los datos. Pruebe a seleccionar *Gráfico de columnas* en lugar de *Línea*.
fr: Par défaut, l'axe des ordonnées indique le *Nombre* et la représentation est une *Ligne*, mais vous pouvez choisir le type de graphe qui convient le mieux à vos données. Essayez de sélectionner *Diagramme en bâtons* à la place de *Ligne*.
it: Per impostazione predefinita, l'asse Y è impostato su *Numero* e il grafico su *Riga*. Qui puoi scegliere il tipo di grafico più adatto alle tue esigenze. Prova a selezionare *Grafico a colonne* anziché *Riga*.
nl: Standaard is de Y-as ingesteld op *Tellen* en is de plot een *Lijn*. U kan het type grafiek kiezen dat het best geschikt is voor uw data. Probeer *Kolomgrafiek* te selecteren in plaats van *Lijn*.

source: Next to this selection menu, you click on the color box to pick another color for the columns.
de: Klicken Sie neben diesem Auswahlmenü auf die Farbauswahl, um eine andere Farbe für die Säulen festzulegen.
es: Junto a este menú de selección, haga clic en el cuadro de color para seleccionar otro color para las columnas.
fr: À côté de ce menu de sélection, cliquez sur la palette de couleurs pour choisir une couleur différente pour les bâtons.
it: In seguito, clicca sulla casella accanto al menu di selezione per scegliere il colore delle colonne.
nl: Naast dit selectiemenu kan u klikken op het kleurenpallet om een andere kleur voor de kolommen te kiezen.

source: In the `Configuration` settings, click on `Appearance`, then *display values on chart*. This adds a label with a numerical value on top of each column. Under `Y-Axis` you can set the scientific display for the *Y* scale.
de: Klicken Sie in den Einstellungsoptionen der `Konfiguration` zunächst auf `Anzeige` und dann auf *Werte im Diagramm anzeigen*. Dadurch wird über jeder Säule eine Beschriftung mit einem numerischen Wert hinzugefügt. Unter `Y-Achse` können Sie die systematische Anzeige für die *Y*-Größenordnung einstellen.
es: En los valores de `Configuración`, haga clic en `Apariencia` y, a continuación, en *visualizar valores en gráfico*. De este modo se añade una etiqueta con un valor numérico en la parte superior de cada una de las columnas. Bajo `Eje Y` puede establecer la visualización científica de la escala *Y*.
fr: Dans les options de `Configuration`, cliquez sur `Apparence` puis sur *afficher les valeurs sur le graphe*. Cela permet d'ajouter une indication de la valeur en haut de chaque bâton. Sous `Axe des ordonnées`, vous pouvez aussi choisir la forme scientifique d'affichage des valeurs de *Y*.
it: Nelle impostazioni di `Configurazione`, clicca su `Aspetto`, quindi su *visualizza i valori sul grafico*. All'inizio di ogni colonna verrà aggiunta un'etichetta con un valore numerico. In `Asse Y` è possibile impostare la notazione scientifica per la scala *Y*.
nl: Klik in de configuratie-instellingen op `Voorkomen` en vervolgens op *waarden op de grafiek weergeven*. Hierdoor wordt bovenaan elke kolom een label toegevoegd met een numerieke waarde. Onder `Y-as` kan u de wetenschappelijke weergave instellen voor de *Y*-schaal.

source: Finally, add a threshold color under `Color threshold: type *17000* next *Y >*` and choose another color. You can add multiple thresholds with different colors.
de: Fügen Sie unter `Farbschwellenwert: Typ *17000* neben *Y >*` schließlich einen Farbschwellenwert hinzu und wählen Sie eine andere Farbe. Sie können mehrere Schwellenwerte unterschiedlicher Farben hinzufügen.
es: Por último, añada un color de umbral debajo de `Umbrales de color: escriba *17000* y después *Y >*` y elija otro color. Puede añadir varios umbrales con colores diferentes.
fr: Pour finir, ajoutez un seuil de couleur dans `Seuil de couleur : tapez *17000* en regard de *Y >*` et choisissez une autre couleur. Vous pouvez ajouter plusieurs seuils de couleurs différentes.
it: Infine, aggiungiamo una soglia di colore: in `"Soglie di colore", inserisci *17000* dopo *Y >*` e scegli un altro colore. Puoi aggiungere più soglie con colori diversi.
nl: Voeg tot slot een drempelkleur toe onder `Kleur drempel: type *17000* naast *Y >*` en kies een andere kleur. U kan meerdere drempels met verschillende kleuren toevoegen.

source: Here is what this layer looks like with these settings and two thresholds:
de: So sieht diese Schicht mit diesen Einstellungen und zwei Schwellenwerten aus:
es: Este es el aspecto que tendrá esta capa con estos valores y 2 umbrales:
fr: Voici à quoi ressemble cette couche avec ces paramètres et deux seuils :
it: Dopo aver definito queste impostazioni e le due soglie, il layer si presenterà come segue:
nl: Zo ziet deze laag eruit met deze instellingen en twee drempels:

source: Adding a serie
de: Hinzufügen einer Verbindungslinie
es: Añadir una serie
fr: Ajouter une série
it: Aggiunta di una serie
nl: Een reeks toevoegen

source: You can add a data representation on the same dataset by clicking on ``Add a serie``.
de: Sie können dem gleichen Datensatz eine Datendarstellung hinzufügen, indem Sie auf ``Verbindungslinie hinzufügen`` klicken.
es: Puede añadir una representación de datos en el mismo conjunto de datos haciendo clic en ``Añadir una serie``.
fr: Vous pouvez ajouter une représentation des données sur le même jeu de données en cliquant sur ``Ajouter une série``.
it: È possibile aggiungere una diversa rappresentazione dei dati di uno stesso dataset cliccando su ``Aggiungi una serie``.
nl: U kan een dataweergave op dezelfde dataset toevoegen door te klikken op ``Voeg een reeks toe``.

source: The `X-Axis` parameters will be the same, but you can customize the type of curve and tweak the appearance parameters on the new serie.
de: Die Parameter der `X-Achse` bleiben unverändert, aber Sie können den Typ der Kurve anpassen und die Anzeigeparameter der neuen Verbindungslinie optimieren.
es: Los parámetros de `Eje X` serán los mismos, pero puede personalizar el tipo de curva y retocar los parámetros de apariencia de la serie nueva.
fr: Les paramètres `Axe des abscisses` seront identiques, mais vous pouvez personnaliser le type de courbe et l'apparence de la nouvelle série.
it: I parametri dell'`Asse X` non variano, ma puoi personalizzare il tipo di curva e definire l'aspetto della nuova serie.
nl: De parameters van de `X-as` zullen dezelfde zijn, maar u kan het type curve aanpassen en de weergaveparameters voor de nieuwe reeks wijzigen.

source: Try changing the type from ``Line`` to ``Spline`` to see a nice curve on top of the initial column chart.
de: Probieren Sie, den Typ von ``Linie`` in ``Spline`` zu ändern, um eine schöne Kurve über dem ursprünglichen Säulendiagramm zu sehen.
es: Pruebe a cambiar el tipo de ``Línea`` a ``Spline`` para ver una bonita curva en la parte superior del gráfico de columnas inicial.
fr: Essayez de remplacer le type ``Ligne`` par ``Courbe`` pour afficher une jolie courbe au-dessus du diagramme en bâtons initial.
it: Prova a cambiare il tipo, da ``Riga`` a ``Spline`` per visualizzare una curva sopra al grafico a colonne iniziale.
nl: Probeer het type te wijzigen van ``Lijn`` naar ``Kromme`` om een mooie curve te zien bovenaan de initiële kolomgrafiek.

source: You can reorder the series by clicking and dragging. The series order affects the chart legend and the serie in the top has priority on the `Y-Axis` parameter.
de: Sie können die Verbindungslinien durch Anklicken und Ziehen neu anordnen. Die Reihenfolge der Verbindungslinien wirkt sich auf die Diagrammlegende aus und die oberste Verbindungslinie ist prioritär für die `Y-Achsen`-Parameter.
es: Puede reordenar las series haciendo clic en ellas y arrastrándolas. El orden de las series afecta a la leyenda del gráfico, y la serie de la posición superior tiene prioridad en el parámetro `Eje Y`.
fr: Vous pouvez réorganiser les séries en effectuant un glisser-déposer. L'ordre des séries affecte la légende du graphe et la série du dessus est prioritaire sur le paramètre `Axe des ordonnées`.
it: Puoi anche modificare l'ordine delle serie, trascinando gli elementi selezionati. L'ordine delle serie influisce sulla legenda del grafico e la serie che si trova all'inizio ha la priorità sul parametro `Asse Y`.
nl: U kan de reeksen in een andere volgorde zetten door te klikken en te slepen. De volgorde van de reeksen heeft een impact op de legende van de grafiek en de reeks bovenaan heeft prioriteit over de `Y-as` parameter.

source: In the next section we will add another dataset to our chart.
de: Im nächsten Abschnitt werden wir unserem Diagramm einen weiteren Datensatz hinzufügen.
es: En la sección siguiente añadiremos otro conjunto de datos al gráfico.
fr: Dans la section suivante, nous allons ajouter un autre jeu de données à notre graphe.
it: Nella prossima sezione aggiungeremo un altro dataset al grafico.
nl: In het volgende deel zullen we een andere dataset toevoegen aan onze grafiek.

source: Stacking layers
de: Stapeln von Schichten
es: Apilar capas
fr: Superposer les couches
it: Sovrapposizione dei layer
nl: Lagen op elkaar stapelen

source: Let's elaborate another data visualization, this time with multiple layers.
de: Lassen Sie uns eine andere Datenvisualisierung erstellen, diesmal mit mehreren Schichten.
es: Vamos a elaborar otra visualización de datos, esta vez con varias capas.
fr: Créons une visualisation de données avec plusieurs couches.
it: Elaboriamo un'altra visualizzazione dei dati, questa volta utilizzando più layer.
nl: Laten we een andere dataweergave uitwerken, dit keer met meerdere lagen.

source: **First Layer**
de: **Erste Schicht**
es: **Primera capa**
fr: **Première couche**
it: **Primo layer**
nl: **Eerste laag**

source: We will start the same way as before, click on ``Add a dataset to this layer`` then search for "Oil Prices" to add the `Oil Prices <https://public-us.opendatasoft.com/explore/dataset/oil-prices>`_ dataset.
de: Wir fangen genauso an, wie zuvor: Klicken Sie auf ``Datensatz zur Schicht hinzufügen`` und suchen Sie dann nach "Ölpreisen", um den Datensatz `Ölpreise <https://public-us.opendatasoft.com/explore/dataset/oil-prices>`_ hinzuzufügen.
es: Empezaremos del mismo modo que antes: haga clic en ``Añadir un conjunto de datos a esta capa`` y busque "Oil Prices" para añadir el conjunto de datos `Oil Prices <https://public-us.opendatasoft.com/explore/dataset/oil-prices>`_.
fr: Nous allons commencer comme précédemment par cliquer sur ``Ajouter un jeu de données à cette couche``, puis nous allons rechercher `Oil Prices` (Prix du pétrole) pour ajouter le jeu de données `Oil Prices <https://public-us.opendatasoft.com/explore/dataset/oil-prices>`_ correspondant.
it: Come già fatto in precedenza, clicca su ``Aggiungere un dataset a questo layer`` e cerca "Oil Prices" per aggiungere il dataset `Oil Prices <https://public-us.opendatasoft.com/explore/dataset/oil-prices>`_.
nl: We beginnen op dezelfde manier als daarvoor. Klik op ``Voeg een dataset toe aan deze laag``, zoek vervolgens naar "Olieprijzen" om de dataset `Olieprijzen <https://public-us.opendatasoft.com/explore/dataset/oil-prices>`_ toe te voegen.

source: No need to filter it, just note that the data starts from the year 1987. We will use 1987 as the starting point for the other layers.
de: Filtern brauchen Sie ihn nicht, beachten Sie nur, dass die Daten bei 1987 beginnen. Wir werden 1987 als Ausgangspunkt für die anderen Schichten verwenden.
es: No es necesario que lo filtre, simplemente tenga en cuenta que los datos empiezan en el año 1987. Utilizaremos 1987 como base para las capas restantes.
fr: Ici, il n'est pas nécessaire d'appliquer un filtre, mais sachez que les données commencent en 1987. Nous utiliserons donc 1987 comme point de départ des autres couches.
it: Non è necessario applicare alcun filtro: nota solo che sono disponibili dati a partire dal 1987. Utilizzeremo il 1987 come punto di partenza per gli altri layer.
nl: Niet nodig om deze te filteren. Noteer gewoon dat de data beginnen vanaf het jaar 1987. We zullen 1987 gebruiken als vertrekpunt voor alle andere lagen.

source: When you first import a dataset in Advanced Charts, the default visualization of this dataset is imported: in this case you can see two lines: `WTI Spot Price` and `Brent Spot Price`.
de: Beim Import eines Datensatzes in Erweiterte Diagramme wird die Standardvisualisierung dieses Datensatzes importiert. In diesem Fall sehen Sie die beiden Linien: `WTI-Spotpreis` und `Brent-Spotpreis`.
es: Cuando se importa por primera vez un conjunto de datos en Gráficos avanzados, se importa la visualización predeterminada de este conjunto de datos: en este caso puede observar 2 líneas: `WTI Spot Price` y `Brent Spot Price`.
fr: La première fois que vous importez un jeu de données dans un graphe avancé, la visualisation de celui-ci est importée. Ici, vous pouvez voir deux lignes : `WTI Spot Price` (Cours du prix du baril WTI) et `Brent Spot Price` (Cours du prix du baril Brent).
it: Quando si importa per la prima volta un dataset in Grafici avanzati, viene importata anche la sua visualizzazione predefinita. In questo caso vengono visualizzate due linee: `WTI Spot Price` e `Brent Spot Price`.
nl: Wanneer u de eerste keer een dataset importeert in Geavanceerde Grafieken, wordt de standaard weergave van deze dataset geïmporteerd. In dit geval kan u twee lijnen zien: `WTI Spot Price` en `Brent Spot Price`.

source: **Second Layer**
de: **Zweite Schicht**
es: **Segunda capa**
fr: **Deuxième couche**
it: **Secondo layer**
nl: **Tweede laag**
