Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/exploring_catalog_and_datasets/02_visualizing_data/dataset.po
Languages: de, es, fr, it, nl

source: Visualizing data
de: Visualisieren von Daten
es: Visualizar datos
fr: Visualiser des données
it: Visualizzazione dei dati
nl: Data weergeven

source: OpenDataSoft features an in-depth visualization experience for you to explore a dataset in a rich and interactive manner.
de: OpenDataSoft bietet eine umfangreiche Visualisierung, mit der Sie einen Datensatz ausgiebig und interaktiv untersuchen können.
es: OpenDataSoft propone una experiencia de visualización detallada que permite explorar un conjunto de datos de manera completa e interactiva.
fr: L'expérience de visualisation approfondie proposée par OpenDataSoft vous permet d'explorer un jeu de données de façon riche et interactive.
it: Grazie alle sue visualizzazioni dettagliate e interattive, la piattaforma OpenDataSoft permette di esplorare ogni dataset in maniera approfondita.

source: The dataset information page displays the dataset metadata like its title, description, source, keywords, license, etc.
de: Auf der Datensatzinformationsseite werden die Metadaten eines Datensatzes angezeigt, wie z. B. Titel, Beschreibung, Quelle, Schlüsselwörter, Lizenz usw.
es: La página de información del conjunto de datos muestra los metadatos del conjunto de datos, tales como título, descripción, origen, palabras claves, licencia, etc.
fr: Sur la page d'information du jeu de données, vous pouvez consulter les métadonnées associées au jeu de données telles que son titre, sa description, sa source, ses mots-clés, sa licence, etc.
it: La pagina di informazioni del dataset contiene i metadati ad esso associati, come il titolo, la descrizione, l'origine, le parole chiave, la licenza e così via.
nl: Op de datasetinformatiepagina worden de metadata van de dataset weergegeven, zoals de titel, omschrijving, bron, trefwoorden, licentie, enz.

source: Depending on your dataset's columns, you will be able to explore it as a classic table, to project it on a map, or to display it thanks to various charts and widgets. You will also find all the images present in the dataset.
de: Je nach den Spalten Ihres Datensatzes können Sie ihn in Form einer klassischen Tabelle untersuchen, auf eine Karte projizieren oder dank zahlreicher Diagramme und Widgets anzeigen. Sie werden auch alle im Datensatz vorhandenen Bilder finden.
es: Según las columnas del conjunto de datos, podrá explorarlo como una tabla clásica, proyectarlo en un mapa o visualizarlo mediante diversos gráficos y widgets. También encontrará todas las imágenes presentes en el conjunto de datos.
fr: En fonction des colonnes de votre jeu de données, vous aurez la possibilité de l'explorer comme un tableau classique, de le projeter sur une carte ou de l'afficher grâce à divers graphes et widgets. Vous trouverez également toutes les images disponibles dans le jeu de données.
it: In base alle colonne presenti, potrai esplorare il dataset nella classica modalità della tabella, ma anche proiettarlo su una mappa o visualizzarlo sotto forma di grafici o widget. Avrai inoltre a disposizione tutte le immagini inserite al suo interno.
nl: Afhankelijk van de kolommen van uw dataset, zal u deze kunnen exploreren als een klassieke tabel, deze kunnen projecteren op een kaart of deze kunnen weergeven dankzij de verschillende grafieken en widgets. U zal ook alle afbeeldingen kunnen terugvinden die aanwezig zijn in de dataset.

source: Finally, you will be able to export it in several file formats (depending on the nature of your data) and to consume it through an API.
de: Schließlich können Sie ihn (je nach der Art Ihrer Daten) in diverse Formate exportieren und durch eine API nutzen.
es: Por último, podrá exportarlo en varios formatos de archivo (en función de la naturaleza de los datos) y consumirlo a través de una API.
fr: Enfin, vous serez en mesure de l'exporter en plusieurs formats de fichiers (en fonction de la nature de vos données) et de le consommer via une API.
it: Infine, puoi esportarlo in vari formati, a seconda della natura dei dati, e usufruirne tramite un'API.
nl: Tot slot zal u deze kunnen exporteren in verschillende bestandsformaten (afhankelijk van de aard van uw data) en deze kunnen gebruiken via een API.

source: Displaying data on a map
de: Anzeigen von Daten auf einer Karte
es: Visualizar datos en un mapa
fr: Cartographier des données
it: Visualizzazione dei dati su una mappa
nl: Data weergeven op een kaart

source: This can be achieved by switching to the **Map** tab in the dataset explore page. For that tab to be available, your dataset must contain a geopoint or a geoshape field.
de: Das können Sie erreichen, indem Sie auf der Datensatzuntersuchungsseite zum Register **Karte** wechseln. Damit dieses Register zur Verfügung steht, muss Ihr Datensatz einen Geopunkt- oder ein Geoformfeld enthalten.
es: Esta operación se puede llevar a cabo en la ficha **Mapa** de la página Explorar del conjunto de datos. Para que la ficha esté disponible, el conjunto de datos debe contener un campo de punto geográfico o forma geográfica.
fr: Il est possible de cartographier les données en basculant sur l'onglet **Carte** de la page d'exploration du jeu de données. Pour que cet onglet soit disponible, votre jeu de données doit contenir un champ de point géo ou de forme géo.
it: Puoi accedere a questa modalità di visualizzazione selezionando la scheda **Mappa** nella pagina di esplorazione del dataset. La scheda è disponibile solo se il dataset contiene un campo geopoint (punto geografico) o un campo geoshape (forma geografica).
nl: Dit kan door over te schakelen naar het tabblad **Kaart** in de explore-pagina van de dataset. Opdat het tabblad beschikbaar is, moet uw dataset een geopoint- of geoshape-veld bevatten.

source: Displaying data on a chart
de: Anzeigen von Daten in einem Diagramm
es: Visualizar datos en un gráfico
fr: Afficher des données dans un graphe
it: Visualizzazione dei dati su un grafico
nl: Data weergeven op een grafiek

source: This can be achieved by switching to the **Analyze** tab in the dataset explore page. For that tab to be available, your dataset must contain facets or date/time fields.
de: Das können Sie erreichen, indem Sie auf der Datensatzuntersuchungsseite zum Register **Analyse** wechseln. Damit dieses Register zur Verfügung steht, muss Ihr Datensatz Facet- oder Datum-/Zeitfelder enthalten.
es: Esta operación se puede llevar a cabo en la ficha **Analizar** de la página Explorar del conjunto de datos. Para que la ficha esté disponible, el conjunto de datos debe contener facetas o campos de fecha/hora.
fr: Il est possible d'afficher les données dans un graphe en basculant sur l'onglet **Analyse** de la page d'exploration du jeu de données. Pour que cet onglet soit disponible, votre jeu de données doit contenir des champs de facettes ou de date/heure.
it: Puoi accedere a questa modalità di visualizzazione selezionando la scheda **Analizza** nella pagina di esplorazione del dataset. La scheda è disponibile solo se il dataset contiene un campo "facet" o un campo "data/ora".
nl: Dit kan door over te schakelen naar het tabblad **Analyse** in de explore-pagina van de dataset. Opdat het tabblad beschikbaar is, moet uw dataset facetten of datum/tijd-velden bevatten.

source: Reusing a visualization
de: Weiterverwenden einer Visualisierung
es: Reutilizar una visualización
fr: Réutiliser une visualisation
it: Riutilizzo di una visualizzazione
nl: Een weergave hergebruiken

source: Any visualization built with OpenDataSoft can easily be reused as is.
de: Sämtliche mit OpenDataSoft erstellten Visualisierungen können unverändert weiterverwendet werden.
es: Cualquier visualización creada con OpenDataSoft se puede reutilizar fácilmente tal cual.
fr: Toutes les visualisations faites avec OpenDataSoft peuvent être facilement réutilisées telles quelles.
it: Le visualizzazioni create nella piattaforma OpenDataSoft possono essere facilmente riutilizzate così come sono.

source: At the bottom of the *Map* and *Chart* tabs, there is a widget that allows you to share a visualization you made:
de: In den Registern *Karte* und *Diagramm* befindet sich unten ein Widget, mit dem Sie eine von Ihnen erstellte Visualisierung teilen können:
es: En la parte inferior de las fichas *Mapa* y *Gráfico* se encuentra un widget que le permitirá compartir una visualización que haya creado:
fr: En bas des onglets *Carte* et *Graphe*, vous trouverez un widget permettant de partager l'une de vos visualisations :
it: In fondo alle schede *Mappa* e *Analizza*, un widget ti consente di condividere la visualizzazione nelle seguenti modalità:
nl: Onderaan de tabbladen *Kaart* en *Grafiek* staat een widget die u toelaat om een weergave die u maakte, te delen:

source: as a **Share** link, to share a direct access to the visualization,
de: als **Teilen**-Link, um einen direkten Zugriff auf die Visualisierung zu teilen.
es: como vínculo **Compartir**, para compartir un acceso directo a la visualización;
fr: sous la forme d'un lien **Partager**, pour partager un accès direct à la visualisation ;
it: **Condividi**: che contiene il link per condividere l'accesso diretto alla visualizzazione.
nl: als een koppeling **Delen**, om een rechtstreekse toegang tot de weergave te delen,

source: as an **Embed** code, to embed the visualization in an iframe on a remote web site,
de: als **Einbetten**-Code, um die Visualisierung in einen Iframe auf einer Remote-Website einzubetten.
es: como código **Incrustar**, para incrustar la visualización en un iframe de un sitio web remoto;
fr: sous la forme d'un lien **Intégrer**, pour intégrer la visualisation dans un iframe sur un site Web distant ;
it: **Embed**: che offre il codice per integrare la visualizzazione in un iframe su un sito web remoto.
nl: als een **Invoeg** code om de weergave in te voegen in een iframe op een website op afstand,

source: as a **Widget** code, to integrate the visualization as a widget in a content page using the OpenDataSoft ods-widgets framework.
de: als **Widget**-Code, um die Visualisierung unter Verwendung des OpenDataSoft-Frameworks ods-widgets als Widget in eine Inhaltsseite zu integrieren.
es: como código **Widget**, para integrar la visualización a modo de widget en una página de contenido por medio del marco ods-widgets de OpenDataSoft.
fr: sous la forme d'un bout de code **Widget**, pour intégrer la visualisation en tant que widget dans une page de contenu en utilisant le framework d'OpenDataSoft ods-widget.
it: **Widget**: che include il codice per integrare la visualizzazione sotto forma di widget in una pagina di contenuto, tramite il framework OpenDataSoft ods-widgets.

source: **Listing reuses**
de: **Auflisten von Weiterverwendungen**
es: **Mostrar una lista de las reutilizaciones**
fr: **Lister les réutilisations**
it: **Elenco dei riutilizzi**
nl: **Listing hergebruiken**

source: You can list reuses on the dataset page, to help promote both the reuse itself and your data. The reuses will be listed at the bottom of the information tab on each dataset page. You can learn more about this feature in the section :doc:`Encouraging reuses </configuring_domain/04_sharing_reusing_communicating/engaging>`.
de: Weiterverwendungen können Sie auf der Datensatzseite auflisten, um die Weiterverwendung an sich sowie Ihre Daten zu präsentieren. Die Weiterverwendungen werden auf der Seite jedes Datensatzes im unteren Bereich der Registerkarte Informationen aufgelistet. Mehr dazu erfahren Sie im Abschnitt :doc:`Weiterverwendungen fördern </configuring_domain/04_sharing_reusing_communicating/engaging>`.
es: Puede mostrar una lista de las reutilizaciones en la página de conjunto de datos, con objeto de promover tanto la reutilización en sí como los datos. La lista de las reutilizaciones aparecerá en la parte inferior de la ficha de información de las páginas de conjunto de datos. Puede consultar más información acerca de esta función en la sección :doc:`Fomentar las reutilizaciones </configuring_domain/04_sharing_reusing_communicating/engaging>`.
fr: Vous pouvez lister les réutilisations sur la page du jeu de données pour promouvoir la réutilisation, mais aussi vos données. Les réutilisations seront listées en bas de l'onglet Informations de chaque page du jeu de données. Reportez-vous à la section :doc:`Favoriser la réutilisation </configuring_domain/04_sharing_reusing_communicating/engaging>` pour en savoir plus sur cette fonctionnalité.
nl: U kunt op de datasetpagina een lijst maken van de hergebruiken om zowel het hergebruik op zich als uw gegevens te helpen promoten. De hergebruiken zullen onderaan het informatietabblad op elke datasetpagina worden opgesomd.. Meer informatie over dit kenmerk is terug te vinden in de rubriek :doc:`Hergebruiken aanmoedigen </configuring_domain/04_sharing_reusing_communicating/engaging>`.

source: Filtering the records
de: Filtern der Einträge
es: Filtrar los registros
fr: Filtrer les enregistrements
it: Filtri dei record
nl: De records filteren

source: On the left hand side of the dataset page, there is a filtering toolbar very similar to what is described in the paragraph :ref:`filtering-catalog`.
de: Links auf der Datensatzseite befindet sich eine Symbolleiste zum Filtern, die der Beschreibung im Absatz :ref:`filtering-catalog` sehr ähnelt.
es: En la parte izquierda de la página de conjunto de datos, existe una barra de herramientas de filtro muy parecida a lo que se ha descrito en el párrafo :ref:`filtering-catalog`.
fr: Une barre d'outils de filtrage, quasiment identique à la description du paragraphe :ref:`filtering-catalog`, se trouve dans la partie gauche de la page du jeu de données.
it: Sulla sinistra della pagina di ogni dataset, è presente un menu per filtrare i dati molti simile a quello descritto nel paragrafo :ref:`filtering-catalog`.
nl: Aan de linkerzijde van de datasetpagina vindt u een filtering toolbar die zeer sterk lijkt op diegene die beschreven staat in de paragraaf :ref:`filtering-catalog`.

source: Default tab
de: Standardregister
es: Ficha predeterminada
fr: Onglet par défaut
it: Scheda predefinita
nl: Standaard tabblad

source: You can choose between the **table tab** and the **information tab** as the default tab on which a dataset is opened. See :doc:`Configure catalog & dataset pages </configuring_domain/05_configuring_domain/tabs>` for more informations.
de: Sie können zwischen der **Registerkarte Tabelle** und der **Registerkarte Informationen** als Standard-Registerkarte zum Öffnen eines Datensatzes wählen. Weitere Informationen finden Sie unter :doc:`Katalog- und Datensatzseiten konfigurieren </configuring_domain/05_configuring_domain/tabs>`.
es: Puede elegir entre la **ficha de tabla** y la **ficha de información** como la ficha predeterminada en que se abre un conjunto de datos. Consulte :doc:`Configurar páginas de catálogo y conjunto de datos </configuring_domain/05_configuring_domain/tabs>` para obtener más detalles.
fr: Vous pouvez choisir entre **l'onglet Tableau** et **l'onglet Informations** comme onglet par défaut affiché à l'ouverture d'un jeu de données. Voir :doc:`Configuration des pages de jeux de données et du catalogue </configuring_domain/05_configuring_domain/tabs>` pour plus d'informations.
nl: U kunt kiezen tussen het **tabeltabblad** en het **informatietabblad** als het standaard tabblad waarop een dataset wordt geopend. Voor meer informatie, zie :doc:`Catalogus & datasetpagina's configureren </configuring_domain/05_configuring_domain/tabs>`.

source: Opendatasoft features an in-depth visualization experience for you to explore a dataset in a rich and interactive manner.
nl: Opendatasoft voorziet een diepgaande weergave-ervaring zodat u een dataset kan exploreren op een rijke en interactieve manier.

source: Any visualization built with Opendatasoft can easily be reused as is.
nl: Elke weergave die opgebouwd wordt met Opendatasoft kan gemakkelijk als dusdanig hergebruikt worden.

source: as a **Widget** code, to integrate the visualization as a widget in a content page using the Opendatasoft ods-widgets framework.
nl: als een **Widget** code, om de weergave te integreren als een widget in een contentpagina door gebruik te maken van het Opendatasoft ods-widgets kader.
