Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_account/06_managing_notifications/daily_report.po
Languages: de, es, fr, it, nl

source: Daily report
de: Tagesbericht
es: Informe diario
fr: Rapport journalier
it: Report giornaliero
nl: Dagelijks rapport

source: The daily report contains a recap of the portal's active issues:
de: Der Tagesbericht ist eine Zusammenfassung der aktiven Elemente des Portals:
es: El informe diario incluye un resumen de los problemas actuales del portal:
fr: Le rapport journalier contient un récapitulatif des anomalies du portail :
it: Il report giornaliero offre un riepilogo dei problemi al momento in corso sul portale:
nl: Het dagelijks rapport bevat een samenvatting van de actieve problemen van het portaal:

source: Open processing alerts for realtime datasets, i.e. no data received for a period of time
de: Warnungen zur Verarbeitung von Echtzeit-Datensätzen öffnen, d. h. keine Daten für einen bestimmten Zeitraum erhalten
es: Alertas de procesamiento abiertas para conjuntos de datos en tiempo real (es decir, sin recibir datos en un periodo de tiempo)
fr: Alertes ouvertes pour les jeux de données temps réels, c'est à dire aucune donnée reçue pendant une période de temps donnée
it: Avvisi di elaborazione attivi su dataset in tempo reale (ad esempio: nessun dato ricevuto in un determinato lasso di tempo).
nl: Open verwerkingswaarschuwingen voor real time datasets, m.a.w. geen data ontvangen gedurende een bepaalde tijdperiode

source: Datasets currently in error due to a processing (scheduled or trigger)
de: Datensätze infolge einer Verarbeitung zurzeit fehlerhaft (programmiert oder ausgelöst)
es: Conjuntos de datos erróneos actualmente debido a un proceso (planificado o desencadenador)
fr: Jeux de données actuellement en erreur de traitement (planifiés ou lancés manuellement)
it: Errori nel dataset dovuti a un'elaborazione (pianificata o attivata mediante trigger).
nl: Datasets die momenteel in fout staan als gevolg van een verwerking (gepland of trigger)

source: Datasets created yesterday
de: Gestern erstellte Datensätze
es: Conjuntos de datos creados ayer
fr: Jeux de données créés la veille
it: Dataset creati ieri
nl: Gisteren gemaakte datasets

source: Datasets with pending user feedbacks
de: Datensätze mit ausstehenden Nutzer-Rückmeldungen
es: Conjuntos de datos con comentarios de usuarios pendientes
fr: Jeux de données avec des contributions utilisateurs en attente
it: Dataset con feedback degli utenti in sospeso
nl: Datasets met in afwachting zijnde feedback van gebruikers

source: They are sent every day at 9AM (CET).
de: Sie werden jeden Tag um 9AM (CET) gesendet.
es: Se envían diariamente a las 9:00 am (CET).
fr: Ils sont envoyés tous les jours à 9h (CET).
it: I report vengono inviati ogni giorno alle 09:00 (CET).
nl: Deze worden elke dag om 09u00 (CET) verstuurd.

source: Recipients
de: Empfänger
es: Destinatarios
fr: Destinataires
it: Destinatari
nl: Ontvangers

source: Users on the domain with the "Edit all datasets" permission
de: Benutzer der Domain mit der Berechtigung "Alle Datensätze bearbeiten"
es: Los usuarios del dominio con el permiso "Editar todos los conjuntos de datos".
fr: Utilisateurs sur le domaine avec la permission "Modifier tous les jeux de données"
it: Utenti del dominio che dispongono del permesso "Modifica tutti i dataset"
nl: Gebruikers op het domein met de toelating "Bewerk alle datasets"

source: Sample
de: Muster
es: Ejemplo
fr: Exemple
it: Esempio
nl: Voorbeeld
