Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_account/06_managing_notifications/managing_notifications.po
Languages: de, es, fr, nl

source: Managing notifications
de: Benachrichtigungen verwalten
es: Administrar las notificaciones
fr: Gérer les notifications
nl: Kennisgevingen beheren

source: From the Notifications tab, authenticated users can manage which domain-related notifications and Opendatasoft-related newsletters they wish to receive by email.
de: Über die Registerkarte "Benachrichtigungen" können authentifizierte Benutzer verwalten, welche Domain-relevanten Benachrichtigungen und Opendatasoft-Newsletter sie per E-Mail erhalten möchten.
fr: Depuis l'onglet Notifications, les utilisateurs authentifiés peuvent gérer les notifications en fonction des domaines et les newsletters liées à Opendatasoft qu'ils souhaitent recevoir par e-mail.

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: Notifications are sent to the users depending on their permissions.
de: Benachrichtigungen werden je nach ihren Berechtigungen an die entsprechenden Benutzer gesendet.
es: Las notificaciones se envían a los usuarios en función de sus permisos.
fr: Les notifications sont envoyées aux utilisateurs en fonction des autorisations données.
nl: Kennisgevingen worden naar de gebruikers gestuurd afhankelijk van hun toelatingen.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Notifications are always sent by support@opendatasoft.com. For notifications to be sent from a different sender address, for example, the email address of an organization, please contact the support team.
de: Benachrichtigungen werden immer von support@opendatasoft.com versendet. Damit Benachrichtigungen von einer anderen Absenderadresse (z.B. der E-Mail-Adresse eines Unternehmens) gesendet werden können, wenden Sie sich bitte an das Supportteam.
fr: Les notifications sont toujours envoyées par l'adresse support@opendatasoft.com. Pour que les notifications soient envoyées depuis une autre adresse, comme celle d'une organisation, veuillez contacter l'équipe de support technique.

source: Subscribing to alerts and reports
de: Meldungen und Berichte abonnieren
es: Suscribirse a alertas e informes
fr: S'abonner aux alertes et rapports
nl: Inschrijven op waarschuwingen en rapporten

source: Alerts and reports notifications are sent whenever an important event occurs on the portal. They allow being informed in real time and take action if needed.
de: Meldungen und Berichte werden immer dann gesendet, wenn ein wichtiges Ereignis auf Ihrem Portal auftritt. So werden Sie in Echtzeit informiert und können gegebenenfalls Maßnahmen ergreifen.
fr: Des notifications d'alertes et de rapports sont envoyées à chaque fois qu'un événement important se produit sur le portail. Elles vous permettent d'être informé en temps réel et de prendre éventuellement les mesures nécessaires.

source: 3 types of domain-related notifications can be sent:
de: Es gibt 3 Arten von Domain-relevanten Benachrichtigungen:
es: Se pueden enviar tres tipos de notificaciones relacionadas con el dominio:
fr: 3 types de notifications en lien avec les domaines peuvent être envoyés :
nl: Er kunnen 3 soorten domeingerelateerde kennisgevingen worden verstuurd:

source: Daily reports: portal alerts and news sent daily at 9 AM. They notify users about processing alerts, newly created datasets on the portal, and pending user feedbacks on a dataset (:doc:`more information<daily_report>`).
de: Tägliche Berichte: Meldungen und Nachrichten des Portals, die täglich um 9 Uhr versendet werden. Sie informieren Benutzer über Meldungen zu Verarbeitungen, neu erstellte Datensätze im Portal und ausstehende Rückmeldungen eines Benutzer zu einem Datensatz (:doc:`weitere Informationen<daily_report>`).
fr: Rapports quotidiens : les alertes de portail et les actualités sont envoyées chaque jour à 9 h. Elles informent les utilisateurs du traitement des alertes, des nouveaux jeux de données disponibles sur le portail et des commentaires utilisateurs en attente concernant un jeu de données (:doc:`plus d'informations<daily_report>`).

source: Processing alerts: sent whenever there is a processing alert on a newly created dataset. They notify about processors in error and errors of realtime dataset update (:doc:`more information<processing_alert>`).
de: Meldungen zu Verarbeitungen: werden immer dann gesendet, wenn eine Meldung bezüglich der Verarbeitung eines neu erstellten Datensatzes vorliegt. Sie informieren über fehlerhafte Prozessoren und Fehler bei der Aktualisierung von Echtzeit-Datensätzen (:doc:`weitere Informationen<processing_alert>`).
fr: Alertes de traitement : elles sont envoyées à chaque fois qu'il y a une alerte de traitement sur un nouveau jeu de données. Elles signalent les processeurs en erreur et les erreurs de mise à jour en temps réel des jeux de données (:doc:`plus d'informations<processing_alert>`).

source: Quota alerts: sent when a quota has reached 80% or is expired (:doc:`more information<quota>`).
de: Quotenalarme: werden gesendet, wenn eine Quote 80 % erreicht hat oder abgelaufen ist (:doc:`weitere Informationen<quota>`).
es: Alertas de cuota: se envían cuando una cuota ha alcanzado el 80% o ha caducado (:doc:`más información<quota>`).
fr: Alertes de quota : elles sont envoyées quand un quota atteint 80 % de sa capacité ou expire (:doc:`plus d'informations<quota>`).
nl: Quotawaarschuwingen: worden verstuurd wanneer een quotum 80% heeft bereikt of het is vervallen (:doc:`meer informatie<quota>`).

source: Tick the box corresponding to any of the Notifications to subscribe. Untick any of the boxes to stop receiving the corresponding notification.
de: Markieren Sie das Kontrollkästchen, das einer Benachrichtigung entspricht, die Sie abonnieren möchten. Deaktivieren Sie eines der Kontrollkästchen, um den Versand der entsprechenden Benachrichtigung zu stoppen.
es: Marque la casilla correspondiente a cualquiera de las notificaciones para suscribirse. Desmarque cualquiera de las casillas para dejar de recibir la notificación correspondiente.
fr: Cochez la case correspondant aux notifications de votre choix pour vous abonner. Décocher les cases pour ne plus recevoir les notifications correspondantes.
nl: Vink het vakje aan dat overeenstemt met een van de Kennisgevingen waarop kan worden ingeschreven. Vink een van de vakjes uit om het ontvangen van de overeenkomstige kennisgeving stop te zetten.

source: Subscribing to Opendatasoft newsletters
de: Opendatasoft-Newsletter abonnieren
es: Suscribirse a las newsletters de Opendatasoft
fr: S'abonner aux lettres d'information Opendatasoft
nl: Inschrijven op Opendatasoft-nieuwsbrieven

source: 2 types of newsletters can be sent:
de: Es können 2 Arten von Newslettern versendet werden:
es: Se pueden enviar dos tipos de newsletters:
fr: 2 types de lettres d'informations peuvent vous être envoyés :
nl: Er kunnen 2 soorten nieuwsbrieven worden verstuurd:

source: Product News: informs about new features, shares tips and tricks about the Opendatasoft platform.
de: Product News: informiert über neue Funktionen und bietet Tipps und Tricks zur Opendatasoft-Plattform.
es: Product News: informa sobre nuevas funciones, comparte consejos y trucos sobre la plataforma Opendatasoft.
fr: Actualités du Produit : elles informent des nouvelles fonctionnalités et vous donnent des astuces concernant l'utilisation de la plateforme Opendatasoft.
nl: Product News: informeert over nieuwe functionaliteiten en deelt tips and tricks over het Opendatasoft-portaal.

source: Data Ecosystem News: informs about the data world (articles, events, featured datasets, etc.).
de: Data Ecosystem News: informiert über die Welt der Daten (Artikel, Veranstaltungen, ausgewählte Datensätze usw.).
fr: Actualités de l'Ecosystème Data : elles relatent les nouveautés dans le monde des données (articles, événements, jeux de données, etc.).

source: Tick the box corresponding to any of the newsletters to subscribe. Untick any of the boxes to stop receiving the corresponding newsletter.
de: Markieren Sie das Kontrollkästchen, um den entsprechenden Newsletter zu abonnieren. Deaktivieren Sie eines der Kontrollkästchen, um den Versand des entsprechenden Newsletters zu stoppen.
es: Marque la casilla correspondiente a cualquiera de las newsletters para suscribirse. Desmarque cualquiera de las casillas para dejar de recibir la newsletter correspondiente.
fr: Cochez la case correspondant aux lettres d'information de votre choix pour vous abonner. Décocher les cases pour ne plus recevoir les lettres d'information correspondantes.
nl: Vink het vakje aan dat overeenstemt met een van de nieuwsbrieven waarop kan worden ingeschreven. Vink een van de vakjes uit om het ontvangen van de overeenkomstige nieuwsbrief stop te zetten.

source: Opendatasoft newsletters are only available in English and French.
de: Opendatasoft-Newsletter sind nur auf Englisch und Französisch verfügbar.
es: Las newsletters de Opendatasoft solo están disponibles en inglés y francés.
fr: Les lettres d'information Opendatasoft ne sont disponibles qu'en français et en anglais.
nl: Opendatasoft-nieuwsbrieven zijn enkel in het Engels en het Frans beschikbaar.

source: From the Notifications tab, authenticated users have the possibility to manage which domain-related notifications and Opendatasoft-related newsletters they wish to receive by email.
es: En la ficha Notificaciones los usuarios autenticados tienen la posibilidad de administrar las notificaciones relacionadas con el dominio y las newsletters relacionadas con Opendatasoft que deseen recibir por correo electrónico.
nl: Vanuit de tab Kennisgevingen hebben geauthentificeerde gebruikers de mogelijkheid te bepalen welke domeingerelateerde kennisgevingen en Opendatasoft-gerelateerde nieuwsbrieven ze via e-mail willen ontvangen.

source: Notifications are always sent by support@opendatasoft.com. For notifications to be sent from a different sender address, for example the email address of an organization, please contact the support team.
es: Las notificaciones se envían siempre desde support@opendatasoft.com. Si desea que las notificaciones se envíen desde la dirección de otro remitente (por ejemplo, una dirección de su propia organización), póngase en contacto con el equipo de soporte.
nl: Kennisgevingen worden altijd verstuurd door support@opendatasoft.com. Voor kennisgevingen die verstuurd worden door een ander verzendadres, bijvoorbeeld het e-mailadres van een organisatie, gelieve contact op te nemen met het support team.

source: Alerts and reports notifications are sent whenever an important event occurs on the portal. They give the opportunity to be informed in real time and take action if needed.
es: Las notificaciones de alertas e informes se envían siempre que tiene lugar algún evento importante en el portal. Permiten estar informados en tiempo real y actuar si es necesario.
nl: Kennisgevingen voor waarschuwingen en rapporten worden verstuurd wanneer er een belangrijke gebeurtenis plaatsvindt op het portaal. Ze bieden de mogelijkheid in real time te worden ge√Ønformeerd en om indien nodig actie te ondernemen.

source: Daily reports: portal alerts and news sent daily at 9AM. They notify users about processing alerts, newly created datasets on the portal, and pending user feedbacks on a dataset (:doc:`more information<daily_report>`).
es: Informes diarios: alertas y noticias del portal que se envían a diario a las 09:00 de la mañana. Notifican a los usuarios si hay alertas de procesamiento, conjuntos de datos recién creados en el portal y comentarios de usuario pendientes acerca un conjunto de datos (:doc:`más información<daily_report>`).
nl: Dagelijkse rapporten: waarschuwingen en nieuws over het portaal die dagelijks om 09u00 worden verstuurd. Ze stellen gebruikers in kennis van waarschuwingen met betrekking tot verwerking, nieuw aangemaakte datasets op het portaal en in afwachting zijnde feedback van gebruikers over een dataset (:doc:`meer informatie<daily_report>`).

source: Processing alerts: sent whenever there is a processing alert on a newly created dataset. They notify about processors in error, and errors of realtime dataset update (:doc:`more information<processing_alert>`).
es: Alertas de procesamiento: se envían siempre que existe una alerta de procesamiento sobre un conjunto de datos recién creado. Notifican si existen errores de procesador y errores en la actualización de los conjuntos de datos en tiempo real (:doc:`más información<processing_alert>`).
nl: Verwerkingswaarschuwingen: worden verstuurd wanneer er een verwerkingswaarschuwing is voor een nieuw aangemaakte dataset. Ze geven informatie over processoren in fout en fouten bij een real time dataset-update (:doc:`meer informatie<processing_alert>`).

source: Data Ecosystem News: informs about the data world (articles, events, featured datasets etc.).
es: Data Ecosystem News: informa sobre el mundo de los datos (artículos, eventos, conjuntos de datos destacados, etc.).
nl: Data Ecosystem News: informeert over de datawereld (artikels, evenementen, gekenmerkte datasets, enz.).
