Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/managing_account/06_managing_notifications/quota.po
Languages: de, es, fr, it, nl

source: API calls quota notifications
de: Benachrichtigungen über API-Aufrufquote
es: Notificaciones de cuotas de llamadas de API
fr: Notifications de quota d'API
it: Notifiche sulle quote delle chiamate API
nl: Kennisgevingen betreffende de quota's voor API calls

source: The following API calls quotas are considered:
de: Berücksichtigt werden folgende API-Aufrufquoten:
es: Se tienen en cuenta las cuotas de llamadas de API siguientes:
fr: Les appels d'API suivants sont pris en compte :
it: Le quote che regolano l’uso delle chiamate API sono le seguenti:
nl: De volgende quota's voor API calls worden overwogen:

source: the number of API calls allowed in your OpenDataSoft license; this is a quota shared by all users (both authenticated and anonymous).
de: die Anzahl der für Ihre OpenDataSoft-Lizenz zulässigen API-Aufrufe. Diese Quote wird von allen Benutzern geteilt (authentifizierte und anonyme).
fr: le nombre d'appels d'API autorisés dans votre licence OpenDataSoft ; il s'agit du quota partagé par tous les utilisateurs (authentifiés et anonymes).
it: numero di chiamate API consentite dalla tua licenza OpenDataSoft; questa quota comprende gli utilizzi di tutti gli utenti, sia quelli autenticati che anonimi;
nl: het aantal API calls dat toegelaten is volgens uw OpenDataSoft-licentie: die is een quotum dat gedeeld wordt door alle gebruikers (zowel geïdentificeerde als anonieme gebruikers).

source: the quota allowed to a specific user; this can be configured in the back-office.
de: die einem bestimmten Benutzer gewährte Quote. Dies kann im Back-Office konfiguriert werden.
es: La cuota permitida para un usuario específico; se puede configurar en el back office.
fr: le quota alloué à un utilisateur spécifique ; cela peut être configuré dans l'administration du portail.
it: la quota assegnata a un utente specifico, configurata nell'interfaccia di back-office;
nl: het quotum dat toegelaten is voor een specifieke gebruiker; deze kan geconfigureerd worden in de back-office.

source: the quota allowed to all anonymous users; this is a quota shared by all anonymous users, and it can be configured in the back-office.
de: die allen anonymen Benutzern gewährte Quote. Das ist eine von allen anonymen Benutzern geteilte Quote, die im Back-Office konfiguriert werden kann.
es: La cuota permitida para todos los usuarios anónimos; es una cuota compartida por todos los usuarios anónimos, y se puede configurar en el back office.
fr: le quota alloué à tous les utilisateurs anonymes ; il s'agit du quota partagé par tous les utilisateurs anonymes, il peut être configuré dans l'administration du portail.
it: la quota assegnata alla totalità degli utenti anonimi, comprendente gli utilizzi di tutti gli utenti anonimi, configurata nell'interfaccia di back-office.
nl: het quotum dat toegelaten is voor alle anonieme gebruikers; dit is een quotum dat gedeeld wordt door alle anonieme gebruikers en kan niet worden geconfigureerd in de back-office.

source: A notification email is sent when any of these conditions is met:
de: Eine E-Mail-Benachrichtigung wird versendet, sobald eine der folgenden Bedingungen erfüllt ist:
es: Se envía un correo electrónico de notificación cuando se cumple alguna de estas condiciones:
fr: Un email de notification est envoyé quand une des conditions suivantes est rencontrée :
it: Un'email di notifica viene inviata al verificarsi di una di queste condizioni:
nl: Er wordt een kennisgevingsmail verstuurd wanneer aan één van deze voorwaarden is voldaan:

source: 80% of the allowed API calls have been reached for a given quota
de: 80 % der zulässigen API-Aufrufe wurden für eine bestimmte Quote erreicht
es: Se ha alcanzado el 80% de las llamadas de API permitidas para una cuota determinada.
fr: 80% des appels d'API autorisés a été atteint pour un quota donné
it: è stato raggiunto l'80% delle chiamate API consentite da una determinata quota;
nl: voor een welbepaald quotum werd 80% van het toegelaten aantal API calls bereikt

source: the maximum number of allowed API calls has been reached for a given quota
de: die maximal zulässige Anzahl an API-Aufrufen wurde für eine bestimmte Quote erreicht
es: Se ha alcanzado el número máximo de llamadas de API permitidas para una cuota determinada.
fr: le nombre maximum d'appels API a été atteint pour un quota donné
it: è stato raggiunto il numero massimo di chiamate API consentite da una determinata quota.
nl: voor een welbepaald quotum werd het maximum aantal toegelaten API calls bereikt

source: Recipients
de: Empfänger
es: Destinatarios
fr: Destinataires
it: Destinatari
nl: Ontvangers

source: the user with the expired quota, if the notification is triggered on the user's quota
de: die Benutzer mit der erreichten Quote bei Auslösung der Benachrichtigung durch die Benutzerquote
es: El usuario con la cuota caducada, si la notificación se ha desencadenado para la cuota del usuario.
fr: l'utilisateur dont le quota a expiré, si la notification s'est déclenchée sur un quota utilisateur
it: l'utente che ha raggiunto la quota massima, se la notifica è stata attivata sulla quota di un utente;
nl: de gebruiker met het vervallen quotum, wanneer de kennisgeving getriggerd wordt voor het quotum van de gebruiker

source: all users on the domain with the "Edit all datasets" permission
de: alle Benutzer der Domain mit der Berechtigung "Alle Datensätze bearbeiten"
es: Todos los usuarios del dominio con el permiso "Editar todos los conjuntos de datos".
fr: tous les utilisateurs du domaine avec la permission "Editer tous les jeux de données"
it: tutti gli utenti del dominio che dispongono del permesso "Modifica tutti i dataset".
nl: alle gebruikers op het domein met een toelating "Bewerk alle datasets"

source: Sample
de: Muster
es: Ejemplo
fr: Exemple
it: Esempio
nl: Voorbeeld

source: the number of API calls allowed in your Opendatasoft license; this is a quota shared by all users (both authenticated and anonymous).
es: El número de llamadas de API permitidas en la licencia de Opendatasoft; es una cuota compartida por todos los usuarios (autenticados y anónimos).
