Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/08_configuring_dataset_export/configuring_dataset_export.po
Languages: de, es, fr, nl

source: Configuring dataset export
de: Datensatz-Export konfigurieren
es: Configurar la exportación de conjuntos de datos
fr: Configurer l'export d'un jeu de données
nl: Export van datasets configureren

source: Users can download any published dataset in a variety of formats, from the Export tab of the front office (see :doc:`Exporting data </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).
de: Benutzer können jeden veröffentlichten Datensatz in einer Vielzahl von Formaten unter der Registerkarte "Export" im Front-Office herunterladen (siehe :doc:`Daten exportieren </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).
es: Los usuarios pueden descargar los conjuntos de datos publicados en varios formatos desde la ficha Exportar del front office (consulte :doc:`Exportar datos </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).
fr: Les utilisateurs peuvent télécharger en divers formats n'importe quel jeu de données produit, depuis l'onglet Export de l'interface de navigation (voir :doc:`Exporter des données </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).
nl: Gebruikers kunnen elke gepubliceerde dataset in verschillende formaten downloaden vanuit de Export tab van de front office (zie :doc:`Data exporteren </exploring_catalog_and_datasets/04_getting_involved/exporting_data>`).

source: In the Opendatasoft platform, the configuration of the available exports is done in the Export tab of the edition interface of each dataset.
de: Auf der Opendatasoft-Plattform werden die verfügbaren Exporte unter der Registerkarte "Export" der Bearbeitungsoberfläche eines Datensatzes konfiguriert.
es: En la plataforma Opendatasoft, la configuración de las exportaciones disponibles se lleva a cabo en la ficha Exportar de la interfaz de edición de cada conjunto de datos.
fr: Dans la plateforme Opendatasoft, la configuration des exports disponibles est effectuée dans l'onglet Export de l'interface d'édition pour chaque jeu de données.
nl: In het Opendatasoft-portaal gebeurt de configuratie van de beschikbare exports in de tab Exporteren van de bewerkingsinterface van elke dataset.

source: Specifying a sort for exports
de: Festlegen einer Sortierung für die Exporte
es: Especificar un orden para las exportaciones
fr: Spécifier une règle de tri pour les exports
nl: Een volgorde voor exports specificeren

source: By default, the records of a dataset export are not ordered. It is possible to configure the sorting of the records, by choosing a sort type for a chosen field.
de: Standardmäßig sind die Einträge eines Datensatz-Exports nicht geordnet. Sie können die Sortierung der Datensätze konfigurieren, indem Sie einen Sortierungstyp für ein ausgewähltes Feld auswählen.
es: De manera predeterminada, los registros de una exportación de conjuntos de datos no están ordenados. Es posible configurar el orden de los registros seleccionando un tipo de ordenación para un campo concreto.
fr: Par défaut, les enregistrements d'un export de jeu de données ne sont pas ordonnés. Il est possible de configurer le classement des enregistrements en choisissant une règle de tri pour un champ donné.
nl: Standaard staan de records van een dataset export niet in volgorde. Het is mogelijk om de volgorde van de records te configureren door een volgordetype voor het gekozen veld te kiezen.

source: Prerequisite
de: Voraussetzung
es: Requisito previo
fr: Prérequis
nl: Voorvereiste

source: Only fields that can be sorted by default, or fields that have been set as sortable, can be selected for this feature.
de: Für diese Funktion können nur Felder ausgewählt werden, die standardmäßig sortierbar sind oder die als sortierbar eingestellt wurden.
es: Para esta función solo se pueden seleccionar campos que puedan ordenarse de manera predeterminada o campos que se hayan definido como ordenables.
fr: Seuls les champs pouvant être triés par défaut ou ceux configurés comme triables peuvent être sélectionnés pour cette fonctionnalité.
nl: Hiervoor kunnen enkel velden worden geselecteerd die standaard gesorteerd kunnen worden of velden die ingesteld geweest zijn als sorteerbaar.

source: In the Export sort area, click on the "Sort on field" list box.
de: Klicken Sie im Bereich "Export sortieren" auf das Listenfeld "Sortieren nach Feld".
es: En el área Orden de la exportación, haga clic en el cuadro de lista "Ordenar según campo".
fr: Dans la section Tri des exports, cliquez sur la zone de liste "Tri sur le champ".
nl: Klik in de rubriek Exportvolgorde op het vakje "Sorteer op veld"

source: Choose a field from the dataset, on which the sorting will be based.
de: Wählen Sie ein Feld aus dem Datensatz, auf dem die Sortierung basieren soll.
es: Seleccione un campo del conjunto de datos en el que se basará la ordenación.
fr: Choisissez le champ du jeu de données sur lequel le tri doit être basé.
nl: Kies een veld uit de dataset waarop de sortering gebaseerd zal zijn.

source: Click on the second list box, displayed below the first one.
de: Klicken Sie auf das zweite Listenfeld, das unterhalb des ersten angezeigt wird.
es: Haga clic en el segundo cuadro de lista, que se muestra bajo el primero.
fr: Cliquez sur la deuxième zone de liste qui s'affiche sous la première.
nl: Klik op het tweede vakje in de lijst dat onder het eerste vakje staat weergegeven.

source: Choose a sort type.
de: Wählen Sie einen Sortierungstyp.
es: Elija un tipo de ordenación:
fr: Choisissez une règle de tri.
nl: Kies een volgordetype

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: The sort does not apply on additional export formats.
de: Die Sortierung gilt nicht für weitere Exportformate.
es: La ordenación no se aplica a formatos de exportación adicionales.
fr: Le tri ne s'applique pas aux formats d'export additionnels.
nl: De sortering geldt niet voor bijkomende exportformaten.

source: Adding other geographical projections
de: Weitere geografische Projektionen hinzufügen
es: Añadir otras proyecciones geográficas
fr: Ajouter d'autres projections géographiques
nl: Andere geografische projecties toevoegen

source: The geographical coordinates of a published dataset are by default expressed in WGS84, no matter what was their original projection when creating the dataset. It is possible to configure additional geographical projections to enable users to export the dataset in their preferred geographical projection.
de: Die geografischen Koordinaten eines veröffentlichten Datensatzes werden standardmäßig in WGS84 angegeben, unabhängig von ihrer ursprünglichen Projektion bei der Erstellung des Datensatzes. Es können zusätzliche geografische Projektionen konfiguriert werden, damit der Benutzer den Datensatz in seiner bevorzugten geografischen Projektion exportieren kann.
es: Las coordenadas geográficas de un conjunto de datos publicado se expresan por defecto en WGS84, independientemente de su proyección original al crearse el conjunto de datos. Se pueden configurar proyecciones geográficas adicionales para que los usuarios puedan exportar el conjunto de datos en la proyección geográfica que deseen.
fr: Les coordonnées géographiques d'un jeu de données publié sont exprimées par défaut en WGS84, peu importe la projection originale utilisée au moment de la création du jeu de données. Il est possible de configurer des projections géographiques supplémentaires pour permettre aux utilisateurs d'exporter le jeu de données dans leur projection géographique préférée.
nl: De geografische coördinaten van een gepubliceerde dataset worden standaard uitgedrukt in WGS84, ongeacht hun oorspronkelijke projectie wanneer de dataset werd aangemaakt. Het is mogelijk om extra geografische projecties te configureren om zo gebruikers in staat te stellen de dataset te exporteren in hun favoriete geografische projectie.

source: In the Additional geographical projections area, click on the Additional projections textbox.
de: Klicken Sie in dem Bereich "Zusätzliche geografische Projektionen" auf das Textfeld "Zusätzliche Projektionen".
es: En el área Proyecciones geográficas adicionales, haga clic en el cuadro de texto Proyecciones adicionales.
fr: Dans la zone Projections géographiques supplémentaires, cliquez sur la zone de texte Projections supplémentaires.
nl: Klik in de rubriek Extra geografische projecties op het tekstvak Extra projecties.

source: Write the EPSG code of the chosen geographical projection. Or, choose one from the suggestions list.
de: Geben Sie den EPSG-Code der gewählten geografischen Projektion ein. Oder wählen Sie einen aus der Vorschlagsliste aus.
es: Escriba el código EPSG de la proyección geográfica elegida. También puede elegir una de las opciones de la lista de sugerencias.
fr: Saisissez le code EPSG de la projection géographique choisie ou sélectionnez-en une parmi la liste de suggestions.
nl: Schrijf de EPSG-code van de gekozen geografische projectie of kies er een uit de lijst met suggesties.

source: Adding more export formats
de: Weitere Exportformate hinzufügen
es: Añadir formatos de exportación adicionales
fr: Ajouter des formats d'export supplémentaires
nl: Meer exportformaten toevoegen

source: More specific formats can be available for export:
de: Für den Export können spezifischere Formate zur Verfügung gestellt werden:
es: Puede poner a disposición de los usuarios más formatos de exportación específicos:
fr: Des formats d'export plus spécifiques peuvent être activés :
nl: Er zijn meerdere specifieke formaten beschikbaar voor het exporteren:

source: GPX (default): this format can directly be configured from the Export tab to be available as additional export format. Note that the GPX format requires the dataset to contain geographical coordinates to be available.
de: GPX (Standard): Dieses Format kann direkt über die Registerkarte "Export" konfiguriert werden, um als zusätzliches Exportformat verfügbar zu sein. Beachten Sie, dass der Datensatz für das GPX-Format geografische Koordinaten enthalten muss.
es: GPX (predeterminado): este formato se puede configurar directamente en la pestaña Exportar para que esté disponible como formato de exportación adicional. Tenga en cuenta que el formato GPX requiere que el conjunto de datos contenga coordenadas geográficas para estar disponible.
fr: GPX (par défaut) : ce format peut être configuré directement depuis l'onglet Export afin d'être proposé dans les formats d'export supplémentaires. Veuillez noter que le jeu de données doit contenir des coordonnées géographiques pour que ce format soit disponible.
nl: GPX (standaard): dit formaat kan rechtstreeks worden geconfigureerd vanuit de Export tab om beschikbaar te zijn als extra exportformaat. Merk op dat het GPX-formaat vereist dat de dataset geografische coördinaten moet bevatten om beschikbaar te zijn.

source: CIFS (on demand): for datasets pushing data to Waze. Once activated on the domain, this format can be configured from the Export tab.
de: CIFS (auf Anfrage): für Datensätze, die Daten an Waze übertragen. Nach der Aktivierung in der Domain kann dieses Format über die Registerkarte Export konfiguriert werden.
es: CIFS (bajo demanda): para conjuntos de datos que envían datos a Waze. Una vez activado en el dominio, este formato se puede configurar en la pestaña Exportar.
fr: CIFS (sur demande) : pour les jeux de données transmettant des données vers Waze. Une fois activé sur le domaine, ce format peut être configuré depuis l'onglet Export.
nl: CIFS (op verzoek): voor datasets die data pushen naar Waze. Eenmaal dit formaat geactiveerd is op het domein, kan het geconfigureerd worden vanuit de Export tab.

source: DCAT-AP for Sweden, Spain, Germany and Switzerland (on demand): these formats must be configured by Opendatasoft. They are never displayed in the Export tab of the edition interface of the dataset.
de: DCAT-AP für Schweden, Spanien, Deutschland und die Schweiz (auf Anfrage): Diese Formate müssen von Opendatasoft konfiguriert werden. Sie werden niemals unter der Registerkarte "Export" der Bearbeitungsoberfläche eines Datensatzes angezeigt.
es: DCAT-AP para Suecia, España, Alemania y Suiza (bajo demanda): estos formatos deben ser configurados por Opendatasoft. Nunca se muestran en la pestaña Exportar de la interfaz de edición del conjunto de datos.
fr: DCAT-AP pour la Suède, l'Espagne, l'Allemagne et la Suisse (sur demande) : ces formats doivent être configurés par OpenDataSoft. Ils ne figurent jamais dans l'onglet Export de l'interface d'édition du jeu de données.
nl: DCAT-AP voor Zweden, Spanje, Duitsland en Zwitserland (op verzoek): deze formaten moeten geconfigureerd worden door Opendatasoft. Ze worden nooit weergegeven in de Export tab van de bewerkingsinterface van de dataset.

source: Please contact Opendatasoft support team to know more about and/or to ask for the activation of additional export formats.
de: Wenden Sie sich an das OpenDataSoft-Supportteam, um mehr darüber zu erfahren und/oder die Aktivierung zusätzlicher Exportformate zu beantragen.
es: Póngase en contacto con el equipo de soporte de Opendatasoft para obtener más información o solicitar la activación de formatos de exportación adicionales.
fr: Veuillez contacter l'équipe support OpenDataSoft pour en savoir plus et/ou demander l'activation de formats d'export supplémentaires.
nl: Gelieve contact op te nemen met het support team van Opendatasoft voor meer informatie en/of om te vragen om extra exportformaten te activeren.

source: Uploading alternative exports
de: Alternative Exportformate hochladen
es: Cargar exportaciones alternativas
fr: Mettre en ligne d'autres formats d'export
nl: Alternatieve exports uploaden

source: The Alternative exports area of the Export tab allows to upload any file of any format.
de: Über den Bereich "Alternative Exporte" in der Registerkarte "Exporte" können Dateien jedes Formates hochgeladen werden.
es: El área Exportaciones alternativas de la pestaña Exportar permite cargar cualquier archivo de cualquier formato.
fr: La section Autres exports de l'onglet Export vous permet de télécharger des fichiers, quel qu'en soit le format.
nl: De rubriek Alternatieve exports van de Export tab laat toe om elk bestand in elk formaat te uploaden

source: To upload an alternative export file, either click the Upload a file button, or drag and drop the file in the area.
de: Um eine alternative Exportdatei hochzuladen, klicken Sie entweder auf den Button "Eine Datei hochladen" oder ziehen Sie die Datei per Drag & Drop in den Bereich.
es: Para cargar un archivo de un formato alternativo, haga clic en el botón Cargar un archivo, o arrastre el archivo y suéltelo en el área en cuestión.
fr: Pour mettre en ligne un fichier d'export dans un autre format, cliquez sur le bouton Ajouter un fichier ou glissez/déposez le fichier dans la zone.
nl: Om een alternatief exportbestand te uploaden, klik ofwel op de knop Een bestand uploaden, of sleep en plaats het bestand in de rubriek.
