Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/01_creating_advanced_maps/configure-your-map.po
Languages: de, es, fr, it, nl

source: Configure your map
de: Konfigurieren Sie Ihre Karte
es: Configurar el mapa
fr: Configurer votre carte
it: Configurazione di una mappa
nl: Configureer uw kaart

source: Overview of the Configuration interface
de: Überblick über die Konfigurationsoberfläche
es: Visión general de la interfaz Configuración
fr: Vue d'ensemble de l'interface de configuration
it: Panoramica dell'interfaccia di Configurazione
nl: Overzicht van de configuratie-interface

source: From the **Configuration** interface, you can configure your map as seen in view or preview mode. This interface is accessible from the Map Builder menu displayed at the very top of the map.
de: In der Oberfläche **Konfiguration** können Sie konfigurieren, wie Ihre Karte in der Ansicht oder der Vorschau angezeigt wird. Diese Oberfläche ist über das Kartenersteller-Menü erreichbar, das ganz oben auf der Karte angezeigt wird.
es: En la interfaz **Configuración**, puede configurar el mapa tal como se ve en el modo de edición o vista previa. Se puede acceder a esta interfaz desde el menú Compilador de mapas que se visualiza en la parte superior del mapa.
fr: Depuis l'interface **Configuration**, vous pouvez configurer votre carte telle qu'elle apparaitra dans le mode aperçu ou visualisation. Cette interface est accessible depuis le menu de l'Editeur de Cartes affiché tout en haut de la carte.
it: Dall'interfaccia di **Configurazione**, puoi configurare l’aspetto che avrà la mappa nelle modalità di visualizzazione e di anteprima. L'interfaccia è accessibile dal menu di Mapbuilder, presente nella parte superiore della mappa stessa.
nl: Vanuit de **configuratie-interface** kunt u uw kaart configureren zoals u gezien hebt in weergave- of voorbeeldmodus. Deze interface is toegankelijk vanuit het menu Map Builder dat helemaal bovenaan de kaart wordt weergegeven.

source: The interface of **Configuration** contains:
de: Die Oberfläche der **Konfiguration** enthält:
es: La interfaz **Configuración** contiene:
fr: L'interface de **Configuration** contient :
it: L'interfaccia di **Configurazione** presenta:
nl: De interface van **Configuratie** omvat:

source: the **URL** of your map
de: die **URL** Ihrer Karte
es: La dirección **URL** del mapa
fr: l'**URL** de la carte
it: l'**URL** della mappa;
nl: de **URL** van uw kaart

source: a **Display search box** checkbox, to have the possibility to make research on your map
de: ein Kontrollkästchen **Suchleiste anzeigen**, um die Möglichkeit zu haben, auf Ihrer Karte eine Suche durchzuführen
es: Una casilla **Visualizar cuadro de búsqueda**, para poder llevar a cabo tareas de investigación en el mapa
fr: une case à cocher **Afficher le champ de recherche**, qui donne la possibilité de faire des recherches sur votre carte
it: la casella di controllo **Visualizza la casella di ricerca**, per offrire la possibilità di effettuare ricerche sulla mappa;
nl: een vakje **Weergave zoekvak** dat kan worden aangevinkt en dat u toelaat om een zoekopdracht uit te voeren op de kaart

source: a **Display full screen in view mode** checkbox, to display |icon-fullscreen| on your map and thus have the possibility to display your map in full screen
de: ein Kontrollkästchen **Vollbildanzeige im Modus Ansicht anbieten**, um |icon-fullscreen| auf Ihrer Karte anzuzeigen und somit die Möglichkeit zu haben, Ihre Karte als Vollbild darzustellen
es: Una casilla **Visualizar pantalla completa en modo de vista**, para ver |icon-fullscreen| en el mapa y así poder visualizar el mapa en pantalla completa
fr: une case à cocher **Afficher le mode plein écran en mode vue**, pour afficher l'icône |icon-fullscreen| sur votre carte et donner la possibilité d'afficher la carte en plein écran
it: la casella di controllo **Mostra la visualizzazione a schermo intero**, per rendere disponibile l'icona |icon-fullscreen| e consentire quindi di visualizzare la mappa a schermo intero;
nl: een vakje **Weergave op volledig scherm in bekijkmodus** om het pictogram |icon-fullscreen| weer te geven op uw kaart en u zo de mogelijkheid hebt om uw kaart op een volledig scherm weer te geven

source: a **Geolocation** checkbox, to display |icon-localize| on your map and thus have the possibility to focus the map on where you’re located
de: ein Kontrollkästchen **Geolokalisierung**, um |icon-localize| auf Ihrer Karte anzuzeigen und somit die Möglichkeit zu haben, die Karte auf Ihren aktuellen Standort zu zentrieren
es: Una casilla **Geolocalización**, para ver |icon-localize| en el mapa y así poder centrar el mapa en su ubicación actual
fr: une case à cocher **Géolocalisation**, pour afficher l'icône |icon-localize| sur votre carte et donner la possibilité de centrer la carte sur votre localisation actuelle
it: la casella di controllo **Geolocalizzazione**, per rendere disponibile l'icona |icon-localize| e consentire quindi di centrare la mappa sulla propria posizione geografica;
nl: een vakje **Geolocatie** dat kan worden aangevinkt om het pictogram |icon-localize| weer te geven op uw kaart en u zo de mogelijkheid hebt om de kaart te focussen daar waar u zich bevindt

source: an **Auto-geolocation** checkbox for the map to automatically focus on where you’re located
de: ein Kontrollkästchen **Auto-Geolokalisierung**, um die automatische Zentrierung der Karte auf Ihren aktuellen Standort zu aktivieren
es: Una casilla **Geolocalización automática**, para que el mapa se centre automáticamente en su ubicación actual

source: a **Display layers and groups visibility control** checkbox, to have the possibility to play with layers and groups of layers (hide them or display them) on the map
de: ein Kontrollkästchen **Sichtbarkeitskontrolle für Ebenen und Gruppen anzeigen**, um die Möglichkeit zu haben, auf der Karte mit (aus- und einzublendenden) Ebenen und Gruppen zu experimentieren
es: Una casilla **Visualizar control de visibilidad de capas y grupos**, para poder ocultar o visualizar las capas y los grupos de capas en el mapa
fr: une case à cocher **Afficher le contrôle de visibilité des calques et groupes**, qui donne la possibilité de manipuler les couches et groupes de couches (les masquer ou les afficher) sur la carte
it: la casella di controllo **Visualizza il comando per la visibilità di layer e gruppi**, per permettere di giocare con i layer e i gruppi di layer della mappa, scegliendo quando visualizzarli o nasconderli.
nl: een vakje **Weergave zichtbaarheidscontrole lagen en groepen** dat kan worden aangevinkt zodat u de mogelijkheid hebt om te spelen met lagen en groepen lagen (ze verbergen of weergeven) op de kaart

source: an **Auto-geolocation** checkbox, for the map to automatically focus on where you’re located
fr: une case à cocher **Géolocalisation automatique**, pour que la carte soit automatiquement centrée sur votre localisation actuelle
it: la casella di controllo **Geolocalizzazione automatica**, per centrare automaticamente la mappa sulla propria posizione geografica;
nl: een vakje **Auto-geolocatie** dat kan worden aangevinkt zodat de kaart zich automatisch focust daar waar u zich bevindt
