Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/01_creating_advanced_maps/create-a-multiple-layers-map.po
Languages: fr, it, nl

source: Choose, out of the available operations, which one you want your clusters to be based on. The result value will be displayed inside the cluster.
fr: Choisissez parmi les agrégations disponibles, celle sur laquelle vous souhaitez que vos clusters soient basés. La valeur résultante sera affichée à l'intérieur du cluster.
it: Tra le operazioni disponibili, seleziona quella su cui desideri basare i cluster. Il risultato verrà visualizzato all'interno del cluster.
nl: Kies uit de beschikbare transacties diegene waarvan u wilt dat uw clusters erop gebaseerd zijn. De resultaatwaarde wordt weergegeven in de cluster.

source: **Count**: how many markers are in the area.
fr: **Compte** : combien il y a de marqueurs dans la zone.
it: **Numero**: numero di marcatori presenti nell'area.
nl: **Tel**: hoeveel markers staan er in het gebied.

source: **Average**: the average of a selected field from the dataset.
fr: **Moyenne** : la valeur moyenne d'un champ du jeu de données.
it: **Media**: il valore medio di un campo selezionato nel dataset.
nl: **Gemiddelde**: het gemiddelde van een geselecteerd veld uit de dataset.

source: **Sum**: the total of a selected field from the dataset.
fr: **Somme** : le total d'un champ du jeu de données.
it: **Somma**: il totale di un campo selezionato nel dataset.
nl: **Som**: het totaal van een geselecteerd veld uit de dataset.

source: **Minimum**: the minimum of a selected field from the dataset.
fr: **Minimum** : la valeur minimale d'un champ du jeu de données.
it: **Minimo**: il valore minimo di un campo selezionato nel dataset.
nl: **Minimum**: het minimum van een geselecteerd veld uit de dataset.

source: **Maximum**: the maximum of a selected field from the dataset.
fr: **Maximum** : la valeur maximale d'un champ du jeu de données.
it: **Massimo**: il valore massimo di un campo selezionato nel dataset.
nl: **Maximum**: het maximum van een geselecteerd veld uit de dataset.

source: **Standard deviation**: the standard deviation of a selected field from the dataset, to indicate whether the values are close to the average or not.
fr: **Ecart type** : l'écart type d'un champ du jeu de données, pour indiquer la dispersion des valeurs par rapport à la moyenne.
it: **Deviazione standard**: la deviazione standard di un campo selezionato nel dataset, per indicare di quanto i valori si discostano dal valore medio.
nl: **Standaardafwijking**: de standaardafwijking van een geselecteerd veld uit de dataset om aan te geven of de waarden al dan niet dicht in de buurt liggen van het gemiddelde.

source: **Computing**
fr: **Calcul**
it: **Elaborazione**
nl: **Berekenen**

source: *Choose how the clusters size is calculated*
fr: *Définir le mode de calcul de la taille du cluster*
it: *Scegli come calcolare le dimensioni dei cluster*
nl: *Kies hoe de grootte van de clusters wordt berekend*

source: **Linear**: for your values ranges to be the same size, evenly spread from the minimum to the maximum (e.g. 1, 2, 3, 4).
fr: **Linéaire** : pour que les plages de valeurs soient de taille égale, réparties de façon homogène entre la valeur maximale et la valeur minimale (e.g. 1, 2, 3, 4).
it: **Lineare**: per ottenere valori con intervalli regolari, distribuiti in maniera uniforme dal valore minimo a quello massimo (ad esempio: 1, 2, 3, 4).
nl: **Lineair**: opdat de vorken van uw waarden van dezelfde grootte zijn, spreid gelijkmatig van het minimum naar het maximum (bijv. 1, 2, 3, 4).

source: **Logarithmic**: for your values to vary in size and spread from a very large spectrum (e.g. 1, 10, 100).
fr: **Logarithmique** : pour que les plages de valeurs varient en taille et s'étendent sur un spectre très large (e.g. 1, 10, 100).
it: **Logaritmico**: per ottenere valori con intervalli non regolari, distribuiti all'interno di uno spettro molto ampio (esempio: 1, 10, 100).
nl: **Logaritmisch**: opdat uw waarden verschillen in grootte en gespreid zijn over een zeer breed spectrum (bijv. 1, 10, 100).

source: Choropleth
fr: Choroplèthe
it: Coropletico

source: The Choropleth visualization mode displays data as markers (dots or icons) or as shapes. It also enhances the visualization with colors. The markers and/or shapes are colored according to a color scheme, defined by a values range based on a chosen variable. The Choropleth mode allows the creation of a thematic layer.
fr: Le mode de visualisation Choroplèthe affiche vos données en tant que marqueurs (points ou icônes) ou formes. Il améliore la visualisation avec des couleurs. Les marqueurs et/ou formes sont colorés selon une palette de couleurs, définie par des plages de valeurs d'une variable choisie. Le mode Choroplèthe permet la création d'une couche thématique.
it: La modalità coropletica mostra i dati sotto forma di marcatori (punti o icone) o di forme, ottimizzando al contempo la visualizzazione a colori. I marcatori e/o le forme vengono colorati secondo uno schema definito da un intervallo di valori, a sua volta basato su una variabile selezionata. La modalità coropletica consente la creazione di un layer tematico.
nl: De weergavemodus "Choropleth" geeft data weer als markers (stippen of pictogrammen) of als vormen. Ze verbetert ook de weergave met kleuren. De markers en/of vormen worden gekleurd volgens een kleurenschema dat gedefinieerd wordt door een waardenvork die gebaseerd is op een gekozen variabele. De Choroplet-modus laat toe om een thematische laag aan te maken.

source: *Customize your dots and shapes*
fr: *Personnaliser les marqueurs et formes*
it: *Personalizza i punti e le forme*
nl: *Personaliseer uw stippen en vormen*

source: **Palette**: define on which field and operation your choropleth layer will be based on, and the color of your markers, shapes and/or lines.
fr: **Palette** : définit sur quel champ et quelle opération sera basée votre couche de choroplèthe, et la couleur de vos marqueurs, formes et/ou lignes.
it: **Gamma**: definisci su quale campo e operazione basare il layer coropletico, nonché il colore di marcatori, forme e/o linee.
nl: **Pallet**: definieert op welk veld en op welke transactie uw choropleth-laag gebaseerd is en de kleur van uw markers, vormen en/of lijnen.

source: Choose whether you want to base the color of your shape on the **Value of a field** or on the **Aggregation on a field**.
fr: Choisissez si vous voulez baser la couleur de votre forme sur la **Valeur d'un champ** ou sur une **Agrégation sur un champ**.
it: Scegli se basare il colore della forma sul **Valore di un campo**, oppure optare per l'**Aggregazione su un campo**.
nl: Kies of u wilt dat de kleur van uw vorm gebaseerd is op de **Waarde van een veld** of op de **Aggregatie van een veld**.

source: Depending on the choice you just made for your shape’s color, choose the field which value you want to use, or decide which aggregation operation you want to apply on your chosen field.
fr: Selon le choix que vous avez fait pour la couleur de la forme, choisissez le champ dont vous voulez utiliser la valeur, ou décidez quelle opération d'agrégation vous voulez appliquer sur le champ choisi.
it: In base al colore scelto per le forme, seleziona il campo contenente il valore che desideri utilizzare, oppure decidi quale operazione di aggregazione applicare sul campo selezionato.
nl: Afhankelijk van de keuze die u heeft gemaakt voor de kleur van uw vorm, kies het veld waarvan u de waarde wilt gebruiken of beslis welke aggregatietransactie u wilt toepassen op het door u gekozen veld.

source: Define the **Values range**.
fr: Définissez la **Gamme de valeurs**.
it: Definisci l'**Intervallo di valori**.
nl: Definieer de **Waardenvork**.

source: Define the number of **Tiers**, meaning in how many categories your values range will be divided.
fr: Définissez le nombre d'**Etapes**, c'est à dire en combien de catégories sera divisé votre gamme de valeurs.
it: Definisci il numero di **Livelli**, cioè in quante categorie sarà diviso l'intervallo di valori.
nl: Definieer het aantal **Tiers**, zijnde in hoeveel categorieën u wil dat de waardenvork is onderverdeeld.

source: Choose a **computing mode**: **linear** (for your values ranges to be the same size, evenly spread from the minimum to the maximum), **logarithmic** (for your values to vary in size and spread from a very large spectrum) or **custom**.
fr: Choisissez un **Mode de calcul** : **linéaire** (pour que vos plages de valeurs soient de taille égale, répartis de façon homogène entre le maximum et le minimum), **logarithmique** (si vos valeurs sont réparties sur un très large spectre) ou **Personnalisé**.
it: Seleziona una **modalità di elaborazione**: **lineare** (per ottenere valori con intervalli regolari, distribuiti in maniera uniforme dal valore minimo a quello massimo), **logaritmica** (per ottenere valori con intervalli non regolari, distribuiti all'interno di uno spettro molto ampio) o **personalizzata**.
nl: Kies een **berekeningswijze**: **lineair** (opdat uw waardenvorken dezelfde grootte hebben, gelijkmatig gespreid van het minimum tot het maximum), **logaritmisch** (opdat uw waarden verschillen in grootte en gespreid zijn over een zeer breed spectrum) of **aanpasbaar**.

source: Choose the **colors range** by clicking the colors menu and selecting your colors.
fr: Choisissez la **Gamme de couleurs** en cliquant sur le menu couleurs et en sélectionnant vos couleurs.
it: Definisci la **gamma di colori** cliccando sul menu dei colori e selezionando quelli desiderati.
nl: Kies het **kleurenbereik** door het kleurenmenu aan te klikken en uw kleuren te selecteren.

source: Choose a **gradient type** (RGB, Lab, HSL or Lch), meaning a way to calculate the color gradient between the 2 colors you just chose.
fr: Choisissez un **type de gradient** (RGB, Lab, HSL ou Lch), c'est à dire une façon de calculer le gradient de couleurs entre les 2 valeurs que vous avez choisies.
it: Scegli il **tipo di gradiente** (RGB, Lab, HSL o Lch), cioè il modo con cui calcolare il gradiente tra i 2 colori selezionati.
nl: Kies een **type gradiënt** (RGB, Lab, HSL of Lch), m.a.w. een manier om de kleurgradiënt te berekenen tussen de 2 kleuren die u net heeft gekozen.

source: *Customize the border of your shapes*
fr: *Personnaliser la bordure des formes*
it: *Personalizza il bordo delle forme*
nl: *Personaliseer de rand van uw vormen*

source: Borders are only available for dots and shapes, icons and map markers do not have borders.
fr: Les bordures sont seulement disponibles pour les formes, points, icônes et marqueurs qui n'ont pas de bordure.
it: I bordi sono disponibili unicamente per le forme, i punti, le icone e i marcatori di mappa che non presentano bordi.
nl: Randen zijn enkel beschikbaar voor stippen en vormen. Pictogrammen en kaartmarkers hebben geen randen.

source: Color by category
fr: Couleur par catégorie
it: Colore per categoria
nl: Kleur per categorie

source: The Color by category visualization mode displays data as markers (dots or icons) or as shapes. It also enhances the visualization with colors. The markers and/or shapes are colored according to a color scheme based on defined categories - which can be numerical or not, just defined by a certain word. The Color by category mode allows the creation of a categorized layer.
fr: Le mode de visualisation Couleur par catégorie affiche vos données en tant que marqueurs (points ou icônes) ou formes. Il améliore la visualisation avec des couleurs. Les marqueurs et/ou formes sont colorés selon une palette de couleurs basées sur des catégories définies qui peuvent être numériques ou textuelles. Le mode Couleur par catégorie permet la création d'une couche catégorisée.
it: La modalità "Colore per categoria" mostra i dati sotto forma di marcatori (punti o icone) o di forme, ottimizzando al contempo la visualizzazione a colori. I marcatori e/o le forme vengono colorati secondo uno schema basato su categorie definite, che possono essere numeriche o identificate da una certa parola. La modalità "Colore per categoria" consente la creazione di un layer categorizzato.
nl: De weergavemodus "Kleur per categorie" geeft data weer als markers (stippen of pictogrammen) of als vormen. Ze verbetert ook de weergave met kleuren. De markers en/of vormen worden gekleurd volgens een kleurenschema dat gebaseerd is op welbepaalde categorieën - die numeriek kunnen zijn of niet, enkel gedefinieerd door een welbepaald woord. De "Kleur per categorie"-modus laat toe om een gecatalogeerde laag aan te maken.

source: **Palette**: choose whether you want:
fr: **Palette** : choisissez si vous souhaitez :
it: **Gamma**: decidi se desideri:
nl: **Pallet**: kies of u:

source: to create a **Custom palette based on a field’s value**
fr: **Utiliser une palette personnalisée à partir des valeurs d'un champ**
it: creare una **Gamma personalizzata basata sui valori di un campo**
nl: een **Gepersonaliseerd pallet gebaseerd op de waarde van een veld** wil aanmaken

source: Click the Brush icon to access the custom palette interface.
fr: Cliquez sur l'icône pinceau pour accéder à l'interface de palette personnalisée.
it: Clicca sull'icona Pennello per accedere all'interfaccia di personalizzazione della gamma.
nl: Klik op het pictogram "Borstel" om toegang te krijgen tot de personaliseerbare palletinterface

source: Choose the field you want to categories to be based on.
fr: Choisissez le champ sur lequel les catégories doivent être basées.
it: Scegli il campo sul quale basare le categorie.
nl: Kies het veld waarop u wilt dat de categorieën gebaseerd zijn.

source: Choose whether or not you want to enable the creation of an additional category.
fr: Choisissez si vous voulez activer la création d'une catégorie additionnelle.
it: Scegli se attivare o meno la creazione di una categoria aggiuntiva.
nl: Kies of u al dan niet het aanmaken van een bijkomende categorie mogelijk wil maken.

source: Choose a color for each category.
fr: Choisissez une couleur pour chaque catégorie.
it: Scegli un colore per ogni categoria.
nl: Kies een kleur voor elke categorie.

source: Click the **Apply** button.
fr: Cliquez sur le bouton **Appliquer**.
it: Clicca su **Applica**.
nl: Klik op de knop **Toepassen**.

source: a palette **Generated with colors contained in a field** (in case your dataset already contains a field which provides color information: an hexadecimal color code for instance).
fr: utiliser une palette **Généré à partir des couleurs contenus dans un champ** (dans le cas où votre jeu de données contient déjà un champ fournissant une couleur : un code couleur hexadécimal par exemple).
it: una gamma **Generata con i colori contenuti in un campo**, nel caso in cui il dataset contenga già un campo con informazioni sui colori (ad esempio, un codice colore esadecimale).
nl: een pallet **Gegeneerd met kleuren die vervat zitten in een veld** wil aanmaken (ingeval uw dataset reeds een veld bevat dat kleurinformatie verschaft: een hexadecimale kleurencode bijvoorbeeld).

source: In that case, simply choose the right field and the colors will automatically appear on the corresponding markers and/or dots of your map.
fr: Dans ce cas, choisissez simplement le champ, et les couleurs apparaitront automatiquement sur les marqueurs et/ou points correspondant sur votre carte.
it: In questo caso, una volta selezionato il campo corrispondente, i colori appariranno automaticamente sui relativi marcatori e/o sui punti della tua mappa.
nl: In dat geval hoeft u enkel het veld rechts te kiezen en de kleuren verschijnen automatisch op de overeenkomstige markers en/of stippen van uw kaart.

source: Heatmap
fr: Carte de chaleur
it: Mappa termica
nl: Hittekaart

source: The Heatmap visualization mode is not about markers or shapes. Instead, this mode groups data and displays them as a span of colors to show the differences of intensity of one variable but at different spots in the map.
fr: Le mode de visualisation Carte de chaleur n'affiche pas de marqueurs ou formes. Ce mode groupe les données et les affiche sous forme d'un gradient de couleurs qui montre les différences d'intensité d'une variable aux différents points de la carte.
it: La modalità di visualizzazione "Mappa termica" non prevede l'uso di forme o marcatori, ma raggruppa i dati visualizzandoli nei vari gradienti di colore. In questo modo vengono evidenziate le differenze di intensità presentate da una variabile nei diversi punti della mappa.
nl: Bij de weergavemodus "Hittekaart" gaat het niet om markers of vormen. In plaats daarvan groepeert deze modus data en geeft deze weer als een spectrum van kleuren waarmee de verschillen in intensiteit van één variabele wordt getoond maar op verschillende plaatsen op de kaart.

source: *Choose on what operation your heatmap is based*
fr: *Définir l'opération de base pour la carte de chaleur*
it: *Scegli l'operazione su cui impostare la mappa termica*
nl: *Kies op welke transactie uw hittekaart is gebaseerd*

source: Choose, out of the available operations depending on your dataset, which one you want your heatmap to be based on.
fr: Choisissez parmi les agrégations disponibles, celle sur laquelle vous souhaitez que la carte de chaleur soit basée.
it: Tra le operazioni disponibili per il dataset, seleziona quella su cui desideri basare la mappa. Il risultato verrà visualizzato all'interno del cluster.
nl: Kies uit de beschikbare transacties en afhankelijk van uw dataset, diegene waarop u wilt dat uw hittekaart is gebaseerd.

source: *Choose how is calculated the progression of your heatmap*
fr: *Définir la façon dont est calculée la progression de la carte de chaleur*
it: *Scegli come calcolare la progressione della mappa termica*
nl: *Kies hoe de vooruitgang van uw hittekaart wordt berekend*

source: **Colors**
fr: **Couleurs**
it: **Colori**
nl: **Kleuren**

source: *Choose the color palette of your heatmap*
fr: *Définir la palette de couleurs de la carte de chaleur*
it: *Scegli la gamma di colori della mappa termica*
nl: *Kies het kleurenpallet van uw hittekaart*

source: Click on the **Edit palette** button.
fr: Cliquez sur le bouton **Editer la palette**.
it: Clicca su **Modifica gamma**.
nl: Klik op de knop **Bewerk pallet**.

source: Choose your 5 colors.
fr: Choisissez vos 5 couleurs.
it: Seleziona 5 colori.
nl: Kies uw 5 kleuren.

source: Click on the **Apply** button.
fr: Cliquez sur le bouton **Appliquer**.
it: Clicca su **Applica**.
nl: Klik op de knop **Toepassen**.

source: Add and edit information
fr: Ajouter et éditer les informations
it: Aggiunta e modifica delle informazioni
nl: Voeg toe en bewerk informatie

source: Click the **Information** tab.
fr: Cliquez sur l'onglet **Informations**.
it: Clicca sulla scheda **Informazioni**.
nl: Klik op het tabblad **Informatie**;

source: Title and description
fr: Titre et description
it: Titolo e descrizione
nl: Titel en omschrijving

source: Rename your layer in the **Title** area, to make it clearer for the map viewers.
fr: Renommez votre couche dans la zone **Titre**, pour la rendre plus claire pour vos visiteurs.
it: Rinomina il layer nell'area **Titolo** per rendere più chiaro ai visitatori il suo contenuto.
nl: Geef uw laag een andere naam in het veld **Titel** om het duidelijker te maken voor mensen die de kaart bekijken.

source: Add a **Description** in the provided area.
fr: Ajoutez une **Description** dans la zone correspondante.
it: Aggiungi una **Descrizione** nell'apposita area.
nl: Voeg een **Omschrijving** toe in de voorziene ruimte.

source: If you do not add your own description, it is the default one that will be displayed.
fr: Si vous n'ajoutez pas votre propre description, la description par défaut du jeu de données sera affichée.
it: Se non aggiungi una descrizione, verrà visualizzata quella predefinita.
nl: Indien u uw eigen omschrijving niet wilt toevoegen, zal er een standaard omschrijving worden weergegeven.

source: Icon
fr: Icône
it: Icona
nl: Pictogram

source: You can add an icon to your layer, which will be displayed next to the layer’s title.
fr: Vous pouvez ajouter une icône à votre couche, qui sera affichée à coté du titre de celui-ci.
it: Puoi anche aggiungere un'icona, che verrà visualizzata accanto al titolo del layer.
nl: U kan een pictogram aan uw laag toevoegen dat weergegeven wordt naast de titel van de laag.

source: Click on the **Icon** drop-down menu to choose the icon that represents your layer the best.
fr: Cliquez sur le menu déroulant **Icône** pour choisir l'icône qui représente le mieux la couche.
it: Clicca sul menu a tendina **Icona** e seleziona l'icona che rappresenta al meglio il layer.
nl: Klik op het drop down-menu **Pictogram** om het pictogram te kiezen dat de beste afspiegeling is van uw laag.

source: Click on the **Color** menu to add a color to the layer’s icon.
fr: Cliquez sur le menu **Couleur** pour ajouter une couleur à l'icône de la couche.
it: Clicca sul menu **Colore** per colorare l'icona.
nl: Klik op het menu **Kleur** om een kleur aan het pictogram van de laag toe te voegen.

source: Add and edit a caption
fr: Ajouter et éditer la légende
it: Aggiunta e modifica di una didascalia
nl: Voeg toe en bewerk een titel

source: Captions are not mandatory however they are recommended because they add more information to your dataset, which means more clarity to the reading of your map.
fr: Les légendes ne sont pas obligatoires, mais sont recommandées car elles ajoutent des informations pertinentes à vos jeu de données, ce qui les rend plus lisibles pour vos utilisateurs.
it: Pur non essendo obbligatoria, l'aggiunta di didascalie è consigliata perché offre altre informazioni sul dataset, rendendo ancora più chiara e leggibile la mappa.
nl: Titels zijn niet verplicht. Wel zijn ze aanbevolen aangezien ze meer informatie verschaffen over uw dataset en zo het lezen van uw kaart duidelijker maken.

source: Click on the **Caption** tab.
fr: Cliquez sur l'onglet **Légende**.
it: Clicca sulla scheda **Didascalia**.
nl: Klik op het tabblad **Titel**.

source: If it’s not already the case, tick the **Display caption for this dataset** option.
fr: Si ce n'est pas déjà le cas, cochez l'option **Afficher une légende pour ce jeu de données**.
it: Se non è già attiva, spunta l'opzione **Visualizza didascalia per questo dataset**.
nl: Vink de optie **Titel voor deze dataset weergeven** aan indien dit nog niet het geval is.

source: Captions are activated by default. If you do not want to display a caption for your dataset, simply untick the **Display caption for this dataset** option.
fr: Les légendes sont activées par défaut. Si vous ne voulez pas afficher de légende pour votre jeu de données, décochez simplement l'option **Afficher une légende pour ce jeu de données**.
it: La didascalia è attiva di default. Se non desideri visualizzarla per un determinato dataset, togli la spunta all'opzione **Visualizza didascalia per questo dataset**.
nl: Titels zijn standaard geactiveerd. Indien u niet wilt dat er een titel voor uw dataset wordt weergegeven, hoeft u de optie **Titel voor deze dataset weergeven** gewoon uit te vinken.

source: In the provided area, write a **Title** for your layer’s caption.
fr: Dans la zone correspondante, écrivez un **Titre** pour la légende de la couche.
it: Nell'apposita area, inserisci il **Titolo** della didascalia del layer.
nl: Schrijf in de voorziene ruimte een **Titel** voor de titel van uw laag.

source: Delete a layer
fr: Supprimer une couche
it: Eliminare un layer
nl: Een laag verwijderen

source: Click on the |icon-trash| icon.
fr: Cliquez sur l'icône |icon-trash|.
it: Clicca sul''icona |icon-trash|.
nl: Klik op het pictogram |icon-trash|.
