Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/01_creating_advanced_maps/create-a-multiple-layers-map.po
Languages: fr, it, nl

source: Create a multiple layers map
fr: Créer une carte multi-couches
it: Creazione di una mappa con più layer
nl: Maak een kaart met meerdere lagen aan

source: Add a dataset to your map
fr: Ajouter un jeu de données à votre carte
it: Aggiunta di un dataset alla mappa
nl: Voeg een dataset toe op uw kaart

source: In the layer editing area, click on **Add a dataset to this map**.
fr: Dans la zone d'édition de couches, cliquez sur **Ajouter un jeu de données à cette carte**.
it: Nell'area di modifica dei layer, clicca su **Aggiungi un dataset a questa mappa**.
nl: Klik in de ruimte voor het bewerken van de lagen op **Voeg een dataset toe aan deze kaart**.

source: Choose the dataset you want to display on your map. You can select a dataset with geographical information either from your own catalog of datasets published on your domain, or from the **All available data** catalog.
fr: Choisissez le jeux de données que vous voulez afficher sur votre carte. Vous pouvez choisir un jeux de données qui comporte des informations géographiques, soit depuis votre propre catalogue de jeux de données publiés sur votre domaine, soit depuis le catalogue **Toutes les données disponibles**.
it: Scegli il dataset che desideri visualizzare. Puoi selezionarne uno che contenga informazioni geografiche e che appartenga al catalogo di dataset pubblicati nel tuo dominio o al catalogo *Tutti i dati disponibili*.
nl: Kies de dataset die u wilt weergeven op de kaart. U kan een dataset met geografische informatie selecteren ofwel vanuit uw eigen catalogus van datasets die gepubliceerd is op uw domein, ofwel vanuit de catalogus **Alle beschikbare data**.

source: Click on **Select** if you want to add all data, or **Filter data** if you just want to add part of the data.
fr: Cliquez sur **Sélectionner** si vous voulez ajouter toutes les données, ou sur **Filtrer les données** si vous voulez seulement ajouter une partie des données.
it: Clicca su **Seleziona** se desideri aggiungere tutti i dati, oppure su **Filtro dati** per aggiungerne solo una parte.
nl: Klik op **Selecteren** indien u alle data wilt toevoegen of op **Filter data** indien u slechts een deel van de data wilt toevoegen.

source: Note
fr: Remarque
nl: Opmerking

source: You can change dataset or change which part is filtered at any time. To do so, simply click on **Change filter** next to the layer’s title.
fr: Vous pouvez changer de jeu de données ou modifier le filtre à tout moment. Pour ce faire, cliquez simplement sur **Changer le filtre** à coté du titre de la couche.
it: Puoi cambiare il dataset o la parte da filtrare in qualsiasi momento. Per fare ciò, clicca sul pulsante **Modifica filtro**, accanto al titolo del layer.
nl: U kan te allen tijde datasets veranderen of welk deel dat gefilterd is veranderen. Om dit te doen hoeft u enkel te klikken op **Wijzig filter** naast de titel van de laag.

source: You can add as many datasets as you want on your map, and all of the data they contain can be displayed on that same map, at the same time. This is when the whole concept of layers comes in play. In Map Builder, because you overlay several datasets, each dataset is called a layer. This is why Map Builder allows you to configure your layers to make sure that you can represent many different data on the same map and still make the reading of this map easy and clear.
fr: Vous pouvez ajouter autant de jeux de données que vous le souhaitez sur votre carte, et toutes les données qu'ils contiennent seront ajoutées sur la même carte, en même temps. C'est là que le concept de couches prend tout son sens. Dans l'Editeur de Cartes, parce que vous superposez plusieurs jeux de données, chaque jeu de données est appelé une couche. C'est pourquoi l'Editeur de Cartes vous permet de configurer vos couches, afin que que vous puissiez représenter plusieurs informations sur la même carte tout en gardant sa lecture simple et claire.
it: Sulla mappa è possibile aggiungere un numero illimitato di dataset, visualizzando tutti i dati in essi contenuti allo stesso tempo. Ed è qui che entrano in gioco i layer. In Mapbuilder i dataset aggiunti si sovrappongono e ciascuno di essi definisce un layer. Mapbuilder ti consente di configurare ogni layer al fine di rappresentare il maggior numero di dati, mantenendo al contempo la mappa chiara e leggibile.
nl: U kan zoveel datasets op uw kaart toevoegen als u wil en alle data die deze bevatten kunnen te allen tijde worden weergegeven op diezelfde kaart. Dit is wanneer het volledige concept van lagen aan bod komt. Aangezien u verschillende datasets in meerdere lagen gebruikt, wordt elke dataset in Map Builder een laag genoemd. Dit is waarom Map Builder u toelaat om uw lagen te configureren om er zeker van te zijn dat u vele verschillende data op dezelfde kaart kan weergeven en nog steeds het lezen van deze kaart eenvoudig en duidelijk maakt.

source: Keep in mind that the more datasets you add to your map, the heavier it will be, and the longer it will take to load.
fr: Notez que plus vous ajoutez de jeux de données à votre carte, plus elle sera lourde, et plus son temps de chargement sera important.
it: Ricorda che più alto è il numero dei dataset aggiunti alla mappa e più pesante questa sarà, allungando quindi i tempi necessari per caricarla.
nl: Denk eraan dat hoe meer datasets u aan uw kaart toevoegt, hoe zwaarder deze zal worden en hoe langer het zal duren om deze te laden.

source: Edit a layer
fr: Editer une couche
it: Modifica di un layer
nl: Bewerk een laag

source: The edition of a layer (meaning, a dataset displayed on a map created with Map Builder) has 2 aspects:
fr: L'édition d'une couche (c'est à dire d'un jeu de données affiché sur une carte créée par l'Editeur de Cartes) comporte 2 aspects :
it: La modifica di un layer – cioè di un dataset visualizzato su una mappa creata con Mapbuilder – si articola in 2 sezioni:
nl: Het bewerken van een laag (m.a.w. een dataset die weergegeven wordt op een kaart die aangemaakt is met Map Builder) houdt 2 aspecten in:

source: **Display**: the style, in other words, how the data is displayed on the map
fr: **Affichage** : le style, autrement dit, la façon dont la donnée est affichée sur la carte
it: **Visualizza**: lo stile, il modo in cui visualizzare i dati sulla mappa
nl: **Weergeven**: de stijl, met andere woorden, hoe de data worden weergegeven op de kaart

source: **Information**: the information and caption that go with the dataset to describe it better
fr: **Informations** : les informations et légendes qui accompagneront le jeu de données pour le décrire au mieux
it: **Informazione**: le informazioni e la didascalia che descrivono il dataset
nl: **Informatie**: de informatie en titel die bij de dataset past om deze beter te omschrijven

source: Edit style
fr: Editer le style
it: Modifica dello stile
nl: Bewerk stijl

source: Click on the **Display** tab. The menu with all style configurations drops down.
fr: Cliquez sur l'onglet **Affichage**. Le menu de configuration du style apparait.
it: Clicca sulla scheda **Visualizza** per accedere al menu con tutte le impostazioni di stile.
nl: Klik op het tabblad **Weergeven**. Het menu verschijnt met alle stijlconfiguraties.

source: Choose a visualization mode and configure your layer as you like.
fr: Choisissez un mode de visualisation et configurez votre couche selon vos goûts.
it: Scegli una modalità di visualizzazione e configura il layer a piacimento.
nl: Kies een weergavemodus en configureer uw laag zoals u wenst.

source: The style configurations entirely depend on the visualization mode you choose to apply to your layer. There are 5 different modes:
fr: Les configurations de style dépendent du mode de visualisation choisi pour votre couche. Il y a 5 modes différents :
it: Le impostazioni di stile disponibili dipendono dalla modalità di visualizzaione che hai scelto di applicare sul layer. Sono presenti 5 diverse modalità:
nl: De stijlconfiguraties hangen volledig af van de weergavemodus die u kiest om toe te passen op uw laag. Er zijn 5 verschillende modi:

source: The style configurations displayed for each visualization mode also depend on your dataset. Depending on the dataset you added to your Map Builder map, you may not see all the configurations explained in this documentation.
fr: Les configurations de style affichées pour chaque mode de visualisation dépendent aussi de votre jeu de données. Selon le jeu de données que vous avez ajouté à votre carte, vous pourriez ne pas voir certaines options présentées dans cette documentation.
it: Le impostazioni di stile visualizzate nelle diverse modalità dipendono anche dal tipo di dataset che hai aggiunto su Mapbuilder. In base a quest'ultimo, alcune delle impostazioni illustrate in questa documentazione potrebbero non essere visibili.
nl: De stijlconfiguraties die weergegeven worden voor elke weergavemodus hangen ook af van uw dataset. Afhankelijk van de dataset die u hebt toegevoegd aan uw Map Builder-kaart, is het mogelijk dat niet alle configuraties uitgelegd staan in deze documentatie.

source: Dots and shapes
fr: Points et formes
it: Punti e forme
nl: Stippen en vormen

source: The Dots and shapes visualization mode simply displays your data as markers (dots or icons) or as shapes. It is the most common visualization mode.
fr: Le mode de visualisation Points et formes affiche simplement vos données comme des marqueurs (points ou icônes), ou formes. C'est le mode de visualisation le plus répandu.
it: La modalità di visualizzazione "Punti e forme" mostra i dati sotto forma di marcatori (punti o icone) o di forme. È la modalità più diffusa.
nl: De weergavemodus "Stippen en vormen" geven uw data enkel weer als markers (stippen of pictogrammen) of als vormen. Het is de meest gebruikelijke weergavemodus.

source: **Style configuration**
fr: **Configuration du style**
it: **Impostazione di stile**
nl: **Stijlconfiguratie**

source: **Marker display**
fr: **Affichage des marqueurs**
it: **Visualizzazione del marcatore**
nl: **Weergave marker**

source: *What your data will look like on the map*
fr: *L'aspect que vos données auront sur la carte*
it: *Come appariranno i dati sulla mappa*
nl: *Hoe uw data eruit zullen zien op de kaart*

source: **Dot**: simple plain circle. Dots are recommended for high density datasets.
fr: **Point** : un simple cercle. Les points sont recommandés pour un jeu de données très dense.
it: **Punto**: cerchio semplice. I punti sono la scelta ideale per dataset ad alta densità.
nl: **Stip**: gewone cirkel. Stippen worden aanbevolen voor datasets met een hoge dichtheid.

source: **Icon**: themed icon (available in the Opendatasoft library).
fr: **Icône** : une icône thématique (disponible dans la bibliothèque Opendatasoft).

source: **Map marker (with an optional icon)**: standard drop-shaped map marker, with an optional themed icon (available in the Opendatasoft library) inside.
fr: **Marqueur (avec une icône optionnelle)** : un marqueur de carte standard en forme de goutte d'eau, qui peut contenir une icône thématique optionnelle (disponible dans la bibliothèque Opendatasoft).

source: If you choose the **Icon** or the **Map marker (with an optional icon)** mode:
fr: Si vous choisissez le mode **Icône** ou **Marqueur (avec une icône optionnelle)** :
it: Se scegli l'**Icona** o il **Marcatore di mappa con icona opzionale**:
nl: Indien u de modus **pictogram** of **Kaartmarker (met een optioneel pictogram)** kiest:

source: In the **Shapes style** section below the **Market display** section, click on the **Icon** menu.
fr: Dans la section **Style des icônes** sous la section **Affichage des marqueurs**, cliquez sur le menu **Icône**.
it: Nella sezione **Stile delle forme**, sotto **Visualizzazione del marcatore**, clicca sul menu **Icona**.
nl: In de rubriek **Stijl vormen** onder de rubriek **Marktweergave** klik op het menu **Pictogram**.

source: Choose the icon which will represent your data the best.
fr: Choisissez l'icône qui représente le mieux vos données.
it: Scegli l'icona che rappresenterà al meglio i tuoi dati.
nl: Kies het pictogram dat de beste afspiegeling is van uw data.

source: Click on the **Select icon** button.
fr: Cliquez sur le bouton **Sélectionner une icône**.
it: Clicca sul pulsante **Seleziona un'icona**.
nl: Klik op de knop **Selecteer pictogram**.

source: **Shapes style**
fr: **Style des icônes**
it: **Stile delle forme**
nl: **Stijl vormen**

source: *Customize your markers and shapes*
fr: *Personnaliser vos marqueurs et formes*
it: *Personalizza i marcatori e le forme*
nl: *Personaliseer uw markers en vormen*

source: **Icon**: choose an icon for both the **Icon** and **Map marker (with an optional icon)** modes (see procedure above).
fr: **Icône** : choisissez une icône pour les modes **Icône** et **Marqueur (avec une icône optionnelle)** (c.f procédure ci-dessus).
it: **Icona**: scegli un'icona per le modalità **Icona** e **Marcatore di mappa con icona facoltativa** (segui la procedura illustrata qui sopra).
nl: **Pictogram**: kies een pictogram voor zowel de modi **Pictogram** en **Kaartmarker (met een optioneel pictogram** (zie bovenstaande procedure)

source: **Size**: make your dots/icons larger or smaller.
fr: **Taille** : rendez vos points et icônes plus gros ou plus petits.
it: **Dimensioni**: aumenta o diminuisci le dimensioni dei punti o delle forme.
nl: **Grootte**: maakt uw stippen/pictogrammen groter of kleiner.

source: **Point opacity**: if your markers are dots or icons - add transparency to these markers.
fr: **Opacité des points** : si vos marqueurs sont des points ou des icônes - ajoutez de la transparence à ces marqueurs.
it: **Opacità del punto**: rendi più trasparenti i punti o le icone che hai scelto come marcatori.
nl: **Puntdichtheid**: indien uw markers stippen of pictogrammen zijn - maak deze markers transparanter.

source: **Shape opacity**: if your data are represented as shapes instead of markers (dots or icons) - increase or decrease their transparency.
fr: **Opacité des formes** : si vos données sont représentées par des formes et non des marqueurs (points ou icônes), augmente ou réduit leur transparence.
it: **Opacità della forma**: se i tuoi dati sono rappresentati da forme, aumenta o diminuisci il loro livello di trasparenza.
nl: **Vormdichtheid**: indien uw data worden weergegeven als vormen in plaats van markers (stippen of pictogrammen) - vergroot of verminder de transparantie ervan.

source: **Line thickness**: if your data are represented as lines - increase or decrease their thickness.
fr: **Epaisseur** : si vos données sont représentées par des lignes - augmente ou réduit leur épaisseur.
it: **Spessore linea**: se i tuoi dati sono rappresentati da linee, aumenta o diminuisci il loro spessore.
nl: **Lijndikte**: indien uw data worden weergegeven als lijnen - maak de lijnen dikker of dunner.

source: For all the options above, simply drag the dot along the slider or directly change the numbers displayed on the right of each slider.
fr: Pour toutes les options ci-dessus, faites glisser le curseur le long du trait, ou changez directement les nombres affichés à droite de chaque curseur.
it: Per modificare le opzioni illustrate qui sopra, trascina il punto lungo il dispositivo di scorrimento o modifica alla destra di quest'ultimo i numeri presenti.
nl: Voor alle bovenstaande opties, sleep de stip gewoon langs de glijder of verander gewoon de getallen die rechts van elke glijder staan weergegeven.

source: **Color**: change the color of your markers, shapes and lines.
fr: **Couleur** : changez la couleur de vos marqueurs, formes et lignes.
it: **Colore**: modifica il colore di marcatori, forme e linee.
nl: **Kleur**: wijzig de kleur van uw markers, vormen en lijnen.

source: To change the color:
fr: Pour changer la couleur :
it: Per modificare il colore:
nl: Om de kleur te wijzigen:

source: Click on the color menu.
fr: Cliquez sur le menu couleur.
it: Clicca sul menu dei colori.
nl: Klik op het menu met de kleuren.

source: Choose the color you want from the Nice colors or with the Color picker.
fr: Choisissez la couleur souhaitée dans les jolies couleurs ou à l'aide du sélecteur de couleur.
it: Seleziona il colore che desideri da "Colori splendidi" o tramite il "Selettore di colore".
nl: Kies de kleur die u wilt uit de Mooie kleuren of met de Kleurenpikker.

source: Click on the **Select color** button.
fr: Cliquez sur le bouton **Sélectionner**.
it: Clicca sul pulsante **Seleziona un colore**.
nl: Klik op de knop **Selecteer kleur**.

source: **Shapes border**
fr: **Bordure des formes**
it: **Bordo delle forme**
nl: **Rand van de vormen**

source: *Customize the border of your markers and shapes*
fr: *Personnaliser la bordure des marqueurs et formes*
it: *Personalizza il bordo dei marcatori e delle forme*
nl: *Personaliseer de rand van uw markers en vormen*

source: Borders are only available for shapes, dots, icons and map markers do not have borders.
fr: Les bordures sont seulement disponibles pour les formes, points, icônes et marqueurs qui n'ont pas de bordure.
it: I bordi sono disponibili unicamente per le forme, i punti, le icone e i marcatori di mappa che non presentano bordi.
nl: Randen zijn enkel beschikbaar voor vormen. Stippen, pictogrammen en kaartmarkers hebben geen randen.

source: **Pattern**: choose the pattern of the border, whether you want it to be a simple line, or a dashed or dotted line.
fr: **Motif** : choisissez le motif de la bordure, que vous vouliez une ligne simple ou une ligne pointillée.
it: **Pattern**: scegli il pattern del bordo, tra linea semplice, tratteggiata o punteggiata.
nl: **Patroon**: kies het patroon van de rand. Dit kan een gewone lijn zijn of een streepjes- of stippellijn.

source: For the **Pattern** option, simply click on the provided menu and choose the one you want.
fr: Pour l'option **Motif**, cliquez simplement sur le menu proposé et choisissez celui que vous souhaitez.
it: Per la scelta del **Pattern**, clicca sul menu corrispondente e seleziona l'opzione desiderata.
nl: Klik voor de optie **Patroon** op het aangeboden menu en kies het patroon dat u wilt.

source: **Thickness**: make the border of your shapes thicker or thinner.
fr: **Epaisseur** : rend la bordure de votre forme plus ou moins épaisse.
it: **Spessore**: aumenta o diminuisci lo spessore del bordo nelle forme.
nl: **Dikte**: maakt de rand van uw vormen dikker of dunner.

source: **Opacity**: increase or decrease the transparency of the border.
fr: **Opacité** : augmente ou réduit la transparence de la bordure.
it: **Opacità**: aumenta o diminuisci la trasparenza del bordo.
nl: **Dichtheid**: verhoogt of verkleint de transparantie van de rand.

source: For the options above, simply drag the dot along the slider or directly change the numbers displayed on the right of each line.
fr: Pour toutes les options ci-dessus, faites glisser le curseur le long du trait, ou changez directement les nombres affichés à droite de chaque curseur.
it: Per modificare le opzioni illustrate qui sopra, trascina il punto lungo il dispositivo di scorrimento o modifica i numeri alla destra di ogni riga.
nl: Voor de bovenstaande opties, sleep de stip gewoon langs de glijder of verander gewoon de getallen die rechts van elke glijder staan weergegeven.

source: **Color**: change the color of the border.
fr: **Couleur** : change la couleur de la bordure.
it: **Colore**: modifica il colore del bordo.
nl: **Kleur**: wijzigt de kleur van de rand.

source: Choose the color you want from the *Nice colors* or with the *Color picker*.
fr: Choisissez la couleur souhaitée dans les jolies couleurs ou à l'aide du sélecteur de couleur.
it: Seleziona il colore che desideri da *Colori splendidi* o tramite il *Selettore di colore*.
nl: Kies de kleur die u wilt uit de *Mooie kleuren* of met de *Kleurenpikker*.

source: The Cluster visualization mode groups your data into clusters instead of displaying them separately and individually. Clusters are grouped according to a chosen type of calculation: linear or logarithmic.
fr: Le mode de visualisation Cluster groupe vos données en clusters au lieu de les afficher séparément. Les clusters sont regroupés selon la formule choisie : linéaire ou logarithmique.
it: La modalità di visualizzazione "Cluster" raggruppa i dati in cluster invece di visualizzarli separatamente e individualmente. I cluster vengono raggruppati in base al tipo di calcolo selezionato: lineare o logaritmico.
nl: De weergavemodus Cluster groepeert uw data in clusters in plaats van deze afzonderlijk en individueel weer te geven. Clusters worden gegroepeerd volgens het gekozen berekeningstype: lineair of logaritmisch.

source: **Cluster style**
fr: **Style des clusters**
it: **Stile del cluster**
nl: **Clusterstijl**

source: *What your cluster will look like on the map*
fr: *L'aspect de vos clusters sur la carte*
it: *Come apparirà il cluster sulla mappa*
nl: *Hoe u wilt dat uw cluster eruit ziet op de kaart*

source: **Min size**: choose the size of the smallest clusters.
fr: **Taille min.** : définit la taille des plus petits clusters.
it: **Dimensioni minime**: scegli le dimensioni dei cluster più piccoli.
nl: **Minimale grootte**: kies de grootte van de kleinste clusters.

source: **Max size**: choose the size of the biggest clusters.
fr: **Taille max.** : définit la taille des plus gros clusters.
it: **Dimensioni massime**: scegli le dimensioni dei cluster più grandi.
nl: **Maximale grootte**: kies de grootte van de grootste clusters.

source: **Opacity**: increase or decrease the transparency of your clusters.
fr: **Opacité** : augmente ou réduit la transparence des clusters.
it: **Opacità**: aumenta o diminuisci la trasparenza dei cluster.
nl: **Dichtheid**: verhoogt of verkleint de transparantie van uw clusters.

source: **Cluster border**
fr: **Bordure des clusters**
it: **Bordo del cluster**
nl: **Clusterrand**

source: *Customize the border of your clusters*
fr: *Personnaliser la bordure des clusters*
it: *Personalizza il bordo dei cluster*
nl: *Personaliseer de rand van uw clusters*

source: **Thickness**: make the border of your clusters more or less thick.
fr: **Epaisseur** : rend la bordure des clusters plus ou moins épaisse.
it: **Spessore**: aumenta o diminuisci il bordo dei cluster.
nl: **Dikte**: maak de rand van uw clusters dikker of dunner

source: **Opacity**: add transparency to the border.
fr: **Opacité** : augmente ou réduit la transparence de la bordure.
it: **Opacità**: aumenta il livello di trasparenza del bordo.
nl: **Dichtheid**: verhoog de transparantie van de rand.

source: For the options above, simply drag the dot along the slider or directly change the numbers displayed on the right of each slider.
fr: Pour toutes les options ci-dessus, faites glisser le curseur le long du trait, ou changez directement les nombres affichés à droite de chaque curseur.
it: Per modificare le opzioni illustrate qui sopra, trascina il punto lungo il dispositivo di scorrimento o modifica alla destra di quest'ultimo i numeri presenti.
nl: Voor de bovenstaande opties, sleep de stip gewoon langs de glijder of verander gewoon de getallen die rechts van elke glijder staan weergegeven.

source: **Aggregation operations**
fr: **Opérations d'agrégation**
it: **Operazioni di aggregazione**
nl: **Aggregatietransacties**

source: *Choose the base operation for your clusters*
fr: *Définir l'opération de base pour les clusters*
it: *Scegli l'operazione base per i cluster*
nl: *Kies de basistransactie voor uw clusters*
