Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/01_creating_advanced_maps/create-a-multiple-layers-map.po
Languages: fr, it, nl

source: Click on the red **Remove dataset from the map** button.
fr: Cliquez sur le bouton rouge **Retirer le jeu de données de la carte**.
it: Clicca sul pulsante rosso **Rimuovi dataset dalla mappa**.
nl: Klik op de rode knop **Dataset van de kaart verwijderen**.

source: **Description**
it: **Descrizione**
nl: **Omschrijving**

source: **Icon**: themed icon (available in the OpenDataSoft library).
it: **Icona**: icona a tema disponibile nella libreria OpenDataSoft.
nl: **Pictogram**: themapictogrammen (beschikbaar in de OpenDataSoft-bibliotheek).

source: **Map marker (with an optional icon)**: standard drop-shaped map marker, with an optional themed icon (available in the OpenDataSoft library) inside.
it: **Marcatore di mappa con icona facoltativa**: marcatore a goccia standard con all'interno un'icona facoltativa, disponibile nella libreria OpenDataSoft.
nl: **Kaartmarker (met een optioneel pictogram)**: standaard druppelvormige kaartmarkering met een optioneel themapictogram (beschikbaar in de OpenDataSoft-bibliotheek) erin.
