Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/01_creating_advanced_maps/manage-your-maps.po
Languages: de, es, fr, it, nl

source: Manage your maps
de: Ihre Karten verwalten
es: Administrar los mapas
fr: Gérer vos cartes
it: Gestione delle mappe
nl: Uw kaarten beheren

source: Overview of the maps management interface: My Maps
de: Überblick über die Oberfläche der Kartenverwaltung: Meine Karten
es: Visión general de la interfaz de administración de mapas:‭ ‬Mis mapas
fr: Vue d'ensemble de l'interface de gestion de cartes : Mes Cartes
it: Panoramica dell'interfaccia di gestione delle mappe: "Le mie mappe"
nl: Overzicht van de kaartenbeheerinterface: My Maps

source: All maps management actions (except saving and renaming, see :doc:`Rename and save a map <rename-and-save-a-map>`) are made from the **My Maps** interface. This interface is accessible from the Map Builder menu displayed at the very top of the map.
de: Alle Aktionen zur Kartenverwaltung (außer speichern und umbenennen, siehe :doc:`Eine Karte umbenennen und speichern <rename-and-save-a-map>`) werden von der Oberfläche **Meine Karten** aus durchgeführt. Diese Oberfläche ist über das Kartenersteller-Menü erreichbar, das ganz oben auf der Karte angezeigt wird.
es: Todas las acciones de administración de mapas (‬excepto guardar y cambiar el nombre,‭ ‬consulte :doc:`Cambiar el nombre de un mapa y guardarlo <rename-and-save-a-map>`) ‬se efectúan en la interfaz **Mis mapas**. ‬Se puede acceder a esta interfaz desde el menú Compilador de mapas situado en la parte superior del mapa.
fr: Toutes les actions de gestion de cartes (excepté l'enregistrement et le renommage, voir :doc:`Renommer et enregistrer une carte <rename-and-save-a-map>`) sont effectuées depuis l'interface **Mes cartes**. Cette interface est accessible depuis le menu de l'Editeur de Cartes affiché tout en haut de la carte.
it: Tutte le opzioni di gestione delle mappe (ad eccezione del salvataggio e della rinomina, consulta :doc:`Rinominare e salvare una mappa <rename-and-save-a-map>`) si effettuano dall'interfaccia **Le mie mappe**, accessibile dal menu di Mapbuilder nella parte superiore della mappa stessa.
nl: Alle kaartenbeheeracties (behalve het bewaren en hernoemen, zie :doc:`Rename and save a map <rename-and-save-a-map>`) gebeuren vanuit de interface **My Maps**. Deze interface is toegankelijk vanuit het menu Map Builder dat helemaal bovenaan de kaart wordt weergegeven.

source: The interface of **My Maps** is composed of:
de: Die Oberfläche von **Meine Karten** besteht aus:
es: La interfaz **‬Mis mapas** ‬está formada por:
fr: L'interface de **Mes cartes** est composée de :
it: L'interfaccia **Le mie mappe** presenta:
nl: De interface van **My Maps** bestaat uit:

source: the **New map** button, to create a new map
de: dem Button **Neue Karte**, um eine neue Karte zu erstellen
es: El botón **‬Nuevo mapa**, para crear un nuevo mapa
fr: le bouton **Nouvelle carte**, pour créer une nouvelle carte
it: il pulsante **Nuova Mappa**, per creare una nuova mappa;
nl: de knop **Nieuwe kaart** om een nieuwe kaart aan te maken

source: 2 submenus:
de: 2 Untermenüs
es: 2‭ ‬submenús:
fr: 2 sous-menus :
it: 2 sottomenu:

source: **Saved maps**, a list of your named and manually saved maps
de: **Gespeicherte Karten**, eine Liste von ihren mit Namen versehenen und manuell gespeicherten Karten
es: ‭**‬Mapas guardados**‬,‭ ‬una lista de los mapas con nombre y guardados manualmente
fr: **Cartes enregistrées**, une liste de vos cartes nommées et enregistrées manuellement
it: **Mappe salvate**, un elenco delle mappe salvate manualmente con nome;
nl: **Opgeslagen kaarten**: een lijst van de door u benoemde en manueel opgeslagen kaarten

source: **Drafts**, a list of your unnamed and automatically saved by Map Builder maps
de: **Entwürfe**, eine Liste ihre unbenannten und automatisch vom Kartenersteller gespeicherten Karten
es: ‭**‬Borradores**‬,‭ ‬una lista de los mapas sin nombre y guardados automáticamente por el compilador de mapas
fr: **Brouillons**, une liste de vos cartes non-nommées et enregistrées automatiquement par l'Editeur de Cartes
it: **Bozze**, un elenco delle mappe senza nome salvate automaticamente da Mapbuilder;
nl: **Ontwerpen**: een lijst van uw niet-benoemde en door Map Builder automatisch opgeslagen kaarten.

source: a search bar to find a map more easily in case you have quite a long list of maps
de: eine Suchleiste, um Karten einfacher zu finden, falls Sie eine lange Liste von Karten haben
es: Una barra de búsqueda para encontrar con más facilidad un mapa, si tiene una larga lista de mapas
fr: une barre de recherche pour trouver plus facilement une carte dans le cas où vous en auriez une longue liste
it: una barra di ricerca per trovare più facilmente le mappe quando sono numerose.
nl: een zoekbalk om gemakkelijker een kaart te vinden ingeval u een vrij lange lijst met kaarten heeft

source: The **Saved maps** and **Drafts** submenus display information the same way. In each row of each tab, you will find:
de: Die Untermenüs **Gespeicherte Karten** und **Entwürfe** zeigen Informationen auf die gleiche Weise an. In jeder Zeile von jedem Tab finden Sie:
es: Los submenús **‬Mapas guardados** ‬y **‬Borradores** ‬visualizan información del mismo modo.‭ ‬En cada fila de cada una de las fichas,‭ ‬encontrará:
fr: Les sous-menus **Cartes enregistrées** et **Brouillons** affichent les informations de la même manière. Pour chaque ligne de chaque onglet, vous trouverez :
it: La modalità di visualizzazione delle informazioni nei sottomenu **Mappe salvate** e **Bozze** è identica. Ogni riga di queste schede presenta:
nl: De submenu's **Opgeslagen kaarten** en **Ontwerpen** geven informatie op dezelfde manier weer. In elke rij van elk tabblad vindt u:

source: **Open map**, a link to open the selected map in the same tab
de: **Karte öffnen**, einen Link, um die ausgewählte Karte im selben Tab zu öffnen
es: ‭**‬Abrir mapa**‬,‭ ‬un vínculo para abrir el mapa seleccionado en la misma ficha
fr: **Ouvrir la carte**, un lien pour ouvrir la carte sélectionnée dans le même onglet
it: il pulsante **Apri mappa**, un link per aprire la mappa selezionata nella stessa scheda;
nl: **Open kaart**: een link om de geselecteerde kaart in hetzelfde tabblad te openen

source: information on the map, such as title, URL, and number of datasets
de: Informationen über die Karte, wie etwa Titel, URL, Anzahl der Datensätze
es: Información sobre el mapa,‭ ‬como el título,‭ ‬la dirección URL y el número de conjuntos de datos
fr: des informations sur la carte, telles que le titre, l'URL et le nombre de jeux de données
it: informazioni sulla mappa, quali il titolo, l'URL e il numero di dataset;
nl: Informatie over de kaart, zoals titel, URL en aantal datasets

source: reading and writing rights on the map
de: Lese- und Schreibrechte der Karte
es: Los derechos de lectura y escritura del mapa
fr: les droits de lecture et d'écriture sur la carte
it: i diritti di lettura e scrittura sulla mappa;
nl: lees- en schrijfrechten op de kaart

source: **Duplicate**, a button to duplicate the map
de: **Duplizieren**, ein Button, um die Karte zu duplizieren
es: ‭**‬Duplicar**‬,‭ ‬un botón para duplicar el mapa
fr: **Dupliquer**, un bouton pour dupliquer la carte
it: il pulsante **Duplica**, per duplicare la mappa;
nl: **Duplicaat**: een knop om een duplicaat te maken van een kaart

source: |icon-trash| to delete the map
de: |icon-trash|, um die Karte zu löschen
es: |icon-trash| ‬para suprimir el mapa
fr: un bouton |icon-trash| pour supprimer la carte
it: il pulsante |icon-trash| per eliminare la mappa.
nl: |icon-trash| om de kaart te verwijderen

source: Duplicate a map
de: Eine Karte duplizieren
es: Duplicar un mapa
fr: Dupliquer une carte
it: Duplicare una mappa
nl: Duplicaat maken van een kaart

source: Find the map or draft you want to duplicate in the **Saved maps** or **Drafts** tab.
de: Finden Sie die Karte oder den Entwurf, den Sie duplizieren wollen, in der Registerkarte **Gespeicherte Karten** oder **Entwürfe**.

source: Click on the **Duplicate** button.
de: Klicken Sie auf den Button **Duplizieren**.
es: Haga clic en el botón **‬Duplicar**.
fr: Cliquez sur le bouton **Dupliquer**.
it: Clicca sul pulsante **Duplica**.
nl: Klik op de knop **Duplicaat maken**.

source: Delete a map
de: Eine Karte löschen
es: Suprimir un mapa
fr: Supprimer une carte
it: Eliminare una mappa
nl: Verwijder een kaart

source: Find the map or draft you want to delete in the **Saved maps** or **Drafts** tab.
de: Finden Sie die Karte oder den Entwurf, den Sie löschen wollen, in der Registerkarte **Gespeicherte Karten** oder **Entwürfe**.

source: Click on the |icon-trash| button. A *Delete map?* window appears.
de: Klicken Sie auf den Button |icon-trash|. Ein Fenster *Karte löschen?* erscheint.
es: Haga clic en el botón |icon-trash|.‭ ‬Aparecerá la ventana *‬¿Suprimir mapa?*.
fr: Cliquez sur l'icône |icon-trash|. Une fenêtre *Supprimer la carte ?* apparait.
it: Clicca sul pulsante |icon-trash|. Comparirà il messaggio *Eliminare la mappa?*.
nl: Klik op de knop |icon-trash|. Een venster *Kaart verwijderen?* verschijnt.

source: Click on the red **Delete map** button.
de: Klicken Sie auf den roten Button **Karte löschen**.
es: Haga clic en el botón **‬Suprimir mapa** ‬rojo.
fr: Cliquez sur le bouton rouge **Supprimer la carte ?**.
it: Clicca sul pulsante rosso **Elimina mappa**.
nl: Klik op de rode knop **Kaart verwijderen**.

source: Find the map or draft you want to duplicate, in the **Saved maps** or **Drafts** tab.
es: Busque el mapa o borrador que desee duplicar,‭ ‬en la ficha **‬Mapas guardados** ‬o **‬Borradores**.
fr: Trouvez la carte ou le brouillon que vous souhaitez dupliquer dans l'onglet **Cartes enregistrées** ou **Brouillons**.
it: Cerca la mappa o la bozza che desideri duplicare nella scheda **Mappe salvate** o **Bozze**.
nl: Ga in het tabblad **Opgeslagen kaarten** of **Ontwerpen** naar de kaart of het ontwerp waarvan u een duplicaat wilt maken.

source: Find the map or draft you want to delete, in the **Saved maps** or **Drafts** tab.
es: Busque el mapa o borrador que desee suprimir en la ficha **‬Mapas guardados** ‬o **‬Borradores**.
fr: Trouvez la carte ou le brouillon que vous souhaitez supprimer dans l'onglet **Cartes enregistrées** ou **Brouillons**.
it: Cerca la mappa o la bozza che desideri eliminare nella scheda **Mappe salvate** o **Bozze**.
nl: Ga in het tabblad **Opgeslagen kaarten** of **Ontwerpen** naar de kaart of het ontwerp dat u wilt verwijderen.
