Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/01_creating_advanced_maps/navigate-on-a-map-builder-map.po
Languages: de, es, fr, it, nl

source: Navigate on a Map Builder map
de: Durch eine Karte des Kartenerstellers navigieren
es: Navegar por un mapa del compilador de mapas
fr: Naviguer sur une carte de l'Editeur de Cartes
it: Navigare all'interno di una mappa di Mapbuilder
nl: Navigeren op een Map Builder-kaart

source: Overview of the interactive map of Map Builder
de: Überblick über die interaktive Karte im Kartenersteller
es: Visión general del mapa interactivo del compilador de mapas
fr: Vue d'ensemble de la carte interactive de l'Editeur de Cartes
it: Panoramica della mappa interattiva di Mapbuilder
nl: Overzicht van de interactieve kaart van Map Builder

source: The interactive map contains the same buttons as in any Opendatasoft map:
de: Die interaktive Karte enthält dieselben Buttons wie jede Opendatasoft-Karte:
es: El mapa interactivo contiene los mismos botones que cualquier mapa de Opendatasoft:
fr: La carte interactive comporte les mêmes boutons que n'importe quelle carte Opendatasoft :
nl: De interactieve kaart bevat dezelfde knoppen als elke andere Opendatasoft-kaart:

source: polygon |icon-polygon|, circle |icon-circle| and square |icon-square| buttons to draw on the map and filter on certain areas, along with the edit shape |icon-edit| and delete shape |icon-trash-map| buttons to go with them
de: Polygon |icon-polygon|, Kreis |icon-circle| und Rechteck |icon-square| Buttons, um auf die Karte zu zeichnen und einige Bereiche zu filtern, gemeinsam mit den dazu gehörigen Buttons Form bearbeiten |icon-edit| und Form löschen |icon-trash-map|
es: Los botones de polígono |icon-polygon|, círculo |icon-circle| y cuadrado |icon-square| para dibujar en el mapa y aplicar filtros en determinadas áreas, y los botones de editar forma |icon-edit| y suprimir forma |icon-trash-map| correspondientes
fr: les boutons polygone |icon-polygon|, cercle |icon-circle| et carré |icon-square| permettent de dessiner sur la carte afin de filtrer par zone, ainsi que les boutons *Modifier le filtre par zone* |icon-edit| et le bouton *Effacer le filtre par zone* |icon-trash-map|
it: I pulsanti "poligono" |icon-polygon|, "cerchio" |icon-circle| e "quadrato" |icon-square| per disegnare sulla mappa e filtrare determinate aree, nonché i pulsanti per modificare le forme |icon-edit| o eliminarle |icon-trash-map|;
nl: veelhoek |icon-polygon|, cirkel |icon-circle| en vierkant |icon-square| , knoppen om te tekenen op de kaart en te filteren op bepaalde gebieden, samen met de knoppen bewerk vorm |icon-edit| en verwijder vorm |icon-trash-map| die er mee samen gaan

source: |icon-fullscreen| to view your map in fullscreen mode
de: |icon-fullscreen|, um die Karte im Vollbildmodus anzusehen
es: icon-fullscreen| para ver el mapa en modo de pantalla completa
fr: |icon-fullscreen| pour afficher la carte en mode plein écran
it: l'icona |icon-fullscreen| per visualizzare la mappa a schermo intero;
nl: |icon-fullscreen| om uw kaart in volledige schermmodus te bekijken

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: The fullscreen mode button won’t appear if your map is embedded within an iframe, due to technical limitations.
de: Aus technischen Gründen wird der Vollbildmodus-Button nicht angezeigt, wenn Ihre Karte in ein Iframe eingebunden ist.
fr: En raison de limitations techniques, le bouton de mode plein écran n’apparaît pas sur votre carte lorsqu'elle est intégrée à une iframe.

source: zoom in |icon-zoom-in| and zoom out |icon-zoom-out| buttons
de: Buttons zum Einzommen |icon-zoom-in| und Auszoomen |icon-zoom-out|
es: Los botones de acercar |icon-zoom-in| y alejar |icon-zoom-out|
fr: les boutons *zoomer* |icon-zoom-in| et *dézoomer* |icon-zoom-out|
it: i pulsanti di zoom avanti |icon-zoom-in| e indietro |icon-zoom-out|;
nl: knoppen zoom in |icon-zoom-in| en zoom uit |icon-zoom-out|

source: localize |icon-localize| button to focus the map on your current location
de: Lokalisierungs |icon-localize| Button, um die Karte auf Ihren aktuellen Aufenthaltsort zu fokussieren
es: El botón de localizar |icon-localize| para centrar el mapa en la ubicación actual
fr: le bouton *Détecter ma localisation* |icon-localize| pour centrer la carte sur votre localisation actuelle
it: il pulsante di geolocalizzazione |icon-localize| per centrare la mappa sulla tua posizione geografica.
nl: knop lokaliseer |icon-localize| om de kaart te focussen om hun huidige locatie

source: However, any interactive map created with Map Builder also contains specific features, whether they are optional or not:
de: Allerdings enthält jede interaktive mit dem Kartenersteller kreierte Karte auch spezielle Funktionen, teils optional, teils nicht.
es: Sin embargo, los mapas interactivos creados con el compilador de mapas también contienen funciones específicas, sean opcionales o no:
fr: Cependant, les cartes interactives crées avec l'Editeur de Cartes contiennent aussi des fonctionnalités spécifiques, qui peuvent être optionnelles.
it: In aggiunta, le mappe interattive create con Mapbuilder offrono delle funzionalità specifiche, alcune opzionali:
nl: Wel bevat elke interactieve map die aangemaakt is met Map Builder ook specifieke kenmerken, die al dan niet optioneel zijn:

source: a search bar, to make research on your map
de: eine Suchleiste, um auf Ihrer Karte eine Suche durchzuführen
es: Una barra de búsqueda, para llevar a cabo tareas de investigación en el mapa
fr: une barre de recherche, pour effectuer une recherche sur la carte
it: una barra di ricerca, per consentire le ricerche all'interno della mappa;
nl: een zoekbalk om een zoekopdracht uit te voeren op uw kaart

source: the list of all the layers contained in the map, which you can hide or display
de: die Liste aller in einer Karte enthaltenen Ebenen, die Sie anzeigen oder ausblenden können
es: La lista de todas las capas incluidas en el mapa, que puede ocultar o visualizar
fr: une liste de toutes les couches contenues par la carte, que vous pouvez masquer ou afficher
it: l'elenco di tutti i layer contenuti nella mappa, con la possibilità di nasconderli o visualizzarli;
nl: de lijst met alle lagen in de kaart die u kan verbergen of weergeven

source: on the bottom right-hand corner of the map, a box containing the caption of each layer displayed, to better understand the map
de: rechts unten in der Ecke der Karte wird eine Beschriftung für jede Ebene angezeigt, um die Karte besser zu verstehen
fr: dans le coin inférieur droit de la carte, un encadré contenant la légende de chaque couche affichée, afin de mieux comprendre la carte
it: in basso a destra, una casella con la didascalia di ogni layer, per capire meglio la natura dei dati visualizzati.

source: Display or hide layers
de: Ebenen anzeigen oder ausblenden
es: Visualizar u ocultar capas
fr: Afficher ou masquer des couches
it: Visualizzare o nascondere i layer
nl: Lagen weergeven of verbergen

source: By default, all your map layers are displayed on your map. The list of all the layers that compose your Map Builder map is displayed on the top right-hand corner of the map.
de: Standardmäßig werden alle Ebenen auf Ihrer Karte angezeigt. Die Liste aller Ebenen, aus denen Ihre Karte im Kartenersteller besteht, wird oben rechts auf der Karte angezeigt.
es: De forma predeterminada, en el mapa se visualizan todas las capas del mapa. La lista de todas las capas que forman el mapa del compilador de mapas se visualiza en la esquina superior derecha del mapa.
fr: Par défaut, toutes les couches sont affichées sur la carte. La liste de toutes les couches qui composent la carte est affichée dans le coin supérieur droit de celle-ci.
it: Per impostazione predefinita, una mappa creata con Mapbuilder visualizza tutti i layer utilizzati. L'elenco dei layer che la compongono è disponibile sulla mappa, in alto a destra.
nl: Standaard worden alle lagen op uw kaart weergegeven. De lijst van alle lagen waaruit uw Map Builder-kaart is samengesteld, wordt in de hoek rechts bovenaan de kaart weergegeven.

source: You can hide layers in case you only want to focus on specific layers or even on just one very layer. To hide a layer, simply click on it. You will see that the layer disappears from the map, and that its title and description in the list turn light gray and are detached from the active, displayed layers.
de: Sie können Ebenen ausblenden, wenn Sie sich nur auf bestimmte oder gar nur eine Ebene konzentrieren wollen. Um eine Ebene auszublenden, klicken Sie sie einfach an. Sie werden sehen, dass die Ebene von der Karte verschwindet und dass ihr Titel und ihre Beschreibung in der Liste hellgrau und von den aktiven, angezeigten Ebenen dargestellt werden.
fr: Vous pouvez masquer des couches si vous souhaitez porter votre attention sur certaines couches en particulier, ou même sur une seule d'entre elles. Pour masquer une couche, cliquez simplement dessus. Vous verrez que la couche disparait de la carte, et que son titre et description dans la liste se grisent et se détachent des couches actives affichées.
it: Mapbuilder ti consente di nascondere tutti i layer di cui non hai bisogno, fino a visualizzarne anche uno solo. Per nascondere un layer, cliccaci sopra: a questo punto il layer scomparirà dalla mappa, mentre il titolo e la descrizione diventeranno grigi, comparendo separati dall'elenco dei layer attivi.

source: If the map was configured on a monolayer mode, you will only be able to display one layer at a time. It means that if you display one specific layer, all the other layers will automatically be hidden.
de: Wenn Ihre Karte im Monolayer-Modus konfiguriert wurde, können Sie nur eine Ebene gleichzeitig anzeigen. Das heißt, dass alle anderen automatisch ausgeblendet werden, wenn Sie eine bestimmte Ebene anzeigen.
fr: Si la carte a été configurée en mode monocouche, vous ne pourrez afficher qu'une seule couche à la fois. Cela signifie que si vous affichez une couche en particulier, toutes les autres seront automatiquement masquées.

source: Understand the map: captions
de: Die Karte verstehen: Beschriftungen
es: Comprender el mapa: leyendas
fr: Comprendre la carte : les légendes
it: Comprendere la mappa: le didascalie
nl: De map begrijpen: titels

source: For a better understanding of the map, each layer can have a related caption you can refer to. All available captions are displayed on the bottom right-hand corner of the map, under the list of layers. To go from one caption to another, simply click the |icon-left| and |icon-right| buttons.
de: Für eine bessere Übersichtlichkeit der Karte kann jede Ebene eine Beschriftung haben, auf die Sie sich beziehen können. Alle verfügbaren Beschriftungen werden rechts unten auf der Karte angezeigt, unterhalb der Liste der Ebenen. Um von einer Beschriftung zur anderen zu wechseln, klicken Sie einfach auf die Buttons |icon-left| und |icon-right|.
es: Para mejorar la comprensión del mapa, cada una de las capas puede tener una leyenda relacionada a la cual se puede hacer referencia. Todas las leyendas disponibles se visualizan en la esquina inferior derecha del mapa, bajo la lista de capas. Para ir de una leyenda a otra, simplemente haga clic en los botones |icon-left| y |icon-right|.
fr: Pour une meilleure compréhension de la carte, chaque couche peut avoir une légende qui lui est propre. Toutes les légendes disponibles sont affichées dans le coin inférieur droit de la carte, sous la liste des couches. Pour passer d'une légende à une autre, cliquez sur les boutons |icon-left| et |icon-right|.
it: Per una migliore comprensione della mappa, ad ogni layer può essere aggiunta una didascalia. Quest'ultima viene visualizzata sulla mappa, in basso a destra, sotto l'elenco dei layer. Per passare da una didascalia all'altra, clicca su |icon-left| e |icon-right|.
nl: Om de kaart beter te begrijpen, kan elke laag een aanverwante titel hebben waarnaar u kan verwijzen. Alle beschikbare titels worden weergegeven in de hoek rechts onderaan de kaart, onder de lijst met lagen. Om van één titel naar een andere te gaan, volstaat het op de knoppen |icon-left| en |icon-right| te klikken.

source: By default, the caption box is reduced to showing the most important information only, and to not take too much space on the map. You can only see the name of the layer it refers to and its captions. To expand this box and see more details, simply click the |icon-up| button.
de: Standardmäßig ist die Beschriftungsbox verkleinert, um nur die wichtigsten Informationen anzuzeigen und nicht zu viel Platz auf der Karte einzunehmen. Sie können nur den Namen und die zugehörige Ebene sowie ihre Beschreibungen sehen. Um die Box zu vergrößern und mehr Details anzuzeigen, klicken Sie einfach auf den Button |icon-up|.
fr: Par défaut, l'encadré des légendes est réduit afin de n'afficher que les informations importantes, et éviter d'encombrer la carte. Vous ne pourrez que voir le nom de la couche concernée et sa légende. Pour agrandir cet encart, cliquez sur le bouton |icon-up|.
it: Per impostazione predefinita, la casella delle didascalie compare in formato ridotto per non occupare troppo spazio sulla mappa e lasciarlo soprattutto alle informazioni più importanti. Inizialmente, puoi quindi leggere solo il nome del layer e la relativa didascalia. Per espandere la casella e rendere visibili altri dettagli, clicca su |icon-up|.

source: Use the search bar
de: Die Suchleiste verwenden
es: Utilizar la barra de búsqueda
fr: Utiliser la barre de recherche
it: Utilizzo della barra di ricerca
nl: De zoekbalk gebruiken

source: You can use the search bar to make research on your map. To do so, simply enter a keyword in the search bar at the top left-hand corner of the map. By default, the search bar will return location results. If you click on a location result, the map will automatically move to that selected location.
de: Sie können die Suchleiste verwenden, um auf Ihrer Karte eine Suche durchzuführen. Klicken Sie dafür einfach auf ein Stichwort in der Suchleiste oben links auf der Karte. Standardmäßig bietet die Suchleiste Orte als Ergebnis an. Wenn Sie auf eines dieser Ergebnisse klicken, wird die Karte automatischen auf den ausgewählten Ort zentriert.
fr: La barre de recherche permet d'effectuer des recherches sur la carte. Pour ce faire, entrez un mot clé dans la barre de recherche située dans le coin supérieur gauche de la carte. Par défaut, celle-ci retournera les localisations des résultats. Lorsque vous cliquez sur un des résultats, la carte sera automatiquement centrée sur la localisation sélectionnée.
it: Per trovare un determinato tipo di dati sulla mappa, puoi utilizzare l'apposita barra di ricerca, disponibile in alto a sinistra. Inserisci al suo interno la parola chiave desiderata ed avvia la ricerca. Di default, la barra di ricerca restituisce la posizione geografica di ogni risultato. Cliccando su quella desiderata, la mappa si sposterà automaticamente nella posizione selezionata.

source: However, the search bar will also suggest searching the keyword in the displayed data, meaning into the datasets that compose the layers of your Map Builder map.
de: Allerdings bietet die Suchleiste auch an, das Stichwort in den angezeigten Daten zu suchen, also in den Datensätzen, auf denen die Ebenen der Karte in Ihrem Kartenersteller basieren.
es: No obstante, la barra de búsqueda también propone buscar la palabra clave en los datos visualizados, es decir, en los conjuntos de datos que forman las capas del mapa del compilador de mapas.
fr: Cependant, la barre de recherche suggère aussi des mots-clés trouvés dans les données affichées, c'est à dire dans les jeux de données qui composent les couches de votre carte.
it: La barra di ricerca di Mapbuilder suggerirà anche in quali layer della mappa è possibile trovare la parola chiave ricercata.
nl: De zoekbalk zal echter ook voorstellen om het trefwoord te zoeken in de weergegeven data, met andere woorden in de datasets waaruit de lagen van uw Map Builder-kaart is opgebouwd.

source: If your map is embedded within an iframe, the fullscreen mode button won’t appear due to technical limitations.
es: Si el mapa está incrustado en un iframe, el botón del modo de pantalla completa no aparecerá por motivos técnicos.
nl: Als gevolg van technische beperkingen verschijnt de knop voor de volledige scherm-modus niet weergegeven wanneer uw kaart ingebed is binnen een iframe.

source: on the bottom right-hand corner of the map, a box containing the caption of each layer displayed to better understand the map
es: En la esquina inferior derecha del mapa, un cuadro con la leyenda de cada una de las capas visualizadas a fin de facilitar la comprensión del mapa
nl: in de hoek rechts onderaan de kaart, een vakje dat de titel van elke weergegeven laag bevat om zo de kaart beter te begrijpen

source: In case you only want to focus on specific layers or even on just one very layer, you can hide layers. To hide a layer, simply click on it. You will see that the layer disappears from the map. Its title and description in the list turn light gray and are detached from the active, displayed layers.
es: Si solo desea centrarse en unas capas específicas o incluso en una sola capa, puede ocultar capas. Para ocultar una capa, simplemente haga clic en ella. Verá que la capa desaparece del mapa. Su título y su descripción en la lista se vuelven de color gris claro y se desasocian de las capas visualizadas activas.
nl: U kan lagen verbergen indien u zich enkel wenst te focussen op specifieke lagen of zelfs op één enkele laag. Om een laag te verbergen volstaat het erop te klikken. U ziet dat de laag van de kaart verdwijnt en dat de titel en omschrijving ervan in de lijst lichtgrijs worden en loskomen van de actieve weergegeven lagen.

source: If the map is configured on a monolayer mode, you will only be able to display one layer at a time. It means that if you display one specific layer, all the other layers will automatically be hidden.
es: Si el mapa está configurado en un modo monocapa, solo podrá visualizar una capa a la vez. Esto significa que si visualiza una capa específica, todas las demás capas se ocultarán automáticamente.
nl: Wanneer de kaart geconfigureerd was als een modus met één laag, kunt u op hetzelfde moment slechts één laag weergeven. Dit betekent dat wanneer u een specifieke laag weergeeft, alle andere lagen automatisch verborgen zullen worden.

source: By default, the caption box is reduced to showing the most important information only and not to take too much space on the map. You can only see the name of the layer it refers to and its captions. To expand this box and see more details, simply click the |icon-up| button.
es: De forma predeterminada, el cuadro de leyenda tiene un formato reducido para mostrar solo la información más importante sin ocupar demasiado espacio en el mapa. Solo permite ver el nombre de la capa a la cual hace referencia y sus leyendas. Para expandir este cuadro y ver más detalles, basta con hacer clic en el botón |icon-up|.
nl: Standaard wordt het titelvak verkleind zodat enkel de belangrijkste informatie wordt getoond en er niet te veel ruimte op de kaart wordt ingenomen. U kan enkel de naam van de laag zien waarnaar deze verwijst en de titels ervan. Om dit vak te vergroten en meer details te zien, dient u gewoon op de knop |icon-up| te klikken.

source: You can use the search bar to do research on your map. To do so, simply enter a keyword in the search bar at the top left-hand corner of the map. By default, the search bar will return location results. If you click on a location result, the map will automatically move to that selected location.
es: Puede utilizar la barra de búsqueda para llevar a cabo tareas de investigación en el mapa. Para ello, basta con introducir una palabra clave en la barra de búsqueda de la parte superior izquierda del mapa. De forma predeterminada, la barra de búsqueda devuelve resultados de ubicación. Al hacer clic en un resultado de ubicación, el mapa se desplaza automáticamente a la ubicación seleccionada.
nl: U kan de zoekbalk gebruiken om een zoekopdracht op uw kaart uit te voeren. Hiervoor volstaat het om een trefwoord in te voeren in de zoekbalk hoek links boven de kaart. Standaard zal de zoekbalk locatieresultaten opleveren. Indien u een locatieresultaat aanklikt, zal de kaart automatisch naar de geselecteerde locatie gaan.

source: The interactive map contains the same buttons as in any OpenDataSoft map:
it: La mappa interattiva presenta gli stessi pulsanti di una mappa OpenDataSoft:
