Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/01_creating_advanced_maps/overview-of-map-builder.po
Languages: de, es, fr, it, nl

source: Overview of Map Builder
de: Überblick über den Kartenersteller
es: Visión general del compilador de mapas
fr: Vue d'ensemble de l'Editeur de Cartes
it: Panoramica di Mapbuilder
nl: Overzicht van Map Builder

source: Map Builder is a tool to create maps. Map Builder’s maps are more advanced than those simply created within the Map tab of a published dataset because you can overlay as many datasets as you want in the same map, creating different data layers. This specificity thus makes these maps great for enriching your data by crossing them together. You can also group your layers and edit their descriptions and titles in order to obtain and share a map finely designed to meet specific needs and purposes.
de: Der Kartenersteller ist ein Tool, um Karten zu kreieren. Er bietet gegenüber den im Karten-Tab eines publizierten Datensatzes erstellten Karten zusätzliche Möglichkeiten, da Sie mit dem Kartenersteller verschiedene Ebenen erstellen und so viele Datensätze wie Sie wollen in einer Karte übereinanderlegen können. Durch diese Besonderheit können Sie besonders großartige Karten mit zueinander in Beziehung gesetzten Daten erstellen. Sie können außerdem Ihre Ebenen gruppieren und deren Beschreibungen sowie Titel bearbeiten, um eine genau Ihren spezifischen Ansprüchen und Zwecken angepasste Karte zu erhalten und zu teilen.
es: El compilador de mapas es una herramienta para crear mapas.‭ ‬Los mapas del compilador de mapas son más avanzados que los creados simplemente en la ficha de mapa de un conjunto de datos publicado, ya que le permite superponer todos los conjuntos de datos que desee en el mismo mapa, y crear así diferentes capas de datos. Gracias a esta particularidad, estos mapas son ideales para enriquecer sus datos cruzándolos.‭ ‬También puede agrupar las capas y editar sus descripciones y títulos a fin de obtener y compartir un mapa con un diseño adaptado a unas necesidades y unos fines concretos.
fr: L'Editeur de Cartes est un outil pour créer des cartes. Les cartes créées à l'aide de l'Editeur de Cartes sont plus avancées que celles de l'onglet "Carte" d'un jeu de données publié, car vous pouvez superposer autant de jeux de données que vous le souhaitez pour montrer différentes couches de données. Cette spécificité rend les cartes parfaites pour enrichir vos données en les croisant ensemble. Vous pouvez également grouper plusieurs couches et éditer leurs descriptions et titres pour obtenir et partager une carte finement conçue pour répondre à des besoins et objectifs précis.
it: Mapbuilder è uno strumento per la creazione di mappe che offre funzionalità molto più avanzate rispetto alla scheda Mappe di un dataset pubblicato. È infatti possibile sovrapporre un numero illimitato di dataset e creare diversi layer di dati. Grazie a questa funzionalità, potrai incrociare i tuoi dati sulla mappa, valorizzandoli al meglio. Con Mapbuilder puoi inoltre raggruppare tra loro più layer, modificandone anche la descrizione e il titolo, per ottenere e condividere una mappa a misura delle tue esigenze.
nl: Map Builder is een tool om kaarten te maken. De kaarten van Map Builder zijn geavanceerder dan diegene die gewoon gemaakt worden binnen de tabblad Kaart van een gepubliceerde dataset omdat u zo veel datasets als u wilt kan gebruiken in dezelfde kaart, waardoor verschillende datalagen worden gecreëerd. Dit specifieke kenmerk zorgt er bijgevolg voor dat deze mappen uiterst geschikt zijn om uw data te verrijken door deze met elkaar te kruisen. Ook kan u uw lagen groeperen en de omschrijvingen en titels ervan bewerken om een fijn ontworpen kaart te bekomen en te delen en zo te beantwoorden aan specifieke noden en doelen.

source: Map Builder has 2 modes:
de: Der Kartenersteller hat 2 Modi:
es: El compilador de mapas tiene 2‭ ‬modos:
fr: L'Editeur de Cartes a 2 modes :
it: Mapbuilder presenta 2 modalità:
nl: Map Builder heeft 2 modi:

source: **Edition**, to create and configure your map to define what it will look like to the final map viewers
de: **Bearbeitung**, um Ihre Karte zu erstellen und zu konfigurieren und zu definieren, wie Sie gegenüber dem Endbenutzer dargestellt wird
es: ‭**‬Edición**‬, para crear y configurar el mapa a fin de definir su aspecto ante quienes visualicen el mapa
fr: **Edition**, pour créer et configurer votre carte afin de définir son aspect pour vos utilisateurs finaux
it: **Modifica**, per creare le mappe e configurare il modo in cui queste verranno visualizzate dagli utenti.
nl: **Bewerking**, om uw kaart te maken en te configureren en zo te bepalen hoe deze eruit zal zien voor mensen die de kaart uiteindelijk bekijken.

source: **Preview**, to see what your map looks like to the final map viewers
de: **Vorschau**, um zu sehen, wie Ihre Karte für Endbenutzer dargestellt wird
es: ‭**‬Vista previa**‬, para ver cuál será el aspecto del mapa ante quienes visualicen el mapa
fr: **Aperçu**, pour prévisualiser votre carte telle qu'elle sera présentée à vos utilisateurs finaux
it: **Anteprima**, per verificare l'aspetto della mappa così come apparirà agli utenti.
nl: **Voorbeeldweergave** om te zien hoe uw kaart er zal uitzien voor mensen die de kaart uiteindelijk zullen bekijken

source: Map Builder, in Edition mode, is also split into 3 parts:
de: Der Kartenersteller ist im Bearbeitungsmodus in 3 Teile aufgeteilt:
es: A su vez, en el modo Edición, el compilador de mapas se divide en 3 partes:
fr: L'Editeur de Cartes en mode Edition est divisé en 3 parties :
it: La modalità "Modifica" di Mapbuilder è composta da 3 parti:
nl: Map Builder is in Bewerkingsmodus ook opgesplitst in 3 delen:

source: the layer editing area
de: den Bereich Ebenenbearbeitung
es: Área de edición de capas
fr: la zone d'édition de couches
it: l'area di modifica dei layer;
nl: de ruimte om de laag te bewerken

source: the Map Builder menu
de: das Kartenersteller-Menü
es: Menú Compilador de mapas
fr: le menu de l'Editeur de Cartes
it: il menu di Mapbuilder;
nl: het Map Builder menu

source: the interactive, multi-layered map
de: die interaktive Multiebenen-Karte
es: Mapa multicapa interactivo
fr: la carte interactive multi-couches
it: la mappa interattiva multi-layer.
nl: de interactieve kaart met meerdere lagen

source: Overview of the layer editing area of Map Builder
de: Überblick über den Bereich Ebenenbearbeitung des Kartenerstellers
es: Visión general del área de edición de capas del compilador de mapas
fr: Vue d'ensemble de la zone d'édition de couches de l'Editeur de Cartes
it: Panoramica dell'area di modifica dei layer in Mapbuilder
nl: Overzicht van de ruimte om de laag te bewerken van Map Builder

source: The layer editing area is located on the right-hand side of your page, right next to the map. Through this part of Map Builder, you can :doc:`create a multiple layers map <create-a-multiple-layers-map>`.
de: Der Bearbeitungsbereich der Ebenen befindet sich rechts auf Ihrer Seite, direkt neben der Karte. Mit diesem Teil des Kartenerstellers können Sie :doc:`eine Mehrebenen-Karte erstellen <create-a-multiple-layers-map>`.
es: El área de edición de capas se encuentra en la parte derecha de la página,‭ ‬justo al lado del mapa.‭ ‬En esta parte del compilador de mapas,‭ ‬puede :doc:`crear un mapa multicapa <create-a-multiple-layers-map>`.
fr: La zone d'édition de couches est située du coté droit de votre page, juste à coté de la carte. Cette partie de l'Editeur de cartes vous permet de :doc:`créer une carte multi-couches <create-a-multiple-layers-map>`.
it: L'area di modifica dei layer si trova sul lato destro della pagina, accanto alla mappa. Questa sezione di Mapbuilder permette di :doc:`creare una mappa multi-layer <create-a-multiple-layers-map>`.
nl: De ruimte om de laag te bewerken bevindt zich aan de rechterzijde van uw pagina, net naast de kaart. via dit deel van Map Builder kan u een :doc:`kaart met meerdere lagen maken <create-a-multiple-layers-map>`.

source: If you haven’t started creating your map, you will only see a link, **Add a dataset to this map**, to add your first dataset and thus start the creation of your first map. Afterward, this section will display:
de: Wenn Sie die Erstellung Ihrer Karte noch nicht begonnen haben, sehen Sie nur einen Link **Datensatz zu dieser Karte hinzufügen**, um Ihren ersten Datensatz hinzuzufügen und so Ihre erste Karte zu beginnen. Anschließend wird dieser Bereich Folgendes anzeigen:
es: Si todavía no ha empezado a crear el mapa ‬solo verá un vínculo, **Añadir un conjunto de datos a este mapa**, para añadir su primer conjunto de datos y empezar así a crear su primer mapa.‭ ‬Más adelante,‭ ‬en esta sección verá:
fr: Si vous n'avez pas encore commencé à créer votre carte, vous verrez simplement un lien **Ajouter un jeu de données à cette carte**, pour ajouter votre premier jeu de données et commencer la création de votre première carte. Ensuite, cette section affichera :
it: Quando la mappa non è ancora stata creata, questa sezione contiene un solo collegamento – **Aggiungi un dataset a questa mappa** – tramite il quale inserirai il tuo primo dataset nella mappa, iniziando quindi il lavoro. A partire da questo momento, verranno visualizzati:
nl: Wanneer u nog niet begonnen bent met het maken van uw kaart, ziet u enkel een link **Een dataset toevoegen aan deze kaart** waarmee u uw eerste dataset kan toevoegen en zo kan starten met het maken van uw eerste kaart. Daarna wordt deze rubriek weergegeven:

source: all your added datasets
de: alle Ihre hinzugefügten Datensätze
es: Todos sus conjuntos de datos añadidos
fr: tous les jeux de données ajoutés
it: tutti i dataset aggiunti;
nl: al uw toegevoegde datasets

source: **Edit**, a link to access the visualization configuration options of the related dataset
de: **Bearbeiten**, ein Link, um auf die Optionen der Anzeigekonfiguration des entsprechenden Datensatzes zuzugreifen
es: ‭**‬Editar**‬,‭ ‬un vínculo para acceder a las opciones de configuración de la visualización del conjunto de datos relacionado
fr: **Modifier**, un lien pour accéder aux options de configuration de la visualisation du jeux de données correspondant
it: il collegamento **Modifica**, per accedere alle impostazioni di visualizzazione del singolo dataset;
nl: **Bewerken**, een link om naar de weergaveconfiguratieopties te gaan van de aanverwante dataset

source: **Add a dataset to this map**, a link to add a new dataset to your map
de: **Einen Datensatz zu dieser Karte hinzufügen**, ein Link, um einen neuen Datensatz zu Ihrer Karte hinzuzufügen
es: **Añadir un conjunto de datos a este mapa**, un vínculo para añadir un conjunto de datos nuevo al mapa
fr: **Ajouter un jeu de données**, un lien pour ajouter un nouveau jeu de données à votre carte
it: il collegamento **Aggiungi un dataset a questa mappa**, per inserire un nuovo dataset nella mappa.
nl: **Een dataset aan deze kaart toevoegen**, een link om een nieuwe dataset aan uw kaart toe te voegen

source: Overview of the Map Builder menu
de: Überblick über das Kartenersteller-Menü
es: Visión general del menú Compilador de mapas
fr: Vue d'ensemble du menu de l'Editeur de Cartes
it: Panoramica del menu di Mapbuilder
nl: Overzicht van het Map Builder-menu

source: The Map Builder menu is located at the very top of the map. Through this part of Map Builder, you can :doc:`rename and save a map <rename-and-save-a-map>`, :doc:`manage your maps<manage-your-maps>`, :doc:`reorder and group layers in a map <reorder-and-group-layers-in-a-map>`, :doc:`configure your map <configure-your-map>` and :doc:`share your map <share-your-map>`.
de: Das Kartenersteller-Menü befindet sich ganz oben auf der Karte. In diesem Teil des Kartenerstellers, können Sie :doc:`eine Karte umbenennen und speichern <rename-and-save-a-map>`, :doc:`Ihre Karten verwalten<manage-your-maps>`, :doc:`Ebenen in einer Karte neu anordnen und gruppieren <reorder-and-group-layers-in-a-map>`, :doc:`Ihre Karte konfigurieren <configure-your-map>` und :doc:`Ihre Karte teilen <share-your-map>`.
es: El menú Compilador de mapas se encuentra en la parte superior del mapa.‭ ‬En esta parte del compilador de mapas,‭ ‬puede :doc:`cambiar el nombre de un mapa y guardarlo <rename-and-save-a-map>`, :doc:`administrar los mapas‭<manage-your-maps>`, :doc:`reordenar y agrupar las capas en un mapa <reorder-and-group-layers-in-a-map>`, :doc:`configurar el mapa <configure-your-map>` y :doc:`compartir el mapa‭ <share-your-map>`.
fr: Le menu de l'Editeur de Cartes est situé tout en haut de la carte. Cette partie de l'Editeur de Cartes vous permet de :doc:`renommer et enregistrer une carte <rename-and-save-a-map>`, :doc:`gérer vos cartes <manage-your-maps>`, :doc:`réordonner et grouper les couches sur une carte <reorder-and-group-layers-in-a-map>`, :doc:`configurer votre carte <configure-your-map>` et :doc:`partager votre carte <share-your-map>`.
it: Il menu di Mapbuilder si trova nella parte superiore della mappa e consente di :doc:`rinominarla o salvarla <rename-and-save-a-map>`, :doc:`gestirla <manage-your-maps>`, :doc:`riordinarne o raggrupparne i layer <reorder-and-group-layers-in-a-map>`, :doc:`configurarla <configure-your-map>` e :doc:`condividerla <share-your-map>`.
nl: Het Map builder-menu bevindt zich helemaal bovenaan de kaart. Via dit deel van Map Builder kan u :doc:`een kaart hernoemen en opslaan<rename-and-save-a-map>`, :doc:`uw kaarten beheren<manage-your-maps>`, :doc:`lagen in een kaart herschikken en groeperen <reorder-and-group-layers-in-a-map>`, :doc:`uw kaart configureren <configure-your-map>` en :doc:`uw kaart delen <share-your-map>`.

source: It displays the following information, action buttons and submenus:
de: Zeigt die folgenden Informationen, Aktionsbuttons und Untermenüs an:
es: Visualiza los siguientes datos,‭ ‬botones de acción y submenús:
fr: Il contient les informations, actions, boutons et sous-menus suivants :
it: Al suo interno sono presenti le informazioni, i pulsanti e i sottomenu elencati qui di seguito:
nl: Deze geeft de volgende informatie, actieknoppen en submenu's weer:

source: **My Maps**, to manage your maps, including your not-yet-saved maps (drafts)
de: **Meine Karten**, um Ihre Karten zu verwalten, darunter Ihre noch nicht gespeicherten Karten (Entwürfe)
es: ‭**‬Mis mapas**‬,‭ ‬para administrar los mapas,‭ ‬incluidos los mapas que aún no se han guardado (‬borradores)
fr: **Mes cartes**, pour gérer vos cartes, y compris les cartes pas encore enregistrées (brouillons).
it: **Le mie mappe**, per gestire le mappe, incluse quelle non ancora salvate (bozze);
nl: **My Maps** om uw kaarten te beheren, inclusief de nog niet door u opgeslagen kaarten (ontwerpen)

source: the title of your map
de: der Titel Ihrer Karte
es: El título del mapa
fr: le titre de votre carte
it: il titolo della mappa;
nl: de titel van uw kaart

source: a switch button, whether you want to display Map Builder in an edition or in a preview mode
de: Button zum Umschalten zwischen Bearbeitungs- und Vorschaumodus der Anzeige des Kartenerstellers
es: Un botón conmutador,‭ ‬para elegir si desea visualizar el compilador de mapas en el modo de edición o vista previa
fr: un bouton interrupteur, qui permet de passer du mode édition au mode aperçu de l'Editeur de Cartes
it: un pulsante interruttore, per passare dalla modalità di modifica a quella di anteprima;
nl: een omschakelknop om te bepalen of u Map Builder in een bewerkings- of voorbeeldweergavemodus wil weergeven

source: **Order and groups**, to manage in what order your datasets are displayed and to group your datasets together
de: **Reihenfolge und Gruppen**, um zu bestimmen, in welcher Reihenfolge Ihre Datensätze angezeigt werden, und um Ihre Datensätze zu gruppieren
es: ‭**‬Orden y grupos**‬,‭ ‬para administrar en qué orden se visualizan los conjuntos de datos y agrupar los conjuntos de datos
fr: **Ordres et groupes**, pour choisir l'ordre selon lequel vos jeux de données sont affichés, et les regrouper ensemble
it: la sezione **Ordine e gruppi**, per gestire l'ordine di visualizzazione dei dataset o raggrupparli insieme;
nl: **Volgorde en groepen** om te beheren in welke volgorde uw datasets worden weergegeven en om uw datasets samen te groeperen

source: **Configuration**, to define which features will be activated when your map is in preview or view mode
de: **Konfiguration**, um zu bestimmen, welche Funktionen aktiviert werden, wenn Ihre Karte im Vorschau- oder im Anzeigemodus ist
es: ‭**Configuración**‬,‭ ‬para definir qué funciones se activarán cuando el mapa esté en modo de edición o vista previa
fr: **Configuration**, pour définir quelles fonctionnalités activer lorsque votre carte est en mode aperçu ou en mode affichage
it: **Configurazione**, per definire le opzioni da attivare nelle modalità di anteprima o di visualizzazione;
nl: **Configuratie** om te bepalen welke functies zullen worden geactiveerd wanneer uw kaart zich in voorbeeldweergave- of bekijkmodus bevindt

source: **Save**, to save your map
de: **Speichern**, um Ihre Karte zu speichern
es: **Guardar**, para guardar el mapa
fr: **Enregistrer**, pour sauvegarder votre carte
it: il pulsante **Salva**, per salvare la mappa
nl: **Opslaan** om uw kaart op te slaan

source: **Share**, to access links to share your map as a link, inside an iframe or as a widget pasted in a page
de: **Teilen**, um Links zu erhalten, mit denen Sie Ihre Karte als Link, in einem Iframe oder als in eine Seite eingefügtes Widget teilen können
es: ‭**‬Compartir‭**‬,‭ ‬para acceder a los vínculos a fin de compartir el mapa como vínculo,‭ ‬dentro de un iframe o como widget pegado en una página
fr: **Partager**, pour accéder aux liens de partage de votre carte en tant que lien, à l'intérieur d'une iframe ou en tant que widget collé dans une page
it: il pulsante **Condividi**, per accedere ai link di condivisione della mappa in formato link semplice, integrazione in un iframe o widget da incollare in una pagina.
nl: **Delen** om toegang te krijgen tot links om uw kaart te delen als een link, binnen een iframe of als een widget geplakt in een pagina

source: Overview of the interactive map of Map Builder
de: Überblick über die interaktive Karte im Kartenersteller
es: Visión general del mapa interactivo del compilador de mapas
fr: Vue d'ensemble de la carte interactive de l'Editeur de Cartes
it: Panoramica della mappa interattiva di Mapbuilder
nl: Overzicht van de interactieve kaart van Map Builder

source: The interactive map displays your data. You can :doc:`navigate on your Map Builder map <navigate-on-a-map-builder-map>` to play with this data.
de: Die interaktive Karte zeigt Ihre Daten an. Sie können :doc:`auf der Karte in Ihrem Kartenersteller navigieren<navigate-on-a-map-builder-map>`, um mit diesen Daten zu spielen.
es: El mapa interactivo visualiza sus datos. Puede :doc:`navegar por el mapa del compilador de mapas <navigate-on-a-map-builder-map>` para jugar con estos datos.
fr: La carte interactive affiche vos données. Vous pouvez :doc:`naviguer sur votre carte <navigate-on-a-map-builder-map>` pour parcourir ces données.
it: La mappa interattiva è l'area di visualizzazione dei tuoi dati. Con Mapbuilder puoi :doc:`navigare all'interno della mappa <navigate-on-a-map-builder-map>` e combinare a piacimento i vari dati a disposizione.
nl: De interactieve kaart toont uw data. U kan :doc:`op uw Map Builder-kaart navigeren <navigate-on-a-map-builder-map>` om met deze data te spelen.
