Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/creating_maps_charts/01_creating_advanced_maps/reorder-and-group-layers-*-a-map.po
Languages: de, es, fr, it, nl

source: Reorder and group layers in a map
de: Ebenen in einer Karte neu ordnen und gruppieren
es: Reordenar y agrupar capas en un mapa
fr: Réordonner et grouper les couches sur une carte
it: Riordinare e raggruppare i layer in una mappa
nl: Lagen in een kaart herschikken en groeperen

source: Overview of the Order and groups interface
de: Überblick über die Reihenfolge- und Gruppenoberfläche
es: Visión general de la interfaz Orden y grupos
fr: Vue d'ensemble de l'interface Ordres et groupes
it: Panoramica dell'interfaccia Ordine e gruppi
nl: Overzicht van de interface Volgorde en groepen

source: You can reorder your layers and group some of them together.
de: Sie können Ihre Ebenen neu sortieren und einige von ihnen gruppieren.
es: Puede reordenar las capas y agrupar varias de ellas.
fr: Vous pouvez réordonner les couches et en grouper plusieurs ensemble.
it: I layer che aggiungi possono essere riordinati e raggruppati tra loro.
nl: U kan uw lagen herschikken of enkele ervan samen groeperen.

source: Reordering layers can be handy, for example, if some of your layers are more important or requested than others. You can thus move the most important and/or requested layers at the very beginning of the list of layers so that they can be found more easily.
de: Die Neusortierung der Ebenen kann praktisch sein, zum Beispiel, wenn einige Ihrer Ebenen wichtiger sind oder häufiger angefordert werden als andere. Auf diese Weise können Sie die wichtigsten und/oder gefragtesten ganz oben in die Liste ihrer Ebenen setzen, damit sie einfacher zu finden sind.

source: Grouping layers can also come in handy. For example, you might want to display different layers on your map, but they need to be displayed together to be really relevant. If you group these layers, you make them stick together: or they’re all displayed at the same time, or they’re all hidden.
de: Die Gruppierung von Ebenen kann auch nützlich sein. Beispielsweise möchten Sie vielleicht verschiedene Ebenen auf Ihrer Karte anzeigen, die aber zusammen angezeigt werden müssen, um wirklich relevant zu sein. Wenn Sie diese Ebenen gruppieren, sorgen Sie dafür, dass sie zusammenbleiben: Entweder alle werden gleichzeitig angezeigt, oder alle werden ausgeblendet.

source: Order and group management actions are made from the **Order and groups** interface. This interface is accessible from the Map Builder menu displayed at the very top of the map.
de: Aktionen zur Verwaltung der Reihenfolge und Gruppierung werden in der Oberfläche **Reihenfolge und Gruppen*** durchgeführt. Diese Oberfläche ist über das Kartenersteller-Menü erreichbar, das ganz oben auf der Karte angezeigt wird.

source: The interface of **Order and Groups** is composed of:
de: Die Oberfläche von **Reihenfolge und Gruppen** besteht aus:
es: La interfaz **‬Orden y grupos** ‬está formada por:
fr: L'interface de **Ordres et groupes** est composée de :
it: L'interfaccia **Ordine e Gruppi** presenta:
nl: De interface **Volgorde en groepen** bestaat uit:

source: a **Group** button to group layers
de: ein Button **Gruppe**, um Ebenen zu gruppieren

source: a **Split** button to split groups
de: ein Button **Trennen**, um Gruppen aufzuspalten

source: a switch button to see your map in **Multilayer** mode (several layers can be displayed at the same time) or in **Monolayer** mode (only one layer can be displayed on the map: choosing a layer automatically excludes the others)
de: ein Button zum Umschalten, um die Karte im Modus **Multilayer** (mehrere Ebenen können gleichzeitig angezeigt werden) oder im Modus **Monolayer** (es kann nur eine Ebene auf der Karte angezeigt werden: Die Auswahl einer Ebene schließt die anderen automatisch aus) anzeigen zu lassen

source: the complete list of the layers of your map, with the following action buttons:
de: vollständige Liste der Ebenen auf Ihrer Karte, mit den folgenden Aktionsbuttons:
es: La lista completa de las capas del mapa,‭ ‬con los botones de acción siguientes:
fr: la liste complète des couches de la carte, avec les boutons d'action suivants :
it: l'elenco completo dei layer della mappa, con i seguenti pulsanti:
nl: de volledige lijst van de lagen op uw kaart met de volgende actieknoppen:

source: a checkbox to select a layer, useful to group layers or split groups
de: Auswahlbox, um Ebenen zu selektieren, praktisch zum Gruppieren von Ebenen und Aufspalten von Gruppen
es: Una casilla para seleccionar una capa, útil para agrupar capas o dividir grupos
fr: une case à cocher pour sélectionner une couche, utilisée pour grouper des couches ou dissocier des groupes
it: una casella di controllo per selezionare i layer, utile per raggrupparli o per dividere i gruppi;
nl: een aanvinkvakje om een laag te selecteren. Nuttig om lagen te groeperen of groepen op te splitsen

source: |icon-hide| to make a layer visible or not
de: |icon-hide| zum Aus-/Einblenden einer Ebene
es: icon-hide‭| ‬para establecer una capa como visible o no
fr: un bouton |icon-hide| pour rendre une couche visible ou pas
it: un pulsante |icon-hide| per rendere visibile o invisibile un layer;
nl: |icon-hide| om een laag zichtbaar of onzichtbaar te maken

source: |icon-move| to move a layer when reordering
de: |icon-move| zum Verschieben einer Ebene beim Neusortieren
es: icon-move‭| ‬para mover una capa al reordenar
fr: un bouton |icon-move| pour déplacer une couche lors d'une réorganisation
it: un pulsante |icon-move| per spostare e riordinare i layer.
nl: |icon-move| om een laag te verwijderen bij het herschikken

source: Group layers
de: Ebenen gruppieren
es: Agrupar capas
fr: Grouper des couches
it: Raggruppare i layer
nl: Lagen groeperen

source: Tick the boxes of the layers you want to group together.
de: Wählen Sie die Kästchen der Ebenen aus, die Sie gruppieren möchten.
es: Marque las casillas de las capas que desea agrupar.
fr: Cochez les cases des layers que vous souhaitez grouper ensemble.
it: Spunta la casella dei layer che desideri raggruppare.
nl: Vink de vakjes aan van de lagen die u samen wil groeperen.

source: Click on the **Group** button.
de: Klicken Sie auf den Button **Gruppieren**.
es: Haga clic en el botón **‬Grupo**.
fr: Cliquez sur le bouton **Grouper**.
it: Clicca sul pulsante **Raggruppa**.
nl: Klik op de knop **Groep**.

source: Click on the **Apply** button for your changes to be taken into account.
de: Klicken Sie auf den Button **Anwenden**, damit Ihre Änderungen übernommen werden.
es: Haga clic en el botón **‬Aplicar** ‬para que se introduzcan los cambios que ha efectuado.
fr: Cliquez sur le bouton **Appliquer** pour que vos changements soient pris en compte.
it: Clicca su **Applica** per rendere effettive le tue modifiche.
nl: Klik op de knop **Toepassen** zodat rekening wordt gehouden met uw wijzigingen.

source: Split groups of layers
de: Gruppierte Ebenen aufspalten
es: Dividir grupos de capas
fr: Dissocier des groupes de couches
it: Dividere i gruppi di layer
nl: Groepen lagen opsplitsen

source: Tick the box of the group you want to split.
de: Wählen Sie das Kästchen der Gruppe aus, die Sie aufspalten wollen.
es: Marque la casilla del grupo que desea dividir.
fr: Cochez la case du groupe que vous souhaitez dissocier.
it: Spunta la casella del gruppo che desideri dividere.
nl: Vink het vakje aan van de groep dat u wil opsplitsen.

source: Click on the **Split** button.
de: Klicken Sie auf den Button **Trennen**.
es: Haga clic en el botón **Dividir**.
fr: Cliquez sur le bouton **Dissocier**.
it: Clicca sul pulsante **Dividi**.
nl: Klik op de knop **Opsplitsen**.

source: Reordering layers can be handy, for instance if some of your layers are more important or demanded as others. You can thus move the most important and/or demanded layers at the very beginning of the list of layers, so that they can be found more easily.
es: Reordenar las capas puede resultar práctico, por ejemplo si algunas capas son más importantes o están más solicitadas que otras. Por consiguiente, puede mover las capas más importantes y/o demandadas al principio de la lista de capas para que sean más fáciles de encontrar.
fr: Réordonner les couches peut être utile, par exemple si certaines couches sont plus importantes ou plus demandées que d'autres. Vous pouvez alors déplacer les plus importantes et/ou demandées au début de la liste de couches afin qu'elles puissent être trouvées plus facilement.
it: Il riordino dei layer può rivelarsi un'operazione molto utile, ad esempio quando alcuni sono più importanti o richiesti di altri: spostandoli all'inizio dell'elenco, sarà infatti più facile trovarli.
nl: Het herschikken van lagen kan handig zijn, bijvoorbeeld wanneer sommige van uw lagen belangrijker zijn of meer gevraagd worden dan andere. Zo kan u de belangrijkste en/of meest gevraagde lagen verplaatsen naar het begin van de lijst met lagen zodat ze makkelijker terug te vinden zijn.

source: Grouping layers can also come in handy. For example, you might want to display different layers on your map but that need to be displayed together to be really relevant. If you group these layers, you make them stick together: or they’re all displayed at the same time, or they’re all hidden.
es: Agrupar las capas también puede ser muy conveniente. Por ejemplo, tal vez le interese ver varias capas en un mapa pero necesite asegurarse de que se visualizan juntas para que sean realmente relevantes. Al agrupar estas capas, las está ensamblando: o todas se visualizarán a la vez, o todas estarán ocultas.
fr: Grouper des couches peut aussi être utile. Par exemple, vous pourriez vouloir afficher plusieurs couches sur une carte, qui nécessitent d'être affichées ensemble pour être pertinentes. Si vous groupez ces couches, vous les liez fortement : soit elles sont toutes affichées en même temps, soit elles sont toutes cachées.
it: Anche il loro raggruppamento offre vantaggi importanti. Ad esempio, alcuni layer potrebbero essere più rilevanti se visualizzati contemporaneamente sulla tua mappa. Una volta raggruppati, questi layer potranno essere visualizzati o nascosti insieme.
nl: Ook het groeperen van lagen kan handig zijn. Bijvoorbeeld: misschien wil u verschillende lagen op uw kaart weergeven maar moeten deze samen weergegeven worden om echt relevant te zijn. Wanneer u deze lagen groepeert, zorgt u ervoor dat deze samen blijven: ofwel worden ze allemaal tezelfdertijd weergegeven ofwel worden ze allemaal verborgen.

source: Order and groups management actions are made from the **Order and groups** interface. This interface is accessible from the Map Builder menu displayed at the very top of the map.
es: Las acciones de administración de Orden y grupos se realizan desde la interfaz **‬Orden y grupos**.‭ ‬Se puede acceder a esta interfaz desde el menú Compilador de mapas que se visualiza en la parte superior del mapa.
fr: Les actions de gestion de l'ordre et des groupes s'effectuent depuis l'interface **Ordres et groupes**. Cette interface est accessible depuis le menu de l'Editeur de Cartes affiché tout en haut de la carte.
it: La gestione dell'ordine e dei gruppi si effettua dall'interfaccia **Ordine e gruppi**, accessibile dal menu di Mapbuilder nella parte superiore della mappa.
nl: Het herschikken en groeperen gebeurt via de interface **Volgorde en groepen**. Deze interface is toegankelijk vanuit het Map Builder-menu dat helemaal boven de kaart wordt weergegeven.

source: **Group** button, to group layers
es: El botón ‭**‬Grupo**,‭ ‬para agrupar capas
fr: le bouton **Grouper**, pour grouper des couches
it: il pulsante **Raggruppa**, per raggruppare i layer;
nl: de knop **Groep** om lagen te groeperen

source: **Split** button, to split groups
es: ‭El botón **‬Dividir**, para dividir grupos
fr: le bouton **Dissocier**, pour dissocier des groupes
it: il pulsante **Dividi**, per separare i gruppi;
nl: de knop **Opsplitsen** om groepen op te splitsen

source: a switch button, to see your map in **Multilayer** mode (several layers can be displayed at the same time) or in **Monolayer** mode (only one layer can be displayed on the map: choosing a layer automatically excludes the others)
es: Un botón conmutador, para ver el mapa en el modo **Multicapa** (se pueden visualizar varias capas al mismo tiempo) o el modo **Monocapa** (solo se puede visualizar una capa en el mapa: al elegir una capa, automáticamente se excluyen las demás).
fr: un bouton bascule pour afficher votre carte en mode **Multicouche** (c.-à-d. que plusieurs couches peuvent être affichées simultanément) ou en mode **Monocouche** (c.-à-d. qu'une seule couche peut être affichée sur la carte ; le fait de choisir une couche exclut les autres)
nl: een schakelknop om uw kaart te zien in **Multilayer** modus (er kunnen meerdere lagen tezelfdertijd worden weergegeven) of in **Monolayer** modus (er kan slechts één laag op de kaart worden weergegeven: wanneer een laag wordt gekozen, worden de andere automatisch uitgeschakeld)

source: a switch button, whether you want to be able to see several layers on your map (**Multilayer**) or just one at a time (**Monolayer**)
it: un pulsante interruttore, per decidere se visualizzare sulla mappa più layer contemporaneamente (**Multi-layer**), oppure uno alla volta (**Mono-layer**);
