Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/configuring_remote_service.po
Languages: de, es, fr, nl

source: Configuring a remote service
de: Eine Remote-Service konfigurieren
es: Configurar un servicio remoto
fr: Configurer un service distant
nl: Een service op afstand configureren

source: You can configure a remote service to add a source while creating a dataset.
de: Sie können einen Remote-Service so konfigurieren, dass er beim Erstellen eines Datensatz eine Quelle hinzufügt.
es: Puede configurar un servicio remoto para añadir un origen al crear un conjunto de datos.
fr: Vous pouvez configurer un service distant pour ajouter une source lorsque vous créez un jeu de données.
nl: U kunt een service op afstand configureren om een bron toe te voegen terwijl een dataset wordt aangemaakt.

source: For a list of available connectors, see :ref:`connectors_remote_services`.
de: Eine Liste der verfügbaren Konnektoren finden Sie hier: :ref:`connectors_remote_services`.
es: Para ver una lista de los conectores disponibles, consulte :ref:`connectors_remote_services`.
fr: Pour obtenir la liste des connecteurs disponibles, consultez :ref:`connectors_remote_services`.
nl: Voor een lijst met beschikbare connectoren, zie :ref:`connectors_remote_services`.

source: In **Catalog** > **Datasets**, click on the **New dataset** button.
de: Klicken Sie unter **Katalog** > **Datensätze** auf den Button **Neuer Datensatz**.
es: En **Catálogo** > **Conjuntos de datos**, haga clic en el botón **Conjunto de datos nuevo**.
fr: Dans **Catalogue** > **Jeux de données**, cliquez sur le bouton **Nouveau jeu de données**.
nl: Klik in **Catalogus** > **Datasets** op de knop **Nieuwe dataset**.

source: In the wizard that opens, select the desired service under the **Configure a remote service** section.
de: Wählen Sie in dem sich öffnenden Assistenten den gewünschten Service unter dem Abschnitt **Remote-Service konfigurieren**.
es: En el asistente que aparece, seleccione el servicio deseado en la sección **Configurar un servicio remoto**.
fr: Sélectionnez le service souhaité dans l'assistant qui s'ouvre, sous la section **Configurer un service distant**.
nl: Selecteer in de wizard die wordt geopend de gewenste service onder de rubriek **Een service op afstand configureren**.

source: Configure the connection to your source.
de: Konfigurieren Sie die Verbindung zu Ihrer Quelle.
es: Configure la conexión con su origen.
fr: Configurez la connexion à votre source.
nl: Configureer de verbinding naar uw bron.

source: For Google Drive and SharePoint, you can select a saved connection or configure a new connection. If you configure a new connection, select the **Save connection information** check box to save your connection.
de: Für Google Drive und SharePoint können Sie eine gespeicherte Verbindung auswählen oder eine neue Verbindung konfigurieren. Wenn Sie eine neue Verbindung konfigurieren, aktivieren Sie die Option **Verbindungsinformationen speichern**, um die Verbindung zu speichern.
es: Para Google Drive y SharePoint, puede seleccionar una conexión guardada o configurar una nueva conexión. Si configura una nueva conexión, seleccione la casilla **Guardar información de conexión** para guardar la conexión.
fr: Pour Google Drive et SharePoint, vous pouvez sélectionner une connexion enregistrée ou configurer une nouvelle connexion. Si vous configurez une nouvelle connexion, cochez la case **Sauvegarder les informations de connexion** pour enregistrer votre connexion.
nl: Voor Google Drive en SharePoint, kunt u een opgeslagen verbinding selecteren of een nieuwe verbinding configureren. Indien u een nieuwe verbinding configureert, selecteer het vakje **Informatie over de verbinding opslaan** om uw verbinding op te slaan.

source: From the preview of the first 20 records that appears, configure the source.
de: Konfigurieren Sie die Quelle über die Vorschau der ersten 20 Datensätze, die angezeigt wird.
es: En la vista previa de los 20 primeros registros que aparece, configure el origen.
fr: Configurez la source dans l'aperçu des 20 premiers enregistrements qui s'affiche.
nl: Configureer de bron vanuit de voorbeeldweergave van de eerste 20 records die verschijnen.

source: Configure the dataset information or use the pre-filled values:
de: Konfigurieren Sie die Datensatzinformationen oder verwenden Sie die vorausgefüllten Werte:
es: Configure la información del conjunto de datos o use los valores precompletados:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :
nl: Configureer de datasetinformatie of gebruik de vooraf ingevulde waarden:

source: In the **Dataset name** field, enter the title for this dataset.
de: Geben Sie in das Feld **Datensatzname** den Titel für diesen Datensatz ein.
es: En el campo **Nombre de conjunto de datos**, especifique el título de este conjunto de datos.
fr: Dans le champ **Nom du jeu de données**, saisissez le titre de ce jeu de données.
nl: Voer de titel voor deze dataset in in het veld **Naam van de dataset**.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
de: Geben Sie in das Feld **Technische Kennung des Datensatzes** eine sinnvolle Kennung für diesen Datensatz ein.
es: En el campo **Identificador técnico de conjunto de datos**, especifique un identificador significativo para este conjunto de datos.
fr: Dans le champ **Identifiant technique du jeu de données**, saisissez un identifiant explicite pour ce jeu de données.
nl: Voer in het veld **Technische identifier van de dataset** een betekenisvolle identifier voor deze dataset in.

source: If you want anyone with access to your domain to be able to explore the dataset, toggle off **Access restricted to allowed users and groups**.
de: Wenn Sie möchten, dass jeder, der Zugriff auf die Domain hat, den Datensatz untersuchen kann, müssen Sie die Option **Zugriff auf zulässige Benutzer und Gruppen beschränkt** deaktivieren.
es: Si desea que cualquier usuario con acceso al dominio pueda explorar el conjunto de datos, desactive el botón de alternancia **Acceso restringido a usuarios y grupos permitidos**.
fr: Si vous souhaitez que tout utilisateur ayant accès à votre domaine puisse explorer le jeu de données, désactivez l'option **Accès limité aux utilisateurs et aux groupes autorisés**.
nl: Indien u iemand met toegang tot uw domein in staat wilt stellen om de dataset te verkennen, vink **Beperkte toegang voor gemachtigde gebruikers en groepen** uit.

source: After creating a dataset, an edition interface for that dataset opens. Only users granted with the right permissions, either "Create dataset" or "Edit dataset", can use this interface.
de: Nach der Erstellung eines Datensatzes wird eine Bearbeitungsoberfläche für diesen Datensatz geöffnet. Nur Benutzer mit der Berechtigung "Datensatz erstellen" oder "Datensatz bearbeiten" können diese Oberfläche nutzen.
es: Tras crear un conjunto de datos, se abre una interfaz de edición para ese conjunto de datos. Solamente pueden usar esta interfaz los usuarios a los que se han concedido los permisos adecuados, o bien "Crear conjunto de datos" o bien "Editar conjunto de datos".
fr: Après avoir créé un jeu de données, un interface de modification s'ouvre pour ce jeu de données. Seuls les utilisateurs bénéficiant des permissions appropriées ("Créer un nouveau jeu de données" ou "Éditer tous les jeux de données") peuvent utiliser cette interface.
nl: Nadat een dataset werd aangemaakt, wordt een bewerkingsinterface voor die dataset geopend. Deze interface kan enkel gebruikt worden door gebruikers met de juiste toelatingen, hetzij "Dataset aanmaken", hetzij "Dataset bewerken".

source: Using this edition interface, you can process the data, configure the datasets and their visualizations, and manage the publishing of the dataset. For more information, see:
de: Über diese Bearbeitungsoberfläche können Sie die Daten verarbeiten, die Datensätze und ihre Visualisierungen konfigurieren und die Veröffentlichung des Datensatzes verwalten. Weitere Informationen finden Sie hier:
es: Mediante esta interfaz de edición, puede procesar los datos, configurar los conjuntos de datos y sus visualizaciones, y gestionar la publicación del conjunto de datos. Para obtener más información, consulte:
fr: Cette interface de modification vous permet de traiter les données, de configurer les jeux de données et leurs visualisations, ainsi que de gérer la publication du jeu de données. Pour plus d'informations, consultez :
nl: Met deze bewerkingsinterface kunt u de data verwerken, de datasets en de weergaves ervan configureren en de publicatie van de dataset beheren. Voor meer informatie, zie:

source: Connectors to remote services
de: Konnektoren zu Remote-Services
es: Conectores con servicios remotos
fr: Connecteurs pour services distants
nl: Connectoren naar diensten op afstand

source: Opendatasoft can connect to a variety of remote services.
de: Opendatasoft kann eine Verbindung zu zahlreichen Remote-Services herstellen.
es: Opendatasoft puede conectar con diversos servicios remotos.
fr: Plusieurs services distants peuvent être connectés à Opendatasoft.
nl: Opendatasoft kan verbinding maken met een brede waaier aan diensten op afstand.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Contact your local support team to get on-demand connectors activated on your domain. Some of them are subject to pricing.
de: Wenden Sie sich an Ihr lokales Support-Team, um On-Demand-Konnektoren auf Ihrer Domain zu aktivieren. Einige von ihnen sind kostenpflichtig.
es: Póngase en contacto con el equipo de soporte de su zona para activar estos conectores a petición en su dominio. Algunos de ellos están sujetos a una tarificación.
fr: Contactez l'équipe de support locale pour activer des connecteurs à la demande sur votre domaine. Certains d'entre eux peuvent être facturés.
nl: Contacteer uw lokaal support team om on-demand connectoren te krijgen die geactiveerd zijn op uw domein. Sommige ervan zijn betalend.

source: Connector
de: Konnektor
es: Conector
fr: Connecteur

source: Description
de: Beschreibung
es: Descripción
nl: Omschrijving

source: Availability
de: Verfügbarkeit
es: Disponibilidad
fr: Disponibilité
nl: Beschikbaarheid

source: Folder
es: Carpeta

source: Retrieves data from an Airtable base
de: Ruft Daten aus einer Airtable-Datenbank ab
es: Recupera datos de una base de Airtable
fr: Récupère les données d'une base Airtable
nl: Haalt data op uit een Airtable-basis

source: On demand
de: Auf Abruf
es: Bajo demanda
fr: À la demande
nl: Op verzoek

source: N/A
es: N/D

source: Retrieves data from a file stored in an Amazon S3 bucket
es: Recupera datos de un archivo almacenado en un depósito de Amazon S3

source: Files only
es: Solo archivos

source: Retrieves data from an ArcGIS server
de: Ruft Daten von einem ArcGIS-Server ab.
es: Recupera datos de un servidor ArcGIS
fr: Récupère les données d'un serveur ArcGIS
nl: Haalt data op uit een ArcGIS-server

source: Default
de: Standard
es: Valor predeterminado
fr: Par défaut
nl: Standaard

source: Retrieves data from a file stored in a Blob storage
es: Recupera datos de un archivo almacenado en Azure Blob Storage

source: Retrieves data using the US Census Bureau's API
de: Ruft Daten mit der API des US Census Bureau ab.
es: Recupera datos con la API de la Oficina del Censo de Estados Unidos
fr: Récupère les données à l'aide de l'API de l'US Census Bureau
nl: Haalt data op met behulp van de API van US Census Bureau

source: :doc:`Dataset of datasets<connectors/dataset_of_datasets>`
de: :doc:`Datensatz der Datensätze<connectors/dataset_of_datasets>`
es: :doc:`Conjunto de datos de conjuntos de datos<connectors/dataset_of_datasets>`
fr: :doc:`Jeu de données de jeux de données<connectors/dataset_of_datasets>`

source: Creates a dataset from the catalog of an Opendatasoft domain
de: Erstellt einen Datensatz aus dem Katalog einer Opendatasoft-Domain.
es: Crea un conjunto de datos a partir del catálogo de un dominio Opendatasoft
fr: Crée un jeu de données à partir du catalogue d'un domaine Opendatasoft
nl: Maakt een dataset aan vanuit de catalogus van een Opendatasoft-domein

source: Retrieves data about Eco Counter counters and counting sites
de: Ruft Daten über Eco Counter Zähler und Zählstellen ab
es: Recupera datos sobre contadores Eco Counter y sitios de recuento
fr: Récupère les données sur les sites de comptage et compteurs Eco-Compteur
nl: Haalt data op over Eco Counter-tellers en telsites

source: :doc:`Feed<connectors/feed>`
es: :doc:`Fuente<connectors/feed>`
fr: :doc:`Flux<connectors/feed>`

source: Retrieves data from Atom and RSS feeds
de: Ruft Daten von Atom und RSS Feeds ab
es: Recupera datos de fuentes Atom y RSS
fr: Récupère les données des flux Atom et RSS
nl: Haalt data op uit Atom en RSS feeds

source: Retrieves data from a Google BigQuery table
es: Recupera datos de una tabla de Google BigQuery

source: Retrieves files located in Google Drive
de: Ruft Daten von Google Drive ab
es: Recupera archivos ubicados en Google Drive
fr: Récupère les fichiers se trouvant dans Google Drive
nl: Haalt bestanden op die in Google Drive zitten

source: Retrieves the state of JCDecaux bike stations
de: Ruft Daten von JCDecaux Fahrradstationen ab
es: Recupera el estado de las estaciones de bicicletas JCDecaux
fr: Récupère l'état des stations de vélos JCDecaux
nl: Haalt de staat van JCDecaux-fietsstations op

source: Retrieves data using the Netatmo API
de: Ruft Daten mit der Netatmo-API ab
es: Recupera datos con la API de Netatmo
fr: Récupère les données à l'aide de l'API Netamo
nl: Haalt data op via de Netatmo API

source: Retrieves events from OpenAgenda agendas
de: Ruft Daten aus OpenAgenda-Terminkalendern ab
es: Recupera eventos de las agendas de OpenAgenda
fr: Récupère des évènements dans des agendas OpenAgenda
nl: Haalt evenementen op uit OpenAgenda-agenda's

source: :doc:`Realtime<connectors/realtime>`
es: :doc:`Tiempo real<connectors/realtime>`
fr: :doc:`Temps réel<connectors/realtime>`

source: Pushes real-time data to the platform
de: Übermittelt Echtzeitdaten an die Plattform
es: Inserta datos en tiempo real en la plataforma
fr: Envoie des temps en temps réel à la plateforme
nl: Pusht real time data naar het platform

source: Retrieves data using the Salesforce API
de: Ruft Daten mit der Salesforce-API ab
es: Recupera datos con la API de Salesforce
fr: Récupère les données à l'aide de l'API Salesforce
nl: Haalt data op via de Salesforce API

source: Retrieves files located in SharePoint
de: Ruft in SharePoint befindliche Dateien ab
es: Recupera archivos ubicados en SharePoint
fr: Récupère les fichiers se trouvant dansSharePoint
nl: Haalt bestanden op die in SharePoint zitten

source: Retrieves data from a WFS service
de: Ruft Daten von einem WFS-Dienst ab
es: Recupera datos de un servicio WFS
fr: Récupère les données d'un service WFS
nl: Haalt data op uit een WFS-service

source: :doc:`Eco Counter<connectors/ecocounter>`
fr: :doc:`Eco-Compteur<connectors/ecocounter>`
