Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/creating_dataset_with_multiple_files.po
Languages: de, es, fr, it, nl

source: All the files in the directory need to have the same format and schema (e.g. CSV files with the same column titles). Files must also not be inside subdirectories: if the URL points towards a directory containing a compressed file, the latter will be imported into the platform as such -it will not be unzipped.
it: Tutti i file della directory devono avere lo stesso formato e lo stesso schema (ad es. file CSV con gli stessi titoli di colonna). Inoltre, i file non devono essere inclusi in sottodirectory: se l'URL punta a una directory contenente file compressi, questi saranno importati nella piattaforma come tali, senza essere decompressi.

source: In the **Enter a URL** box, write the URL of the FTP server where the files are stored.
it: Nella casella **Inserisci un URL**, immetti l'URL del server FTP in cui sono memorizzati i file.

source: When synchronizing from a remote FTP location, OpenDataSoft keeps a persistent cache and does not automatically prune files missing from the remote directory. Please contact OpenDataSoft's support if you need some cleanup to be performed.
it: Quando si esegue la sincronizzazione da una posizione FTP remota, OpenDataSoft mantiene una cache persistente e non elimina automaticamente i file mancanti dalla directory remota. Per richiedere l'eliminazione dei file non più necessari, ti invitiamo a contattare il servizio di assistenza OpenDataSoft.
