Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/creating_dataset_with_multiple_files.po
Languages: de, es, fr, it, nl

source: Creating a dataset with multiple files
de: Erstellen eines Datensatzes mit mehreren Dateien
es: Crear un conjunto de datos con varios archivos
fr: Création d'un jeu de données avec plusieurs fichiers
it: Creazione di un dataset con più file
nl: Een dataset met meerdere bestanden aanmaken

source: It is possible to add multiple files to a dataset, as well as to have multiple sources into one dataset.
de: Es können mehrere Dateien zu einem Datensatz hinzugefügt werden. Außerdem können mehrere Quellen in einen Datensatz eingespeist werden.
es: Puede añadir varios archivos a un conjunto de datos, así como tener varios orígenes en un conjunto de datos.
fr: Il est possible d'ajouter plusieurs fichiers dans un jeu de données, ainsi que d'avoir plusieurs sources dans un même jeu de données.
it: Per ciascun dataset è possibile aggiungere più file e avere più origini.
nl: Het is mogelijk om meerdere bestanden aan een dataset toe te voegen alsook om meerdere bronnen in één dataset te hebben.

source: There are 3 methods to add multiple files into a dataset:
de: Es gibt 3 Möglichkeiten, um mehrere Dateien zu einem Datensatz hinzuzufügen:
es: Existen 3 métodos para añadir varios archivos a un conjunto de datos:
fr: 3 méthodes sont proposées pour ajouter plusieurs fichiers à un jeu de données :
nl: Er zijn 3 methodes om meerdere bestanden in een dataset toe te voegen:

source: adding each file one by one,
de: jede Datei einzeln hinzufügen,
es: añadirlos uno a uno;
fr: ajouter les fichiers un par un,
nl: door ze één voor één toe te voegen,

source: adding multiple files at the same time through an archive file, or
de: mehrere Dateien gleichzeitig mithilfe einer Archivdatei hinzufügen, oder
es: añadir varios archivos al mismo tiempo por medio de un archivo archivador;
fr: ajouter plusieurs fichiers en même temps via un fichier d'archive,
nl: door meerdere bestanden tezelfdertijd toe te voegen via een archiefbestand, of

source: adding them via an FTP server.
de: die Dateien über einen FTP-Server hinzufügen.
es: añadirlos a través de un servidor FTP.
fr: ou ajouter les fichiers via un serveur FTP.
nl: door ze toe te voegen via een FTP-server.

source: Sourcing files one by one
de: Dateien einzeln einspeisen
es: Añadir archivos uno a uno
fr: Collecte de fichiers un par un
it: Aggiunta dei file uno a uno
nl: Bestanden één voor één sourcen

source: This method consists of adding files one by one into the platform, creating as many sources as the number of added files. In that case, because a new source is created for each added file, those can have different formats (see :doc:`Supported formats</publishing_data/01_creating_a_dataset/supported_formats>`)
de: Bei dieser Methode werden Dateien einzeln zur Plattform hinzugefügt. Dabei entspricht die Anzahl der erzeugten Quellen derjenigen der hinzugefügten Dateien. In diesem Fall - und weil für jede hinzugefügte Datei eine neue Quelle erstellt wird - können sie unterschiedliche Formate aufweisen (siehe :doc:`Unterstützte Formate</publishing_data/01_creating_a_dataset/supported_formats>`)
es: Este método consiste en añadir varios archivos uno a uno a la plataforma, creando tantos orígenes como archivos añadidos. En ese caso, como para cada uno de los archivos añadidos se crea un origen nuevo, su formato puede variar (consulte :doc:`Formatos permitidos</publishing_data/01_creating_a_dataset/supported_formats>`).
fr: Cette méthode consiste à ajouter les fichiers un par un à la plateforme, de façon à créer autant de sources que le nombre de fichiers ajoutés. Dans cette situation, étant donné qu'une source différente est créée pour chaque fichier ajouté, ceux-ci peuvent être de divers formats (voir :doc:`Formats pris en charge</publishing_data/01_creating_a_dataset/supported_formats>`).
nl: Deze methode bestaat uit het één voor één toevoegen van verschillende bestanden, uit het aanmaken van even zoveel bronnen als het aantal toegevoegde bestanden. In dat geval kunnen deze verschillende formaten hebben (zie :doc:`Ondersteunde formaten</publishing_data/01_creating_a_dataset/supported_formats>`)

source: In Catalog > Datasets, click on the **New dataset** button.
de: Klicken Sie unter Katalog > Datensätze auf den Button **Neuer Datensatz**.
es: En Catálogo > Conjuntos de datos, haga clic en el botón **Conjunto de datos nuevo**.
fr: Dans Catalogue > Jeux de données, cliquez sur le bouton **Nouveau jeu de données**.
it: In Catalogo > Dataset, clicca sul pulsante **Nuovo dataset**.
nl: Klik in Catalogus > Datasets op de knop **Nieuwe dataset**.

source: Click on the **Add a source** button.
de: Klicken Sie auf den Button **Eine Quelle hinzufügen**.
es: Haga clic en el botón **Añadir un origen**.
fr: Cliquez sur le bouton **Ajouter une source**.
it: Clicca su **Aggiungi un'origine**.
nl: Klik op de knop **Een bron toevoegen**.

source: Choose one of the 3 available methods to upload your first file (see :doc:`Sourcing data<sourcing_data>`).
de: Wählen Sie eine der 3 möglichen Methoden, um Ihre erste Datei hochzuladen (siehe :doc:`Daten einspeisen<sourcing_data>`).
es: Elija uno de los 3 métodos disponibles para cargar el primer archivo (consulte :doc:`Orígenes de datos<sourcing_data>`).
fr: Optez pour l'une des trois méthodes proposées pour télécharger votre premier fichier (voir :doc:`Collecte de données<sourcing_data>`).
it: Scegli uno dei tre metodi disponibili per caricare il primo file (vedere :doc:`Origini dei dati<sourcing_data>`).
nl: Kies één van de 3 beschikbare methodes om uw eerste bestand te uploaden (zie :doc:`Data sourcen<sourcing_data>`).

source: Once the first file is added, click again on the **Add a source** button.
de: Nachdem die erste Datei hinzugefügt wurde, klicken Sie erneut auf den Button **Eine Quelle hinzufügen**.
es: Una vez añadido el primer archivo, vuelva a hacer clic en el botón **Añadir un origen**.
fr: Après avoir ajouté le premier fichier, cliquez une nouvelle fois sur le bouton **Ajouter une source**.
it: Una volta aggiunto il primo file, clicca nuovamente sul pulsante **Aggiungi un'origine**.
nl: Eenmaal het bestand is toegevoegd, klik opnieuw op de knop **Een bron toevoegen**.

source: Repeat the procedure from step 3 as many times as you need until all your files have been added to the new dataset.
de: Wiederholen Sie den Vorgang ab Schritt 3 so oft wie nötig, bis Sie all Ihre Dateien zum neuen Datensatz hinzugefügt haben.
es: Repita el procedimiento a partir del paso 3 tantas veces como sea necesario, hasta que se hayan añadido todos los archivos al conjunto de datos nuevo.
fr: Répétez la procédure à partir de l'étape 3 autant de fois que nécessaire, c'est-à-dire jusqu'à ce que tous vos fichiers soient ajoutés au nouveau jeu de données.
nl: Herhaal de procedure vanaf stap 3 zoveel als nodig is tot al uw bestanden toegevoegd zijn aan de nieuwe dataset.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: With this method, it's the first file to be added that determines the data schema. In other words, if the other files contain fields that do not match those in the first added file, they will be ignored by the platform.
de: Bei dieser Vorgehensweise wird das Datenschema von der Datei, die als erstes hinzugefügt wurde, bestimmt. Wenn also andere Dateien Felder enthalten, die nicht mit denen der ersten hinzugefügten Datei übereinstimmen, werden sie von der Plattform ignoriert.
es: Con este método, el primer archivo que se añade determina el esquema de datos. Dicho de otro modo, si los demás archivos contienen campos que no coinciden con los del primer archivo añadido, la plataforma los omitirá.
fr: Avec cette méthode, c'est le premier fichier ajouté qui détermine le schéma de données. En d'autres termes, si les autres fichiers contiennent des champs qui ne correspondent pas à ceux du premier fichier ajouté, ils seront ignorés par la plateforme.
it: Con questo metodo, è il primo file aggiunto che determina lo schema dei dati. Se gli altri file contengono campi che non corrispondono a quelli del primo file aggiunto, la piattaforma li ignorerà.
nl: Met deze methode is het het eerste bestand dat moet worden toegevoegd dat het dataschema bepaalt. Met andere woorden, wanneer de andere bestanden velden bevatten die niet overeenstemmen met die in het eerst toegevoegde bestand, zullen deze door het platform worden genegeerd.

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: Be careful when deleting files from a dataset created with multiple files, especially those with different data schemas: if the first file is deleted, the whole dataset will appear as empty.
de: Seien Sie vorsichtig beim Löschen von Dateien aus einem Datensatz, der mit mehreren Dateien erstellt wurde, insbesondere solchen mit unterschiedlichen Datenschemata: Wenn die erste Datei gelöscht wird, erscheint der gesamte Datensatz als leer.
es: Tenga cuidado cuando suprima archivos de un conjunto de datos creado con varios archivos, especialmente aquellos con esquemas de datos diferentes: si se suprime el primer archivo, todo el conjunto de datos aparecerá como vacío.
fr: Attention, lorsque vous supprimez des fichiers dans un jeu de données créé à partir de plusieurs fichiers, notamment ceux ayant différents schémas de données : si le premier fichier est supprimé, alors le jeu de données paraîtra entièrement vide.
nl: Wees voorzichtig wanneer bestanden worden gewist uit een dataset dat aangemaakt is met meerdere bestanden, vooral diegene met verschillende dataschema's: wanneer het eerste bestand wordt gewist, zal de volledige dataset verschijnen als zijnde leeg.

source: Sourcing multiple files within an archive
de: Mehrere Dateien mithilfe eines Archivs einspeisen
es: Añadir varios archivos de un archivador
fr: Collecte de plusieurs fichiers dans une archive
it: Aggiunta di più file mediante un archivio
nl: Meerdere bestanden in een archief sourcen

source: This method consists of adding several files at the same time via an archive file, creating a single source for all the added files. In that case, because only one source is created for all the files, those have to have the same format (see :doc:`Supported formats</publishing_data/01_creating_a_dataset/supported_formats>`).
de: Bei dieser Methode werden mehrere Dateien gleichzeitig mithilfe einer Archivdatei hinzugefügt, wobei eine einzige Quelle für alle hinzugefügten Dateien erzeugt wird. In diesem Fall - und weil für alle hinzugefügten Dateien nur eine Quelle erstellt wird - haben sie das gleiche Format (siehe :doc:`Unterstützte Formate</publishing_data/01_creating_a_dataset/supported_formats>`).

source: With this method, the platform will choose the file with the oldest modification time to determine the data schema.
de: Bei dieser Vorgehensweise wählt die Plattform die Datei mit dem ältesten Änderungszeitpunkt, um das Datenschema zu bestimmen.
es: Con este método, la plataforma elige el archivo con la hora de modificación más antigua para determinar el esquema de datos.
fr: Avec cette méthode, la plateforme choisira le fichier possédant la date de modification la plus ancienne pour déterminer le schéma de données.
it: Tramite questo metodo, la piattaforma determina lo schema dei dati scegliendo il file con la data di modifica più lontana.
nl: Met deze methode zal het platform het bestand kiezen met de oudste wijzigingstijd om het dataschema te bepalen.

source: Create an archive file (see :ref:`Supported compressed file formats<supportedcompressedformats>`) with the files to add to the same dataset.
de: Erzeugen Sie eine Archivdatei (siehe :ref:`Unterstützte komprimierte Dateiformate<supportedcompressedformats>`) mit Dateien, die zum gleichen Datensatz hinzugefügt werden sollen.
es: Cree un archivo archivador (consulte :ref:`Formatos de archivos comprimidos permitidos<supportedcompressedformats>`) con los archivos que se añadirán en el mismo conjunto de datos.
fr: Créez un fichier d'archive (voir :ref:`Formats de fichiers compressés pris en charge<supportedcompressedformats>`) avec les fichiers à ajouter au même jeu de données.
nl: Creëer een archiefbestand (zie :ref:`Ondersteunde gecomprimeerde bestandsformaten<supportedcompressedformats>`) met de bestanden die in dezelfde dataset moeten worden toegevoegd.

source: Source the archive file using one of the 3 available methods (see :doc:`Sourcing data</publishing_data/01_creating_a_dataset/sourcing_data>`).
de: Wählen Sie eine der 3 möglichen Methoden, um die Archivdatei hochzuladen (siehe :doc:`Daten einspeisen</publishing_data/01_creating_a_dataset/sourcing_data>`).
es: Añada el archivo archivador por medio de uno de los 3 métodos disponibles (consulte :doc:`Orígenes de datos</publishing_data/01_creating_a_dataset/sourcing_data>`).
fr: Collectez le fichier d'archive grâce à l'une des 3 méthodes proposées (voir :doc:`Collecte de données</publishing_data/01_creating_a_dataset/sourcing_data>`).
nl: Haal het archiefbestand op door gebruik te maken van één van de 3 beschikbare methodes (zie :doc:`Data ophalen</publishing_data/01_creating_a_dataset/sourcing_data>`).

source: To source a shapefile (containing the following file formats: .shp, .shx, .dbf, and .prj), create an archive file with all the needed files inside and follow the procedure above.
de: Um eine Shapefile hinzuzufügen (mit den folgenden Dateiformaten: .shp, .dbf und .prj), erzeugen Sie eine Archivdatei mit allen benötigten Dateien und befolgen Sie die oben beschriebene Vorgehensweise.
es: Para añadir un archivo de forma (con los siguientes formatos de archivo: .shp, .shx, .dbf y .prj), cree un archivo archivador con todos los archivos necesarios en su interior y siga el procedimiento anterior.
fr: Pour collecter un fichier Shapefile (contenant les formats de fichiers suivants : .shp, .dbf et .prj), créez un fichier d'archive avec tous les fichiers nécessaires dedans et suivez la procédure ci-dessus.
nl: Om een shapefile om te halen (dat de volgende bestandsformaten bevat: .shp, .shx, .dbf en .prj), dient u een archiefbestand aan te maken waarin alle nodige bestanden staan en de bovenstaande procedure te volgen.

source: Sourcing multiple files stored on an FTP server
de: Mehrere auf einem FTP-Server gespeicherte Dateien hinzufügen
es: Añadir varios archivos almacenados en un servidor FTP
fr: Collecte de plusieurs fichiers stockés sur un serveur FTP
it: Aggiunta di più file memorizzati su un server FTP
nl: Meerdere bestanden sourcen die opgeslagen zijn op een FTP-server

source: This method consists of connecting the platform to the directory of an FTP server to retrieve all the files contained in this directory.
de: Bei dieser Methode wird die Plattform mit dem Verzeichnis eines FTP-Servers verbunden, um alle Dateien aus diesem Verzeichnis abzurufen.
es: Este método consiste en conectar la plataforma al directorio de un servidor FTP para recuperar todos los archivos de ese directorio.
fr: Cette méthode consiste à connecter la plateforme au répertoire d'un serveur FTP pour récupérer tous les fichiers de ce répertoire.
nl: Deze methode bestaat erin dat het platform wordt verbonden met de map van een FTP-server om alle bestanden op te halen die opgeslagen zijn in deze map.

source: All the files in the directory need to have the same format and schema (for example, CSV files with the same column titles). Files must also not be inside subdirectories: if the URL points towards a directory containing a compressed file, the latter will be imported into the platform as such -it will not be unzipped.
de: Alle Dateien im Verzeichnis müssen das gleiche Format und Schema haben (z. B. CSV-Dateien mit denselben Spaltentiteln). Die Dateien dürfen sich außerdem nicht in Unterverzeichnissen befinden: wenn die URL auf ein Verzeichnis mit einer komprimierten Datei verweist, wird diese als solche in die Plattform importiert und nicht entpackt.
es: Todos los archivos del directorio deben tener el mismo formato y esquema (por ejemplo, archivos CSV con los mismos títulos de columna). Además, los archivos no pueden estar dentro de subdirectorios: si la dirección URL apunta a un directorio que contiene un archivo comprimido, este se importará en la plataforma como tal (no se descomprimirá).
fr: Tous les fichiers du répertoire doivent avoir le même format et le même schéma (par exemple, des fichiers CSV avec des titres de colonnes identiques). En outre, les fichiers ne doivent pas se trouver dans des sous-répertoires : si l'URL pointe vers un répertoire contenant un fichier compressé, ce dernier est importé tel quel (non décompressé) dans la plateforme.
nl: Alle bestanden in de map moeten hetzelfde formaat en schema hebben (bijv. CSV-bestanden met dezelfde kolomtitels). Bestanden mogen ook niet in submappen staan: wanneer een URL verwijst naar een map die een gecomprimeerd bestand bevat, zal de laatstgenoemde als dusdanig geïmporteerd worden in het platform - het zal niet worden unzipped.

source: In the **Enter a URL** box, write the URL of the FTP server where the files are stored. The URL should contain both the login and password to the FTP (for example, ftp://login:password@example.org/my_directory/my_dataset).
de: Geben Sie in das Feld **Eine URL eingeben** die URL des FTP-Servers ein, auf dem die Dateien gespeichert sind. Die URL sollte sowohl den Benutzernamen als auch das Passwort für den FTP enthalten (z.B.: ftp://login:password@example.org/my_directory/my_dataset).
es: En el cuadro **Especificar una dirección URL**, escriba la dirección URL del servidor FTP donde están almacenados los archivos. La dirección URL debe contener el inicio de sesión y la contraseña de FTP (por ejemplo, ftp://login:password@example.org/my_directory/my_dataset).
fr: Dans le champ **Saisir une URL**, saisissez l'URL du serveur FTP sur lequel les fichiers sont stockés. L'URL doit contenir l'identifiant et le mot de passe du FTP (par exemple, ftp://login:password@example.org/my_directory/my_dataset).
nl: Schrijf in het vakje **Voer een URL in** de URL van de FTP-server waar de bestanden zijn opgeslagen. De URL moet zowel de login als het wachtwoord naar de FTP bevatten (bijv. ftp://login:password@example.org/my_directory/my_dataset).

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: FTPS servers are also supported for this method (for example, `ftps://login:password@example.org/my_directory/my_dataset`).
de: FTPS-Server werden für diese Methode ebenfalls unterstützt (z.B. `ftps://login:password@example.org/my_directory/my_dataset`).
es: Los servidores FTPS también están permitidos para este método (por ejemplo, `ftps://login:password@example.org/my_directory/my_dataset`).
fr: Les serveurs FTPS sont également pris en charge pour cette méthode (par exemple, `ftps://login:password@example.org/my_directory/my_dataset`).
nl: Ook FTPS-servers worden voor deze methode ondersteund (bijv. `ftps://login:password@example.org/my_directory/my_dataset`).

source: When synchronizing from a remote FTP location, Opendatasoft keeps a persistent cache and does not automatically prune files missing from the remote directory. If you need some cleanup to be performed, to the right of the resource, click "Clean cache".
de: Beim Synchronisieren aus einem Remote-FTP-Standort behält Opendatasoft einen persistenten Cache bei und löscht fehlende Dateien nicht automatisch aus dem Remote-Verzeichnis. Falls Sie ein Cleanup durchführen möchten, klicken Sie rechts neben der Ressource auf "Cache bereinigen".
es: Al llevar a cabo la sincronización desde una ubicación FTP remota, Opendatasoft conserva una caché persistente y no elimina automáticamente los archivos que faltan en el directorio remoto. Si necesita realizar alguna limpieza, a la derecha del recurso, haga clic en "Limpiar la caché".
fr: Lors de la synchronisation depuis un emplacement FTP distant, Opendatasoft conserve un cache persistant et ne nettoie pas automatiquement les fichiers absents du répertoire distant. Pour tout besoin de nettoyage, cliquez sur "Nettoyer le cache" à droite de la ressource.
nl: Wanneer er gesynchroniseerd wordt vanuit een FTP-locatie op afstand, behoudt Opendatasoft een persistente cache en snoeit het niet automatisch ontbrekende bestanden uit de directory op afstand. Indien u wil dat er een opkuis wordt uitgevoerd klik dan rechts van de bron op "Cache verwijderen".

source: TThis method consists of adding several files at the same time via an archive file, creating a single source for all the added files. In that case, because only one source is created for all the files, those have to have the same format (see :doc:`Supported formats</publishing_data/01_creating_a_dataset/supported_formats>`).
es: Este método consiste en añadir varios archivos al mismo tiempo a través de un archivo archivador, creando un único origen para todos los archivos añadidos. En ese caso, como tan solo se crea un origen para todos los archivos, el formato siempre debe ser el mismo (consulte :doc:`Formatos permitidos</publishing_data/01_creating_a_dataset/supported_formats>`).
fr: Cette méthode consiste à ajouter plusieurs fichiers en même temps via un fichier d'archive, de façon à créer une source unique pour tous les fichiers ajoutés. Dans cette situation, étant donné qu'une seule source est créée pour l'ensemble des fichiers, ceux-ci doivent tous avoir le même format (voir :doc:`Formats pris en charge</publishing_data/01_creating_a_dataset/supported_formats>`).
nl: Deze methode bestaat uit het tezelfdertijd toevoegen van verschillende bestanden via een archiefbestand, het aanmaken van éénzelfde bron voor alle toegevoegde bestanden. In dit geval moeten deze hetzelfde formaat hebben (zie :doc:`Ondersteunde formaten</publishing_data/01_creating_a_dataset/supported_formats>`).

source: There are 3 methods to add multiple files into a dataset: by adding them one by one, or by adding multiple files at the same time either through an archive file or via an FTP server.
it: Per aggiungere più file a un dataset è possibile procedere in 3 modi: aggiungere i file singolarmente, aggiungerli tutti insieme mediante un file di archivio o utilizzare un server FTP.

source: Repeat the procedure from step 3 as many times as you need, until all your files have been added into the new dataset.
it: Ripeti la procedura dal punto 3 per l'aggiunta di ogni file al nuovo dataset.

source: Create an archive file (see :ref:`Supported compressed file formats<supportedcompressedformats>`) with the files to add in the same dataset.
it: Crea un file di archivio (vedere :ref:`Formati di file compressi supportati<supportedcompressedformats>`) con i file da aggiungere allo stesso dataset.

source: To source a shapefile (containing file formats such as .shp, .dbf and .prj), create an archive file with all the needed files inside and follow the procedure above.
it: Per aggiungere uno shapefile (contenente file in formati quali .shp, .dbf e .prj), crea un file di archivio con tutti i file desiderati e procedi come indicato sopra.

source: This method consists in connecting the platform to the directory of an FTP server (e.g. ftp://example.org/my_dir/) to retrieve all the files contained in this directory.
it: Per utilizzare questo metodo è necessario collegare la piattaforma alla directory di un server FTP (ad es. ftp://esempio.org/mia_dir/), in modo da recuperare tutti i file che vi sono contenuti.
