Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/creating_dataset_with_images.po
Languages: de, es, fr, nl

source: The CSV file must at least contain a column with the names of the media files. It can contain other columns that will be considered as additional fields.
de: Die CSV-Datei muss mindestens eine Spalte mit den Namen der Mediendateien enthalten. Sie kann weitere Spalten enthalten, die als zusätzliche Felder betrachtet werden.
fr: Le fichier CSV doit avoir une colonne contenant les noms des fichiers média ; les autres colonnes sont considérées comme des champs supplémentaires.

source: Example of a CSV file to create a dataset with media files:
de: Beispiel für eine CSV-Datei zur Erstellung eines Datensatzes mit Mediendateien:
fr: Exemple d'un fichier CSV pour créer un jeu de données avec des fichiers média :

source: Media 1
de: Medium 1
fr: Média 1

source: Media 2
de: Medium 2
fr: Média 2

source: Media 3
de: Medium 3
fr: Média 3

source: Media 4
de: Medium 4
fr: Média 4

source: Step 3: Sourcing the archive file
de: 3. Schritt: Die Archivdatei hinzufügen
fr: Étape 3 : collecter le fichier d'archive

source: You can use the archive file you created as a source and upload it to the platform.
de: Sie können die von Ihnen erstellte Archivdatei als Quelle verwenden und auf die Plattform hochladen.
fr: Vous pouvez utiliser le fichier d'archive créé en tant que source et le charger dans la plateforme.

source: In **Catalog** > **Datasets**, click on the **New dataset** button.
de: Klicken Sie unter **Katalog** > **Datensätze** auf den Button **Neuer Datensatz**.
fr: Dans **Catalogue** > **Jeux de données**, cliquez sur le bouton **Nouveau jeu de données**.

source: In the wizard that opens, select **From my computer** under the **Retrieve a file** section.
de: Wählen Sie in dem sich öffnenden Assistenten **Von meinem Computer** unter dem Abschnitt **Datei abrufen**.
fr: Sélectionnez **À partir de mon ordinateur** dans l'assistant qui s'ouvre, sous la section **Récupérer un fichier**.

source: Either drop the archive file or click **Browse** to locate the archive file in your local filesystem.
de: Legen Sie die Archivdatei entweder per Drag & Drop ab oder klicken Sie auf **Durchsuchen**, um die Archivdatei in Ihrem lokalen Dateisystem zu suchen.
fr: Déposez le fichier d'archive ou cliquez sur **Consulter** pour localiser le fichier d'archive dans votre système de fichiers local.

source: From the preview of the first 20 records that opens, configure the source.
de: Konfigurieren Sie die Quelle über die Vorschau der ersten 20 Einträge, die angezeigt wird.
fr: Configurez la source dans l'aperçu des 20 premiers enregistrements qui s'affiche.

source: Configure the dataset information or use the pre-filled values.
de: Konfigurieren Sie die Datensatzinformationen oder verwenden Sie die vorausgefüllten Werte.
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies.

source: Sourcing media files via URLs
de: Mediendateien über URLs hinzufügen
fr: Collecter des fichiers média via des URL

source: This method consists of sourcing any :ref:`supportedformats` file containing URLs of media files stored in a remote server and using a processor to define the media files and extract their metadata.
de: Bei dieser Methode werden Dateien aller :ref:`supportedformats` eingespeist, die URLs von Mediendateien enthalten, die auf einem Remote-Server gespeichert sind. Unter Einsatz eines Prozessors werden die Mediendateien festgelegt und ihre Metadaten extrahiert.
fr: Cette méthode consiste à collecter des fichiers :ref:`supportedformats` contenant des URL de fichiers média stockés sur un serveur distant, ainsi qu'à utiliser un processeur pour définir les fichiers média et extraire leurs métadonnées.

source: For this method, Opendatasoft supports the HTTP protocol and its secured version HTTPS. Both should link to a single file.
de: Opendatasoft unterstützt für diese Vorgehensweise das HTTP-Protokoll und die abgesicherte Version HTTPS, beide mit einem Link zu einer Einzeldatei.
fr: Pour cette méthode, Opendatasoft prend en charge le protocole HTTP et sa version sécurisée HTTPS, qui permettent d'accéder à un fichier unique.

source: Step 1: Create a dataset
de: 1. Schritt: Datensatz erstellen
fr: Étape 1 : créer un jeu de données

source: In the wizard that opens, select the desired method under the **Retrieve a file** section.
de: Wählen Sie in dem sich öffnenden Assistenten unter dem Abschnitt **Datei abrufen** die gewünschte Methode aus.
fr: Sélectionnez la méthode souhaitée dans l'assistant qui s'ouvre, sous la section **Récupérer un fichier**.

source: From the preview of the first 20 records that appears, configure the source.
de: Konfigurieren Sie die Quelle über die Vorschau der ersten 20 Datensätze, die angezeigt wird.
fr: Configurez la source dans l'aperçu des 20 premiers enregistrements qui s'affiche.

source: Step 2: Process the URLs
de: 2, Schritt: URLs verarbeiten
fr: Étape 2 : traiter les URL

source: Choose the File processor in the Generic operations section.
de: Wählen Sie den Dateiprozessor im Bereich "Generische Operationen".
fr: Sélectionnez le processeur de fichiers dans la section Traitements génériques.

source: *(optional)* In the File processor area, select the **Extract metadata** check box to import the related metadata of the images.
de: *(optional)* Im Bereich des Dateiprozessors können Sie das Feld **Metadaten extrahieren** auswählen, um die zu den Bildern gehörenden Metadaten zu importieren.
fr: *(optionnel)* Toujours dans la section du processeur de fichiers, cochez la case **Extraire des métadonnées** pour importer les métadonnées associées aux images.

source: Example of a CSV file used to create a dataset with media files:
de: Beispiel einer CSV-Datei, die zur Erstellung eines Datensatzes mit Mediendateien verwendet wird:
fr: Exemple d'un fichier CSV utilisé pour créer un jeu de données avec des fichiers média :

source: through the default **Images** visualization tab: an image gallery displaying all the images and their metadata, or
de: über die Registerkarte **Bilder**: eine Bildergalerie, in der alle Bilder und Metadaten zu sehen sind, oder
fr: via l'onglet de visualisation **Images** par défaut : une galerie d'images présentant toutes les images et les métadonnées associées ou

source: through a slideshow, which is `an Opendatasoft widget <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsSlideshow>`_ you can add in any code area of the platform. For example, you can add it in the Custom view of the dataset or in a content page. In that case, images are displayed one by one.
de: mit einer Diashow. Dies ist "ein Opendatasoft-Widget <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsSlideshow>", das in jedem Code-Bereich der Plattform hinzugefügt werden kann. Zum Beispiel in der benutzerdefinierten Ansicht des Datensatzes oder in einer Inhaltsseite. In diesem Fall werden die Bilder einzeln angezeigt.
fr: via un diaporama, `un widget Opendatasoft <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsSlideshow>`_ que vous pouvez ajouter dans n'importe quelle section de code de la plateforme. Par exemple, vous pouvez l'intégrer à la vue personnalisée du jeu de données ou à une page de contenu ; dans ce cas, les images sont affichées une par une.
