Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/creating_a_dataset.po
Languages: de, es, fr, nl

source: Creating a dataset
de: Einen Datensatz erstellen
es: Crear un conjunto de datos
fr: Créer un jeu de données
nl: Een dataset aanmaken

source: Creating a dataset involves the following steps:
de: Die Erstellung eines Datensatzes umfasst die folgenden Schritte:
es: Para crear un conjunto de datos, debe seguir estos pasos:
fr: La création d'un jeu de données implique les étapes suivantes :
nl: Het aanmaken van een dataset houdt de volgende stappen in:

source: Step 1: Adding a source
de: 1, Schritt: Eine Quelle hinzufügen
es: Paso 1: Añadir un origen
fr: Étape 1 : ajouter une source
nl: Stap 1: Een bron toevoegen

source: When you create a dataset, you start with adding a source.
de: Wenn Sie ein Datensatz erstellen, fügen Sie zunächst eine Quelle hinzu.
es: Al crear un conjunto de datos, empieza añadiendo un origen.
fr: Lorsque vous créez un jeu de données, vous commencez par ajouter une source.
nl: Wanneer u een dataset aanmaakt, begint u met het toevoegen van een bron.

source: You can add a source to a dataset in the following ways:
de: Sie können einem Datensatz auf folgende Weise eine Quelle hinzufügen:
es: Puede añadir un origen a un conjunto de datos de estos modos:
fr: Vous pouvez ajouter une source à un jeu de données des façons suivantes :
nl: U kunt op de volgende manieren een bron toevoegen aan een dataset:

source: Step 2. Configuring the connection to the source
de: 2. Schritt: Die Verbindung zu Ihrer Quelle konfigurieren
es: Paso 2. Configurar la conexión con el origen
fr: Étape 2 : configurer la connexion à la source
nl: Stap 2: De verbinding naar de bron configureren

source: To retrieve data from your source, you must establish the connection between this source and the Opendatasoft platform. For FTP, Google Drive, HTTP, and SharePoint, you can configure and save a new connection or reuse a saved connection.
de: Um Daten von Ihrer Quelle abzurufen, müssen Sie die Verbindung zwischen dieser Quelle und der Opendatasoft-Plattform herstellen. Für FTP, Google Drive, HTTP und SharePoint können Sie eine neue Verbindung konfigurieren und speichern oder eine gespeicherte Verbindung aufrufen.
es: Para recuperar datos del origen, debe establecer la conexión entre este origen y la plataforma Opendatasoft. Para FTP, Google Drive, HTTP y SharePoint, puede configurar y guardar una nueva conexión o reutilizar una conexión guardada.
fr: Pour récupérer des données à partir de votre source, vous devez établir la connexion entre cette source et la plateforme Opendatasoft. Pour FTP, Google Drive, HTTP et SharePoint, vous pouvez configurer et enregistrer une nouvelle connexion ou réutiliser une connexion sauvegardée.
nl: Om gegevens van uw bron op te halen, moet u de verbinding maken tussen deze bron het het Opendatasoft-platform. Voor FTP, Google Drive, HTTP en SharePoint kunt u een nieuwe verbinding configureren en opslaan of een opgeslagen verbinding hergebruiken.

source: Step 3: Configuring the source to make sure your data look good
de: 3. Schritt: Die Quelle konfigurieren, um sicherzustellen, dass Ihre Daten gut aussehen
es: Paso 3: Configurar el origen para asegurarse de la correcta visualización de los datos
fr: Étape 3 : configurer la source pour garantir un affichage correct de vos données
nl: Stap 3: De bron configureren om er zeker van te zijn dat uw gegevens er goed uitzien

source: From the preview, you can configure your source.
de: In der Vorschau können Sie Ihre Quelle konfigurieren.
es: En la vista previa, puede configurar el origen.
fr: Vous pouvez configurer votre source depuis l'aperçu.
nl: Vanuit de voorbeeldweergave kunt u uw bron configureren.

source: For more information about the sources you can connect to and their configuration, see :ref:`supportedformats` and :ref:`connectors_remote_services`.
de: Weitere Informationen über die Quellen, zu denen Sie eine Verbindung herstellen können, und deren Konfiguration finden Sie unter :ref:`supportedformats` und :ref:`connectors_remote_services`.
es: Para obtener más información sobre los orígenes con que puede conectar y su configuración, consulte :ref:`supportedformats` y :ref:`connectors_remote_services`.
fr: Pour plus d'informations sur les sources auxquelles vous pouvez vous connecter et leur configuration, consultez :ref:`supportedformats` et :ref:`connectors_remote_services`.
nl: Voor meer informatie over de bronnen die u kunt verbinden en over het configureren ervan, zie :ref:`supportedformats` and :ref:`connectors_remote_services`.

source: Step 4: Configuring the dataset standard metadata and access rights
de: 4. Schritt: Die Standard-Metadaten und Zugriffsrechte für den Datensatz konfigurieren
es: Paso 4: Configurar los metadatos estándar y derechos de acceso del conjunto de datos
fr: Étape 4 : configurer les droits d'accès et métadonnées standards du jeu de données
nl: Stap 4: De standaard metadata van de dataset en de toegangsrechten configureren

source: From the **Dataset information** screen, you can configure the dataset title and technical identifier to keep or edit the default values. You can also set up the dataset access rights.
de: Auf dem Bildschirm **Datensatzinformationen** können Sie den Datensatztitel und die technische Kennung so konfigurieren, dass die Standardwerte beibehalten oder bearbeitet werden. Sie können auch die Zugriffsrechte für den Datensatz einrichten.
es: En la pantalla **Información de conjunto de datos**, puede configurar el título del conjunto de datos y el identificador técnico para conservar o editar los valores predeterminados. También puede configurar los derechos de acceso del conjunto de datos.
fr: Depuis l'écran **Informations du jeu de données**, vous pouvez configurer l'identifiant technique et le titre du jeu de données pour conserver ou modifier les valeurs par défaut. Par ailleurs, vous pouvez configurer les droits d'accès au jeu de données.
nl: Vanuit het scherm **Informatie over de dataset** kunt u de titel en de technische identifier van de dataset configureren om de standaard waarden te behouden of te bewerken. U kunt ook de toegangsrechten tot de dataset instellen.

source: After you create a dataset, you can add a new source, or edit an existing source and its connection using the **Sources** tab of the desired dataset.
de: Nachdem Sie einen Datensatz erstellt haben, können Sie in der Registerkarte **Quellen** des gewünschten Datensatzes eine neue Quelle hinzufügen oder eine vorhandene Quelle und ihre Verbindung bearbeiten.
es: Después de crear un conjunto de datos, puede añadir un origen nuevo o editar un origen existente y su conexión por medio de la ficha **Orígenes** del conjunto de datos deseado.
fr: Après la création d'un jeu de données, vous pouvez ajouter une source ou modifier une source existante et sa connexion via l'onglet **Sources** du jeu de données souhaité.
nl: Nadat u een dataset hebt aangemaakt, kunt u een nieuwe bron toevoegen of een bestaande bron en de verbinding ermee bewerken via het tabblad **Bronnen** van de gewenste dataset.
