Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/creating_dataset_with_images.po
Languages: de, es, fr, nl

source: Creating a dataset with media files
de: Erstellen eines Datensatzes mit Mediendateien
es: Crear un conjunto de datos con archivos multimedia
fr: Créer un jeu de données avec des fichiers média
nl: Een dataset aanmaken met mediabestanden

source: It is possible to source the following media files into the platform:
de: Es ist möglich, die folgenden Mediendateien auf die Plattform zu laden:
es: Es posible añadir los siguientes archivos multimedia a la plataforma:
fr: Il est possible de collecter les fichiers média suivants sur la plateforme :
nl: Het is mogelijk de volgende mediabestanden in het platform te sourcen:

source: Images (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg)
de: Bilder (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg)
es: Imágenes (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg)
nl: Afbeeldingen (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg)

source: PDF files (.pdf)
de: PDF-Dateien (.pdf)
es: Archivos PDF (.pdf)
fr: fichiers PDF (.pdf) ;
nl: PDF-bestanden (.pdf)

source: GTFS files (.gtfs)
es: Archivos GTFS (.gtfs)
nl: GTFS-bestanden (.gtfs)

source: All formats considered as images by the platform will be imported as such. It means that a thumbnail will be generated for these formats, activating the Images visualization. The other types of files can also be added into a dataset, however no thumbnail will be generated and the Images visualization will not be available. Users will only be able to download these files.
es: Todos los formatos considerados imágenes por la plataforma se importarán como tal. Esto significa que se generará una miniatura para estos formatos y se activará la visualización de las imágenes. Los demás tipos de archivos también se pueden añadir a un conjunto de datos, aunque no se generará ninguna miniatura y no estará disponible la visualización de las imágenes. Los usuarios solo podrán descargar estos archivos.
nl: Alle formaten die door het platform beschouwd worden als afbeeldingen zullen als dusdanig worden geïmporteerd. Dit betekent dat er voor deze formaten een thumbnail wordt gegenereerd die de visualisatie van de afbeeldingen activeert. Er kunnen ook andere types bestanden toegevoegd worden in een dataset. Wel zal er geen thumbnail worden gegenereerd en zal de visualisatie van de afbeeldingen niet beschikbaar zijn. Gebruikers zullen deze bestanden enkel kunnen downloaden.

source: There are 2 different methods to source media files and add them into a dataset: with an archive file or via a URL.
es: Existen 2 métodos para añadir archivos multimedia a un conjunto de datos: con un archivo archivador o a través de una dirección URL.
nl: Er zijn 2 verschillende methodes om mediabestanden te sourcen en deze toe te voegen in een dataset: met een archiefbestand of via een URL.

source: Sourcing media files with an archive file
de: Mediendateien mit einem Archiv hinzufügen.
es: Añadir archivos multimedia con un archivo archivador
fr: Collecte de fichiers média avec un fichier d'archive
nl: Mediabestanden sourcen met een archiefbestand

source: This method consists in building an archive file (see :ref:`Supported compressed file formats<supportedcompressedformats>`) with the media files, and then to import it into the platform.
es: Este método consiste en crear un archivo archivador (consulte :ref:`Formatos de archivos comprimidos permitidos<supportedcompressedformats>`) con los archivos multimedia e importarlo en la plataforma.
nl: Deze methode bestaat erin dat een archiefbestand wordt gebouwd (zie :ref:`Supported compressed file formats<supportedcompressedformats>`) met de mediabestanden en dit vervolgens wordt geïmporteerd in het platform.

source: Building the archive file
es: Crear el archivo archivador
nl: Het archiefbestand bouwen

source: The archive file must contain:
de: Die Archivdatei muss Folgendes enthalten:
es: El archivo archivador debe contener:
fr: Le fichier d'archive doit contenir :
nl: Het archiefbestand moet het volgende bevatten:

source: the media files,
es: los archivos multimedia
nl: de mediabestanden,

source: and a CSV file listing the media files and their metadata
es: y un archivo CSV con una lista de los archivos multimedia y sus metadatos
nl: en een CSV-bestand waarin de mediabestanden en hun metadata zijn opgelijst

source: No matter what the format of the media files is, both these media files and CSV file must be zipped together. For instance, if the media files are already zipped files, they must be zipped again altogether with the CSV file.
es: Independientemente del formato de los archivos multimedia, tanto estos archivos multimedia como el archivo CSV deben comprimirse juntos. Por ejemplo, si los archivos multimedia ya son archivos comprimidos, deben volver a comprimirse junto con el archivo CSV.
nl: Ongeacht het formaat van de mediabestanden, moeten zowel deze mediabestanden als het CSV-bestand samen worden gezipt. Bijvoorbeeld, wanneer de mediabestanden al gezipte bestanden zijn, moeten ze opnieuw samen worden gezipt met het CSV-bestand.

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet

source: We recommend to keep all images at the same level into the archive file. However, if images are into subdirectories, keep in mind to write the whole path in the CSV file.
es: Recomendamos conservar todas las imágenes en el mismo nivel dentro del archivo archivador. Sin embargo, si hay imágenes en subdirectorios, recuerde escribir la ruta completa en el archivo CSV.
nl: We raden aan om alle afbeeldingen op hetzelfde niveau te bewaren in het archiefbestand. Wanneer afbeeldingen echter in submappen staan, denk er dan aan om het volledige pad in het CSV-bestand te schrijven.

source: There must be only one CSV file, and it must only be in a CSV format.
es: Solo puede haber un archivo CSV, y solo puede tener el formato CSV.
nl: Er mag slechts één CSV-bestand zijn en dit mag enkel in een CSV-formaat staan.

source: Creating the CSV file of the archive file
es: Crear el archivo CSV del archivo archivador
nl: Een CSV-bestand van het archiefbestand aanmaken

source: The CSV file must at least contain a column with the names of the media files. It can contain other columns, that will be considered as additional fields.
es: El archivo CSV debe contener como mínimo una columna con los nombres de los archivos multimedia. Puede contener otras columnas, que se considerarán campos adicionales.
nl: Het CSV-bestand moet minstens een kolom bevatten met de namen van de mediabestanden. Er kunnen ook andere kolommen instaan. Deze zullen dan beschouwd worden als extra velden.

source: Example:
es: Ejemplo:
nl: Voorbeeld:

source: CSV file to create a dataset with media files:
es: Archivo CSV para crear un conjunto de datos con archivos multimedia:
nl: CSV-bestand om een dataset aan te maken met mediabestanden:

source: Caption
de: Beschriftung
fr: Légende
nl: Opschrift

source: Title
de: Titel
fr: Titre
nl: Titel

source: File
de: Datei
fr: Fichier
nl: Bestand

source: Caption of PNG file
de: Beschriftung der PNG-Datei
fr: Légende du fichier PNG
nl: Opschrift van PNG-bestand

source: Caption of PDF file
de: Beschriftung der PDF-Datei
fr: Légende du fichier PDF
nl: Opschrift van PDF-bestand

source: Caption of ZIP file
de: Beschriftung der ZIP-Datei
fr: Légende du fichier ZIP
nl: Opschrift van ZIP-bestand

source: Caption of SVG file
de: Beschriftung der SVG-Datei
fr: Légende du fichier SVG
nl: Opschrift van SVG-bestand

source: In this example:
de: In diesem Beispiel:
es: En este ejemplo:
fr: Dans cet exemple :
nl: In dit voorbeeld:

source: the column "File" indicates the names of the media files
de: Die Spalte "Datei" gibt die Namen der Mediendateien an
es: La columna "File" indica los nombres de los archivos multimedia.
fr: la colonne "Fichier" spécifie le nom des fichiers média ;
nl: de kolom "Bestand" verwijst naar de namen van de mediabestanden

source: the columns "Title" and "Caption" are additional fields
de: Die Spalten "Titel" und "Beschriftung" sind zusätzliche Felder
es: Las columnas "Title" y "Caption" son campos adicionales.
fr: les colonnes "Titre" et "Légende" sont des champs supplémentaires.
nl: de kolommen "Titel" en "Opschrift" zijn extra velden

source: Sourcing the archive file
es: Añadir el archivo archivador
nl: Het archiefbestand sourcen

source: Once the archive file is created, it can be imported into the platform.
es: Una vez creado el archivo archivador, se puede importar en la plataforma.
nl: Eenmaal het archiefbestand is aangemaakt, kan het in het platform worden geïmporteerd.

source: In Catalog > Datasets, click on the **New dataset** button.
es: En Catálogo > Conjuntos de datos, haga clic en el botón **Conjunto de datos nuevo**.
nl: Klik in Catalogus > Datasets op de knop **Nieuwe dataset**.

source: Click on the **Add a source** button.
es: Haga clic en el botón **Añadir un origen**.
nl: Klik op de knop **Een bron toevoegen**.

source: Click on the **Upload a file** button.
es: Haga clic en el botón **Cargar un archivo**.
nl: Klik op de knop **Een bestand uploaden**.

source: Choose the archive file you created, with your media files inside.
es: Elija el archivo archivador que ha creado, con los archivos multimedia en su interior.
nl: Kies het archiefbestand dat u heeft aangemaakt en waar uw mediabestanden in zitten.

source: Click on the **Open** button of the file selection window.
es: Haga clic en el botón **Abrir** de la ventana de selección de archivos.
nl: Klik op de knop **Openen** in het venster waar bestanden kunnen worden geselecteerd.

source: Sourcing media files via a URL
es: Añadir archivos multimedia a través de una dirección URL
nl: Mediabestanden via een URL sourcen

source: This method consists in sourcing any :doc:`supported format <supported_formats>` file, containing URLs of media files stored in a remote server, and using a processor to define the media files and extract their metadata.
es: Este método consiste en añadir cualesquiera archivos de los :doc:`formatos permitidos <supported_formats>`, que contienen las direcciones URL de los archivos multimedia almacenados en un servidor remoto, y utilizar un procesador para definir los archivos multimedia y extraer sus metadatos.
nl: Deze methode bestaat uit het sourcen van een bestand in om het even welk :doc:`supported format <supported_formats>`. Het bevat de URL's van mediabestanden die zijn opgeslagen op een server op afstand en waarbij een processor wordt gebruikt om de mediabestanden te definiëren en hun metadata te extraheren.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: For this method, OpenDataSoft supports the following protocols: http, and its secured version https. Both should link to a single file.
es: Para este método, OpenDataSoft admite los protocolos siguientes: http y su versión protegida https. Ambos deben establecer un vínculo con un archivo individual.
nl: Voor deze methode ondersteunt OpenDataSoft de volgende protocols: http, en de beveiligde versie https ervan. Beide verwijzen naar één enkel bestand.

source: Click on either **Upload a file** or **Enter a URL** to source the file. Any sourcing method works.
es: Haga clic en **Cargar un archivo** o **Especificar una dirección URL** para añadir el archivo. Sirve cualquier método de adición.
nl: Klik op **Upload een bestand** of **Voer een URL in** om het bestand te sourcen. Elke sourcingmethode werkt.

source: Once the dataset is created, click on the **Processing** tab.
de: Sobald der Datensatz erstellt wurde, klicken Sie auf den Tab **Verarbeiten**.
es: Una vez creado el conjunto de datos, haga clic en la ficha **Procesadores**.
fr: Une fois le jeu de données créé, cliquez sur l'onglet **Traitement**.
nl: Eenmaal de dataset is aangemaakt, klikt u op de tab **Verwerken**.

source: Click on the **Add a processor** button.
de: Klicken Sie auf den Button **Einen Prozessor hinzufügen**.
es: Haga clic en el botón **Añadir un procesador**.
fr: Cliquez sur le bouton **Ajouter un processeur**.
nl: Klik op de knop **Een processor toevoegen**.

source: Choose the File processor, in the Generic operations section.
es: En la sección Operaciones genéricas, seleccione el procesador Archivo.
nl: Kies de bestandprocessor in de sectie Generische operaties.

source: In the File processor area, indicate which field contains the URLs of the media files.
de: Wählen Sie im Bereich des Dateiprozessors das Feld, das die Mediendateien enthält.
es: En el área del procesador Archivo, indique qué campo contiene las direcciones URL de los archivos multimedia.
fr: Dans la section du processeur de fichiers, indiquez quel champ contient les URL des fichiers média.
nl: In de ruimte Bestandprocessor geef aan welk veld de URL's van de mediabestanden bevat.

source: *(optional)* Still in the File processor area, tick the **Extract metadata** box to import the related metadata of the images.
es: *(opcional)* En la misma área del procesador Archivo, marque la casilla **Extraer metadatos** para importar los metadatos de las imágenes correspondientes.
nl: *(optioneel)* Nog steeds in de ruimte Bestandprocessor, vink het vakje **Extraheer metadata** aan om de aanverwante metadata van de afbeeldingen te importeren.

source: the column "File" indicates the URL of the media files (which is also the column that will be used with the File processor)
de: Die Spalte "Datei" gibt die URL der Mediendateien an (diese Spalte wird auch mit dem Dateiprozessor verwendet).
es: La columna "File" indica la dirección URL de los archivos multimedia (que también es la columna que se usará con el procesador Archivo).
fr: la colonne "Fichier" indique l'URL des fichiers média (qui est également la colonne qui sera utilisée avec le processeur de fichiers)
nl: in de kolom "Bestand" staat de URL van de mediabestanden (dit is ook de kolom die gebruikt wordt voor de Bestandprocessor)

source: Displaying images
de: Bilder anzeigen
es: Visualizar imágenes
fr: Affichage des images
nl: Afbeeldingen weergeven

source: Once the images are imported into the platform, they can be displayed in 2 different ways:
de: Nachdem die Bilder in die Plattform importiert wurden, können sie auf zwei verschiedene Arten angezeigt werden:
es: Una vez importadas las imágenes en la plataforma, se pueden visualizar de 2 formas:
fr: Une fois les images importées dans la plateforme, elles peuvent être affichées de deux façons différentes :
nl: Eenmaal de afbeeldingen in het platform zijn geïmporteerd, kunnen ze op 2 verschillende manieren worden weergegeven:

source: through the default Images visualization tab: an image gallery displaying all the images and their metadata
es: por medio de la pestaña de visualización de imágenes: una galería de imágenes que muestra todas las imágenes y sus metadatos;
nl: via de visualisatietab voor standaard afbeeldingen: een afbeeldingengalerij waarin alle afbeeldingen en de metadata ervan worden weergegeven

source: through a slideshow, which is `an OpenDataSoft widget <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSlideshow>`_ that can be added in any code area of the platform (e.g. in the Custom view of the dataset or in a content page): in that case, images are displayed one by one
es: a través de una presentación, que es `un widget de OpenDataSoft <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSlideshow>`_ que se puede añadir en cualquier área de código de la plataforma (p. ej. en la vista personalizada del conjunto de datos o en una página de contenido): En ese caso, las imágenes se visualizan una a una.
nl: via een diavoorstelling, die `een OpenDataSoft widget <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSlideshow>`_ is die in elke coderuimte van het platform kan worden toegevoegd (bijv. in de Custom weergave van de dataset of in een contentpagina): in dat geval worden de afbeeldingen één voor één weergegeven

source: Exporting and downloading images
es: Exportar y descargar imágenes
nl: Afbeeldingen exporteren en downloaden

source: Images imported into the platform can only be downloaded or exported one by one. There is no way to download all the images of a dataset at the same time.
es: Las imágenes importadas en la plataforma solo se pueden descargar o exportar una a una. No existe la posibilidad de descargar todas las imágenes de un conjunto de datos de manera simultánea.
nl: Afbeeldingen die in het platform zijn geïmporteerd, kunnen enkel één voor één worden gedownload of geëxporteerd. Het is niet mogelijk om alle afbeeldingen van een dataset op hetzelfde ogenblik te downloaden.

source: Downloading an image
es: Descargar una imagen
nl: Een afbeelding downloaden

source: In the front office, go to the **Images** visualization tab of the dataset containing the image(s) to download.
es: En el front office, vaya a la ficha de visualización **Imágenes** del conjunto de datos que contiene las imágenes que se descargarán.
nl: Ga in de front office naar de visualisatietab **Afbeeldingen** van de dataset die de afbeeldingen bevat die moeten worden gedownload.

source: Click on the image to download.
es: Haga clic en la imagen para descargar.
nl: Klik op de afbeelding die moet worden gedownload.

source: At the end on the image's metadata, click on the **Download image** button.
es: Al final de los metadatos de la imagen, haga clic en el botón **Descargar imagen**.
nl: Klik op het einde van de metadata van de afbeelding op de knop **Afbeelding downloaden**.

source: Exporting dataset to retrieve image URL
es: Exportar un conjunto de datos para recuperar una dirección URL de imagen
nl: Dataset exporteren om URL van de afbeelding terug te vinden

source: In the front office, go the **Export** tab of the dataset containing the image(s) to export.
es: En el front office, vaya a la ficha **Exportar** del conjunto de datos que contiene las imágenes que se exportarán.
nl: Ga in de front office naar de tab **Export** van de dataset die de afbeeldingen bevat die moeten worden geëxporteerd.

source: Export the whole dataset, or part of it if it's filtered.
es: Exporte el conjunto de datos completo, o una parte del mismo si está filtrado.
nl: Exporteer de volledige dataset of een deel ervan wanneer deze is gefilterd.

source: Open the exported dataset in the spreadsheet software of your choice.
es: Abra el conjunto de datos exportado en el software de hojas de cálculo que desee.
nl: Open de geëxporteerde dataset in de spreadsheet software van uw keuze.

source: Find the field containing the URLs of the image and retrieve them.
es: Busque el campo que contiene las direcciones URL de la imagen y recupérelas.
nl: Vind het veld terug dat de URL's van de afbeelding bevat en haal deze op.

source: GTFS files (.zip)
de: GTFS-Dateien (.zip)
fr: fichiers GTFS (.zip)

source: You can create a source with media files and add them to a dataset with an archive file or via a URL.
de: Sie können eine Quelle mit Mediendateien erstellen und diese mit einer Archivdatei oder über eine URL zu einem Datensatz hinzufügen.
fr: Vous pouvez créer une source avec des fichiers média et les ajouter à un jeu de données avec un fichier d'archive ou via une URL.

source: Important
de: Wichtig

source: All formats considered images by the platform will be imported as such. It means that a thumbnail will be generated for these formats, activating the **Images** visualization. For more, information see :doc:`Configuring the Images visualization</publishing_data/07_configuring_visualizations/04_configuring_image_view/image>`.
de: Alle Formate, die von der Plattform als Bilder erkannt werden, werden als solche hochgeladen. Das bedeutet, dass eine Miniaturansicht für diese Formate erzeugt wird, was die Visualisierung der **Bilder** aktiviert (Weitere Informationen finden Sie unter :doc:`Konfigurieren der Bildvisualisierung</publishing_data/07_configuring_visualizations/04_configuring_image_view/image>`).
fr: Tous les formats considérés comme étant des images par la plateforme seront importés comme tels. Cela signifie qu'une vignette sera générée pour ces formats, ce qui activera la visualisation **Images**. Pour plus d'informations, consultez :doc:`Configurer la visualisation images</publishing_data/07_configuring_visualizations/04_configuring_image_view/image>`.

source: For other formats, such as PDF and GTFS files, no thumbnail will be generated, and the **Images** visualization will not be available. Users will only be able to download these files.
de: Für andere Dateitypen, wie etwa PDF- oder GTFS-Dateien, wird keine Miniaturansicht erstellt und die Visualisierung **Bilder** ist nicht verfügbar. Die Benutzer können solche Dateien nur herunterladen.
fr: Pour les autres formats tels que les fichiers PDF et GTFS, aucune vignette ne sera générée et la visualisation **Images** sera donc indisponible. Les utilisateurs pourront uniquement télécharger ces fichiers.

source: This method consists of building an archive file with the media files and then importing it into the platform.
de: Bei dieser Methode wird eine Archivdatei mit den Mediendateien erstellt und anschließend in die Plattform importiert.
fr: Cette méthode consiste à créer un fichier d'archive avec les fichiers média, puis à l'importer dans la plateforme.

source: For more information about the compressed file formats supported, see :ref:`supportedcompressedformats`.
de: Weitere Informationen zu den unterstützten Dateiformaten finden Sie unter :ref:`supportedcompressedformats`.
fr: Pour plus d'informations sur les formats de fichiers compressés pris en charge, consultez :ref:`supportedcompressedformats`.

source: Step 1: Building the archive file
de: 1. Schritt: Aufbau der Archivdatei
fr: Étape 1 : créer le fichier d'archive

source: the media files, and
de: die Mediendateien und
fr: les fichiers média et

source: a CSV file listing the media files and their metadata.
de: eine CSV-Datei, die die Mediendateien und Metadaten auflistet.
fr: un fichier CSV répertoriant les fichiers média et les métadonnées associées.

source: No matter the format of the media files, they must be zipped together with the CSV file. For instance, if the media files are already zipped files, they must be zipped again altogether with the CSV file.
de: Unabhängig vom Format der Mediendateien müssen diese Mediendateien sowie die CSV-Datei zusammen gezippt werden. Wenn es sich bei den Mediendateien bereits um gezippte Dateien handelt, müssen sie zusammen mit der CSV-Datei erneut gezippt werden.
fr: Quel que soit le format des fichiers média, ces derniers et le fichier CSV doivent être compressés ensemble. Par exemple, si les fichiers média sont déjà des fichiers compressés, ils doivent une fois de plus être compressés avec le fichier CSV.

source: We recommend keeping all images at the same level in the archive file. However, if images are into subdirectories, keep in mind to write the whole path in the CSV file.
de: Wir empfehlen, dass sich alle Bilder im gleichen Bereich der Archivdatei befinden. Sollten sich dennoch Dateien in Unterverzeichnissen befinden, müssen Sie den vollständigen Pfad in der CSV-Datei schreiben.
fr: Nous vous recommandons de laisser toutes les images au même niveau dans le fichier d'archive. Toutefois, si les images se trouvent dans des sous-répertoires, gardez à l'esprit que vous devez saisir l'ensemble du chemin dans le fichier CSV.

source: Step 2: Creating the CSV file of the archive file
de: 2. Schritt: Die CSV-Datei der Archivdatei erstellen
fr: Étape 2 : créer le fichier CSV du fichier d'archive
