Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/dataset_limits.po
Languages: de, es, fr, nl

source: Dataset limits
de: Datensatz-Grenzen
es: Límites de conjuntos de datos
fr: Limites du jeu de données
nl: Datasetlimieten

source: The following limits apply to Opendatasoft datasets:
de: Für Opendatasoft-Datensätze gelten die folgenden Grenzen:
es: Los conjuntos de datos de Opendatasoft tienen los límites siguientes:
fr: Les limites suivantes s'appliquent aux jeux de données Opendatasoft :
nl: De volgende limieten zijn van toepassing op Opendatasoft-datasets:

source: Limit
de: Grenze
es: Límite
fr: Limite
nl: Limiet

source: Value
de: Wert
es: Valor
fr: Valeur
nl: Waarde

source: Notes
de: Hinweise
es: Notas
fr: Remarques
nl: Opmerkingen

source: Number of fields per dataset
de: Anzahl an Felder in einem Datensatz
es: Número de campos por conjunto de datos
fr: Nombre de champs par jeu de données
nl: Aantal velden per dataset

source: Number of fields per data type
de: Anzahl an Felder je Datentyp
es: Número de campos por tipo de datos
fr: Nombre de champs par type de données
nl: Aantal velden per datatype

source: 150 fields for ``text``
de: 150 Felder für ``text``
es: 150 campos para ``text``
fr: 150 champs pour ``text``
nl: 150 velden voor ``text``

source: 150 fields for ``double``
de: 150 Felder für ``double``
es: 150 campos para ``double``
fr: 150 champs pour ``double``
nl: 150 velden voor ``double``

source: 100 fields for ``integer``
de: 100 Felder für ``integer``
es: 100 campos para ``integer``
fr: 100 champs pour ``integer``
nl: 100 velden voor ``integer``

source: 100 fields for ``date``
de: 100 Felder für ``date``
es: 100 campos para ``date``
fr: 100 champs pour ``date``
nl: 100 velden voor ``date``

source: 50 fields for ``geo_shape``
de: 50 Felder für ``geo_shape``
es: 50 campos para ``geo_shape``
fr: 50 champs pour ``geo_shape``
nl: 50 velden voor ``geo_shape``

source: 50 fields for ``geo_point``
de: 50 Felder für ``geo_point``
es: 50 campos para ``geo_point``
fr: 50 champs pour ``geo_point``
nl: 50 velden voor ``geo_point``

source: A dataset can contain up to a total of 500 fields.
de: Ein Datensatz kann insgesamt bis zu 500 Felder enthalten.
es: Un conjunto de datos puede contener un total de 500 campos como máximo.
fr: Un jeu de données peut contenir 500 champs au total.
nl: Een dataset kan in totaal maximaal 500 velden bevatten.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: If you exceed those limits, please contact our `support team <mailto:support@opendatasoft.com>`_.
de: Wenn Sie diese Grenzen überschreiten, wenden Sie sich bitte an unser `Support-Team <mailto:support@opendatasoft.com>`_.
es: Si supera estos límites, póngase en contacto con el `equipo de soporte <mailto:support@opendatasoft.com>`_.
fr: Si vous dépassez ces limites, veuillez contacter notre `équipe de support <mailto:support@opendatasoft.com>`_.
nl: Indien u deze limieten overschrijdt, gelieve dan contact op te nemen met ons `support team <mailto:support@opendatasoft.com>`_.
