Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/federating_data.po
Languages: de, es, fr, it, nl

source: Federating data
de: Daten verbinden
es: Federar datos
fr: Fédérer des données
it: Federazione dei dati
nl: Data samenvoegen

source: Federation is a core feature of the data network we are building. Using it is a good way to enrich your own data and it also gives a new way for others to discover and reuse them.
de: Der Verbund ist eine Kernfunktion des Datennetzwerks, das wir aufbauen. Seine Verwendung ist ein guter Weg, Ihre eigenen Daten anzureichern. Zudem erschließt sie anderen eine neue Möglichkeit, sie zu entdecken und weiterzuverwenden.
fr: La fédération est une fonctionnalité clé du réseau de données que nous mettons en place. Son utilisation permet d'enrichir vos propres données, mais elle permet également à d'autres personnes de les détecter et de les réutiliser.
it: La federazione è una funzionalità fondamentale della rete di dati che stiamo creando. Se utilizzata correttamente, permette di arricchire i tuoi dati, favorendo la loro scoperta e il loro riutilizzo da parte di altri utenti.
nl: Federatie is een kernfunctie van het datanetwerk dat we bouwen. Het gebruiken ervan is een goede manier om uw eigen data te verrijken en het biedt anderen ook een nieuwe manier om deze te ontdekken en te hergebruiken.

source: Federation allows to redistribute, in full or in part, an open dataset from your domain (OpenDataSoft instance) or from another domain. It is a way to collect external sources of data on its own domain.
fr: La fédération permet la redistribution, intégrale ou partielle, d'un jeu de données ouvert depuis votre domaine (instance OpenDataSoft) ou depuis un autre domaine. Cela permet de collecter des sources de données externes sur son propre domaine.
it: Si tratta di un meccanismo che permette la ridistribuzione integrale o parziale di dataset aperti, a partire dal tuo dominio (istanza OpenDataSoft) o da un altro. È un modo per raccogliere origini di dati esterne sui rispettivi domini.
nl: Federatie laat toe om een open dataset vanuit uw eigen domein (OpenDataSoft-domein) of vanuit een ander domein volledig of gedeeltelijk te herverdelen. Het is een manier om externe databronnen in te zamelen op zijn eigen domein.

source: Source
de: Quelle
es: Origen
it: Origine
nl: Bron

source: To federate a dataset, simply go to the *Catalog > Dataset* page and hit **New dataset**. Then, hit the little arrow on the right side of the **Add a source** button.
de: Wechseln Sie zum Verbinden eines Datensatzes einfach zur Seite *Katalog > Datensatz* und wählen Sie **Neuer Datensatz**. Klicken Sie dann auf den kleinen Pfeil rechts von der Schaltfläche **Quelle hinzufügen**.
fr: Pour fédérer un jeu de données, rendez-vous simplement sur la page *Catalogue > Jeu de données* et cliquez sur **Nouveau jeu de données**. Cliquez ensuite sur la petite flèche située à droite du bouton **Ajouter une source**.
it: Per federare un dataset, apri la pagina *Catalogo > Dataset* e seleziona **Nuovo dataset**. Clicca quindi sulla freccia che si trova a destra del pulsante **Aggiungi un'origine**.
nl: Om een dataset te federeren, volstaat het om naar de pagina "Catalogus > Dataset" te gaan en te klikken op **Nieuwe dataset**. Klik vervolgens op het pijltje rechts van de knop **Voeg een bron toe**.

source: There is then a link **Add a dataset from the OpenDataSoft network**, it leads to a console from where it is possible to configure a new federated source.
fr: Un lien **Ajouter un jeu de données depuis le réseau OpenDataSoft** s'affiche alors, il mène à une console depuis laquelle vous pouvez configurer une nouvelle source fédérée.
it: Verrà visualizzato il link **Aggiungi un dataset dalla rete OpenDataSoft**, che apre una console da cui è possibile configurare una nuova origine federata.
nl: Daar staat een koppeling **Voeg een dataset toe vanuit het OpenDataSoft-netwerk**. Deze brengt u naar een console van waaruit het mogelijk is om een nieuw gefedereerde bron te configureren.

source: Click on **Select a source dataset**.
de: Klicken Sie auf **Quelldatensatz auswählen**.
es: Haga clic en **Seleccionar un conjunto de datos de origen**.
fr: Cliquez sur **Sélectionner un jeu de données source**.
it: Clicca su **Seleziona un dataset di origine**.
nl: Klik op **Selecteer een brondataset**.

source: Different sources are available :
de: Zur Verfügung stehen verschiedene Quellen:
es: Hay varios orígenes disponibles:
fr: Différentes sources sont disponibles :
it: Sono disponibili diverse origini:
nl: Er zijn verschillende bronnen beschikbaar:

source: The same domain
de: Die gleiche Domain
es: El mismo dominio
fr: Même domaine
it: lo stesso dominio;
nl: Hetzelfde domein

source: All open datasets from every OpenDataSoft domains
fr: Tous les jeux de données ouverts depuis tous les domaines OpenDataSoft
it: tutti i dataset aperti di tutti i domini OpenDataSoft;
nl: Alle open datasets uit alle OpenDataSoft-domeinen

source: Domain's subdomains (optionnal)
de: Die Subdomains der Domain (optional)
fr: Sous-domaines du domaine (en option)
it: i sottodomini del dominio (facoltativo).
nl: Subdomeinen van het domein (optioneel)

source: From there the next step is to either select a whole dataset or to select a part of it. The filters are the same as in the dataset explore console, there are pre-defined filters, a query box and, if available, the geofilter.
de: Im nächsten Schritt wählen Sie entweder einen ganzen Datensatz oder einen Teil davon aus. Die Filter sind die gleichen wie in der Datensatzuntersuchungskonsole, mit vordefinierten Filtern, einer Anfragebox und - sofern verfügbar - dem Geofilter.
fr: De là, l'étape suivante consiste à sélectionner soit un jeu de données en entier, soit une partie d'un jeu de données. Les filtres sont identiques à ceux de la console d'exploration des jeux de données, vous trouverez des filtres prédéfinis, un champ de requête et, si disponible, le filtre géographique.
it: A questo punto, puoi selezionare un intero dataset o una parte di esso. I filtri sono identici a quelli della console di esplorazione dei dataset; sono presenti alcuni filtri predefiniti, una casella per le query ed eventualmente il filtro geografico.
nl: Van hieruit is de volgende stap om ofwel een volledige dataset te selecteren, ofwel om een deel ervan te selecteren. De filters zijn dezelfde als in de exploreconsole van de dataset, er zijn vooraf gedefinieerde filters, een zoekvak en, indien beschikbaar, een geofilter.

source: Once the data is selected the dataset appears in the backoffice like a normal one, except that there is no *Processing* tab. Indeed, the data is not duplicated and it is not possible to transform it. Only the metadata and visualization configuration can be overriden.
de: Nach der Auswahl der Daten erscheint der Datensatz wie ein normaler im Back-Office, allerdings ohne das Register *Verarbeitung*. Die Daten werden nicht dupliziert und können nicht verändert werden. Lediglich die Konfiguration der Metadaten und Visualisierung können überschrieben werden.
fr: Une fois les données sélectionnées, le jeu de données est affiché dans le back office, comme un jeu normal, excepté qu'il ne dispose pas de l'onglet *Traitement*. En effet, les données ne sont pas dupliquées et il n'est pas possible de les transformer. Seules les métadonnées et la configuration de la visualisation peuvent être surchargées.
it: Una volta selezionati i dati, il dataset viene visualizzato nell'interfaccia di back-office come tutti gli altri, a parte l'assenza della scheda *Elaborazione*. I dati, infatti, non vengono duplicati e non è possibile trasformarli. Solo i metadati e la configurazione della visualizzazione possono essere ignorati.
nl: Eenmaal de dataset is geselecteerd, verschijnt de dataset in de back-office, net zoals een normale dataset, behalve dat er geen tabblad *Verwerking* is. Het is inderdaad zo dat de data niet gedupliceerd is en dat het niet mogelijk is deze te transformeren. Enkel de configuratie van de metadata en van de weergave kan worden opgeheven.

source: Overriding metadata and visualizations
de: Überschreiben von Metadaten und Visualisierungen
es: Sobrescribir metadatos y visualizaciones
fr: Écraser les métadonnées et les visualisations
it: Come ignorare i metadati e le visualizzazioni
nl: Metadata en weergaves opheffen

source: Both metadata and visualization can be overriden. Simply hit **Override** and fill the value you want.
fr: Les métadonnées tout comme les visualisations peuvent être surchargées. Cliquez simplement sur **Surcharger** et saisissez la valeur souhaitée.
it: Per ignorare sia i metadati che la visualizzazione, clicca su **Ignora** e inserisci il valore desiderato.
nl: Zowel de metadata als de weergave kan worden opgeheven. Klik gewoon op **Opheffen** en vul de waarde in die u wenst.

source: It is possible to come back to the original value by hitting **Return to original value**.
fr: Il est possible de rétablir la valeur d'origine en cliquant sur **Rétablir la valeur d'origine**.
it: Cliccando su **Ritorna al valore originario** potrai ripristinare il valore iniziale.
nl: Het is mogelijk terug te keren naar de oorspronkelijke waarde door te klikken op **Terugkeren naar oorspronkelijke waarde**.

source: Limitations
de: Einschränkungen
es: Limitaciones
it: Limitazioni
nl: Beperkingen

source: The federation does not duplicate the data. Only the metadata and visualizations are duplicated, hence can be overriden. There are two reasons for that:
de: Der Verbund dupliziert die Daten nicht. Dupliziert werden nur die Metadaten und Visualisierungen, die somit überschreibbar sind. Dafür gibt es zwei Gründe:
fr: La fédération ne duplique pas les données. Seules les métadonnées et les visualisations sont dupliquées, et peuvent donc être surchargées. Cela s'explique par deux raisons :
it: Con la federazione, vengono duplicati solo i metadati e le visualizzazioni, che quindi possono essere ignorati, ma non i dati. Ciò avviene per due motivi:
nl: Door te federeren worden de data niet gedupliceerd. Enkel de metadata en weergaves worden gedupliceerd, vandaar dat deze kunnen worden opgeheven. Hier zijn twee redenen voor:

source: It is then possible to redistribute data without impacting the size of the data defined in the contract,
de: Daten können dann ohne Auswirkungen auf die im Vertrag definierte Datengröße neuverteilt werden.
es: Después se pueden redistribuir los datos sin afectar al tamaño de los datos definidos en el contrato.
fr: Il est ainsi possible de redistribuer les données sans conséquence sur la taille des données définies dans le contrat.
it: è possibile ridistribuire i dati senza influire sui volumi ammessi per contratto;
nl: Vervolgens is het mogelijk om data te herverdelen zonder dat dit een impact heeft op de grootte van de data zoals die gedefinieerd staat in het contract,

source: When the data changes, the federated dataset is always up-to-date.
de: Bei Datenänderungen ist der verbundene Datensatz immer auf dem neuesten Stand.
es: Si los datos cambian, el conjunto de datos federado se mantiene siempre actualizado.
fr: Lorsque les données sont modifiées, le jeu de données fédéré est toujours à jour.
it: quando i dati cambiano, il dataset federato resta sempre aggiornato.
nl: Wanneer de data wijzigen, is de gefedereerde dataset altijd up-to-date.

source: Currently, when there is a modification in the original dataset related to the dataset schema, metadata or visualizations configuration, the federated dataset is not automatically updated. You'll then have to unpublish / republish your federated dataset to reflect the changes.
fr: Actuellement, lorsque des modifications sont apportées au jeu de données d'origine, au niveau du schéma, des métadonnées ou de la configuration de la visualisation du jeu de données, le jeu de données fédéré n'est pas automatiquement mis à jour. Vous devrez alors dépublier/republier votre jeu de données fédéré pour refléter les modifications.
it: Attualmente, quando nel dataset di origine si apportano modifiche alla configurazione dello schema, dei metadati o delle visualizzazioni, il dataset federato non viene aggiornato automaticamente. Per riflettere le variazioni apportate è quindi necessario annullare la pubblicazione e ripubblicare nuovamente.
nl: Momenteel, wanneer er in de oorspronkelijke dataset een wijziging is aangebracht aan het datasetschema of aan de configuratie van de metadata of weergaves, wordt de gefedereerde dataset niet automatisch up-to-date gebracht. U zal de publicatie van uw gefedereerde dataset ongedaan moeten maken en deze opnieuw moeten publiceren om de wijzigingen te zien.

source: Federation is a core feature of the data network we are building. Using it is a good way to enrich your own data, and it also gives others a new way to discover and reuse them.
es: La federación es una función capital en la red de datos que estamos construyendo. Es una buena manera de enriquecer los propios datos y, al mismo tiempo, ofrecer a los demás una nueva oportunidad de descubrirlos y reutilizarlos.

source: Federation allows to redistribute an open dataset from your domain (Opendatasoft instance) or another domain in full or in part. It is a way to collect external sources of data on its own domain.
es: La federación permite redistribuir un conjunto de datos abierto de su dominio propio (instancia de Opendatasoft) o de otro dominio, total o parcialmente. Es una técnica para recolectar orígenes de datos externos en el dominio propio.

source: To federate a dataset, go to the *Catalog > Dataset* page and hit **New dataset**. Then, hit the little arrow on the right side of the **Add a source** button.
es: Para federar un conjunto de datos, vaya a la página *Catálogo > Conjunto de datos* y haga clic en **Conjunto de datos nuevo**. A continuación, haga clic en la flechita a la derecha del botón **Añadir un origen**.

source: There is then a link **Add a dataset from the Opendatasoft network**. It leads to a console from where it is possible to configure a new federated source.
es: Entonces aparece un vínculo **Añadir un conjunto de datos de la red Opendatasoft**. Este conduce a una consola desde la cual se puede configurar un origen federado nuevo.

source: All open datasets from every Opendatasoft domains
de: Alle offenen Datensätze aller Opendatasoft-Domains
es: Todos los conjuntos de datos abiertos de todos los dominios Opendatasoft

source: Domain's subdomains (optional)
es: Los subdominios del dominio (opcional)

source: The next step is to either select a whole dataset or a part of it. The filters are the same as in the dataset explore console; there are pre-defined filters, a query box, and, if available, the geofilter.
es: El paso siguiente consiste en seleccionar un conjunto de datos completo o una parte de él. Los filtros son los mismos que en la consola de exploración del conjunto de datos; hay filtros predefinidos, un cuadro de consulta y, si está disponible, el filtro geográfico.

source: Once the data is selected, the dataset appears in the back office like a normal one, except that there is no Processing tab. Indeed, the data is not duplicated, and it is not possible to transform it. Only the metadata and visualization configuration can be overridden.
es: Una vez seleccionados los datos, el conjunto de datos aparece en el back office como otro normal, con la salvedad de que no hay ninguna ficha Procesamiento. Efectivamente, los datos no se duplican y no es posible efectuar la transformación. Tan solo se puede sobrescribir la configuración de la visualización y los metadatos.

source: Both metadata and visualization can be overridden. To do so, hit **Override** and enter the desired value. It is possible to come back to the original value by hitting **Return to original value**.
es: Los metadatos y las visualizaciones se pueden sobrescribir. Para ello, haga clic en **Sobrescribir** y especifique el valor deseado. Puede recuperar el valor original haciendo clic en **Volver a valor original**.

source: The federation does not duplicate the data. Only the metadata and visualizations are duplicated; hence they can be overridden. There are two reasons for that:
es: La federación no duplica los datos. Solo los metadatos y las visualizaciones se duplican y, por ende, se pueden sobrescribir. Hay 2 motivos que explican esta circunstancia:

source: Currently, the metadata of federated datasets are updated every day. However, other modifications on the original dataset (for example, visualizations configurations, dataset schema) will not trigger an automatic update: unpublishing and republishing the federated dataset is necessary for the latest modifications to be visible.
es: Actualmente, los metadatos de los conjuntos de datos federados se actualizan diariamente. No obstante, otras modificaciones del conjunto de datos original (por ejemplo, configuraciones de visualizaciones o esquema de conjunto de datos) no desencadenan una actualización automática: es necesario cancelar la publicación del conjunto de datos federado y volver a publicarlo para que las últimas modificaciones sean visibles.

source: Federation allows to redistribute, in full or in part, an open dataset from your domain (Opendatasoft instance) or from another domain. It is a way to collect external sources of data on its own domain.
de: Der Verbund ermöglicht die vollständige oder teilweise Neuverteilung eines offenen Datensatzes Ihrer Domain (z. B. Opendatasoft) oder einer anderen Domain. Dies ist ein Weg, externe Datenquellen auf ihrer eigenen Domain zu sammeln.

source: There is then a link **Add a dataset from the Opendatasoft network**, it leads to a console from where it is possible to configure a new federated source.
de: Darauf folgt ein Link **Datensatz aus dem Opendatasoft-Netzwerk hinzufügen**, das zu einer Konsole führt, über die Sie eine neue verbundene Quelle konfigurieren können.

source: Both metadata and visualization can be overriden. Simply hit **Override** and fill the value you want. It is possible to come back to the original value by hitting **Return to original value**.
de: Sowohl die Metadaten als auch die Visualisierung können überschrieben werden. Wählen Sie einfach **Überschreiben** und geben Sie den jeweils gewünschten Wert ein. Durch Auswählen von **Rückkehr zum Ursprungswert** können Sie zum ursprünglichen Wert zurückkehren.
