Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/retrieving_dataset.po
Languages: de, es, fr, nl

source: Retrieving an Opendatasoft dataset
de: Einen Opendatasoft-Datensatz abrufen
es: Recuperar un conjunto de datos Opendatasoft
fr: Récupérer un jeu de données Opendatasoft
nl: Een Opendatasoft-dataset ophalen

source: Retrieving a dataset published with Opendatasoft is a core feature of the data network we are building. It is a good way to enrich your own data. It also provides others with a new way to discover and reuse your data.
de: Das Abrufen eines mit Opendatasoft veröffentlichten Datensatzes ist eine Kernfunktion des von uns aufgebauten Datennetzes. Auf diese Weise können Sie einfach Ihre eigenen Daten anreichern. Außerdem bietet es anderen eine neue Möglichkeit, Ihre Daten zu finden und wiederzuverwenden.
es: Recuperar un conjunto de datos publicado con Opendatasoft es una función capital en la red de datos que estamos construyendo. Es una buena manera de enriquecer los propios datos. Además, ofrece a los demás una nueva oportunidad de descubrirlos y reutilizarlos.
fr: La récupération d'un jeu de données publié avec Opendatasoft est une fonctionnalité clé du réseau de données que nous mettons en place. Grâce à elle, vous pouvez enrichir vos propres données et offrir à d'autres personnes la possibilité de détecter et de réutiliser vos données.
nl: Het ophalen van een dataset die gepubliceerd is met Opendatasoft is een kernfunctie van het datanetwerk dat we bouwen. Het is een goede manier om uw eigen data te verrijken. Ze biedt anderen ook een nieuwe manier om uw data te ontdekken en te hergebruiken.

source: It allows redistributing an open dataset from your domain (Opendatasoft instance) or another domain in full or in part. It is a way to collect external sources of data on your own domain.
de: Auf diese Weise kann ein offener Datensatz Ihrer Domain (z. B. Opendatasoft) oder einer anderen Domain vollständig oder teilweise neuverteilt werden. Dies ist eine Möglichkeit, externe Datenquellen auf ihrer eigenen Domain zu sammeln.
es: Permite redistribuir un conjunto de datos abierto de su dominio propio (instancia de Opendatasoft) o de otro dominio, total o parcialmente. Es una técnica para recolectar orígenes de datos externos en el dominio propio.
fr: Cette fonction permet la redistribution, intégrale ou partielle, d'un jeu de données ouvert depuis votre domaine (instance Opendatasoft) ou un autre domaine. De cette façon, vous pouvez collecter des sources de données externes sur votre propre domaine.
nl: Het laat u toe een open dataset volledig of gedeeltelijk te herverdelen vanuit uw domein (Opendatasoft-instantie) of een ander domein. Het is een manier om externe bronnen van data te verzamelen op uw eigen domein.

source: Selecting the dataset
de: Den Datensatz auswählen
es: Seleccionar el conjunto de datos
fr: Sélectionner le jeu de données
nl: De dataset selecteren

source: To retrieve a dataset from your domain or another domain, you need to select it.
de: Um einen Datensatz aus Ihrer oder einer anderen Domain abzurufen, müssen Sie ihn zunächst auswählen.
es: Para recuperar un conjunto de datos de su dominio u otro dominio, tiene que seleccionarlo.
fr: Pour récupérer un jeu de données à partir de votre domaine ou d'un autre domaine, vous devez le sélectionner.
nl: Om een dataset op te halen uit uw domein of een ander domein, moet u het selecteren.

source: In **Catalog** > **Datasets**, click on the **New dataset** button.
de: Klicken Sie unter **Katalog** > **Datensätze** auf den Button **Neuer Datensatz**.
es: En **Catálogo** > **Conjuntos de datos**, haga clic en el botón **Conjunto de datos nuevo**.
fr: Dans **Catalogue** > **Jeux de données**, cliquez sur le bouton **Nouveau jeu de données**.
nl: Klik in **Catalogus** > **Datasets** op de knop **Nieuwe dataset**.

source: In the wizard that opens, select the desired option under the **Retrieve a dataset published with Opendatasoft** section:
de: Wählen Sie in dem sich öffnenden Assistenten unter dem Abschnitt **Einen mit Opendatasoft veröffentlichten Datensatz abrufen** die gewünschte Option aus:
es: En el asistente que aparece, seleccione la opción deseada en la sección **Recuperar un conjunto de datos publicado con Opendatasoft**:
fr: Sélectionnez l'option souhaitée dans l'assistant qui s'ouvre, sous la section **Récupérer un jeu de données publié avec Opendatasoft** :
nl: Selecteer in de wizard die wordt geopend de gewenste optie onder de rubriek **Een dataset ophalen die gepubliceerd is met Opendatasoft**:

source: Select **Opendatasoft network** to get a list of all public datasets published on all Opendatasoft domains.
de: Wählen Sie **Opendatasoft-Netzwerk**, um eine Liste aller öffentlichen Datensätze zu erhalten, die auf allen Opendatasoft-Domains veröffentlicht sind.
es: Seleccione **Red de Opendatasoft** para obtener una lista de todos los conjuntos de datos públicos publicados en todos los dominios Opendatasoft.
fr: Sélectionnez **Hub Opendatasoft** pour obtenir une liste de tous les jeux de données publics publiés sur tous les domaines Opendatasoft.
nl: Selecteer **Opendatasoft-netwerk** om een lijst te krijgen van alle publieke datasets die gepubliceerd zijn op alle Opendatasoft-domeinen.

source: Select **My catalog** to get a list list of all datasets published on the current domain and its subdomains.
de: Wählen Sie **Mein Katalog**, um eine Liste aller Datensätze zu erhalten, die auf der aktuellen Domain und ihren Subdomains veröffentlicht wurden.
es: Seleccione **Mi catálogo** para obtener una lista de todos los conjuntos de datos publicados en el dominio actual y sus subdominios.
fr: Sélectionnez **Mon catalogue** pour obtenir une liste de tous les jeux de données publiés sur le domaine actuel et ses sous-domaines.
nl: Selecteer **Mijn catalogus** om een lijst te krijgen van alle datasets die gepubliceerd zijn op het huidige domein en de subdomeinen ervan.

source: Select the desired dataset from the list.
de: Wählen Sie den gewünschten Datensatz aus der Liste aus.
es: Seleccione el conjunto de datos deseado en la lista.
fr: Sélectionnez le jeu de données souhaité dans la liste.
nl: Selecteer de gewenste dataset uit de lijst.

source: From the preview of the first 20 records that opens, you can filter data from the selected source dataset.
de: Über die Vorschau der ersten 20 Einträge, die angezeigt wird, können Sie Daten aus dem ausgewählten Quelldatensatz filtern.
es: En la vista previa de los 20 primeros registros que aparece, puede filtrar los datos del conjunto de datos de origen seleccionado.
fr: Vous pouvez filtrer les données du jeu de données source sélectionné à partir de l'aperçu des 20 premiers enregistrements qui s'affiche.
nl: Vanuit de voorbeeldweergave van de eerste 20 records die wordt geopend, kunt u data filteren uit de geselecteerde brondataset.

source: Configure the dataset information or use the pre-filled values:
de: Konfigurieren Sie die Datensatzinformationen oder verwenden Sie die vorausgefüllten Werte:
es: Configure la información del conjunto de datos o use los valores precompletados:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :
nl: Configureer de datasetinformatie of gebruik de vooraf ingevulde waarden:

source: In the **Dataset name** field, enter the title for this dataset.
de: Geben Sie in das Feld **Datensatzname** den Titel für diesen Datensatz ein.
es: En el campo **Nombre de conjunto de datos**, especifique el título de este conjunto de datos.
fr: Dans le champ **Nom du jeu de données**, saisissez le titre de ce jeu de données.
nl: Voer de titel voor deze dataset in in het veld **Naam van de dataset**.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
de: Geben Sie in das Feld **Technische Kennung des Datensatzes** eine sinnvolle Kennung für diesen Datensatz ein.
es: En el campo **Identificador técnico de conjunto de datos**, especifique un identificador significativo para este conjunto de datos.
fr: Dans le champ **Identifiant technique du jeu de données**, saisissez un identifiant explicite pour ce jeu de données.
nl: Voer in het veld **Technische identifier van de dataset** een betekenisvolle identifier voor deze dataset in.

source: If you want anyone with access to your domain to be able to explore the dataset, toggle off **Access restricted to allowed users and groups**.
de: Wenn Sie möchten, dass jeder, der Zugriff auf die Domain hat, den Datensatz untersuchen kann, müssen Sie die Option **Zugriff auf zulässige Benutzer und Gruppen beschränkt** deaktivieren.
es: Si desea que cualquier usuario con acceso al dominio pueda explorar el conjunto de datos, desactive el botón de alternancia **Acceso restringido a usuarios y grupos permitidos**.
fr: Si vous souhaitez que tout utilisateur ayant accès à votre domaine puisse explorer le jeu de données, désactivez l'option **Accès limité aux utilisateurs et aux groupes autorisés**.
nl: Indien u iemand met toegang tot uw domein in staat wilt stellen om de dataset te verkennen, vink **Beperkte toegang voor gemachtigde gebruikers en groepen** uit.

source: Once created, the dataset appears in the back office, except that there is no **Processing** tab.
de: Nach der Erstellung wird der Datensatz im Back-Office angezeigt, es sei denn, es gibt keine Registerkarte **Verarbeitung**.
es: Una vez creado, el conjunto de datos aparece en el back office, con la salvedad de que no hay ninguna ficha **Procesamiento**.
fr: Une fois créé, le jeu de données apparaît dans l'interface d'administration, mais ne possède pas d'onglet **Traitement**.
nl: Eenmaal aangemaakt, verschijnt de dataset in de back office, behalve dat er geen tabblad **Verwerking** is.

source: note
de: Hinweis
es: nota
fr: Remarque
nl: opmerking

source: When retrieving an Opendatasoft dataset, the data is not duplicated. This means you cannot transform it.
de: Wenn Sie einen Opendatasoft-Datensatz abrufen, werden die Daten nicht dupliziert. Das bedeutet, dass Sie sie nicht umwandeln können.
es: Al recuperar un conjunto de datos de Opendatasoft, los datos no se duplican. Esto significa que no es posible efectuar la transformación.
fr: Lorsque vous récupérez un jeu de données Opendatasoft, les données ne sont pas dupliquées. Cela signifie que vous ne pouvez pas le transformer.
nl: Wanneer een Opendatasoft-dataset wordt opgehaald, worden de data niet gedupliceerd. Dit betekent dat u deze niet kan transformeren.

source: Overriding metadata and visualizations
de: Überschreiben von Metadaten und Visualisierungen
es: Sobrescribir metadatos y visualizaciones
fr: Écraser les métadonnées et les visualisations
nl: Metadata en weergaves opheffen

source: When retrieving an Opendatasoft dataset, you can only override the metadata and visualization configuration.
de: Wenn Sie einen Opendatasoft-Datensatz abrufen, können sie lediglich die Metadaten und die Visualisierungskonfiguration überschreiben.
es: Al recuperar un conjunto de datos de Opendatasoft, solo puede sobrescribir la configuración de los metadatos y las visualizaciones.
fr: Lorsque vous récupérez un jeu de données Opendatasoft, vous pouvez uniquement écraser les métadonnées et la configuration de la visualisation.
nl: Wanneer een Opendatasoft-dataset wordt opgehaald, kunt u de metadata en de weergaveconfiguratie opheffen.

source: If you want to override the title, click **Override** next to the title and enter the desired title.
de: Wenn Sie den Titel überschreiben möchten, klicken Sie neben dem Titel auf **Überschreiben** und geben Sie den gewünschten Titel ein.
es: Si desea sobrescribir el título, haga clic en **Sobrescribir** junto al título y especifique el título deseado.
fr: Si vous souhaitez écraser le titre, cliquez sur **Surcharger** à côté du titre et spécifiez le titre souhaité.
nl: Wanneer u de titel wilt opheffen, klik op **Opheffen** naast de titel en voer de gewenste titel in.

source: If you want to override other metadata, go to the **Information** tab of the edition interface, click **Override** and enter the desired value.
de: Wenn Sie andere Metadaten überschreiben möchten, öffnen Sie die Registerkarte **Informationen** der Bearbeitungsoberfläche, klicken Sie auf **Überschreiben** und geben Sie den gewünschten Wert ein.
es: Si desea sobrescribir otros metadatos, vaya a la ficha **Información** de la interfaz de edición, haga clic en **Sobrescribir** y especifique el valor deseado.
fr: Si vous voulez écraser d'autres métadonnées, rendez-vous dans l'onglet **Information** de l'interface de modification, cliquez sur **Surcharger** et spécifiez la valeur souhaitée.
nl: Wanneer u andere metadata wilt opheffen, ga naar het tabblad **Informatie** van de bewerkingsinterface, klik op **Opheffen** en voer de gewenste waarde in.

source: If you want to override visualizations, go to the **Visualizations** tab of the edition interface, click **Override** and edit the desired visualization configuration.
de: Wenn Sie Visualisierungen überschreiben möchten, öffnen Sie die Registerkarte **Visualisierungen** der Bearbeitungsoberfläche, klicken Sie auf **Überschreiben** und bearbeiten Sie die gewünschte Visualisierungskonfiguration.
es: Si desea sobrescribir las visualizaciones, vaya a la ficha **Visualizaciones** de la interfaz de edición, haga clic en **Sobrescribir** y edite la configuración de las visualizaciones deseadas.
fr: Si vous voulez écraser des visualisations, rendez-vous dans l'onglet **Visualisations** de l'interface de modification, cliquez sur **Surcharger** et modifiez la configuration des visualisations souhaitées.
nl: Indien u weergaves wilt opheffen, ga naar het tabblad **Weergaves** van de bewerkingsinterface, klik op **Opheffen** en bewerk de gewenste weergaveconfiguraties.

source: After editing, you can restore the original value from the source dataset by clicking **Return to original value**.
de: Nach der Bearbeitung können Sie den ursprünglichen Wert aus dem Quelldatensatz wiederherstellen, indem Sie auf **Zurück zum ursprünglichen Wert** klicken.
es: Al terminar la edición, puede restaurar el valor original del conjunto de datos de origen haciendo clic en **Volver a valor original**.
fr: Après avoir effectué des modifications, vous pouvez restaurer la valeur d'origine à partir du jeu de données source en cliquant sur **Rétablir la valeur d'origine**.
nl: Na het bewerken, kunt u de originele waarde uit de brondataset herstellen door te klikken op **Terug naar originele waarde**.

source: Limitations
de: Einschränkungen
es: Limitaciones
nl: Beperkingen

source: Retrieving an Opendatasoft dataset does not duplicate the data. Only the metadata and visualizations are duplicated; hence they can be overridden. There are two reasons for that:
de: Durch das Abrufen eines Opendatasoft-Datensatzes werden die Daten nicht dupliziert. Dupliziert werden nur die Metadaten und Visualisierungen, die daher überschrieben werden können. Dafür gibt es zwei Gründe:
es: La recuperación de un conjunto de datos de Opendatasoft no duplica los datos. Solo los metadatos y las visualizaciones se duplican y, por ende, se pueden sobrescribir. Hay 2 motivos que explican esta circunstancia:
fr: La récupération d'un jeu de données Opendatasoft ne duplique pas les données. Seules les métadonnées et les visualisations sont dupliquées et peuvent donc être écrasées. Cela s'explique par deux raisons :
nl: Door het ophalen van een Opendatasoft-dataset worden de data niet gedupliceerd. Enkel de metadata en de weergaves worden gedupliceerd, vandaar dat ze opgeheven kunnen worden. Hier zijn twee redenen voor:

source: It is then possible to redistribute data without impacting the size of the data defined in the contract.
de: Daten können dann ohne Auswirkungen auf die im Vertrag definierte Datengröße neuverteilt werden.
es: Después se pueden redistribuir los datos sin afectar al tamaño de los datos definidos en el contrato.
fr: Il est ainsi possible de redistribuer les données sans conséquence sur la taille des données définies dans le contrat.
nl: Het is dan mogelijk om data te herverdelen zonder dat dit een impact heeft op de grootte van de data die gedefinieerd staat in het contract.

source: When the data changes, the federated dataset is always up to date.
de: Bei Datenänderungen ist der verbundene Datensatz immer auf dem neuesten Stand.
es: Si los datos cambian, el conjunto de datos federado se mantiene siempre actualizado.
fr: Lorsque les données sont modifiées, le jeu de données récupéré est toujours à jour.
nl: Wanneer de data veranderen, is de gefedereerde dataset altijd up-to-date.

source: Currently, the metadata of federated datasets are updated every day. Other modifications on the original dataset, such as visualization configurations or the dataset schema, will not trigger an automatic update. You need to unpublish and republish the federated dataset for the latest modifications to be visible.
de: Derzeit werden die Metadaten der verbundenen Datensätze täglich aktualisiert. Andere Änderungen am ursprünglichen Datensatz (z.B. Konfigurationen der Visualisierungen oder des Datensatz-Schemas) lösen jedoch kein automatisches Update aus. Die Veröffentlichung der verbundenen Datensätze muss zunächst zurückgezogen werden. Veröffentlichen Sie sie dann erneut, damit die letzten Änderungen sichtbar sind.
es: Actualmente, los metadatos de los conjuntos de datos federados se actualizan diariamente. Otras modificaciones del conjunto de datos original, como configuraciones de visualizaciones o el esquema del conjunto de datos, no desencadenan una actualización automática. Tienes que cancelar la publicación del conjunto de datos federado y volver a publicarlo para que las últimas modificaciones sean visibles.
fr: À l'heure actuelle, les métadonnées des jeux de données récupérés sont actualisées tous les jours. Les autres modifications des jeux de données d'origine, telles que les configurations des visualisations ou les modèles des données, ne déclenchent pas une mise à jour automatique ; pour que les dernières modifications soient visibles, vous devez dépublier le jeu de données récupéré, puis le republier.
nl: Momenteel worden de metadata van gefedereerde datasets elke dag up-to-date gebracht. Andere wijzigingen aan de originele dataset, zoals weergaveconfiguraties of het datasetschema, zullen geen aanleiding geven tot een automatische update. U moet de publicatie van de gefedereerde dataset ongedaan maken en deze opnieuw publiceren opdat de laatste wijzigingen zichtbaar zijn.
