Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/retrieving_file.po
Languages: de, fr, nl

source: Retrieving a file
de: Eine Datei abrufen
fr: Récupérer un fichier
nl: Een bestand ophalen

source: You can add a file from your computer, a URL, or an FTP server as a source to a dataset.
de: Sie können eine Datei von Ihrem Computer, einer URL oder einem FTP-Server als Quelle zu einem Datensatz hinzufügen.
fr: Vous pouvez ajouter un fichier en tant que source à un jeu de données à partir de votre ordinateur, d'une URL ou d'un serveur FTP.
nl: U kunt een bestand uit uw computer, een URL of een FTP-server toevoegen als een bron voor een dataset.

source: For more information, see :ref:`supportedformats`.
de: Weitere Informationen finden Sie unter :ref:`supportedformats`.
fr: Pour plus d'informations, consultez :ref:`supportedformats`.
nl: Voor meer informatie, zie :ref:`supportedformats`.

source: Note
de: Hinweis
fr: Remarque
nl: Opmerking

source: The size limit for a file is 240Mo. If your file is too big, you can compress it before uploading it.
de: Die maximale Dateigröße beträgt 240 MB. Falls Ihre Datei zu groß ist, können Sie sie vor dem Hochladen komprimieren.
fr: La taille des fichiers est limitée à 240 Mo. Si votre fichier est trop volumineux, vous pouvez le compresser avant de le charger.
nl: De limietgrootte voor een bestand is 240MB. Wanneer uw bestand te groot is, kunt het comprimeren alvorens het te uploaden.

source: For more information, see :ref:`supportedcompressedformats`.
de: Weitere Informationen finden Sie unter :ref:`supportedcompressedformats`.
fr: Pour plus d'informations, consultez :ref:`supportedcompressedformats`.
nl: Voor meer informatie, zie :ref:`supportedcompressedformats`.

source: Retrieving a file from your computer
de: Eine Datei von Ihrem Computer abrufen
fr: Récupérer un fichier à partir de votre ordinateur
nl: Een bestand ophalen uit uw computer

source: This method consists of directly uploading a file into the platform to attach a static file to a new dataset.
de: Bei dieser Methode wird eine Datei direkt auf die Plattform hochgeladen, um einen neuen Datensatz mit einer statischen Datei zu versehen.
fr: Cette méthode consiste à charger directement un fichier sur la plateforme, afin d'associer un fichier statique à un nouveau jeu de données.
nl: Deze methode bestaat erin dat een bestand rechtstreeks wordt geÃ¼pload in het platform om zo een statisch bestand te koppelen aan een nieuwe dataset.

source: In **Catalog** > **Datasets**, click on the **New dataset** button.
de: Klicken Sie unter **Katalog** > **Datensätze** auf den Button **Neuer Datensatz**.
fr: Dans **Catalogue** > **Jeux de données**, cliquez sur le bouton **Nouveau jeu de données**.
nl: Klik in **Catalogus** > **Datasets** op de knop **Nieuwe dataset**.

source: In the wizard that opens, select **From my computer** under the **Retrieve a file** section.
de: Wählen Sie in dem sich öffnenden Assistenten **Von meinem Computer** unter dem Abschnitt **Datei abrufen**.
fr: Sélectionnez **À partir de mon ordinateur** dans l'assistant qui s'ouvre, sous la section **Récupérer un fichier**.
nl: Selecteer in de wizard die wordt geopend **Uit mijn computer** onder de rubriek **Een bestand ophalen**.

source: Either drop a file or click **Browse** to locate a file in your local filesystem.
de: Legen Sie die Datei entweder per Drag & Drop ab oder klicken Sie auf **Durchsuchen**, um die Datei in Ihrem lokalen Dateisystem zu suchen.
fr: Déposez un fichier ou cliquez sur **Consulter** pour localiser un fichier dans votre système de fichiers local.
nl: Plaats een bestand of klik op **Browse** om een bestand in uw lokaal bestandensysteem terug te vinden.

source: From the preview of the first 20 records that appears, configure the source.
de: Konfigurieren Sie die Quelle über die Vorschau der ersten 20 Datensätze, die angezeigt wird.
fr: Configurez la source dans l'aperçu des 20 premiers enregistrements qui s'affiche.
nl: Configureer de bron vanuit de voorbeeldweergave van de eerste 20 records die verschijnen.

source: Configure the dataset information or use the pre-filled values:
de: Konfigurieren Sie die Datensatzinformationen oder verwenden Sie die vorausgefüllten Werte:
fr: Configurez les informations du jeu de données ou utilisez les valeurs préremplies :
nl: Configureer de datasetinformatie of gebruik de vooraf ingevulde waarden:

source: In the **Dataset name** field, enter the title for this dataset.
de: Geben Sie in das Feld **Datensatzname** den Titel für diesen Datensatz ein.
fr: Dans le champ **Nom du jeu de données**, saisissez le titre de ce jeu de données.
nl: Voer de titel voor deze dataset in in het veld **Naam van de dataset**.

source: In the **Dataset technical identifier** field, enter a meaningful identifier for this dataset.
de: Geben Sie in das Feld **Technische Kennung des Datensatzes** eine sinnvolle Kennung für diesen Datensatz ein.
fr: Dans le champ **Identifiant technique du jeu de données**, saisissez un identifiant explicite pour ce jeu de données.
nl: Voer in het veld **Technische identifier van de dataset** een betekenisvolle identifier voor deze dataset in.

source: If you want anyone with access to your domain to be able to explore the dataset, toggle off **Access restricted to allowed users and groups**.
de: Wenn Sie möchten, dass jeder, der Zugriff auf die Domain hat, den Datensatz untersuchen kann, müssen Sie die Option **Zugriff auf zulässige Benutzer und Gruppen beschränkt** deaktivieren.
fr: Si vous souhaitez que tout utilisateur ayant accès à votre domaine puisse explorer le jeu de données, désactivez l'option **Accès limité aux utilisateurs et aux groupes autorisés**.
nl: Indien u iemand met toegang tot uw domein in staat wilt stellen om de dataset te verkennen, vink **Beperkte toegang voor gemachtigde gebruikers en groepen** uit.

source: Retrieving a file from a URL
de: Eine Datei von einer URL abrufen
fr: Récupérer un fichier à partir d'une URL
nl: Een bestand ophalen op basis van een URL

source: You can connect the platform to:
de: Sie können die Plattform mit Folgendem verbinden:
fr: Vous pouvez connecter la plateforme aux éléments suivants :
nl: U kunt het platform verbinden met:

source: a remote server via its URL, to import files stored on this remote server, or
de: ein Remote-Server (über seine URL), um darauf gespeicherte Dateien zu importieren, oder
fr: un serveur distant via son URL pour importer les fichiers stockés sur ce serveur distant ;
nl: een server op afstand via zijn URL om bestanden die opgeslagen zijn op deze server op afstand te importeren, of

source: a remote source that exposes data records over an API.
de: eine Remote-Quelle, um Dateneinträge über eine API zu veröffentlichen.
fr: une source distante qui expose des enregistrements de données sur une API.
nl: een bron op afstand die datarecords over een API blootstelt.

source: Opendatasoft supports HTTP and HTTPS URLs to files, for example, `http://example.org/mydata.csv`.
de: Opendatasoft unterstützt HTTP- und HTTPS-URLs zu Dateien, zum Beispiel: `http://example.org/mydata.csv`.
fr: Opendatasoft prend en charge les URL HTTP et HTTPS vers les fichiers, par exemple `http://example.org/mydata.csv`.
nl: Opendatasoft ondersteunt HTTP en HTTPS URLs voor bestanden, bijvoorbeeld, `http://example.org/mydata.csv`.

source: Opendatasoft supports the following authenticated connection methods: login/password, API key, and supplying info within an HTTP header.
de: Opendatasoft unterstützt die folgenden authentifizierten Verbindungsmethoden: Login/Passwort, API-Schlüssel und Angabe von Informationen in einem HTTP-Header.
fr: Opendatasoft prend en charge les méthodes de connexion authentifiée suivantes : identifiant/mot de passe, clé d'API et fourniture d'informations dans un en-tête HTTP.
nl: Opendatasoft ondersteund de volgende methoden voor een geauthentificeerde verbinding: login/wachtwoord, API-sleutel en het verschaffen van informatie binnen een HTTP header.

source: In the wizard that opens, select **From a URL** under the **Retrieve a file** section.
de: Wählen Sie in dem sich öffnenden Assistenten **Von einer URL** unter dem Abschnitt **Datei abrufen**.
fr: Sélectionnez **À partir d'une URL** dans l'assistant qui s'ouvre, sous la section **Récupérer un fichier**.
nl: Selecteer in de wizard die wordt geopend **Vanuit een URL** onder de rubriek **Een bestand ophalen**.

source: Configure your HTTP connection.
de: Konfigurieren Sie Ihre HTTP-Verbindung.
fr: Configurez votre connexion HTTP.
nl: Configureer uw HTTP-verbinding.

source: Retrieving a file from an FTP server
de: Eine Datei von einer FTP-Server abrufen
fr: Récupérer un fichier à partir d'un serveur FTP
nl: Een bestand ophalen vanaf een FTP-server

source: Opendatasoft supports FTP and FTPS URLs:
de: Opendatasoft unterstützt FTP- und FTPS-URLs:
fr: Opendatasoft prend en charge les URL FTP et FTPS :
nl: Opendatasoft ondersteunt FTP en FTPS URLs:

source: to files, for example, `ftp://example.org/my_dir/mydata.csv`, and
de: zu Dateien, wie z.B. `ftp://example.org/my_dir/mydata.csv` und
fr: vers des fichiers, par exemple `ftp://example.org/my_dir/mydata.csv`, et
nl: naar bestanden, bijvoorbeeld, `ftp://example.org/my_dir/mydata.csv`, en

source: to folders, for example, `ftp://example.org/my_dir/`.
de: zu Ordnern, wie z.B. `ftp://example.org/my_dir/`.
fr: vers des dossiers, par exemple `ftp://example.org/my_dir/`.
nl: naar mappen, bijvoorbeeld, `ftp://example.org/my_dir/`.

source: Opendatasoft does not support the SFTP protocol, which is completely different from the FTPS protocol.
de: Das SFTP-Protokoll wird von Opendatasoft nicht unterstützt, da es sich grundlegend vom FTPS-Protokoll unterscheidet.
fr: Opendatasoft ne prend pas en charge le protocole SFTP, qui est complètement différent du protocole FTPS.
nl: Opendatasoft ondersteunt het SFTP-protocol niet, dat volledig verschillend is van het FTPS-protocol.

source: In the wizard that opens, select **From an FTP server** under the **Retrieve a file** section.
de: Wählen Sie in dem sich öffnenden Assistenten **Von einem FTP-Server** unter dem Abschnitt **Datei abrufen**.
fr: Sélectionnez **À partir d'un serveur FTP** dans l'assistant qui s'ouvre, sous la section **Récupérer un fichier**.
nl: Selecteer in de wizard die wordt geopend **Vanaf een FTP-server** onder de rubriek **Een bestand ophalen**.

source: Configure your FTP connection.
de: Konfigurieren Sie Ihre FTP-Verbindung.
fr: Configurez votre connexion FTP.
nl: Configureer uw FTP-verbinding.

source: After creating a dataset, an edition interface for that dataset opens. Only users granted with the right permissions, either "Create dataset" or "Edit dataset", can use this interface. Using this edition interface, you can process the data, configure the datasets and their visualizations, and manage the publishing of the datasets.
de: Nach der Erstellung eines Datensatzes wird eine Bearbeitungsoberfläche für diesen Datensatz geöffnet. Nur Benutzer mit der Berechtigung "Datensatz erstellen" oder "Datensatz bearbeiten" können diese Oberfläche nutzen. Über diese Bearbeitungsoberfläche können Sie die Daten verarbeiten, die Datensätze und ihre Visualisierungen konfigurieren und die Veröffentlichung der Datensätze verwalten.
fr: Après avoir créé un jeu de données, une interface de modification s'ouvre pour ce jeu de données. Seuls les utilisateurs bénéficiant des permissions appropriées ("Créer un nouveau jeu de données" ou "Éditer tous les jeux de données") peuvent utiliser cette interface. Cette interface de modification vous permet de traiter les données, de configurer les jeux de données et leurs visualisations, ainsi que de gérer la publication du jeu de données.
nl: Na het aanmaken van een dataset wordt een bewerkingsinterface voor die dataset geopend. Enkel gebruikers aan wie de juiste toelatingen zijn verleend, hetzij "Dataset aanmaken", hetzij "Dataset bewerken", kunnen deze interface gebruiken. Door deze bewerkingsinterface te gebruiken, kunt u de data verwerken, de datasets en hun weergaves configureren en het publiceren van de datasets beheren.

source: For more information, see:
de: Weitere Informationen finden Sie hier:
fr: Pour plus d'informations, consultez :
nl: Voor meer informatie, zie:

source: Supported formats
de: Unterstützte Formate
fr: Formats pris en charge
nl: Ondersteunde formaten

source: Opendatasoft supports a variety of file formats.
de: Opendatasoft unterstützt unterschiedliche Dateiformate.
fr: Opendatasoft prend en charge divers formats de fichiers.
nl: Opendatasoft ondersteunt een brede waaier aan bestandsformaten.

source: File formats support can be extended to match specific requirements, for example, to support a complex XML or a non-standard flat file format. For more information, contact your local support team.
de: Die Unterstützung von Dateiformaten kann erweitert werden, um bestimmte Anforderungen zu erfüllen, z. B. um ein komplexes XML- oder ein nicht standardisiertes Flat-File-Format zu unterstützen. Für weitere Informationen wenden Sie sich bitte an Ihr lokales Support-Team.
fr: La prise en charge des formats de fichiers peut être étendue pour répondre à des besoins spécifiques, par exemple pour prendre en charge des formats de données à plat non standard ou des XML complexes. Pour plus d'informations, contactez l'équipe de support locale.
nl: De ondersteuning van bestandsformaten kan worden uitgebreid om te matchen met specifieke vereisten, bijvoorbeeld om een complexe XML te ondersteunen of een niet-standaard vlak bestandsformaat. Voor meer informatie, contacteer uw lokaal support team.

source: Supported file formats
de: Unterstützte Dateiformate
fr: Types de fichiers supportés
nl: Ondersteunde bestandsformaten

source: The following table lists the supported file formats. For more information about the supported file formats and configuration options, click the desired file format.
de: In der folgenden Tabelle sind die unterstützten Dateiformate aufgeführt. Für weitere Informationen zu den unterstützten Dateiformaten und Konfigurationsoptionen klicken Sie auf das gewünschte Dateiformat.
fr: La table suivante répertorie les formats de fichiers pris en charge. Pour plus d'informations sur ces derniers et leurs options de configuration, cliquez sur le format de fichier qui vous intéresse.
nl: In de volgende tabel wordt een lijst gegeven van de ondersteunde bestandsformaten. Voor meer informatie over de ondersteunde bestandsformaten en de configuratieopties, klik op het gewenste bestandsformaat.

source: File format
de: Dateiformat
fr: Format de fichier
nl: Bestandformaat

source: File extension
de: Dateierweiterung
fr: Extension de fichier
nl: Bestandsextensie

source: :doc:`OpenDocument Spreadsheet <connectors/spreadsheet>`
de: :doc:`OpenDocument-Tabellenkalkulation <connectors/spreadsheet>`
fr: :doc:`Feuille de calcul OpenDocument <connectors/spreadsheet>`

source: Supported compressed file formats
de: Unterstützte komprimierte Dateiformate
fr: Formats de fichiers compressés pris en charge
nl: Ondersteunde gecomprimeerde bestandsformaten

source: You can compress data if you load large datasets, given that files added to a dataset cannot exceed 240Mo. You can also use compressed file formats on the platform to :doc:`create a dataset with multiple files<creating_dataset_with_multiple_files>`.
de: Sie können Daten komprimieren, wenn Sie große Datensätze laden, da die zu einem Datensatz hinzugefügten Dateien 240Mo nicht überschreiten dürfen. Sie können auch komprimierte Dateiformate auf der Plattform verwenden, um :doc:`einen Datensatz mit mehreren Dateien zu erstellen<creating_dataset_with_multiple_files>`.
fr: Étant donné que la taille des fichiers ajoutés à un jeu de données doit être inférieure à 240 Mo, vous pouvez compresser les données en cas de chargement de jeux de données volumineux. Vous avez également la possibilité d'utiliser des formats de fichiers compressés sur la plateforme pour :doc:`créer un jeu de données avec plusieurs fichiers<creating_dataset_with_multiple_files>`.
nl: U kunt data comprimeren wanneer u grote datasets laadt, aangezien bestanden die aan een dataset worden toegevoegd niet groter mogen zijn dan 240MB. U kunt ook gecomprimeerde bestandsformaten gebruiken op het platform om :doc:`een dataset aan te maken met meerdere bestanden<creating_dataset_with_multiple_files>`.

source: Opendatasoft supports the following compressed file formats:
de: Opendatasoft unterstützt die folgenden komprimierten Dateiformate:
fr: Opendatasoft prend en charge les formats de fichiers compressés suivants :
nl: Opendatasoft ondersteunt de volgende gecomprimeerde bestandsformaten:

source: .zip (UTF-8 encoding for file names is recommended)
de: .zip (für Dateinamen wird eine UTF-8-Codierung empfohlen)
fr: .zip (l'encodage UTF-8 est recommandé pour les noms de fichiers)
nl: .zip (UTF-8 encodage voor bestandsnamen is aanbevolen)
