Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/sourcing_data.po
Languages: de, es, it, nl

source: When sourcing data via a URL, an "Add headers" button is available in the Source configuration area: it allows to add HTTP headers (for example, API keys). Clicking on this button opens a window: indicate a key and a value for each new header.
es: Al añadir datos mediante una dirección URL, hay un botón "Añadir encabezados" disponible en el área Configuración de origen: este permite añadir encabezados HTTP (por ejemplo, claves de API). Al hacer clic en este botón, se abre una ventana: indique una clave y un valor para cada uno de los encabezados nuevos.

source: These connections with the platform allow the automation of data update by scheduling or pushing real-time data (see :doc:`Keeping data up to date</publishing_data/03_scheduling_updates/scheduling_updates>`).
es: Estas conexiones con la plataforma permiten automatizar las actualizaciones de datos planificándolas o insertando datos en tiempo real (consulte :doc:`Mantener los datos actualizados</publishing_data/03_scheduling_updates/scheduling_updates>`).

source: HTTP and HTTPS, which link to a single file (for example, `http://example.org/mydata.csv`)
es: HTTP y HTTPS, que establecen un vínculo con un archivo individual (por ejemplo, `http://example.org/mydata.csv`);

source: FTP and FTPS, which link to a single file (for example, `ftp://example.org/my_dir/mydata.csv` for FTP, or `ftps://example.org/my_dir/mydata.csv` for FTPS) or to a directory (for example, `ftp://example.org/my_dir/` for FTP, ftps://example.org/my_dir/ for FTPS). Using a directory is often the preferred solution to automate incremental updates between a customer's information system and the platform. All the files in the directory need to have the same format and schema (for example, CSV files with the same column titles). In case of automation, new and updated files are fetched from the remote location and processed whenever the dataset is published. Thanks to Opendatasoft's native deduplication strategy, similar records are not processed twice (see :doc:`Special fields documentation</publishing_data/05_processing_data/defining_a_dataset_schema>`).
es: FTP y FTPS, que establecen un vínculo con un archivo individual (por ejemplo, `ftp://example.org/my_dir/mydata.csv` para FTP o `ftps://example.org/my_dir/mydata.csv` para FTPS) o un directorio (por ejemplo, `ftp://example.org/my_dir/` para FTP, ftps://example.org/my_dir/ para FTPS). Utilizar un directorio a menudo es la solución preferida para automatizar las actualizaciones incrementales entre el sistema de información de un usuario y la plataforma. Todos los archivos del directorio deben tener el mismo formato y esquema (por ejemplo, archivos CSV con los mismos títulos de columna). En caso de automatización, cada vez que se publica el conjunto de datos, se capturan y se procesan los archivos nuevos y actualizados de la ubicación remota. Gracias a la estrategia de desduplicación nativa de Opendatasoft, los registros semejantes no se procesan 2 veces (consulte la :doc:`documentación acerca de los campos especiales</publishing_data/05_processing_data/defining_a_dataset_schema>`).

source: When synchronizing from a remote server, Opendatasoft keeps a persistent cache and does not automatically prune files missing from the remote directory. If you need some cleanup to be performed, to the right of the resource, click "Clean cache".
es: Al llevar a cabo la sincronización desde un servidor remoto, Opendatasoft conserva una caché persistente y no elimina automáticamente los archivos que faltan en el directorio remoto. Si necesita realizar alguna limpieza, a la derecha del recurso, haga clic en "Limpiar la caché".

source: This method consists of pasting data in a CSV format. This method is most useful for quick tests.
es: Este método consiste en pegar datos en formato CSV. Este método resulta especialmente útil para las pruebas rápidas.

source: Once a new dataset is created, the platform automatically displays an edition interface for that dataset. It is accessible for any user with the right permissions (either "Create dataset" or "Edit dataset"). This edition interface allows to process the data, configure the datasets and their visualizations, as well as manage the publishing of the dataset. However, after creating a new dataset, the first thing that should be done is to configure its source to make sure the data is perfectly read and understood by the platform
es: Una vez creado un conjunto de datos nuevo, la plataforma automáticamente visualiza una interfaz de edición para ese conjunto de datos. Cualquier usuario con los permisos adecuados ("Crear conjunto de datos" o "Editar conjunto de datos") puede acceder a ella. Esta interfaz de edición permite procesar los datos, configurar los conjuntos de datos y sus visualizaciones, y administrar la publicación del conjunto de datos. No obstante, lo primero que se debe hacer después de crear un conjunto de datos nuevo es configurar su origen para asegurarse de que la plataforma lea y entienda los datos perfectamente.

source: http and https, which link to a single file (e.g. http://example.org/mydata.csv)
it: http e https, che creano un link a un singolo file (ad es. http://esempio.org/mieidati.csv)

source: We do not support the sftp protocol, which is completely different from the ftps protocol.
it: La piattaforma OpenDataSoft non supporta il protocollo SFTP, che è completamente diverso dal protocollo FTPS.
