Repository: opendatasoft/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/01_creating_a_dataset/sourcing_data.po
Languages: de, es, it, nl

source: Sourcing data
de: Daten einspeisen
es: Orígenes de datos
it: Aggiunta dei dati
nl: Data sourcen

source: There are 3 different methods to add data to a dataset:
de: Es gibt 3 Möglichkeiten, um Daten zu einem Datensatz hinzuzufügen:
es: Existen 3 métodos para añadir datos a un conjunto de datos:
it: Per aggiungere i dati a un dataset è possibile procedere in 3 modi diversi:
nl: Er zijn 3 verschillende methodes om data aan een dataset toe te voegen:

source: by uploading a static, local file into the platform
de: durch das Hochladen einer statischen, lokalen Datei auf die Plattform
es: Cargar un archivo local estático en la plataforma
it: caricare un file locale statico nella piattaforma;
nl: door een statisch, lokaal bestand te uploaden in het platform

source: by connecting the platform to a remote service (e.g. an API, a geographical information system, an FTP, etc.): it enables the platform to retrieve what that the remote service contains while staying synchronized with it
de: indem eine Verbindung zwischen der Plattform und einem Remote-Service (z. B. eine API, ein Geoinformationssystem, ein FTP usw.) hergestellt wird: auf diese Weise kann die Plattform die Daten auf dem Remote-Service erfassen und sich mit ihm synchronisieren
it: collegare la piattaforma a un servizio remoto (ad es. un'API, un sistema di informazioni geografiche, un FTP e così via), in modo che possa richiamarne il contenuto mantenendo la sincronizzazione;
nl: door het platform te verbinden met een service op afstand (bijv. een API, een geografisch informatiesysteem, een FTP, enz.): hierdoor kan het platform ophalen wat in de service op afstand staat terwijl u er gesynchroniseerd mee blijft.

source: by pasting data and uploading it into the platform
de: durch das Einfügen von Daten und Hochladen auf die Plattform
es: Pegar datos y cargarlos en la plataforma
it: copiare i dati e caricarli nella piattaforma.
nl: door data te plakken en deze te uploaden in het platform

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Before sourcing data and particularly files into the platform, check the formats supported by the OpenDataSoft platform (see :doc:`Supported formats</publishing_data/01_creating_a_dataset/supported_formats>`).
de: Bevor Sie Daten und insbesondere Dateien zur Plattform hinzufügen, sollten Sie die von der OpenDataSoft-Plattform unterstützten Formate überprüfen (siehe :doc:`Unterstützte Formate</publishing_data/01_creating_a_dataset/supported_formats>`).

source: Uploading a file
de: Eine Datei hochladen
es: Cargar un archivo
it: Caricamento di un file
nl: Een bestand uploaden

source: This method consists in directly uploading a file into the platform, in order to attach a static file to a new dataset.
de: Bei dieser Methode wird eine Datei direkt auf die Plattform hochgeladen, um einen neuen Datensatz mit einer statischen Datei zu versehen.
it: Questo metodo consiste nel caricare direttamente un file nella piattaforma, in modo da allegare un file statico a un nuovo dataset.
nl: Deze methode bestaat erin dat een bestand rechtstreeks wordt geüpload in het platform om zo een statisch bestand te koppelen aan een nieuwe dataset.

source: In Catalog > Datasets, click on the **New dataset** button.
de: Klicken Sie unter Katalog > Datensätze auf den Button **Neuer Datensatz**.
es: En Catálogo > Conjuntos de datos, haga clic en el botón **Conjunto de datos nuevo**.
it: In Catalogo > Dataset, clicca sul pulsante **Nuovo dataset**.
nl: Klik in Catalogus > Datasets op de knop **Nieuwe dataset**.

source: Click on the **Add a source** button.
de: Klicken Sie auf den Button **Eine Quelle hinzufügen**.
es: Haga clic en el botón **Añadir un origen**.
it: Clicca su **Aggiungi un'origine**.
nl: Klik op de knop **Een bron toevoegen**.

source: Click on the **Upload a file** button.
de: Klicken Sie auf den Button **Eine Datei hochladen**.
es: Haga clic en el botón **Cargar un archivo**.
it: Clicca sul pulsante **Carica un file**.
nl: Klik op de knop **Een bestand uploaden**.

source: Choose the file to upload into the platform.
de: Wählen Sie die Datei, die Sie auf die Plattform hochladen möchten.
it: Scegli il file da caricare nella piattaforma.
nl: Kies het bestand dat in het platform moet worden geüpload.

source: Click on the **Open** button of the file selection window.
de: Klicken Sie im Dateiauswahlfenster auf den Button **Öffnen**.
es: Haga clic en el botón **Abrir** de la ventana de selección de archivos.
it: Clicca sul pulsante **Apri** della finestra di selezione dei file.
nl: Klik op de knop **Openen** in het venster waar bestanden kunnen worden geselecteerd.

source: Caution
de: Vorsicht
es: Precaución
nl: Opgelet

source: The size limit for a file is 240Mo. If your file is too big you can compress it before uploading it in the platform (see :ref:`Supported compressed file formats<supportedcompressedformats>`).
de: Die maximale Dateigröße beträgt 240 MB. Falls Ihre Datei zu groß ist, können Sie sie vor dem Hochladen auf die Plattform komprimieren (siehe :ref:`Unterstützte komprimierte Dateiformate<supportedcompressedformats>`).
it: Il limite di dimensioni per i file è di 240 MB. Se il file ha dimensioni superiori, è possibile comprimerlo prima di caricarlo sulla piattaforma (vedere :ref:`Formati di file compressi supportati<supportedcompressedformats>`).
nl: Een bestand mag maximaal 240 MB groot zijn. Wanneer uw bestand te groot is, kan u het comprimeren alvorens het in het platform te uploaden (zie :ref:`Ondersteunde gecomprimeerde bestandsformaten<supportedcompressedformats>`).

source: Note
de: Hinweis
es: Nota
nl: Opmerking

source: It is possible to simply drag and drop the file after steps 1 and 2, instead of following the whole file selection procedure.
de: Nach den Schritten 1 und 2 können Sie die Datei einfach per Drag & Drop hinzufügen, statt das gesamte Auswahlverfahren erneut zu durchlaufen.
it: Anziché selezionare il file secondo la procedura indicata sopra, è possibile trascinarlo e rilasciarlo, dopo i passi 1 e 2.
nl: Het is mogelijk om het bestand na stappen 1 en 2 gewoon te slepen en te plakken in plaats van de volledige bestandselectieprocedure te volgen.

source: Sourcing remote data via a URL
de: Remote-Daten über eine URL einspeisen
es: Añadir datos de orígenes remotos a través de una dirección URL
it: Aggiunta di dati remoti tramite un URL
nl: Data op afstand sourcen via een URL

source: This method consists in connecting the platform to:
de: Bei dieser Methode wird eine Verbindung zwischen der Plattform und einem der Folgenden hergestellt:
es: Este método consiste en conectar la plataforma a:
it: Questo metodo prevede di collegare la piattaforma:
nl: Deze methode bestaat erin dat het platform wordt verbonden met:

source: either a remote server via its URL, to import files stored on this remote server
de: ein Remote-Server (über seine URL), um darauf gespeicherte Dateien zu importieren
it: a un server remoto tramite il relativo URL, per importare i file che vi sono memorizzati;
nl: ofwel een server op afstand via zijn URL om bestanden die opgeslagen zijn op deze server op afstand te importeren

source: or, a remote data source exposing data records over an API
de: oder eine Remote-Datenquelle, um Dateneinträge über eine API zu veröffentlichen.
it: a un'origine di dati remota che trasmetta i record tramite un'API.
nl: of een databron op afstand waarin data records worden blootgesteld over een API

source: These connections with the platform allow the automation of data update, by scheduling or pushing real-time data (see :doc:`Keeping data up to date</publishing_data/03_scheduling_updates/scheduling_updates>`).
de: Mit diesen Verbindungen zur Plattform können Daten-Updates automatisiert oder Echtzeitdaten unmittelbar eingesetzt werden (siehe :doc:`Daten auf dem neuesten Stand halten</publishing_data/03_scheduling_updates/scheduling_updates>`).
nl: Deze verbindingen met het platform maken de automatisering van de data-update mogelijk, door real-time data te plannen of te pushen (zie :doc:`Data up-to-date houden</publishing_data/03_scheduling_updates/scheduling_updates>`).

source: Connecting to a remote server
de: Verbindung zu einem Remote-Server
es: Conectar con un servidor remoto
it: Collegamento a un server remoto
nl: Verbinden met een server op afstand

source: In the **Enter a URL** box, write the URL of the remote server where the files are stored.
de: Geben Sie in das Feld **Eine URL eingeben** die URL des Remote-Servers ein, auf dem die Dateien gespeichert sind.
es: En el cuadro **Especificar una dirección URL**, escriba la dirección URL del servidor remoto donde están almacenados los archivos.
it: Nella casella **Inserisci un URL**, immetti l'URL del server remoto in cui sono memorizzati i file.
nl: Schrijf in het vakje **Voer een URL in** de URL van de server op afstand waar de bestanden zijn opgeslagen.

source: OpenDataSoft supports the following protocols:
de: OpenDataSoft unterstützt die folgenden Protokolle:
it: OpenDataSoft supporta i seguenti protocolli:

source: HTTP and HTTPS, which link to a single file (e.g. http://example.org/mydata.csv)
de: HTTP und HTTPS mit Link zu einer Einzeldatei (z. B. http://example.org/mydata.csv)
nl: HTTP en HTTPS die links zijn naar één enkel bestand (bijv. http://example.org/mydata.csv)

source: FTP and FTPS, which link to a single file (e.g. ftp://example.org/my_dir/mydata.csv for FTP, ftps://example.org/my_dir/mydata.csv for FTPS) or to a directory (e.g. ftp://example.org/my_dir/ for FTP, ftps://example.org/my_dir/ for FTPS). Using a directory is often the prefered solution to automate incremental updates between a customer's information system and the platform. All the files in the directory need to have the same format and schema (e.g. CSV files with the same column titles). In case of automation, whenever the dataset is published, new and updated files are fetched from the remote location and processed and thanks to OpenDataSoft's native deduplication strategy, similar records are not processed twice (see :doc:`Special fields documentation</publishing_data/05_processing_data/defining_a_dataset_schema>`).
de: FTP und FTPS mit Link zu einer Einzeldatei (z. B. ftp://example.org/my_dir/mydata.csv für FTP, ftps://example.org/my_dir/mydata.csv für FTPS) oder einem Verzeichnis (z. B. ftp://example.org/my_dir/ für FTP, ftps://example.org/my_dir/ für FTPS). Die Verwendung eines Verzeichnisses ist oftmals die bessere Lösung zum Automatisieren inkrementeller Updates zwischen einem Informationssystem auf Kundenseite und der OpenDataSoft-Plattform. Sämtliche Dateien im Verzeichnis müssen dasselbe Format und Schema haben (z. B. CSV-Dateien mit demselben Spaltentiteln). Sobald der Datensatz im Falle einer Automatisierung veröffentlicht wird, werden neue und aktualisierte Dateien vom Remote-Standort eingeholt und verarbeitet. Dank der nativen Deduplizierungsstrategie von OpenDataSoft werden ähnliche Einträge nicht zweimal verarbeitet (siehe :doc:`Dokumentation Spezialfelder</publishing_data/05_processing_data/defining_a_dataset_schema>`).

source: When synchronizing from a remote FTP location, OpenDataSoft keeps a persistent cache and does not automatically prune files missing from the remote directory. Please contact OpenDataSoft's support if you need some cleanup to be performed.
de: Beim Synchronisieren aus einem Remote-FTP-Standort behält OpenDataSoft einen persistenten Cache bei und löscht fehlende Dateien nicht automatisch aus dem Remote-Verzeichnis. Bitte kontaktieren Sie den OpenDataSoft-Support, falls Sie ein Cleanup durchführen möchten.
it: Quando si esegue la sincronizzazione da una posizione FTP remota, OpenDataSoft mantiene una cache persistente e non elimina automaticamente i file mancanti dalla directory remota. Per richiedere l'eliminazione dei file non più necessari, ti invitiamo a contattare il servizio di assistenza OpenDataSoft.

source: We do not support the SFTP protocol, which is completely different from the FTPS protocol.
de: Das SFTP-Protokoll wird von uns nicht unterstützt, da es sich grundlegend vom FTPS-Protokoll unterscheidet.
es: No se admite el protocolo SFTP, totalmente distinto del protocolo FTPS.
nl: We ondersteunen het SFTP-protocol niet dat volledig verschillend is van het FTPS-protocol.

source: Connecting to an API
de: Verbindung zu einer API
es: Conectar a una API
it: Collegamento a un'API
nl: Verbinden met een API

source: In the **Enter a URL** box, write the URL of the API.
de: Geben Sie in das Feld **Eine URL eingeben** die URL einer API ein.
es: En el cuadro **Especificar una dirección URL**, escriba la dirección URL de la API.
it: Nella casella **Inserisci un URL**, immetti l'URL dell'API.
nl: Schrijf in het vakje **Voer een URL in** de URL van de API

source: OpenDataSoft natively supports the following APIs:
de: OpenDataSoft unterstützt nativ die folgenden APIs:
it: OpenDataSoft supporta in modo nativo le seguenti API:

source: Contact your local support team to get these connectors activated on your domain.
de: Kontaktieren Sie Ihr örtliches Support-Team, um diese Konnektoren auf Ihrer Domain zu aktivieren.
es: Póngase en contacto con el equipo de soporte de su zona para activar estos conectores en su dominio.
it: Per richiedere l'attivazione di questi connettori sul tuo dominio ti invitiamo a contattare il team di assistenza locale.
nl: Neem contact op met uw lokaal support team om deze connectoren geactiveerd te krijgen op uw domein.

source: OpenDataSoft can also develop and integrate customer specific Web APIs. OpenDataSoft connectivity toolkit makes it possible to develop performant and secured connectors supporting incremental data processing.
de: OpenDataSoft ist zudem in der Lage, kundenspezifische Web-APIs zu entwickeln und zu integrieren. Mit dem OpenDataSoft-Konnektivitäts-Toolkit können leistungsstarke und sichere Konnektoren entwickelt werden, die eine inkrementelle Datenverarbeitung ermöglichen.
it: Inoltre, su richiesta dei clienti OpenDataSoft può sviluppare e integrare API Web specifiche. Il toolkit di connettività OpenDataSoft permette di ottenere connettori performanti e protetti che supportano l'elaborazione di dati incrementali.

source: Available options when configuring a connector
de: Verfügbare Optionen zum Konfigurieren eines Konnektors
it: Opzioni disponibili per la configurazione di un connettore

source: Pasting data
de: Daten einfügen
es: Pegar datos
it: Incollare i dati
nl: Data plakken

source: This method consists in pasting data in a CSV format. This method is most useful for quick tests.
de: Bei dieser Methode werden Daten im CSV-Format eingefügt. Sie ist für eine schnelle Überprüfung sinnvoll.
it: Questo metodo permette di incollare i dati in formato CSV ed è molto utile per eseguire rapidi test.
nl: Deze methode bestaat erin dat data geplakt worden in een CSV-formaat. Deze methode is het nuttigst voor snelle tests.

source: In the **Paste data** area, write or paste data in a CSV format.
de: Nutzen Sie den Bereich **Daten einfügen** dazu, um Daten im CSV-Format zu schreiben oder einzufügen.
es: En el área **Pegar datos**, escriba o pegue datos en formato CSV.
it: Nell'area **Incolla i dati**, scrivi o incolla i dati in formato CSV.
nl: Schrijf of plak in de ruimte **Data plakken** data in een CSV-formaat

source: Click on the **Send data** button.
de: Klicken Sie auf den Button **Daten senden**.
es: Haga clic en el botón **Enviar datos**.
it: Clicca sul pulsante **Invia i dati**.
nl: Klik op de knop **Data versturen**.

source: Once a new dataset is created, the platform automatically displays an edition interface for that dataset. It is accessible for any user with the right permissions (either "Create dataset" or "Edit dataset"). This edition interface allows to process the data, configure the datasets and its visualizations, as well as manage the publishing of the dataset. However, the first thing that should be done after creating a new dataset is to configure its source, to make sure the data is perfectly read and understood by the platform.
de: Sobald ein neuer Datensatz erstellt wurde, zeigt die Plattform automatisch eine Bearbeitungsoberfläche für diesen Datensatz an. Sie ist für jeden Benutzer mit entsprechenden Berechtigungen zugänglich (entweder "Datensatz erstellen" oder "Datensatz bearbeiten"). Diese Bearbeitungsoberfläche ermöglicht die Verarbeitung der Daten, die Konfiguration der Datensätze und ihrer Visualisierungen sowie die Verwaltung der Datensatzveröffentlichung. Nach der Erstellung eines neuen Datensatzes sollte jedoch zunächst seine Quelle konfiguriert und sichergestellt werden, dass die Daten von der Plattform einwandfrei gelesen und verstanden werden.
nl: Eenmaal een nieuwe dataset is aangemaakt, geeft het platform automatisch een bewerkingsinterface weer voor die dataset. Deze is toegankelijk voor elke gebruiker met de juiste toelatingen (hetzij "Dataset aanmaken" of "Dataset bewerken"). Deze bewerkingsinterface laat toe de gegevens te verwerken, de datasets en de weergaves ervan te configureren, alsook het publiceren van de dataset te beheren. Het eerste dat evenwel moet gebeuren na het aanmaken van een nieuwe dataset is om de bron ervan te configureren om er voor te zorgen dat de gegevens perfect worden gelezen en begrepen door het platform.

source: Before sourcing data and particularly files into the platform, check the formats supported by the Opendatasoft platform (see :doc:`Supported formats</publishing_data/01_creating_a_dataset/supported_formats>`).
es: Antes de añadir datos y, en concreto, archivos a la plataforma, compruebe los formatos admitidos por la plataforma Opendatasoft (consulte :doc:`Formatos permitidos</publishing_data/01_creating_a_dataset/supported_formats>`).
nl: Alvorens data op te halen en vooral bestanden in het platform, controleer de formaten die ondersteund worden door het Opendatasoft-platform (zie :doc:`Ondersteunde formaten</publishing_data/01_creating_a_dataset/supported_formats>`).

source: When sourcing data via a URL, an "Add headers" button is available in the Source configuration area: it allows to add HTTP headers (e.g. API keys). Clicking on this button opens a window: indicate a key and a value for each new header.
nl: Wanneer data wordt gesourced via een URL, is er een knop "Headers toevoegen" beschikbaar in de rubriek Sourceconfiguratie: hiermee kunnen HTTP headers worden toegevoegd (bijv. API sleutels). Wanneer op deze knop wordt geklikt, wordt er een venster geopend: vermeld voor elke nieuwe header een sleutel en een waarde.

source: Opendatasoft supports the following protocols:
es: Opendatasoft admite los protocolos siguientes:
nl: Opendatasoft ondersteunt de volgende protocols:

source: FTP and FTPS, which link to a single file (e.g. ftp://example.org/my_dir/mydata.csv for FTP, ftps://example.org/my_dir/mydata.csv for FTPS) or to a directory (e.g. ftp://example.org/my_dir/ for FTP, ftps://example.org/my_dir/ for FTPS). Using a directory is often the prefered solution to automate incremental updates between a customer's information system and the platform. All the files in the directory need to have the same format and schema (e.g. CSV files with the same column titles). In case of automation, whenever the dataset is published, new and updated files are fetched from the remote location and processed and thanks to Opendatasoft's native deduplication strategy, similar records are not processed twice (see :doc:`Special fields documentation</publishing_data/05_processing_data/defining_a_dataset_schema>`).
nl: FTP en FTPS die links zijn naar één enkel bestand (bijv. ftp://example.org/my_dir/mydata.csv voor FTP, ftps://example.org/my_dir/mydata.csv voor FTPS) of een directory (bijv. ftp://example.org/my_dir/ voor FTP, ftps://example.org/my_dir/ voor FTPS). Het gebruik van een directory is vaak de favoriete oplossing om incrementele updates tussen het informatiesysteem en het platform te automatiseren. Alle bestanden in de directory moeten hetzelfde formaat en schema hebben (bijv. CSV-bestanden met dezelfde kolomtitels). In geval van automatisering, wanneer de dataset wordt gepubliceerd, worden nieuwe en bijgewerkte bestanden opgehaald van de locatie op afstand en verwerkt en dankzij de oorspronkelijke deduplicatiestrategie van Opendatasoft worden gelijkaardige records niet twee keer verwerkt (zie :doc:`Documentatie over speciale velden</publishing_data/05_processing_data/defining_a_dataset_schema>`).

source: When synchronizing from a remote FTP location, Opendatasoft keeps a persistent cache and does not automatically prune files missing from the remote directory. Please contact Opendatasoft's support if you need some cleanup to be performed.
nl: Wanneer er wordt gesynchroniseerd vanuit een FTP-locatie op afstand, behoudt Opendatasoft een persistente cache en snoeit het niet automatisch ontbrekende bestanden uit de directory op afstand. Gelieve contact op te nemen met het Support Team van Opendatasoft indien u wil dat er een opkuis wordt uitgevoerd.

source: Opendatasoft natively supports the following APIs:
es: Opendatasoft proporciona soporte nativo para las API siguientes:
nl: Opendatasoft ondersteunt van nature de volgende API's:

source: Opendatasoft can also develop and integrate customer specific Web APIs. Opendatasoft connectivity toolkit makes it possible to develop performant and secured connectors supporting incremental data processing.
nl: Opendatasoft kan ook klantspecifieke Web API's ontwikkelen en integreren. De connectiviteits-toolkit van Opendatasoft maakt het mogelijk om performante en beveiligde connectoren te ontwikkelen die incrementele dataverwerking ondersteunen.

source: by connecting the platform to a remote service (for example, an API, a geographical information system, an FTP, etc.): it enables the platform to retrieve what that the remote service contains while staying synchronized with it
es: Conectar la plataforma a un servicio remoto (por ejemplo, una API, un sistema de información geográfica, un servidor FTP, etc.): permite a la plataforma recuperar el contenido del servicio remoto mientras permanece sincronizado con él.

source: This method consists of directly uploading a file into the platform to attach a static file to a new dataset.
es: Este método consiste en cargar directamente un archivo en la plataforma, con objeto de adjuntar un archivo estático a un conjunto de datos nuevo.

source: Choose the file to upload to the platform.
es: Elija el archivo que se cargará en la plataforma.

source: The size limit for a file is 240Mo. If your file is too big, you can compress it before uploading it to the platform (see :ref:`Supported compressed file formats<supportedcompressedformats>`).
es: El límite de tamaño de un archivo es 240 MB. Si el archivo es demasiado grande, puede comprimirlo antes de cargarlo en la plataforma (consulte :ref:`Formatos de archivos comprimidos permitidos<supportedcompressedformats>`).

source: It is possible to drag and drop the file after steps 1 and 2 instead of following the whole file selection procedure.
es: Se puede arrastrar y soltar el archivo después de los pasos 1 y 2 en lugar de seguir todo el procedimiento de selección de archivos.

source: a remote server via its URL, to import files stored on this remote server, or
es: un servidor remoto a través de su dirección URL, para importar los archivos almacenados en este servidor remoto, o

source: a remote data source exposing data records over an API.
es: un origen de datos remoto que expone los registros de datos a través de una API.
